{
  "title": "409 Conflict error when deploying OO capability",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>When you try to deploy or redeploy the Operations Orchestration (OO) capability on a tenant, the system returns a 409 Conflict error after you click <strong>Deploy </strong>or<strong> Redeploy</strong>.</p>\n<h2>Cause</h2>\n<p>During the OO capability deployment, the system creates an OO tenant. You can manage the OO tenant in the OO Central pod by calling the OO Controller API. The OO Controller returns a 409 Conflict error when:</p>\n<ul>\n<li>The system is trying to delete or activate an OO tenant in ACTIVATED status.</li>\n<li>The system is trying to deactivate an OO tenant in DEACTIVATED status.</li>\n<li>The system is trying to create an OO tenant that already exists in OO Central.</li>\n<li>You trigger another OO job when one existing OO job is still in progress (even if the two jobs are running on two different tenants).</li>\n</ul>\n<p>The specific cause of a 409 Conflict error could be one of the following. </p>\n<h3>Cause 1</h3>\n<p>You have triggered the OO capability deployment for two tenants at the same time. That is, you trigger the OO capability deployment for another tenant while the OO capability deployment for one tenant is still in progress. </p>\n<h3>Cause 2</h3>\n<p>You have triggered the OO capability deployment twice for the same tenant. For example, this may happen when you open the Suite Administration OO capability deployment UI on two tabs and click <strong>Deploy</strong> on the two tabs consecutively. The system returns this error on the second tab. </p>\n<h3>Cause 3</h3>\n<p>You are trying to trigger the OO capability deployment on a recreated tenant as described below:</p>\n<ol>\n<li>You have deployed the OO capability on a tenant.</li>\n<li>You set the tenant to Inactive and delete it. The system starts the deletion of the tenant and the OO tenant created during the OO capability deployment. This takes some time.</li>\n<li>You recreate this tenant under the same account. Note that the new tenant has the same tenant ID as the original one.  </li>\n<li>You try to deploy the OO capability on the recreated tenant. At this time, the deletion of the OO tenant is still in progress, and hence the 409 Conflict error occurs. </li>\n</ol>\n<h3>Cause 4</h3>\n<p>In this scenario, you're trying to redeploy the OO capability after a failure. </p>\n<p>Each OO deployment job creates a k8s pod named \"itom-ooras-&lt;TENANT ID&gt;-0\" for each OO tenant. If this pod can't start for some reason (for example, due to insufficient hardware resources), the OO deployment job fails, and the <strong>Redeploy</strong> button in Suite Administration becomes active so that you can retry. However, it may happen that the OO tenant status in the OO Central pod is already ACTIVATED before the OO deployment job fails. At this time, if you click <strong>Redeploy</strong>, Suite Administration will call the Delete OO tenant API, and hence the 409 Conflict error occurs. </p>\n<h2>Solution</h2>\n<p>Use the solution according to the cause. If the solution requires you to call the OO Controller API, see the instructions below. </p>\n<p><strong>How to use the OO Controller API</strong></p>\n<ol>\n<li>Get the X-Auth-Token\n\t<p>Before you call the OO Controller API, you must first get X-Auth-Token:</p>\n<p>URL: \"https://&lt;External_Access_Host&gt;/bo/rest/auth/token\"<br/>\n\tMethod: POST<br/>\n\tContentType: application/json<br/>\n\tPayload: </p>\n<pre><code> {\n\"username\": \"&lt;suite-admin-user&gt;\",\n\"password\": \"&lt;password&gt;\"\n}\n</code></pre>\n<p>Response: eyJ0eXAiOiJKV......<br/>\n\tThe response is the &lt;X-Auth-Token&gt;.</p>\n</li>\n<li>After you get the token, you can perform any one of the following steps if the solution requires:\n\t<ul>\n<li>Get the OO tenant status by tenant ID:\n\t\t<p>URL: \"https://&lt;OO_FQDN&gt;:&lt;OO_PORT&gt;/oocontroller/rest/v1/tenants/{tenant_id}\"<br/>\n\t\tMethod: GET<br/>\n\t\tHeader: X-Auth-Token: &lt;X-Auth-Token&gt;<br/>\n\t\tResponse: </p>\n<pre><code>{\n    \"id\": \"613062058\",\n    \"name\": \"OO Tenant Name for SMAX tenant with id 613062058.\",\n    \"idmOrgName\": \"TEST_01\",\n    \"status\": \"ACTIVATED\"\n}</code></pre>\n</li>\n<li>Activate/deactivate the OO tenant:<br/>\n\t\tURL: \"https://&lt;OO_FQDN&gt;:&lt;OO_PORT&gt;/oocontroller/rest/v1/tenants/{tenant_id}\"<br/>\n\t\tMethod: PATCH<br/>\n\t\tHeader: X-Auth-Token: &lt;X-Auth-Token&gt;<br/>\n\t\tPayload: {\"activated\": \"false\"} or {\"activated\": \"true\"}<br/>\n\t\tResponse: {\"jobId\":\"1\", \"operation\": \"DEACTIVATE\"} or {\"jobId\":\"1\", \"operation\": \"ACTIVATE\"}</li>\n<li>Delete the OO Tenant:\n\t\t<p>URL: \"https://&lt;OO_FQDN&gt;:&lt;OO_PORT&gt;/oocontroller/rest/v1/tenants/{tenant_id}\"<br/>\n\t\tMethod: DELETE<br/>\n\t\tHeader: X-Auth-Token: &lt;X-Auth-Token&gt;<br/>\n\t\tResponse: {\"jobId\":\"1\", \"operation\": \"UNDEPLOY\"}</p>\n</li>\n</ul>\n</li>\n<li>\n<p>After completing each step described above, before you perform the next step, you must get the OO job status to ensure the job status is SUCCESS. The {jobId} value below is the <strong>jobId</strong> obtained in the previous step. </p>\n<p>URL: \"https://&lt;OO_FQDN&gt;:&lt;OO_PORT&gt;/oocontroller/rest/v1/tenants/{tenant_id}/tenant-jobs/{jobId}\"</p>\n<p>Method: GET<br/>\n\tHeader: X-Auth-Token: &lt;X-Auth-Token&gt;<br/>\n\tResponse:</p>\n<pre><code>{\n    \"id\": \"1\",\n    \"operation\": \"DEPLOY\",\n    \"status\": \"SUCCESS\",\n    \"messages\": [\n        {\n            \"order\": 1,\n            \"time\": \"2021-10-07T08:03:32.640Z\",\n            \"message\": \"Job started.\"\n        },\n        .......\n    ]\n}</code></pre>\n</li>\n</ol>\n<h3>For cause 1</h3>\n<p>Wait until the OO capability deployment on the first tenant is completed and then trigger the OO capability deployment for another tenant. </p>\n<h3>For cause 2</h3>\n<p>The OO capability deployment is running for the tenant. Ignore the error, and wait for the deployment to complete.</p>\n<h3>For cause 3</h3>\n<ol>\n<li>Get the real OO tenant status from the OO Controller API.</li>\n<li>If the OO tenant status is ACTIVATED, deactivate and delete it by using the OO Controller API, and then deploy the OO capability in BO UI again.</li>\n<li>If the OO tenant status is DEACTIVATED or PENDING-FOR-REMOVAL, delete it by using the OO Controller API and then deploy the OO capability in Suite Administration again.</li>\n<li>If the OO tenant status is CREATING, ACTIVATING, DEACTIVATING, or REMOVING, wait for this status to change to a \"completed\" status (ACTIVATED or DEACTIVATED), and then perform step 2 or step 3 and deploy the OO capability in Suite Administration again.</li>\n</ol>\n<h3>For cause 4 (redeployment only)</h3>\n<ol>\n<li>Get the real OO tenant status from the OO Controller API.</li>\n<li>If the OO tenant status is ACTIVATED, deactivate it by using the OO controller Deactivate API, and then redeploy the OO capability in Suite Administration again.</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}