{
  "title": "Create Service Level Target Set record",
  "content": "<div class=\"mw-parser-output\">\n<p>To add a new Service Level Target Set record:</p>\n<ol>\n<li>\n<p>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Plan </b>&gt; <b>Service Level </b>&gt; <b>Service Level Target Sets</b>.</p>\n</li>\n<li>\n<p>Click <b>New</b>.</p>\n</li>\n<li>\n<p>Complete the form with the required information:</p>\n<p><strong>Details</strong></p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Title</td>\n<td>Type a word or phrase that is a unique identifier for the Service Level Target Set. Choose a value that helps the end user easily understand the purpose of the Service Level Target Set.</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>Enter a description for the Service Level Target Set. The description might include some relevant information that helps another user understand the purpose of the Service Level Target Set.</td>\n</tr>\n<tr>\n<td>Target Sets Module</td>\n<td>\n<p>Identify the Service Management module by selecting a value from the drop-down list. The available modules are:</p>\n<ul>\n<li>\n<p>Incident</p>\n</li>\n<li>\n<p>Support Request</p>\n</li>\n<li>\n<p>Service Request</p>\n</li>\n<li>\n<p>Case Request</p>\n</li>\n<li>\n<p>Human Resource Request</p>\n</li>\n<li>\n<p>Change</p>\n</li>\n<li>\n<p>Task</p>\n</li>\n<li>\n<p>Problem</p>\n</li>\n<li>\n<p>The customized record type created in Studio</p>\n</li>\n</ul>\n<p>This field is read-only for existing target sets.</p>\n</td>\n</tr>\n<tr>\n<td>Type</td>\n<td>\n<ul>\n<li>\n<p>SLA</p>\n</li>\n<li>\n<p>OLA</p>\n</li>\n</ul>\n<p>This field is read-only for existing target sets.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p><strong>Definition defaults</strong><br/>\n\tWhen initializing targets and grouping or ungrouping priorities, the system uses the default settings for <strong>Work Schedule</strong> and<strong> Time Zone</strong>. If you later change these default settings, Service Management does not update the Service Level Target definitions that were already initialized. However, if you change the default <strong>Work Schedule</strong> or <strong>Time Zone</strong> from a blank value, Service Management applies the new setting to any definitions where the <strong>Work schedule</strong> or <strong>Time zone </strong>fields are blank.</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Work schedule</td>\n<td>\n<p>The Work schedule time period you want to apply to all the Service Level Target Definitions for this Service Level Target set. </p>\n<p>Service Management includes default work schedules that govern the availability of personnel to fulfill the obligation defined by the target. The organization is accountable to meet the target by working only during the prescribed work hours. For example, if the work schedule hours are limited to a day schedule, only 8 hours a day can be considered in the elapsed time calculation.</p>\n<p>Select one of the following options:</p>\n<ul>\n<li><strong>Customer</strong>: Apply the work schedule of the user that is specified in a Person field of the ticket.</li>\n<li><strong>Assignment group</strong>: Apply the work schedule of a group that is specified in an assignment group field of the ticket. When the ticket is re-assigned to another group, the system recalculates the SLT based on the work schedule of the newly assigned group, and the elapsed time keeps counting.</li>\n<li><strong>Specific value</strong>: Apply a fixed work schedule.</li>\n</ul>\n<p>The field configuration on the SLT settings tab of a record type in Studio controls what fields the <strong>Customer</strong> and <strong>Assignment group</strong> options represent. </p>\n<p>If the system cannot retrieve a work schedule based on the option you specify here, it uses 24 X 7.<br/>\n\t\t\t\tHere is an example:</p>\n<ul>\n<li>The <strong>Assignment group</strong> field on the SLT settings tab of the Request record type in Studio is set to <strong>Assignment group</strong>.</li>\n<li>You select the <strong>Assignment group </strong>option for the Work schedule field here. </li>\n<li>The user submits a request.</li>\n<li>The Request record is assigned to an assignment group. The assignment group does not define the work schedule in the Availability section.</li>\n<li>When calculating the SLT for this request, the system cannot retrieve the work schedule of the assignment group, so it uses 24 X 7.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Time zone</td>\n<td>\n<p>The time zone you want to apply to all the Service Level Target Definitions for this Service Level Target set.</p>\n<p>The target definition calculates the target date according to the option selected:</p>\n<ul>\n<li><strong>Customer</strong>: Apply the time zone of a Person field in the ticket.</li>\n<li><strong>Assignment group</strong>: Apply the time zone of an assignment group field of the ticket. When the ticket is re-assigned to another group, the system recalculates the SLT based on the time zone of the newly assigned group, and the elapsed time keeps counting.</li>\n<li><strong>Specific value</strong>: Apply a fixed time zone. </li>\n</ul>\n<p>The field configuration on the SLT settings tab of a record type in Studio controls what fields the <strong>Customer</strong> and <strong>Assignment group</strong> options represent. </p>\n<p>If the system can't retrieve a time zone based on the option you specify here, it uses UTC.<br/>\n\t\t\t\tHere is an example:</p>\n<ul>\n<li>The <strong>Customer</strong> field on the SLT settings tab of the Request record type in Studio is set to <strong>Requested for</strong>.</li>\n<li>You select the <strong>Customer</strong> option for the Time zone field here.</li>\n<li>A user's Person record does not define the time zone in the Availability section.</li>\n<li>The user submits a request. In the Request record created, the <strong>Requested for</strong> person is set to this user. </li>\n<li>When calculating the SLT for this request, the system cannot retrieve the time zone of this user, so it uses UTC.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<ul>\n<li>\n<p>If you select a value for Work Schedule or Time zone, Service Management applies it to all Service Level Target definitions of the Service Level Target set.</p>\n</li>\n<li>The work schedule restricts the time of the target definition. For example, if the target definition duration is 3 days and the work schedule is 8:00 AM to 5:00 PM (9 hours per day), the target is only breached after 8 work days (72 hours).</li>\n<li>Be aware of the Daylight Saving Time adopted by your country. It is important to note that Daylight Saving Time varies from country to country, and some countries choose not to apply it. Therefore, the impact on the Start Time/End Time brought by Daylight Saving Time cannot be taken into account automatically. You must manually adjust your time period according to it.  </li>\n</ul>\n</div></div></div>\n<ol>\n<li>Define the <strong>Target Types</strong> field.\n\n\t\t<table>\n<thead>\n<tr>\n<th scope=\"col\">Field</th>\n<th scope=\"col\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Target Types</td>\n<td>\n<p>This field defines the target types you want to apply to all the Service Level Target Definitions for this Service Level Target set:</p>\n<ul>\n<li>For Service Level Target set of SLA type, <b>Approval</b>, <b>Fulfillment</b>, <b>Initial review</b>, <b>Chat request response</b>, <b>Resolution</b>, <strong>Classification</strong>, <strong>Planning</strong>, <strong>Deployment</strong>, <strong>Validation</strong>, <strong>Completion</strong>, or custom target types are available. For more information about custom target type management, see <em>Manage custome target types</em>.</li>\n<li>For Service Level Target set of OLA type, only the <b>TimeInGroup</b> target type is available.</li>\n</ul>\n<p>When a custom record type is selected as Target Sets Module, you can click the <b>INITIALIZE RULES</b> button to specify the service level target rules for the target types. <span style=\"background-color: transparent;\">This button is only available when you create a new Service Level Target set record.</span></p>\n<ul>\n<li>Select <b>Start</b>, <b>Stop</b>, <b>Suspend</b> and <b>Unsuspend</b> tab to define the target set rules for each status.</li>\n<li>Under the selected status, set the rules for each target type.</li>\n<li>If necessary, click <b>CLEAR</b> button to clear the input values.</li>\n<li>Click <b>SAVE</b> to create the SLT Rules.</li>\n<li>The target set rules created are saved and created under <b>Entering</b> event.</li>\n</ul>\n<p><span style=\"background-color: transparent;\">For existing Service Level Target set records, you can select the </span><b style=\"background-color: transparent;\">Rules</b><span style=\"background-color: transparent;\"> tab to specify the service level target rules. </span></p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div><span style=\"background-color: transparent;\">The sum of all target type names length cannot exceed 140 characters. </span>Avoid using long names when creating a custom target type.</div></div></div>\n</td>\n</tr>\n</tbody>\n</table>\n\t\tBy default, the target types are as follows:\n\n\t\t<table>\n<tbody>\n<tr>\n<th>Target Sets Module</th>\n<th>Agreement Types</th>\n<th>Default Target Types</th>\n</tr>\n<tr>\n<td rowspan=\"2\">Incident</td>\n<td>SLA</td>\n<td>\n<ul>\n<li>Initial Review</li>\n<li>Resolution</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>OLA</td>\n<td>Time in Group</td>\n</tr>\n<tr>\n<td rowspan=\"2\">Support Request</td>\n<td>SLA</td>\n<td>\n<ul>\n<li>Initial Review</li>\n<li>Resolution</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>OLA</td>\n<td>Time in Group</td>\n</tr>\n<tr>\n<td rowspan=\"2\">Case Request</td>\n<td>SLA</td>\n<td>\n<ul>\n<li>Initial Review</li>\n<li>Resolution</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>OLA</td>\n<td>Time in Group</td>\n</tr>\n<tr>\n<td rowspan=\"2\">Service Request</td>\n<td>SLA</td>\n<td>\n<ul>\n<li>Approval</li>\n<li>Fulfilment</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>OLA</td>\n<td>\n<div>Time in Group</div>\n</td>\n</tr>\n<tr>\n<td rowspan=\"2\">Human Resource Request</td>\n<td>SLA</td>\n<td>\n<ul>\n<li>Initial Review</li>\n<li>Resolution</li>\n<li>Fulfilment</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>OLA</td>\n<td>Time in Group</td>\n</tr>\n<tr>\n<td rowspan=\"2\">Change</td>\n<td>SLA</td>\n<td>\n<ul>\n<li>Classification</li>\n<li>Planning</li>\n<li>Deployment</li>\n<li>Validation</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>OLA</td>\n<td>Time in Group</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"2\">Task</td>\n<td>SLA</td>\n<td>Completion</td>\n</tr>\n<tr>\n<td>OLA</td>\n<td>Time in Group</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"2\">Problem</td>\n<td>SLA</td>\n<td>\n<ul>\n<li>Classification</li>\n<li>Resolution</li>\n<li>Validation</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>OLA</td>\n<td>Time in Group</td>\n</tr>\n<tr>\n<td rowspan=\"2\">The custom record type created in Studio</td>\n<td>SLA</td>\n<td rowspan=\"2\">No default target types</td>\n</tr>\n<tr>\n<td>OLA</td>\n</tr>\n</tbody>\n</table>\n</li>\n</ol>\n</li>\n<li>\n<p>Click  <b>Save</b> on the toolbar. </p>\n</li>\n<li>\n<p>Service Management automatically creates Service Level Target definitions based on priorities. Alternatively, you can group all priorities into one target definition.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>If you choose to group all priorities, the system deletes the old target definitions and creates a new one with default settings.   </div></div></div>\n</li>\n<li>For <strong>Incident</strong>, <strong>Request</strong>, <strong>Change</strong>, <strong>Task</strong>, <strong>Problem</strong>, or a custom record type, if you need to define Service Level Target event business rules or create target set rules under the <strong>Entering</strong>, <b>After Change</b>, or <strong>SLT event</strong>, you can select the <b>Rules</b> tab after you save the Service Level Target Set record.<br/>\n\tFor more information about the business rules, see <em>Offering business rules</em> and <em>How to add Service Level Target event business rules</em> topics.</li>\n</ol>\n<h2 class=\"mw-headline\">Next step</h2>\n<p>After you create a Service Level Target set record, you may need to edit the Service Level Target definitions. For more information, see <em>Edit a Service Level Target definition record </em>topic.</p>\n<p>The next step is to connect a Service Level Agreement record to the Service Level Target Set record. For more information, see <em>Create Service Level Agreement record</em> topic.</p>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}