{
  "title": "Manage Service Level Target business rules",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>For Service Level Target, you can define Service Level Target rules through either:</div>\n<div>\n<ul>\n<li>The <strong>Processes and Rules</strong> section in Studio. This allows you to manage rules for all records controlled by processes in a centralized place. </li>\n<li>The <strong>Rules</strong> section in <strong>Service Level Target Set</strong> records. This allows you to manage rules for records with a specific target set, as a supplement to the rules defined in Studio. </li>\n</ul>\n<p>There are two types of SLT business rules that can be managed by customers, operational rules (Start/Suspend/Unsuspend/Stop Targets) and notification rules. Notification rules will run when the duration reaches 0%, 15%, 35%, 50%, 75%, 90%, and 100% level of the target. You can configure the rules to set fields or send notifications.</p>\n<p>By default, Request, Incident, Change, Problem, and Task workflows contain out-of-the-box operational rules, you can either modify these rules or create new rules according to your business needs.</p>\n<p>If there are multiple rules running the same operation on one target, when conditions are met, they will all be triggered. However, only the first rule is actually executed, the latter ones won't have any effects. For example, if there are multiple rules to start an Initial Review target, the target will be started only by the rule that was triggered first.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li class=\"mw-headline\">You are allowed to add general rules like Set Field in Target Set as well. Especially, for Request, rules defined in Offering will be executed before rules defined in Target Set.</li>\n<li class=\"mw-headline\">If there's only Start Target Type rule but no Stop Target Type rule configured, the system will stop the target type in the End phase of the workflow. Therefore, we recommend that you configure a Stop Target<span id=\"cke_bm_1120E\" style=\"display: none;\"> </span> Type rule in a workflow.</li>\n</ul>\n</div>\n</div>\n<h2 class=\"mw-headline\" id=\"Define_a_Service_Level_Target_event_business_rule\">Define a Service Level Target business rule</h2>\n<p>For record types that have Service Level Target capability enabled, use Studio:</p>\n<ol>\n<li>In the main menu, select <b>Administration &gt; Configuration &gt; Studio</b>.</li>\n<li>Select the record type and select the <b>Processes and Rules</b> tab. You can define target operational rules (based on the <strong>Execute SLT Operation</strong> rule template) to Start, Stop, Suspend, or Unsuspend selected targets under the Entering, Leaving, and After Change events. You can also define SLT notification rules in the SLT Event.<br/>\n<b>Note </b>Start/Stop and Suspend/Unsuspend rules should be used in pairs.</li>\n<li>To define a business rule at the record type level, select the record type in the tree (the top level of the tree). To define a business rule at the process level, select the required process in the tree (for incidents/problems there is only one process).</li>\n</ol>\n<p>Or, use Service Level Target Sets:</p>\n<ol>\n<li>In the main menu, select <b>Plan &gt; Service Level &gt; SERVICE LEVEL TARGET SETS</b>.</li>\n<li>Select the Target Set, on the <strong>Rules</strong> tab, and define target operational rules at Start, Stop, Suspend, and Unsuspend status under the Entering event and After Change event. You can also define SLT notification rules in the SLT Event.<br/>\n<b>Note </b>Start/Stop and Suspend/Unsuspend rules should be used in pairs.</li>\n</ol>\n<p>For details, see <a href=\"/doc/423/26.1/addbizrule\" title=\"Add a business rule\">Add a business rule</a>.</p>\n<h2>SLT operation rules</h2>\n<p>The following parameters are available when you define an SLT operation rule:</p>\n<ul>\n<li><strong>SLT operation</strong>. Select the SLT operation, which can be <strong>Start SLT Target</strong>, <strong>Stop SLT Target</strong>, <strong>Suspend SLT Target</strong>, or <b>Unsuspend SLT Target</b>.</li>\n<li><strong>All SLT types (optional)</strong>. If this parameter is set to True, this rule applies to all SLT types.</li>\n<li><strong>SLT type (optional)</strong>. If the <strong>All SLT types (optional)</strong> parameter is set to False, this <strong>SLT type (optional)</strong> parameter allows you to select the SLT types to which you want to apply the rule.</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\"><b> </b>If you use the <strong>set field rule</strong> to set the SLA/OLA values for a custom record type, make sure you also set the SLT operation rules in the Studio workflow rather than in the target's <strong>Rule</strong> tab.  </div>\n</div>\n<p><span style=\"color: rgb(0, 115, 231); font-family: Roboto, sans-serif; font-size: 24px;\">SLT notification rules</span></p>\n<p>When entering parameters for an SLT notification rule under the <b>SLT Event</b> process event, you can access data related to one of the targets via an Expression Language phrase made of three parts:</p>\n<ul>\n<li><b>slt</b></li>\n<li>Specifies the target type. The available options are defined in the <strong>Target type</strong> list. Note that <b>ChatRequest</b> is for support request records only.</li>\n<li>Specifies the required data. The available options are:\n\t<ul>\n<li><b>PercentageAchieved.</b> The last percentage level of the target (0%, 15%, 35%, 50%, 75%, 90%, 100%) reached by the target duration.</li>\n<li><b>Type.</b> The type of the target.</li>\n<li><b>TargetDate.</b> The target date of the target.</li>\n<li><b>ActualDuration.</b> The duration of the target.</li>\n<li><b>ActualPercentage.</b> The actual percentage of the target reached by the duration.</li>\n<li><b>Name.</b> The name of the target.</li>\n</ul>\n</li>\n</ul>\n<p>For example, the phrase <b>slt.IntialReview.TargetDate</b> refers to the target date of the Initial Review target.</p>\n<p>The out-of-the-box rules defined under the SLT Event process event include these expressions in their parameter values. The following example demonstrates how the expressions are implemented in a business rule:</p>\n<div class=\"example\">\n<p>One of the out-of-the-box rules for Requests sends a notification when the Resolution target duration reaches 50% of the target. The rule includes the following condition expression:</p>\n<p>${slt.Resolution.PercentageAchieved == 50 &amp;&amp; entity.PhaseId != 'Close' &amp;&amp; entity.PhaseId != 'Abandon'}</p>\n<p>This means that the last percentage level reached by the duration for the Resolution target was 50%, and the workflow isn't in the <b>Close</b> or <b>Abandon</b> phases. If this condition is satisfied, the notification is sent.</p>\n<p>The rule also specifies the values to enter in the notification parameters. These include: <b>slt.Resolution.ActualDuration</b>, <b>slt.Resolution.TargetDate</b>, and <b>slt.Resolution.Type</b>, which return the duration, target date, and type of the Resolution target, respectively.</p>\n<h2>Rule execution order</h2>\n<p>SLT rules are executed in the following order: Rules in Offerings &gt; Rules in Target Sets &gt; Rules in Studio Workflows.</p>\n</div>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/slmtasks\" title=\"SMAX:25.1/slmTasks\">Service Level Management procedures</a></li>\n<li><a href=\"/doc/423/26.1/addsltset\" title=\"SMAX:25.1/AddSLTset\">How to create a Service Level Target set record</a></li>\n<li><a href=\"/doc/423/26.1/editsltset\" title=\"SMAX:25.1/EditSLTset\">How to edit a Service Level Target set record</a></li>\n<li><a href=\"/doc/423/26.1/addsltdefn\" title=\"SMAX:25.1/AddSLTDefn\">How to add a Service Level Target definition record</a></li>\n<li><a href=\"/doc/423/26.1/editsltdefn\" title=\"SMAX:25.1/EditSLTDefn\">How to edit a Service Level Target definition record</a></li>\n<li><a href=\"/doc/423/26.1/deletesltdefn\" title=\"SMAX:25.1/DeleteSLTDefn\">How to delete a Service Level Target definition record</a></li>\n<li><a href=\"/doc/423/26.1/addsla\" title=\"SMAX:25.1/AddSLA\">How to create a Service Level Agreement record</a></li>\n<li><a href=\"/doc/423/26.1/editsla\" title=\"SMAX:25.1/EditSLA\">How to edit a Service Level Agreement record</a></li>\n<li><a href=\"/doc/423/26.1/deletesla\" title=\"SMAX:25.1/DeleteSLA\">How to delete a Service Level Agreement record</a></li>\n<li><a href=\"/doc/423/26.1/embizrules\" title=\"SMAX:25.1/emBizRules\">Studio business rules</a></li>\n</ul>\n</div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}