{
  "title": "Administer audit files on the audit client NFS server",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>As an audit client, Service Management uses the &lt;data-volume&gt;/audit directory on its NFS server as a fallback to store audits when audits don't get pushed to the audit engine. The audit client writes the payload to a JSON file with the filename &lt;pod-name&gt;-TS_&lt;rfc3339 Timestamp&gt;.json.  The audit collector will then take the audit files from this path and move them to the audit engine.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">UD/UCMDB uses the &lt;log-volume&gt;/ucmdb/audit directory on its NFS server as a fallback to store audits when audits don't get pushed to the audit engine. </div>\n</div>\n<h2>When does the audit collector push an audit file to the audit engine?</h2>\n<p>The maximum size of an audit file is 1 MB.</p>\n<ul>\n<li>When the size of an audit file exceeds 1 MB, the audit client adds a suffix \"_FULL\" to the filename. The audit collector picks up this file and pushes it to the audit engine at the earliest.</li>\n<li>If the audit file size is less than 1 MB, it takes 24 hours for the audit collector to pick up the file.</li>\n</ul>\n<h2>Audit file tampering detection and handling</h2>\n<p>For every audit file, the audit client creates a digest file and compares the audit file with its digest to check if the audit file is tampered. If tampered, the audit client adds a suffix \"_TAMPERED\" to the filename so that the audit collector won't pick it up.</p>\n<p>However, as an administrator, you must check the content of each audit file marked as TAMPERED. If you find the file isn't tampered, follow these steps to make the file valid for the audit collector to pick up:</p>\n<ol>\n<li>Create an SHA-512 hash of the content of the audit file.</li>\n<li>Replace the content of the digest file with the generated SHA-512 hash.</li>\n<li>Remove the \"_TAMPERED\" suffix from the audit filename. The audit collector will then pick up this audit file.</li>\n</ol>\n<h2></h2>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}