{
  "title": "Work with AFL multi-instance steps",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>A multi-instance step can be a single or a group of steps that execute simultaneously. For example, if you want to run the Windows Diagnostic flow on 100 servers, you can create a multi-instance step that runs the flow on all 100 servers at the same time.</p>\n<p>The targets of the operation (for example, 100 servers) are defined in an input list in the multi-instance step.</p>\n<p>Inside a multi-instance step, you can include one or more operations or subflows. The operations and subflows in the multi-instance step run once for each element from the list—these runs are known as <i>lanes or instances</i>.</p>\n<p>Each instance gets, at its beginning, a duplication of the global and local contexts. As it runs, each step in the instance can change the global variables, flow variables, and flow output fields within the multi-instance step.</p>\n<p>When an exception is thrown in one of the instances, that instance is stopped. The others continue to run because they're running in parallel.</p>\n<p>If running the multi-instance step against too many elements simultaneously would slow down your infrastructure, you can throttle a multi-instance step by limiting how many values it can process at once. The throttling size can be a constant (integer) or take its value from a ${variable}, but not a ${SystemProperty}.</p>\n<h2 class=\"mw-headline\" id=\"Saving_Flow_Data\">Save flow data</h2>\n<p>Flow variables, global variables, and flow output fields created in an instance of a multi-instance step are local to the instance in which they're created and populated. These variables and flow output field variables will disappear at the end of the lane unless you use one of the following ways to make this data available to the rest of the flow:</p>\n<ul>\n<li>Bind the data to results on the multi-instance step</li>\n<li>Create a scriptlet in the multi-instance step to save the data</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Saving_Data_via_Results\">Save data via results</h2>\n<p>To make the data from flow variables available after the multi-instance step has ended, you can define step results in the multi-instance step, which take their value from flow variables created in the instances. You can save the data from flow output fields created in a subflow in the instances. In the <b>Results</b> tab of the Step Inspector for a multi-instance step, select a flow output field created in the instances, by selecting <b>Result Field &lt;result&gt;</b> in the <b>From</b> column.</p>\n<p>You can set the <b>Assignment Action</b> field to do different things with the values that are collected. For example, you could append the results of the different instances, add them together, or get later instances to overwrite previous ones.</p>\n<p>In the example below, there are five variables set up for the results of a multi-instance step. The first three take their value from flow variables and the last two from flow output fields.</p>\n<p>Assuming that there are two instances, <b>Instance1</b> and <b>Instance2</b>, that the main flow has empty contexts, and that <b>Instance2</b> ends after <b>Instance1</b>, the instances provide the following variables:</p>\n<ul>\n<li>\n<p><b>Instance1</b>:</p>\n<ul>\n<li>\n<p>Flow variables:</p>\n<pre>var1 = x</pre>\n<pre>var2 = y</pre>\n<pre>var3 = w</pre>\n</li>\n<li>\n<p>Flow output fields:</p>\n<pre>var1 = z</pre>\n</li>\n</ul>\n<p><b>Instance2</b>:</p>\n<ul>\n<li>\n<p>Flow variables:</p>\n<pre>var2 = t</pre>\n<pre>var3 = v</pre>\n</li>\n<li>\n<p>Flow output fields:</p>\n<pre>var5 = u</pre>\n</li>\n</ul>\n</li>\n</ul>\n<p>When the multi-instance step finishes, the values of the variables will be:</p>\n<p><code>var1 = NULL</code> (because in <b>Instance2</b>, there is no value for this variable, and the action is to overwrite)</p>\n<p><code>var2 = t</code> (the value in <b>Instance2</b> overwrites the value from <b>Instance1</b>)</p>\n<p><code>var3 = wv</code> (the value in <b>Instance2</b> was appended to the value from <b>Instance1</b>)</p>\n<p><code>var4 = NULL</code> (because in <b>Instance2</b>, there is no value for this variable, and the action is to overwrite)</p>\n<p><code>var5 = u</code></p>\n<h2 class=\"mw-headline\" id=\"Saving_Data_via_a_Scriptlet\">Save data via a scriptlet</h2>\n<p>Another way to make data generated within the step available to the rest of the flow is by creating a scriptlet that collects the data and saves it as a variable that will continue to exist after the instance’s run completes.</p>\n<p>In the example below, the scriptlet tracks whether each instance run passes or fails, accumulates this data, and saves it as a variable that is available in the global context:</p>\n<pre><code>// get flow var from MI instance context</code>\n<code>resPass = scriptletBranchContext.get (\"instancePassResult\");</code>\n<code>resFail = scriptletBranchContext.get (\"instanceFailResult\");\n</code>// accumulating values\nscriptletContext.putGlobal (\"accumulatePass\", scriptletContext.get (\"accumulatePass\") + resPass);\nscriptletContext.putGlobal (\"accumulateFail\", scriptletContext.get (\"accumulateFail\") + resFail);</pre>\n<p>This scriptlet will be executed multiple times, once for each instance. Each time, it will be able to access the <code>ScriptletContext</code> of the current instance (called <code>scriptletBranchContext</code>), and can modify the parent flow context (by accessing the <code>scriptletContext</code>).</p>\n<p><code>scriptletBranchContext</code> has the same access method as the <code>scriptletContext</code>.</p>\n<h2 class=\"mw-headline\" id=\"Merging_after_Upgrade\"><span style=\"font-size: clamp(1.59375rem, 18.7895px + 1.39803vw, 2.125rem);\">Create a multi-instance step</span></h2>\n<ol>\n<li>From the upper right-hand corner of OO Workflow Designer, drag the <b>Multi-instance</b> icon to the authoring canvas.</li>\n<li>From the <b>Projects</b> pane, drag the flow or operation into the multi-instance lane. You can add multiple flows and operations to the multi-instance lane. You cannot add a response step in a multi-instance lane.</li>\n<li>\n<p>Set up the list of elements for the multi-instance step by creating an input that is a list of multiple values. For example, the list of servers that the flow will run against:</p>\n<ol start=\"1\">\n<li>Open the Step Inspector for the multi-instance step by double-clicking the <b>Multi-step</b> icon at the start of the step.</li>\n<li>\n<p>Create an input. </p>\n</li>\n<li>\n<p>Set the type to <b>List of Values</b>.</p>\n</li>\n<li>\n<p>Click the right-pointing arrow at the end of the row to open the Input Editor for that row.</p>\n</li>\n<li>\n<p>In the <b>Input Delimiter</b> box, type a delimiter (a character that separates the elements in the list).</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>To define a delimiter that contains several characters, use quotation marks. For example, \"$%^\".</p>\n<p>To use a quotation mark as part of the delimiter, type it in twice. For example, to define the delimiter \"$%, type \"\"$%.</p>\n</div>\n</div>\n</li>\n<li>\n<p>Specify the way that the list of values will be input. For example, if you want the multi-instance step to run against a number of servers, you can select <b>Use Constant</b> and specify the server names in the <b>Constant Value</b> box, have the users enter the values, or make selections from a list of values. Other ways to populate the list of values are to use the results of a previous step or via integration with another program.</p>\n</li>\n</ol>\n</li>\n<li>\n<p>Connect the different parts of the multi-instance step:</p>\n<ol>\n<li> If there are multiple steps in the multi-instance step, connect the steps.</li>\n<li>\n<p>Drag all the response lines from the last step in the lane to the <b>Lane-end</b> icon.</p>\n</li>\n</ol>\n</li>\n<li>\n<p>(Optional) For all the steps inside that need to process this value, set it as input and select the variable created as a result of splitting the list of elements. This variable can have the same name as the initial list.</p>\n<ol start=\"1\">\n<li>Open the Input Editor, and in the <b>Assign From</b> list, select the variable you created to hold the list of elements. In our example, this is <b>servers</b>.</li>\n</ol>\n</li>\n<li>\n<p>If you want to save the data collected by the different instances of the multi-instance step, create a flow variable to store the result:</p>\n<ol start=\"1\">\n<li>\n<p>Open the Step Inspector for the multi-instance step by double-clicking the <b>Multi-step</b> icon.</p>\n</li>\n<li>Click the <b>Results</b> tab and add a result.</li>\n<li>In the <b>Assign To</b> column, assign the result to a flow variable.</li>\n<li>Give a name to the flow variable that will hold the data, for example, <b>outcome</b>.</li>\n<li>\n<p>Decide on how you want the data to be stored. In our example, we want to store the results for each server, so the assignment action is <b>APPEND</b>. For more details, see Save output from a multi-instance step below.</p>\n</li>\n</ol>\n</li>\n<li>\n<p>If you want to save the data collected by the different instances of the multi-instance step, to be used in the global context, write a scriptlet to store the result:</p>\n<ol start=\"1\">\n<li>In the Step Inspector for the multi-instance step, click the <b>Scriptlet</b> tab.</li>\n<li>\n<p>Write a scriptlet that will collect the data from the <code>scriptletBranchContext</code>, and will make it available to the <code>scriptletContext</code>.<br/>\n\t\tIn the example below, the scriptlet tells the flow to accumulate all the values of the <b>outcome</b> variable. This is similar to the <b>APPEND</b> action that was selected in the previous step.</p>\n<pre>var outcome = scriptletBranchContext.get (\"outcome\");\nscriptletContext.putGlobal (\"outcome\", scriptletContext.get (\"outcome\") + outcome);</pre>\n</li>\n</ol>\n</li>\n<li>\n<p>Connect the multi-instance step to the rest of the flow:</p>\n<ol start=\"1\">\n<li>\n<p>If the multi-instance step is not the start step, connect the step that precedes it to the <b>Multi-instance</b> icon.</p>\n</li>\n<li>\n<p>Connect the multi-instance step’s <b>done</b> response to the next step in the flow.</p>\n</li>\n</ol>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Save_output_from_a_multi-instance_step\">Save output from a multi-instance step</h2>\n<p>The data in flow variables and flow output fields in instances are gone after the multi-instance step is completed. To save this data, you can bind it to results in the multi-instance step.</p>\n<ol>\n<li>Create a multi-instance step, as described above.</li>\n<li>In the Step Inspector, click the <b>Results</b> tab.</li>\n<li>\n<p>Add a result line for each flow variable that you want to save.</p>\n</li>\n<li>In the <b>Name</b> column, enter a name for the flow variable that you will be saving the data to.</li>\n<li>\n<p>In the <b>From</b> column, select the flow variable or output field that is the source of the data that you want to save.</p>\n<ul>\n<li>To select a flow variable created in the instances, select <b>Result &lt;result&gt;</b> in the <b>From</b> column.</li>\n<li>To select a flow output field created in the instances, select <b>Result Field &lt;result&gt;</b> in the <b>From</b> column.</li>\n</ul>\n</li>\n<li>\n<p>In the <b>Assignment Action</b> column, select the action that describes how you want to collect the data.</p>\n<p>For example, if you wanted to calculate how long it took to run all the instances, you would select <b>Add</b>. If you wanted to collect a list of all the servers that were checked in the multi-instance step, you would select <b>Append</b>.</p>\n</li>\n<li>Save the step. The flow variables you created will be available for the rest of the flow after the multi-instance step has finished running.</li>\n</ol>\n<h2 id=\"Limit_(throttle)_the_number_of_instances_a_multi-instance_step_can_run_on_simultaneously\"><span class=\"mw-headline\" id=\"Limit_.28throttle.29_the_number_of_instances_a_multi-instance_step_can_run_on_simultaneously\">Limit (throttle) the number of instances a multi-instance step can run on simultaneously</span></h2>\n<p>If running a multi-instance step with many lanes simultaneously slows down your system’s performance, you can set a throttle level for the step, by limiting the number of lanes the multi-instance step can run simultaneously.</p>\n<p>The performance can be related to the target system(s) and also whether or not one flow can use all of OO’s worker execution threads.</p>\n<p>If throttle is not set, the number of lanes is the same as the number of inputs.</p>\n<p>If throttle is set, the number of instances is the minimum between throttle size and remaining inputs.</p>\n<ol>\n<li>Open the <strong>Step Inspector</strong> for the step, and then click the <b>Advanced</b> tab.</li>\n<li>Under <b>Execution</b>, select the <b>Throttle parallel execution</b> check box.</li>\n<li>In the box, type the maximum number of instances of the step that should run at once.\n\t<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">System properties referenced with ${} notation are not resolved in the throttle setting.</div>\n</div>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Move_a_multi-instance_step\">Move a multi-instance step</h2>\n<ol>\n<li>Select the <b>Multi-instance</b> icon at the start of the lane that represents the entire step.</li>\n<li>Drag the step across the authoring canvas.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Resize_a_multi-instance_step\">Resize a multi-instance step</h2>\n<ol>\n<li>Select the lane by clicking on a blank part of it. Handles appear at the sides and corners.</li>\n<li>Drag the side or corner handles to resize the lane.</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}