{
  "title": "Configurations",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The <strong>Configurations </strong>page provides default settings for artificial intelligence services. To customize the settings, from the main menu of Agent Interface, select <b>Administration</b> &gt; <b>Configuration</b> &gt; <b>AI Studio</b> &gt; <b>Configurations.</b></p>\n<p>This topic provides an overview of the configurable settings on this<strong> </strong>page.</p>\n<h2>Enable Aviator in the backend</h2>\n<p>Enabling this setting allows you to use Aviator through business rules, empowering service workflow automation.</p>\n<p>By default, this setting is disabled. Before enabling it, make sure the integration user has the <strong>Access Aviator </strong>and <strong>Log into the application</strong> permissions and is properly configured within the integration scenario. See <a href=\"/doc/423/26.1/adminaviator#Configure_Aviator_business_rule\" title=\"Configure Aviator\">Configure Aviator business rule</a>.</p>\n<h2>Allowed origins for Aviator service</h2>\n<p>List of allowed origins for accessing Aviator service (comma separated). You may enter an asterisk (*) to allow all origins, or leave the field blank to restrict cross-orign requests.</p>\n<p>Example: https://firstDomain.com, https://secondDomain.com:8080.</p>\n<h2>Aviator language</h2>\n<p>This setting allows tenant admins to choose a company-wide language for Aviator chat. By default, the system uses <strong>Auto detect</strong> to automatically determine the language used in interactions with Aviator. However, using the default setting may lead to unexpected errors. To improve the accuracy of Aviator's responses, inform your users that their conversations with Aviator must align with the selected language.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>If you are using business rules for Aviator use cases, the language used in Request, Incident, and Change records must align with the selected language.</li>\n<li>To use the <strong>Summarize this request </strong>or <strong>Summarize this incident </strong>options in Aviator from Agent Interface, inform your users that their profiles must align with the selected language.</li>\n</ul>\n</div>\n</div>\n<p>Here are two examples of how Aviator will respond based on language settings and data input:</p>\n<ol>\n<li>If the language setting in all user profiles is set to Norwegian and all ticket data is entered in Norwegian, Aviator will respond in Norwegian.</li>\n<li>If the language setting in all user profiles is set to English, but all ticket data is entered in Spanish, Aviator will respond in Spanish.</li>\n</ol>\n<p>For more information about Aviator language support, see the <em>System requirements</em> topic.</p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}