{
  "title": "Disk IOPS spikes on AKS worker nodes",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>We recommend using 100 GB Premium SSD disk for AKS worker node. The disk is provisioned with 500 IOPS and can burst IOPS up to 3500. Usually, it meets SMA's requirement for the disk performance; but in some environments, it will cause huge IOPS spikes (typically larger than 500) and the entire AKS cluster will be unstable.</p>\n<h2>Cause</h2>\n<p>AKS isn't compatible with <strong>Azure Security Center</strong> very well. Therefore, if you enable <strong>Azure Security Center</strong> on a subscription, there will be disk IOPS spikes on all worker nodes of all AKS clusters in the subscription.</p>\n<h2>Solution</h2>\n<p>To mitigate the issue, the Azure support team recommends excluding AKS worker nodes from <strong>Azure Security Center </strong>with these steps:</p>\n<div class=\"Admonition_Important\"><span class=\"autonumber\">Important</span>  This solution is recommended by the Azure support team. For the possible security concerns after disconnecting AKS from Azure Security Center, see the clarifications below from the Azure support team:\n\n<p>\"In AKS, the Kubernetes control plane components are part of the managed service provided by Microsoft. Each AKS cluster has its own single-tenanted, dedicated Kubernetes control plane to provide the API Server, Scheduler, etc. This control plane is managed and maintained by Microsoft. For AKS nodes, when an AKS cluster is created or scaled up, the nodes are automatically deployed with the latest OS security updates and configurations. Nodes are deployed into a private virtual network subnet, with no public IP addresses assigned. Please refer to this document for more information: <a href=\"https://docs.microsoft.com/en-us/azure/aks/concepts-security\">https://docs.microsoft.com/en-us/azure/aks/concepts-security</a>. Meanwhile, if a security flaw is found in one or more components of AKS, the AKS team will patch all affected clusters to mitigate the issue. Alternatively, the team will give users upgrade guidance. Please refer to this document for more information: <a href=\"https://docs.microsoft.com/en-us/azure/aks/support-policies\">https://docs.microsoft.com/en-us/azure/aks/support-policies</a>.\" </p>\n</div>\n<ol>\n<li>Create a new <strong>Log Analytics workspace</strong> by referring to <a href=\"https://docs.microsoft.com/en-us/azure/azure-monitor/learn/quick-create-workspace\">https://docs.microsoft.com/en-us/azure/azure-monitor/learn/quick-create-workspace</a>.</li>\n<li>Go to the workspace created in step 1&gt; <strong>Virtual machines</strong> (in the <strong>Workspace Data Sources </strong>section), and select a worker node from the list. <strong>Disconnect</strong> it from the current workspace, and then <strong>Connect</strong> it to the workspace created in step 1.</li>\n<li>Repeat step 2 for all the worker nodes in your AKS cluster.</li>\n</ol>\n<h2>Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/akssizing#Sizing_for_SMA_deployment\">Sizing for Azure</a></li>\n<li><a href=\"/doc/423/26.1/akscluster\">Build AKS cluster</a></li>\n<li>For more information on Azure disk types, see <a href=\"https://docs.microsoft.com/en-us/azure/virtual-machines/windows/disks-types#premium-ssd\">Azure disk types</a>.<br/>\n\t </li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}