{
  "title": "Set up approval plan for a custom record type",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div></div>\n<p>For custom record types created using Studio, you can create approval definitions and enable approval plans in a workflow.</p>\n<h2 class=\"mw-headline\" id=\"Create_approval_definitions\">Create approval definitions</h2>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Administration &gt; Configuration &gt; Studio</b>.</li>\n<li>Select a custom record type.</li>\n<li>Create an approval definition as described in <a href=\"/doc/423/26.1/buildapprovaldefn\" title=\"SMAX:25.1/BuildApprovalDefn\">How to build an approval definition</a>.</li>\n<li>You can add more approval definitions to the custom record type.</li>\n</ol>\n<p>Notes:</p>\n<ul>\n<li>Approval definitions of a custom record type can't be removed after being created. This behavior is identical to the behavior of the <b>Change</b> or <b>Idea</b> record type.</li>\n<li>Approval definitions isn't covered by the dev2prod process. This behavior is identical to the behavior of the <b>Change</b> or <b>Idea</b> record type.</li>\n</ul>\n<h2 id=\"How_to_enable/disable_approval_plan_in_a_phase\"><span class=\"mw-headline\" id=\"How_to_enable.2Fdisable_approval_plan_in_a_phase\">How to enable/disable approval plan in a phase</span></h2>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Administration &gt; Configuration &gt; Studio</b>.</li>\n<li>Select a custom record type.</li>\n<li>Click the <b>Processes and Rules</b> tab.</li>\n<li>Select a phase, click the <b>Properties</b> tab on the right panel.</li>\n<li>Select or deselect the <b>Enable Approval Plan</b> check box.</li>\n<li>Click <b>Save</b>.</li>\n<li>Click the <b>Fields</b> tab, if the <b>Enable Approval Plan</b> check box was selected, you will find that a field named <b>TaskPlanFor&lt;Phase&gt;_&lt;UniqueSuffix&gt;</b> is created for the phase on which you enabled the approval plan. For example, for a field named \"TaskPlanForCustomPhase2_GJGFYU09Z,” “CustomPhase2” is the phase name, and “GJGFYU09Z” is a unique suffix generated by the system. If you deselected the <b>Enable Approval Plan</b> check box, the corresponding field will be removed. The <b>TaskPlanFor&lt;Phase&gt;_&lt;UniqueSuffix&gt;</b> field can be used in DSL expressions of workflow business rules. See <a href=\"/doc/423/26.1/embizrules\" title=\"SMAX:25.1/emBizRules\">Studio business rules</a> for more information.</li>\n<li>If the approval plan is enabled in a phase, the phase can't be moved to another metaphase. To move the phase to another metaphase, you will have to disable the approval plan and save.</li>\n</ol>\n<h2 id=\"How_to_select/deselect_approval_definition_in_a_phase\"><span class=\"mw-headline\" id=\"How_to_select.2Fdeselect_approval_definition_in_a_phase\">How to select/deselect approval definition in a phase</span></h2>\n<p>If the <b>Enable Approval Plan</b> check box is selected for a phase, you can specify the approval definition to be used by the phase.</p>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Administration &gt; Configuration &gt; Studio</b>.</li>\n<li>Select a custom record type.</li>\n<li>Select a phase, click the <b>Properties</b> tab on the right panel.</li>\n<li>Select <b>Approval Definition</b> from the drop-down list or clear the field.</li>\n<li>Click <b>Save</b>.</li>\n</ol>\n<p>See <a href=\"/doc/423/26.1/approvaldefn\" title=\"SMAX:25.1/ApprovalDefn\">Approval definitions</a> for more information.</p>\n<h2 class=\"mw-headline\" id=\"How_to_use_approval_plan_on_a_custom_record_instance\">How to use approval plan on a custom record instance</h2>\n<ol>\n<li>Open a custom record instance from the customized menu. Select a record instance or create a new record instance, fill in the detail page.</li>\n<li>Click the <b>Approvals</b> tab on the left panel. This tab will not be displayed if no approval plan was enabled in any phase of the current record type.</li>\n<li>Tabs of phases that have approval plans are shown on the right panel.</li>\n<li>Approval pans will be shown if the phase has an approval definition. Otherwise, empty approval plan will be shown.</li>\n<li>You can edit the approval plan if no approval definition has been defined in the phase.</li>\n<li>Click <b>Save</b>.</li>\n<li>Customer can only view approval plan if there is approval definition defined in the phase.</li>\n<li>After the record instance enters the phase that has approval plan enabled, the approval plan will be triggered.</li>\n</ol>\n<h2 id=\"How_to_make_sure_the_process_doesn't_enter_the_next_phase_until_all_approvals_are_finished_successfully\"><span class=\"mw-headline\" id=\"How_to_make_sure_the_process_doesn.27t_enter_the_next_phase_until_all_approvals_are_finished_successfully\">How to make sure the process doesn't enter the next phase until all approvals are finished successfully</span></h2>\n<p>As long as there are unfinished approvals, the process should not move on to the next phase. This can be achieved using workflow business rules. The following steps give an example of it, the steps may vary depending on your business case.</p>\n<p>In this example, the <b>bb</b> phase has an approval plan. The display label is \"bb,\" the name is \"CustomPhase1.\"</p>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Administration &gt; Configuration &gt; Studio</b>.</li>\n<li>\n<p>Select the custom record type, click the <b>Processes and Rules</b> tab.</p>\n</li>\n<li>\n<p>Select the transition after the phase that has approval plan enabled. In this example, select the transition after the <b>bb</b> phase.</p>\n</li>\n<li>Click the <b>Properties</b> tab on the right side panel.</li>\n<li>\n<p>Change transition type to <b>Automatic</b>.</p>\n</li>\n<li>\n<p>Enter the following DSL expression in <b>Condition</b>:</p>\n<pre> ${entity.TaskPlanFor&lt;Phasename&gt;_&lt;UniqueSuffix&gt;.ExecutionPlanCompletionCode == 'Success'}</pre>\n<p>In this example, <code>TaskPlanFor&lt;Phasename&gt;_&lt;UniqueSuffix&gt;</code> should be <b>TaskPlanForCustomPhase2_GJGFYU09Z</b>. You can also add other business conditions here.</p>\n</li>\n<li>Save the workflow.</li>\n</ol>\n<p>Create a new record and fill in the record's detail page. The next phase will be disabled until the approval plan is finished with the status \"Success,\" and the process will automatically move on to the next phase when the approval plan is finished.</p>\n<h2 class=\"mw-headline\">How to show the requestor's name for custom record types in Service Portal</h2>\n<p>When an approver views an approval of an OOTB record type in Service Portal, the requestor name, approval task title, record name, record ID, and display name are displayed. By default, the requestor's name doesn't show up in the approval if it is of a custom record type. However, you can adjust the settings in Studio and have the requestor's name displayed for this type of approvals. </p>\n<p>To do this, follow these steps:</p>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Administration &gt; Configuration &gt; Studio</b>.</li>\n<li>Select the \"Task\" record type in Studio &gt; Form/ Approval new form. Add a \"Requestor\" field and then save it.</li>\n<li>Create one custom record, add one entity link field named \"Requestor\" and have it referenced to the \"Person\" record type.</li>\n<li>Add the \"Requestor\" field to the custom record's Full form and New form.</li>\n<li>Add workflow for this custom record type.</li>\n<li>On the <strong>Approval definitions</strong> tab, add an approval definition.</li>\n<li>In the <strong>Approval Plan</strong>, click the <strong>Edit</strong> icon and then click the <strong>Edit</strong> button to add the approval task as shown below.<br/>\n<a class=\"image\" href=\"https://staging.docs.microfocus.com/file/images/6/69/ApprovalReviewStudio.png\" title=\"https://staging.docs.microfocus.com/file/images/6/69/ApprovalReviewStudio.png\"> <img alt=\"\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/6/69/ApprovalReviewStudio.png\" height=\"424\" hspace=\"0\" src=\"../../../images/ApprovalReviewStudio_d5f77423.png\" style=\"width: 800px; height: 424px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></li>\n<li>Return to the workflow and enable the approval definition for the proper phase, then select the approval definition you just created.</li>\n<li>Activate the custom record.</li>\n<li>Go to the custom record type page and create one new record. For example, \"Fix unstable case.\" Set the requestor as \"User A\" and set the approver as \"User B.\" Save it.</li>\n<li>Go to the phase where you just added the approval definition in step 9.</li>\n<li>Check the approval task that is in progress.</li>\n<li>Log in as the Approver and go to the Service Portal to check the approval task.</li>\n<li>Check the requestor name is displayed as shown below.<br/>\n<a class=\"image\" href=\"https://staging.docs.microfocus.com/file/images/7/72/RequestorsNameInServicePortal.png\" title=\"https://staging.docs.microfocus.com/file/images/7/72/RequestorsNameInServicePortal.png\"> <img alt=\"\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/7/72/RequestorsNameInServicePortal.png\" height=\"210\" hspace=\"0\" src=\"../../../images/RequestorsNameInServicePortal_486423ee.png\" style=\"width: 800px; height: 210px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></li>\n</ol>\n<h2 class=\"mw-headline\" id=\"More_information\">More information</h2>\n<ul>\n<li>Depending on the definition in the Studio, the <b>Approvals</b> tab may or may not be displayed on a record's detail page.</li>\n<li>An approval plan shows up in a phase only when it was enabled for the phase in Studio.</li>\n<li>When a record is created, everything on the <b>Approvals</b> tab of a record's detail page is copied from the approval definition of the record type. If you modify the approval definition of the record type, the changes will not affect the records that were created before. This behavior is identical to the behavior of the <b>Change</b> or <b>Idea</b> record type.</li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}