{
  "title": "Strong identity validation for approvals",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Certain task approvals may require strong identity validation as an additional level of security. You will require a passcode, verification code, and authorization code to proceed with the approval for these records. The feature may be enabled by an administrator for all records or for specific records only.</p>\n<h2 class=\"mw-headline\" id=\"Approve_a_task_using_strong_identity_validation\">Approve a task using strong identity validation</h2>\n<ol>\n<li>\n<p>Go to the <span class=\"SAW_VariablesMain_menu\">main menu</span> &gt; <b>Approvals</b>. In the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span>, open your To do list.</p>\n</li>\n<li>\n<p>Select a pending approval that matches the conditions defined for strong identity validation and click <b>Approve</b> or <b>Deny</b> and then <b>Save</b>.</p>\n</li>\n<li>\n<p>If you already have a passcode, the Strong identity validation dialog prompts you to enter it. If you don't have one, you are prompted to create one. Enter a passcode 10 to 20 characters long containing at least one upper case character, at least one lower case character, and at least one number. Retype the passcode and click <b>Create passcode</b>.</p>\n<p>The system retains your passcode for one hour while there is user activity. If you continue working beyond that period, or if there is no user activity for 10 minutes, you are prompted to re-enter your passcode.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span>  </p>\n<ul>\n<li>If you want to change your passcode, click the <b>Security Settings</b> link on the Profile page and click the <b>Change passcode</b> link.</li>\n<li>If you enter an incorrect passcode 3 times, the passcode is locked for 15 minutes. After the next incorrect attempt, it's locked for 30 minutes, then for one hour, and so on.</li>\n</ul>\n</div>\n</li>\n<li>\n<p>The first time you enter your passcode, you are prompted for a verification code. If you don't have one, click <b>Ask for verification code</b> and close the dialog. When you receive the code, enter it in the dialog and click <b>Next</b>.</p>\n<p>If your passcode has already been verified for strong identity validation or for an encryption domain, this step is skipped.</p>\n</li>\n<li>\n<p>Next, you are prompted to enter an authorization code for the record. The code is generated automatically and sent to your email address. When you receive it, enter it in the dialog and click <b>Get access</b>.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span>  </p>\n<ul>\n<li>The authorization code is valid for 24 hours from the time it's sent. If your authorization code has expired, click <b>Resend authorization code</b> to request a new one.</li>\n<li>Each approval has a unique authorization code.</li>\n</ul>\n</div>\n</li>\n<li>The approval is successfully saved.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/approvalsqueue\" title=\"SMAX:25.1/ApprovalsQueue\">Approvals queue</a></li>\n<li><a href=\"/doc/423/26.1/plfrmauthorization\" title=\"SMAX:25.1/plfrmAuthorization\">Authorization</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}