{
  "title": "Assign data domain permissions to a person, group, or role",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Service Management uses the Primary domain assignment (for a group or person) as the default data domain that the group or person has permission to view. This eases the correct assignment of data domains to records. For example, when you assign a request to a particular group, Service Management automatically adds the group's Primary domain to the request's data domains, enabling all members of the assignment group to view that request.</p>\n<p>You can also assign permission to view records for specific data domains or for all data domains to a role.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Notes</span></p>\n<ul>\n<li>By default, fields related to data domains aren't displayed in record forms. To manually assign domains or change existing domain assignments, you must first add the <b>Primary domain</b> field or <b>Data domains</b> field as necessary to the relevant forms. For more information on adding fields to forms, see <a href=\"/doc/423/26.1/editform\" title=\"SMAX:25.1/EditForm\">How to edit a form</a>.</li>\n<li>To allow an agent to log in to the agent interface, the tenant admin must configure the agent's person record such that the agent has access to at least one of the data domains of the agent. If not, the agent will receive an error at login. For example, if an agent has no group or role defined and has a <b>Primary domain</b> value of <b>IT</b>, the agent's <b>Data domains</b> value must include <b>IT</b> (for example: \"<b>IT\"</b>, \"<b>IT, HR\"</b>, or \"<b>Public\"</b>). Alternatively, if the agent has a group or role defined, the group or role's data domain permission must allow the agent to access at least one of the agent's data domains.<br/>\n\tService Management bypasses this login control for the tenant admin, who always has super admin privileges.</li>\n</ul>\n</div>\n<h2 class=\"mw-headline\" id=\"Assign_a_Primary_domain_to_a_group\">Assign a Primary domain to a group</h2>\n<p>When you create a group, assign a Primary domain to the group. All people in this group automatically inherit the group's primary data domain. In addition, a group obtains permissions from the roles assigned to the group.</p>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Administration &gt; Master Data &gt; People &gt; Groups</b>.</li>\n<li>\n<p>Select the group you want to edit.</p>\n<p>To filter the record list, click the <b>Add filter</b> <a class=\"image\" href=\"/file/images/c/cb/2018.08_Helpcenter/Resources/Images/Icons/FilterByIcon.png\" title=\"/file/images/c/cb/2018.08_Helpcenter/Resources/Images/Icons/FilterByIcon.png\"> <img alt=\"FilterByIcon.png\" data-file-height=\"18\" data-file-width=\"19\" height=\"18\" src=\"../../../images/FilterByIcon_8e3dccb1.png\" width=\"19\"/> </a> button. For more information, see <a href=\"/doc/423/26.1/filters\" title=\"SMAX:25.1/Filters\">Filters</a>.</p>\n</li>\n<li>\n<p>Click the record identifier in the <b>ID</b> column to display the selected record.</p>\n</li>\n<li>To assign or change the primary data domain, select a data domain in the <b>Primary domain</b> field. Only records tagged with this data domain or the data domains assigned to roles that are associated with this group are visible to the group's users.</li>\n<li>\n<p>Click  <a class=\"image\" href=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\" title=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\"> <img alt=\"Save\" data-file-height=\"21\" data-file-width=\"20\" height=\"21\" src=\"../../../images/SaveIcon_5eb13ed6.png\" width=\"20\"/> </a> <b>Save</b> on the toolbar.</p>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Assign_a_Primary_domain_to_a_user\">Assign a Primary domain to a user</h2>\n<p>By default, a user has permission to view all records that are in the Public data domain, unless only certain data domains are specified for that user. These data domains are obtained automatically by role or group assignment (best practice), or manually from the Primary domain that's assigned to the user.</p>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Administration &gt; Master Data &gt; People &gt; People</b>.</li>\n<li>\n<p>Select the user or contact you want to update.</p>\n<p>To filter the record list, click the <b>Add filter</b> <a class=\"image\" href=\"/file/images/c/cb/2018.08_Helpcenter/Resources/Images/Icons/FilterByIcon.png\" title=\"/file/images/c/cb/2018.08_Helpcenter/Resources/Images/Icons/FilterByIcon.png\"> <img alt=\"FilterByIcon.png\" data-file-height=\"18\" data-file-width=\"19\" height=\"18\" src=\"../../../images/FilterByIcon_8e3dccb1.png\" width=\"19\"/> </a> button. For more information, see <a href=\"/doc/423/26.1/filters\" title=\"SMAX:25.1/Filters\">Filters</a>.</p>\n</li>\n<li>\n<p>Click the record identifier in the <b>ID</b> column to display the selected record.</p>\n<p>You can edit multiple records simultaneously by selecting them in the grid and updating them in the Preview pane on the right. For more information, see <a href=\"/doc/423/26.1/editrecpreview#Mass\" title=\"SMAX:25.1/EditRecPreview\">Mass update</a>.</p>\n</li>\n<li>To assign or change the primary data domain, select a data domain in the <b>Primary domain</b> field. This Primary domain appears in the list of data domains that the user has permission to view.</li>\n<li>\n<p>Click  <a class=\"image\" href=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\" title=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\"> <img alt=\"Save\" data-file-height=\"21\" data-file-width=\"20\" height=\"21\" src=\"../../../images/SaveIcon_5eb13ed6.png\" width=\"20\"/> </a> <b>Save</b> on the toolbar.</p>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Assign_permission_for_a_data_domain_to_a_role\">Assign permission for a data domain to a role</h2>\n<p>You can assign permission to view records for specific data domains or for all data domains to a role. Select the data domains that are authorized for a particular role on the <b>Roles</b> page.</p>\n<p>By default, a role has permission to view all records that are in the Public data domain (even if the Public data domain isn't assigned to the role), unless specific data domains are selected.</p>\n<p><b>Note</b>: </p>\n<ul>\n<li>It's recommended that you assign data domain permissions to a role before the role is granted to the person or group. By doing this, the permission can be flexibly inherited by any person or group with this role, and you can also assign multiple domain permissions to one role.</li>\n<li>If you only assigned the Primary domain to the group or the user, but not assigned any additional domain permissions via the roles, the user can only access the allowed domain records according to the Primary data domain (PDD). A user can only be assigned with one Primary domain.</li>\n<li>A user with the Tenant Admin role is authorized for all data domains.</li>\n</ul>\n<p>To assign permission for a data domain to a role:</p>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Administration &gt; Master Data &gt; People &gt; Roles</b>.</li>\n<li>In the Security section, do one of the following:\n\t<ul>\n<li><b>View all data domains</b>. Select this check box for records in all data domains to be visible to the role.</li>\n<li><b>Users and groups who have this role are authorized to access records in the following data domains</b>. Click in the text box and select the specific data domains to assign to the role. Only records tagged with these data domains are visible to the role. <strong>Note</strong>: You can assign up to 250 data domains to a role. </li>\n</ul>\n</li>\n<li>Click <a class=\"image\" href=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\" title=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\"> <img alt=\"Save\" data-file-height=\"21\" data-file-width=\"20\" height=\"21\" src=\"../../../images/SaveIcon_5eb13ed6.png\" width=\"20\"/> </a> <b>Save</b> on the toolbar.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/assigndomainrec\" title=\"SMAX:25.1/AssignDomainRec\">How to assign a record to a data domain</a></li>\n<li><a href=\"/doc/423/26.1/impact\" title=\"SMAX:25.1/Impact\">Impact of data domain segmentation</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}