{
  "title": "Assign one or more data domains to a record",
  "content": "<div class=\"mw-parser-output\">\n<div></div>\n<p>You can assign one or more data domains to a record in different ways.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<ul>\n<li>You can assign up to 250 data domains (the Public domain and 249 custom domains) to a record. </li>\n<li>Out of the box, new data domain assignments are always appended to existing assignments, unless the existing data domain assignment is the Public data domain (the out-of-the-box data domain assignment). In this case, the Public data domain assignment disappears from the record, and the new data domain is then set as the record's data domain assignment.</li>\n<li>If you want to create additional business rules to remove domains automatically, be aware that doing so can sometimes be dangerous, and result in orphaned cases. For this reason, the best practice of allowing IT agents to further restrict by removing domains is a safer way.</li>\n</ul>\n</div></div></div>\n<h2 class=\"mw-headline\" id=\"Automatically_obtain_data_domain_assignment_by_using_data_import\">Automatically obtain data domain assignment by using data import</h2>\n<p>At the initial data onboarding stage, you can use this method to automatically assign one data domain to the following types of reference data records: Location, Person, Company, Group, and Record Category.</p>\n<ol>\n<li>Prepare a CSV file that contains the required data. The following is an excerpt of a sample CSV file for Person:\n\t<pre>\"Name\",\"Email\",\"Upn\",\"DataDomains\"\n\n\"Smith,John\",\"john.smith@mycompany.com\",\"John\",\"IT_c\"\n\n\"Holm,David\",\"david.holm@mycompany.com\",\"David\",\"HR_c\"\n</pre>\n<p>Where: <b>Upn</b> represents the <b>User principal name</b> field, and <b>DataDomains</b> represents the <b>Data domains</b> field for which you must provide the <b>Name</b> value defined in the <b>Data domains</b> list (<b>Administration</b> &gt; <b>Configuration</b> &gt; <b>Lists</b>). Note that this is only a simple example for demonstration purposes, and your real CSV files normally should contain many more attributes.</p>\n</li>\n<li>From <b>Studio</b>, open the record type.</li>\n<li>Click <b>Import data</b>, and then click <b>Import</b>. Browse to the CSV file and then click <b>IMPORT</b>. You see a message that indicates how many records were uploaded successfully.</li>\n<li>Check that the <b>Data domain</b> field in each record has the correct value.</li>\n</ol>\n<p>After the initial upload, update the data domains of the imported records as needed, either individually or by using Mass Update.</p>\n<h2>Automatically obtain the data domain assignment from default values or by business rules</h2>\n<p>There are two main ways for records to automatically receive their data domain assignments:</p>\n<ul>\n<li>To ease the creation of some new records, among other information, you can specify a default data domain assignment (the Primary domain). For example, you can specify a <b>Primary domain</b> value for a group and then assign this group as the default Service Desk group in an offering so that the system automatically copies the primary domain of that group to the <b>Data domains</b> field of each request that's based on that offering.</li>\n<li>\n<p>The system uses out-of-the-box business rules to automatically append or remove data domain assignments on records. Additionally, you can create your own business rules for assigning data domains. For more information about rules that append or remove data domain assignments, see <a href=\"/doc/423/26.1/dslactionrules#AppendRemove\" title=\"SMAX:25.1/DSLActionRules\">Append or Remove values in a multi-value field</a>.</p>\n<p>Note that Service Management continuously synchronizes the data domain assignment only for Service Level Targets. For other record types, Service Management appends or copies the data domain assignment only once per assignment. The best practice is to use automatic data domain assignments, but you can change the data domain assignment manually if required. For more information, see <a href=\"/doc/423/26.1/assigndomainrec#Manually_assign_one_or_more_data_domains_to_a_record\" title=\"Manually assign one or more data domains to a record\">Manually assign one or more data domains to a record</a>.</p>\n</li>\n</ul>\n<p>Service Management handles automatic data domain assignments differently for various record types:</p>\n<ul>\n<li>\n<p><b>Requests</b>. A request can obtain its data domain assignments from the following fields:</p>\n<ul>\n<li>the Expert assignee's Primary domain</li>\n<li>the Expert group's Primary domain</li>\n<li>the Service desk owner's Primary domain</li>\n<li>the Service desk group's Primary domain</li>\n<li>the Offering's default data domain values</li>\n<li>Request bundle–the data domains of the child requests are appended to the parent record</li>\n</ul>\n<p>An agent who has permission to view the request may change the domain assignments or add additional domains.</p>\n</li>\n<li>\n<p><b>Articles</b>. New knowledge or news articles (either manually created or as the result of creating an article from another record) automatically have the Public data domain assigned to them.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<p>It's recommended that you manually assign data domains to articles that contain sensitive information, and use targeted permissions to enable strong security. If you don't assign data domains, sometimes users in the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span> could view articles that were published internally using REST APIs.</p>\n</div></div></div>\n</li>\n<li>\n<p><b>Changes</b>. A change can obtain its domain assignments from the following fields:</p>\n<ul>\n<li>the Service desk owner's Primary domain</li>\n<li>the Owning group's Primary domain</li>\n<li>the Change model's default data domain values</li>\n</ul>\n<p>An agent who has permission to view the change may change the domain assignments or add additional domains.</p>\n</li>\n<li>\n<p><b>Incidents</b>. An incident can obtain its data domain assignments from the following fields:</p>\n<ul>\n<li>the Service desk owner's Primary domain</li>\n<li>the Service desk group's Primary domain</li>\n<li>the Expert assignee's Primary domain</li>\n<li>the Expert group's Primary domain</li>\n<li>the Incident model's default data domain values</li>\n</ul>\n<p>An agent who has permission to view the incident may change the data domain assignment or add additional data domains.</p>\n</li>\n<li>\n<p><b>Problems</b>. A problem, which is a collection of related incidents, can obtain its data domain assignments from the following fields:</p>\n<ul>\n<li>the Service desk owner's Primary domain</li>\n<li>the Owning group's Primary domain</li>\n</ul>\n<p>An agent who has permission to view the problem may change the data domain assignments or add additional data domains.</p>\n</li>\n<li><b>Service Level Target (SLT)</b>. The data domain of an SLT is automatically inherited from and synced with the data domain of the parent ticket. The synchronization may take several minutes to complete.</li>\n<li>\n<p><b>Tasks</b>. A task can obtain its data domain assignments from the following fields:</p>\n<ul>\n<li>the Assignee's Primary domain</li>\n<li>The Assignee manager's Primary domain</li>\n<li>The Assignment group's Primary domain</li>\n</ul>\n<p>If there're no data domains copied from these three fields, a task obtains its data domain assignments from its parent record type.</p>\n</li>\n<li>\n<p><b>Approvals</b>. Approvals are a type of task, and obtain their data domain assignments in the same way as tasks do (obtained from the Assignee, Assignee's manager, and Assignment group), or from the parent record type.</p>\n</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Automatically_obtain_data_domain_assignments_from_existing_records\">Automatically obtain data domain assignments from existing records</h2>\n<p>When you create a record from an existing record, the system copies certain information to the new record. For data domain segmentation, the system copies the data domain assignment in the following cases:</p>\n<ul>\n<li>Creating a change, incident or release from a change.</li>\n<li>Creating a change, incident, or problem from an incident.</li>\n<li>Creating a change from a problem.</li>\n<li>Creating an incident from a request.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Manually_assign_a_record_to_one_or_more_data_domains\">Manually assign a record to one or more data domains</h2>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<p>If you work with data domains and you want to manually change existing domain assignments, you must first add the <b>Data domains</b> field to the relevant forms. For more information on adding fields to forms, see <a href=\"/doc/423/26.1/editform\" title=\"SMAX:25.1/EditForm\">How to edit a form</a>. For more information on data domains, see <a href=\"/doc/423/26.1/datadomainseg\" title=\"SMAX:25.1/DataDomainSeg\">Data domain segmentation</a>.</p>\n</div></div></div>\n<ol>\n<li>Select the record to which you want to assign data domains. You can assign data domains to the following record types:\n\t<ul>\n<li>Approval</li>\n<li>Article</li>\n<li>Change</li>\n<li>Incident</li>\n<li>Problem</li>\n<li>Request</li>\n<li>Service Level Target (SLT)</li>\n<li>Task</li>\n<li>Location</li>\n<li>Person</li>\n<li>Company</li>\n<li>Group</li>\n<li>Record Category</li>\n<li>Contract</li>\n<li>Device</li>\n<li>System Element</li>\n<li>Service Component</li>\n<li>Actual Service</li>\n<li>Infrastructure and Peripherals</li>\n<li>Custom record types</li>\n<li>Enterprise Asset</li>\n<li>Enterprise Asset Subtype</li>\n</ul>\n</li>\n<li>In the Data domains field, click <b>Assigned</b> and select the specific data domains that you want to assign to the record.</li>\n<li>Click  <a class=\"image\" href=\"\"> <img alt=\"Save\" data-file-height=\"21\" data-file-width=\"20\" height=\"21\" src=\"../../../images/SaveIcon_5eb13ed6.png\" width=\"20\"/> </a>  <b>Save</b> on the toolbar.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/assigndomainprimary\" title=\"SMAX:25.1/AssignDomainPrimary\">Assign data domain permissions to a user, group or role</a></li>\n<li><a href=\"/doc/423/26.1/impact\" title=\"SMAX:25.1/Impact\">Impact of data domain segmentation</a></li>\n</ul>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}