{
  "title": "Assign OO roles and permissions to users",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>After setting up Operations Orchestration (OO) Containerized, the tenant admin can see all OO Containerized menu items within Service Management and access OO data. However, other users need certain role permissions to access the menu items and work with OO Containerized. </p>\n<h2>Configure OO menu item visibility in Service Management (tenant admin)</h2>\n<p>The tenant admin (or another authorized user) needs to assign role permissions from the Service Management interface to control the visibility of menu items of Operations Orchestration Containerized.</p>\n<p>To do this, navigate to <strong>Administration</strong> &gt; <strong>Master Data</strong> &gt; <strong>People</strong> &gt; <strong>Roles </strong>and use two role permissions on the Role form:</p>\n<ul>\n<li><strong>Permission to manage Operations Orchestration</strong>:<strong> </strong>this permission enables access to the <strong>RUN</strong> &gt; <strong>Automation Operations</strong> menu item. </li>\n<li><strong>Orchestration Settings </strong>(in the <strong>Administration menu visibility</strong> section): this permission enables access to the <strong>Administration</strong> &gt; <strong>Configuration</strong> &gt; <strong>Orchestration Settings</strong> menu item. </li>\n</ul>\n<p>You may want to assign one or both of the role permissions to different users. For example, you can create a group, assign the required permission or permissions to that group, and then add users to that group.</p>\n<h2>Assign OO permissions to users (suite admin)</h2>\n<p>Users need different permissions to work in different areas in OO Containerized. The suite admin can configure users with different permissions for OO Containerized. For more information, see <a href=\"/doc/423/26.1/oorolespermissions\">Roles and permissions in OO Central</a>.</p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}