{
  "title": "User authentication overview",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>User authentication in Service Management validates the identity of a user and then authorizes the user to features that match the user's role. You can use different methods to authenticate users, which fall into two main categories: IdM authentication and external identity provider (IdP) authentication.</p>\n<h2>IdM authentication</h2>\n<p>In IdM authentication, users log in to applications through the IdM login page (the applications utilize the IdM login page), and IdM validates the credentials itself, according to how you have configured the authentication. IdM authentication comprises the following methods:</p>\n<ul>\n<li><strong>Database</strong><br/>\n\tUser information is stored in the IdM database. You must add users to the IdM database by using User Administration, IdM Admin Portal, a seeded file, or an API. For this authentication method, a user must enter the user name and password to log in to the system.</li>\n<li><strong>LDAP</strong> <br/>\n\tUser information is stored on an external LDAP server. You use the IdM Admin Portal to configure an LDAP server connection and the required administrator credentials. When a user logs in to an application, LDAP authenticates the login credentials by verifying that the user name and password match an existing user in the LDAP directory.</li>\n</ul>\n<h2>IdP authentication</h2>\n<p>Using external IdP authentication, you integrate IdM with a third-party IdP. When users log in to the application, the login request is forwarded to the third-party IdP login page and the IdP will validate the credentials. External IdP authentication comprises the following methods:</p>\n<ul>\n<li><b>SAML</b></li>\n<li><b>OAuth</b></li>\n</ul>\n<h3>2FA &amp; MFA</h3>\n<p>Two-factor authentication (2FA) or multi-factor authentication (MFA) is an authentication method that requires the user to provide two or more verification factors rather than just the username and password to gain access to the system. For security, the suite supports this authentication method if your external IdP supports it. By delegating authentication to the federated IdPs through SAML or OAuth, the system will redirect the user to the external IdP for additional verification of the user's identity during the login.</p>\n<h3>SSO</h3>\n<p>The suite supports single sign-on (SSO), a method that allows users to enter their login credentials one time on the login page to access all the applications in the system. With SSO, once users are logged in to the suite, they can access the authorized capabilities without re-login.</p>\n<h2>Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/configureauthenticationinidm\" title=\"Configure authentication services (LDAP, SAML, OAuth)\">Configure authentication services (LDAP, SAML, OAuth)</a></li>\n<li><a href=\"/doc/423/26.1/saconfig\" title=\"Configurations\">Configurations</a></li>\n</ul>\n<div></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}