{
  "title": "Back up suite data before upgrade",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>To ensure a healthy backup, verify the environment.</p>\n<h2 class=\"mw-headline\">Verify the environment before making a backup</h2>\n<p>To verify the healthy or not before making a backup, follow the following steps:</p>\n<ol>\n<li>Log in to the control panel or bastion node and run the following command to make sure all of the suite pods are ready.\n\t<pre>kubectl get pod --all-namespaces|grep -v 1/1|grep -v 2/2|grep -v 3/3|grep -v 4/4|grep -v Completed\n</pre>\n<p>This command returns a list of abnormal pods. When it returns no result, all of the suite pods are ready. If any pods can't run, see <a href=\"/doc/423/26.1/troubleshootinstall\" title=\"Troubleshoot installation.\">Troubleshoot installation.</a></p>\n</li>\n<li>Clear your browser cache.</li>\n<li>Verify that you can log in to the Suite Administration interface: <strong><em>https://&lt;external_access_host&gt;/bo</em></strong> with the credentials below:\n\t<ul>\n<li>Username: <strong>suite-admin</strong></li>\n<li>Password<strong>: </strong>the password you set up in the installation process</li>\n</ul>\n</li>\n<li>Verify that you can log in to the OMT Management Portal: <strong>https://&lt;external_access_host&gt;:5443 </strong>with the credentials below:\n\t<ul>\n<li>Username: <strong>admin</strong></li>\n<li>Password: the password you set up when running the bootstrap installation command</li>\n</ul>\n</li>\n</ol>\n<p>Before the version update, back up the suite data. You can use one of the following methods.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>The method of using VM snapshots can be used for on-premises deployments only.</p>\n</div>\n</div>\n<h2 class=\"mw-headline\" id=\"Back_up_suite_data_by_taking_VM_snapshots\">Back up suite data by taking VM snapshots</h2>\n<p>If you have the privileges and capability to take VM snapshots, perform the following steps to back up the suite data:</p>\n<ol>\n<li>Take a snapshot of each of the control plane nodes and worker nodes. For details, see the \"Take a snapshot of the suite\" topic.</li>\n<li>Back up the suite databases. For details, see the specific database documentation.</li>\n<li>Back up the suite's global and Smart Analytics NFS volumes. For details, see the \"Suite backup procedure\" topic.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Back_up_suite_data_using_the_DR_toolkit\">Back up suite data using the suite disaster recovery solution</h2>\n<p>You can use the disaster recovery solution to back up the suite data. To back up the suite data, see the \"Suite backup procedure\" topic.</p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}