{
  "title": "Overview of backup and restore",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>To maintain business continuity, it's necessary to back up the suite data periodically so you can restore the data when the cluster crashes or data loss happens. For all deployments, use a backup and restore solution that leverages <a href=\"https://velero.io/\">Velero</a> and cloud-native tools and services.</p>\n<p>This page gives an overview of the solution: what data you need to back up and restore, how to plan your backup, and what scenarios this backup and restore solution can apply to.</p>\n<h2>Prerequisites</h2>\n<p>Before implementing the backup and restore solution, note the following items: </p>\n<ul>\n<li>The source and target environments must be hosted on the same platform.</li>\n<li>The Kubernetes versions in both environments must be the same.</li>\n<li>To back up and restore managed Kubernetes configurations and clusters, <a href=\"/doc/423/26.1/installveleromanagedk8s\">set up Velero</a> according to your cloud deployment platforms.<br/>\n\tThere's no need to do this for a deployment using the Kubernetes embedded in OMT, which comes with preinstalled Velero.</li>\n</ul>\n<h2>What can I back up and restore</h2>\n<p>The suite backup and restore solution for all Kubernetes performs a full backup and restoration of the following data:</p>\n<ul>\n<li>Kubernetes configurations, also known as Kubernetes API objects, including Deployments, Daemonsets, Statefulsets, Namespaces, Persistent Volumes, Secrets, and more. </li>\n<li>PostgreSQL database data: the stateful data of the suite components.</li>\n<li>External storage data, including the suite configuration files, logs, attachments, and so on.</li>\n</ul>\n<p>These three types of data backup are independent, but we recommend that you use the same cadence for backing up the PostgreSQL database and external storage.</p>\n<h2>Disaster scenarios</h2>\n<p>This backup and restore solution can address the following scenarios.</p>\n<div class=\"Admonition_Note\" lang=\"en-US\"><span class=\"autonumber\">Note  </span>Before handling all the disaster scenarios in this solution, you should schedule your routine backup for the Kubernetes configurations, database data, and external storage data (see <a href=\"/doc/423/26.1/smabackupprocedure\">SMA backup procedure</a> for the detailed backup procedure). This is the prerequisite for handling disaster scenarios.</div>\n<p><a class=\"image\" href=\"/file/images/5/5f/DR-21.08.png\" title=\"/file/images/5/5f/DR-21.08.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/5/5f/DR-21.08.png\" height=\"500\" hspace=\"0\" src=\"../../../images/DR-21.08_9d68f79d.png\" style=\"width:783px;height:500px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"783\"/> </a></p>\n<h3 id=\"DR2.0documentscope&amp;instructions-Scenario#1In-PlaceRestoreK8SConfigurationsofCDF/SMA\">Scenario 1: Kubernetes configurations corruption</h3>\n<p>In this scenario, one or more Kubernetes configurations of the suite and OMT (for example, configmap, deployment) have been changed by accident or mistakenly. You need to <a href=\"/doc/423/26.1/restorekubernetesconfig\">restore the Kubernetes to the latest correct configuration</a>.</p>\n<p>For the restoration of only Kubernetes configurations, use Velero, an open-source tool. Learn more at <a href=\"https://velero.io/\" rel=\"nofollow\" title=\"https://velero.io/\">https://velero.io/</a>. </p>\n<div class=\"Admonition_Note\"><strong>Note:</strong> Velero has the ability to back up and restore storage data; however, Velero doesn't support the storage types SMA currently uses. For this reason, use Velero only for the Kubernetes configuration backup and restoration.</div>\n<h3 id=\"DR2.0documentscope&amp;instructions-Scenario#2In-PlaceRestoreStorage\">Scenario 2: Persistent storage data corruption</h3>\n<p>In this scenario, some files on the persistent storage are corrupted or deleted by accident or mistakenly. You need to <a href=\"/doc/423/26.1/storagedatacorrupted\">restore these files to the latest backup</a>.</p>\n<p>For the restoration of file storage, use cloud-native services based on the official guides from the cloud providers.</p>\n<h3 id=\"DR2.0documentscope&amp;instructions-Scenario#3In-PlaceRestoreDatabase\">Scenario 3: Databases data corruption</h3>\n<p>In this scenario, the database data is corrupted or deleted by accident or mistakenly. You need to <a href=\"/doc/423/26.1/databasedatacorrupted\">restore the databases to the latest backup</a>.</p>\n<p>For the restoration of databases, use cloud-native services based on the official guides from the cloud providers. </p>\n<h3 id=\"DR2.0documentscope&amp;instructions-Scenario#4In-Placere-buildK8Scluster\">Scenario 4: Kubernetes cluster crash</h3>\n<p>In this scenario, the current Kubernetes cluster has crashed, for example, the API server isn't accessible, or a worker node isn't ready. You need to <a href=\"/doc/423/26.1/kubernetesclustercrashed\">rebuild a new cluster for the suite</a>.</p>\n<p>Specifically, you need to set up an empty Kubernetes cluster, and then restore all the suite and OMT Kubernetes configurations using Velero. The new cluster will use the same storage and database data.</p>\n<h2>How to back up and restore</h2>\n<p>In the event of data corruption or service disruption or natural disasters, it's important to recover your business services and return them back to operation as quickly as possible. A well-planned and fully-tested <strong>Disaster Recovery Plan (DRP)</strong> facilitates your organization to recover from system failures or attacks in a systematic and timely manner. Create and apply your DRP with the help of this backup and restore solution, as described below.</p>\n<h3>Phase 1: Plan for disaster recovery</h3>\n<p>This backup and restore solution lists some key factors you need to consider when creating your own DRP.</p>\n<h4>Recovery objectives</h4>\n<p><strong>Recovery Time Objective (RTO)</strong> and <strong>Recovery Point Objective (RPO)</strong> are metrics of an organization's tolerance for time delay and data loss in the event of service interruption.</p>\n<ul>\n<li>RTO: The maximum acceptable time when your application is unavailable. It's usually defined as part of a larger service level agreement (SLA).</li>\n<li>RPO: The maximum acceptable data loss when your application is unavailable.</li>\n</ul>\n<p>Both being key parts of DRP, you must define an RTO and RPO according to your organization's business risks in disasters, operational complexity, and costs. As a best practice, plan your backup frequency with the help of your <strong>RPO</strong>. For example, if your RPO is 6 hours, schedule backups no more than every 6 hours. The following are guidelines for different data types:</p>\n<ul>\n<li>Business data like database and file storage data often sees constant updates. Schedule your backup of database and file storage based on your <strong>RPO</strong>.</li>\n<li>Compared with business data, the Kubernetes configuration sees much fewer updates. If you seldom update it, back it up only when you do the updates. Or schedule your backups of Kubernetes configurations according to your <strong>RPO</strong> if you regularly update it.</li>\n<li>To avoid data inconsistency issues, leverage native backup services to schedule automated backups of your database and file storage data <strong>in the same cadence</strong>, which means you need to back up databases and file storage at the same point in time with the same frequency. See <a href=\"/doc/423/26.1/smabackupprocedure#Scheduled_routine_backup\">Scheduled routine backup</a>.</li>\n</ul>\n<p>Define your RTO using the table below for reference. This table takes EKS deployment as an example. The RTO values in the table are for your reference only. Define your own RTO values based on your actual environment and business needs. For example, for scenario 4, you can reduce your RTO by setting up an empty cluster in a cold standby system.</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<thead>\n<tr>\n<th scope=\"col\">Scenario</th>\n<th scope=\"col\">RTO </th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Scenario 1  (Kubernetes configuration corruption)</td>\n<td><strong>10 minutes</strong></td>\n</tr>\n<tr>\n<td>Scenario 2 (storage data corruption)</td>\n<td><strong>Hours or days</strong>. The time varies according to your data size.  <strong>2 hours</strong> for verifying on EFS of 200 G data</td>\n</tr>\n<tr>\n<td>Scenario 3 (database data corruption)</td>\n<td><strong>30 minutes</strong></td>\n</tr>\n<tr>\n<td>Scenario 4 (Kubernetes cluster crash)</td>\n<td><strong>Half or 1 day</strong> for setting up a new system (depends on your proficiency to set up a cluster) <strong>+ </strong> <strong>20 minutes</strong> for configuration recovery.</td>\n</tr>\n</tbody>\n</table>\n<p>Define your RPO using the table below for reference. This table takes EKS deployment as an example. </p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<thead>\n<tr>\n<th scope=\"col\">Scenario</th>\n<th scope=\"col\">RPO</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Any of the above</td>\n<td>\n<p>Depends on how frequently the data is modified and how important the data is. </p>\n<p>For example, <span style=\"background-color: transparent;\">frequently modified</span> i<span style=\"background-color: transparent;\">mportant user data should target a </span><strong style=\"background-color: transparent;\">minute-level</strong><span style=\"background-color: transparent;\"> </span>RPO<span style=\"background-color: transparent;\">.</span></p>\n<p>While the data with lower importance and update frequency could target an <strong>hour-level</strong> RPO.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h4>Stakeholders</h4>\n<div>\n<p>Identify, involve, and train all the personnel who need to perform the first and routine backup tasks and who will get informed and take action once a disaster happens. Make sure all stakeholders have a clear understanding of their ownership and the required knowledge and expertise to handle disasters.  </p>\n<p>Also, you need to create and manage exclusive communication channels to handle specific disaster scenarios.</p>\n<h4>Tests and validation</h4>\n<p>Always test your DRP before implementing it. Furthermore, test your plan regularly to ensure all the backup and restore tasks flow smoothly, all stakeholders take action as planned, and the results meet the defined objectives. If you find anything outdated, adjust the plan in a timely manner to make sure your DRP is always up-to-date.  </p>\n<div class=\"Admonition_Tip\"><span class=\"autonumber\">Note</span>  Apart from the aforementioned, a working DRP must also consider more factors such as business impact analysis and recovery costs. Customize your own DRP based on this provided solution and your actual business requirements.</div>\n<h3>Phase 2: Apply your Disaster Recovery Plan</h3>\n<p>After creating your DRP, use the procedure below to apply it to your organization.</p>\n<ol>\n<li>Prepare for the Kubernetes backup and restoration. See <a href=\"/doc/423/26.1/installveleromanagedk8s\">set up Velero</a>. </li>\n<li>Back up the suite:\n\t<ol start=\"1\">\n<li>Perform the <strong>first backup</strong> based on <a href=\"/doc/423/26.1/smabackupprocedure\">Backup procedures</a>.</li>\n<li>Schedule <strong>routine backups </strong>automatically or manually based on DRP. See <a href=\"/doc/423/26.1/smabackupprocedure#Update_scheduled_backup\">Scheduled routine backup</a>.</li>\n</ol>\n</li>\n<li>Test your DRP to see if the plan flows smoothly in various simulated disaster scenarios. If not, adjust the DRP accordingly.</li>\n<li>When a real disaster happens, figure out the specific disaster scenario and trigger your DR flow according to the DRP. See<a href=\"/doc/423/26.1/smarestoreprocedures\"> SMA restore procedures</a> to handle specific disaster scenarios.</li>\n</ol>\n<div class=\"Admonition_Tip\"><span class=\"autonumber\">Tip</span>  See <a href=\"/doc/423/26.1/drpusecase\">Use case: backup and restore</a> for the detailed workflow of how to create and apply a DRP.</div>\n</div>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}