{
  "title": "Create compliance reports based on product compliance scopes",
  "content": "<div class=\"mw-parser-output\"><br/><p>Product compliance scopes in Software Asset Management (SAM) allow you to track and manage software compliance for certain scopes. With this capability, organizations can tailor their compliance checks and processes to specific requirements and constraints of each license type and ensure that each type is managed according to its unique terms and conditions. Typically, there are two scenarios:</p>\n<ul>\n<li>Based on the license agreements or negotiations, you have purchased different licenses. As a result, you need to track license usage separately for each group in the compliance report.</li>\n<li>The software installation on a device requires different types of licenses and must be licensed at the same time.</li>\n</ul>\n<p>This topic describes how to create compliance reports based on product compliance scopes.</p>\n<h2>Create a product compliance scope</h2>\n<p>As a tenant admin, go to Agent Interface and add product compliance scopes in <b>Run</b> &gt; <strong>Software Asset</strong> &gt; <strong>Products </strong>&gt;<strong> <a href=\"/doc/423/26.1/samproducts#Compliance_calculation_settings_tab\" title=\"Compliance calculation settings\">Compliance calculation settings</a></strong>. Here, we will create two scopes to check license compliance for regular employees and contractors. </p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"> </div>\n<div class=\"admonition-content admonition-note-content\">You can use product compliance scopes together with organization compliance scopes. In this case, SAM will calculate product compliance based on the organization compliance scopes. See <a href=\"/doc/423/26.1/bpfororgscope\" title=\"Create compliance reports based on organization scopes\">Create compliance reports based on organization scopes</a>.</div>\n</div>\n<p>Before creating product compliance scopes, you must first prepare the necessary data.</p>\n<ol>\n<li>Go to <strong>License metrics</strong> to create a license metric for each scope, such as ''User license (Regular employees)\" and \"User license (Contractors)\". See <a href=\"/doc/423/26.1/samlicensemetrics\" title=\"License metrics\">License metrics</a>.</li>\n<li>Go to <strong>License models</strong> to create a license model for each license metric. See <a href=\"/doc/423/26.1/samlicensemodel\" title=\"License models\">License models</a>.</li>\n<li>Go to <strong>Licenses </strong>to create a license for each license metric. See <a href=\"/doc/423/26.1/samlicenses\" title=\"Licenses\">Licenses</a>.</li>\n<li>Go to <strong>License rules</strong> and create a license rule for each license metric, such as \"User-based licensing (Regular employees)\" and \"User-based licensing (Contractors)\". See <a href=\"/doc/423/26.1/samlicenserules\" title=\"License rules\">License rules</a>.</li>\n<li>Go to <strong>Products </strong>&gt; <strong>Compliance calculation settings</strong> and link these license rules to the product. See <a href=\"/doc/423/26.1/samproducts#Configure_license_rules_for_a_product_(discovered_products_only)\" title=\"Configure license rules for a product\">Configure license rules for a product</a>.</li>\n</ol>\n<p>Now, follow these steps to create the product compliance scopes in <strong>Products</strong>:</p>\n<ol>\n<li>Click <strong>New</strong>. This opens the <strong>New product compliance scope</strong> dialog box.</li>\n<li>In <strong>Name</strong>, enter a unique name for the product compliance scope, such as \"Regular employees\".</li>\n<li>In <strong>Available license metrics</strong>, you can select multiple options from the drop-down list generated based on the linked license rules in <strong>Compliance calculation settings</strong>. This setting informs SAM which license rules and licenses will be used to calculate license consumption for the product compliance scope.</li>\n<li>In <strong>Preferred license metric</strong>, select one from the available license metrics. If there are not enough licenses to cover the deployments, SAM will apply the license rule using the preferred license metric to calculate the number of license points that need to be purchased.</li>\n<li>Configure the device query and license query based on your business requirements. By default, SAM will query all devices (within the organization compliance scope if configured) where the current product is installed and the licenses associated with the license metrics configured in <strong>Available license metrics</strong>. However, you can configure the device and license queries to define the scopes. SAM will then generate separate compliance reports for each defined scope. In our example, you can configure a device query for the \"Regular employees\" scope and set the owner's employment type to full-time. You don't need to configure the license query.</li>\n<li>Save the settings.</li>\n<li>Repeat the above steps to add the other scope, such as \"Contractors\".</li>\n</ol>\n<h2>Edit a product compliance scope</h2>\n<p>To edit a product compliance scope, select it and click <strong style=\"font-size: 14px;\">Edit</strong><span style=\"font-size: 14px;\">. Make sure the license metrics of the product compliance scope match those of the license rule assigned to the product.</span></p>\n<h2>View license compliance by scope</h2>\n<p>After <a href=\"/doc/423/26.1/samproducts#Calculate_license_consumption\" title=\"Calculate license consumption\">calculating license consumption</a>, go to the <a href=\"/doc/423/26.1/samcompliance\" title=\"Compliance\"><strong>Compliance</strong></a> &gt; <b>Dashboard</b> to view the product's compliance status by the product compliance scopes you defined.</p>\n<p>On the <a href=\"/doc/423/26.1/samlicenseusage#View_a_license_usage_record\" title=\"Analysis\"><b>Analysis</b></a> page, click the <b>Compliance analysis</b> card, select the required product, and then use the <strong>Product compliance scope</strong> option to view each scope's licensing and consumption information.</p>\n<p>In <a href=\"/doc/423/26.1/samlicenseusage\" title=\"view license usage records\">License usage</a>, you can also view the license consumption results of the product based on the defined scopes.</p>\n<div> </div>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}