{
  "title": "Build and manually optimize a scenario",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div id=\"tag-premium\"></div>\n<ol>\n<li>\n<p>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Plan &gt; Project &amp; Program &gt; Portfolio Scenarios</b>. Service Management displays a list of project portfolios.</p>\n</li>\n<li>\n<p>Select the portfolio for which you want to build an optimization scenario.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> You must include at least one content item in a project portfolio in order to create a scenario.</p>\n</div>\n</li>\n<li>\n<p>Click <a class=\"image\" href=\"/file/images/c/cc/2018.08_Helpcenter/Resources/Images/Icons/NewIcon.png\" title=\"/file/images/c/cc/2018.08_Helpcenter/Resources/Images/Icons/NewIcon.png\"> <img alt=\"New\" decoding=\"async\" height=\"18\" src=\"../../../images/NewIcon_7074e789.png\" width=\"17\"/> </a><b>New</b>. Service Management displays a <b>New Portfolio Scenario</b> page. Service Management doesn't assign an ID until you save the scenario.</p>\n<p>By default, Service Management automatically selects all content items that belong to the selected portfolio and contain the necessary information. An information message is displayed if content items in the selected portfolio are missing relevant information. A graphic overview of relevant information for all the included items is displayed.</p>\n<p><a class=\"image\" href=\"/file/images/1/18/SMAXNewPortfolioScenario.png\" title=\"/file/images/1/18/SMAXNewPortfolioScenario.png\"> <img alt=\"SMAXNewPortfolioScenario.png\" decoding=\"async\" height=\"915\" src=\"../../../images/SMAXNewPortfolioScenario_b9765b8b.png\" width=\"1920\"/> </a></p>\n<p>The top section displays the total cost, resource demand, and business value for all selected items , as well as resource demand by resource type, cost by business unit, and cost vs. budget by quarter. Changes that you make to amounts or values in the items included in the scenario are immediately reflected in these charts.</p>\n<p>The following information is displayed:</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Cost</td>\n<td>\n<p>Displays the total planned cost for all of the selected items, and the difference between the planned cost and the total budget.</p>\n<p>You can specify the monthly capacity for each of the months during the time range of the items.</p>\n<p>If the cost of the selected items is within the budget threshold, the amounts are displayed in green. If the cost of the selected items exceeds the budget threshold, the amounts are displayed in red.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> Cost and budget amounts may be shown in different units, depending on the scope of the difference between the amounts.</p>\n</div>\n</td>\n</tr>\n<tr>\n<td>Resource Demand</td>\n<td>\n<p>Displays the total demand for resources for all of the selected items.</p>\n<p>If the resource demand for the selected items is within the budget threshold, the budgeted amount and excess above the cost are displayed in green. If the cost of the selected items exceeds the budget threshold, the amounts are displayed in red.</p>\n</td>\n</tr>\n<tr>\n<td>Business Value</td>\n<td>\n<p>Displays the total estimated business value for all of the selected items.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p>By default, Service Management lists the following information for each item:</p>\n<p>You can add or remove columns that are displayed. For more information, see <a href=\"/doc/423/26.1/listviewcolumns\" title=\"SMAX:25.1/ListViewColumns\">List view columns</a>.</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Id</td>\n<td>The identifier of the item.</td>\n</tr>\n<tr>\n<td>Title</td>\n<td>The name of the item.</td>\n</tr>\n<tr>\n<td>Phase Id</td>\n<td>The current workflow phase of the item.</td>\n</tr>\n<tr>\n<td>Force in/out</td>\n<td>Indicate here whether particular items are taken into consideration when optimizing a scenario automatically. For example, you might choose to force in all items having to do with security issues (meaning that those items must be taken into consideration when optimizing a scenario automatically).</td>\n</tr>\n<tr>\n<td>Flexible</td>\n<td>\n<p>Indicate whether the start and end dates of the item can be changed by dragging the highlighted time span in the Gantt chart.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> This setting is relevant only for automatic optimizations. For more information, see <a href=\"/doc/423/26.1/optimscenario\" title=\"SMAX:25.1/OptimScenario\">How to optimize a scenario automatically using the embedded optimization engine</a>.</p>\n</div>\n</td>\n</tr>\n<tr>\n<td>Business value</td>\n<td>\n<p>The estimated value that the item brings to the organization.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> The estimated business value should be greater than 0.</p>\n</div>\n</td>\n</tr>\n<tr>\n<td>Planned cost</td>\n<td>The total budgeted amount for the item.</td>\n</tr>\n<tr>\n<td>Resource demand</td>\n<td>The total demand for resources for each item.</td>\n</tr>\n<tr>\n<td>Priority</td>\n<td>\n<p>The relative importance of each item to the optimization.</p>\n<p>The priority has no effect on the optimization calculations.</p>\n</td>\n</tr>\n<tr>\n<td>Business objective</td>\n<td>The business objective to which this item applies.</td>\n</tr>\n<tr>\n<td>Business unit</td>\n<td>The business unit to which this item applies.</td>\n</tr>\n<tr>\n<td>Gantt chart</td>\n<td>\n<p>Each line in the Gantt chart represents a single content item.</p>\n<p>The Gantt chart includes all content items that belong to the selected project portfolio. You can include all of the portfolio's content items in the scenario, even those that don't fit within the specified time constraints. By default, the start date for the scenario is the earliest start date among all the selected items , and the end date is the latest end date among all the selected items.</p>\n<p>If you restrict the time range for the scenario to a shorter time, the Gantt chart shows a highlighted area that emphasizes the time span between the start and end dates.</p>\n<p><a class=\"image\" href=\"/file/images/f/f0/2018.08_Helpcenter/Resources/Images/PP/Gantt.png\" title=\"/file/images/f/f0/2018.08_Helpcenter/Resources/Images/PP/Gantt.png\"> <img alt=\"Gantt.png\" class=\"z_migration_tba_PDF\" decoding=\"async\" height=\"228\" src=\"../../../images/Gantt_4bb273dc.png\" width=\"296\"/> </a></p>\n<p>Content items that fall only partially within the specified start and end dates display a <a class=\"image\" href=\"/file/images/9/9a/2018.08_Helpcenter/Resources/Images/PP/TimeSpan.png\" title=\"/file/images/9/9a/2018.08_Helpcenter/Resources/Images/PP/TimeSpan.png\"> <img alt=\"TimeSpan.png\" decoding=\"async\" height=\"16\" src=\"../../../images/TimeSpan_16ae2fb7.png\" width=\"16\"/> </a> icon next to the item's Id. The data contained in these items is excluded when running an automatic optimization.</p>\n</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p>To change relevant information in an item that's included in the scenario, click the project identifier in the <b>Id</b> column to display the details of the selected item. For more information about editing proposals, see <a href=\"/doc/423/26.1/editproposal\" title=\"SMAX:25.1/EditProposal\">How to edit a proposal</a>.</p>\n</li>\n<li>\n<p>Click <a class=\"image\" href=\"/file/images/c/c6/2018.08_Helpcenter/Resources/Images/Icons/Settings.png\" title=\"/file/images/c/c6/2018.08_Helpcenter/Resources/Images/Icons/Settings.png\"> <img alt=\"Settings.png\" decoding=\"async\" height=\"16\" src=\"../../../images/Settings_6f79a60f.png\" width=\"17\"/> </a> <b>Set constraints</b> to set budget and resource capacity thresholds.</p>\n<ul>\n<li>\n<p>In the <b>General</b> section, set the time range for which you want to evaluate the selected items.</p>\n</li>\n<li>\n<p>In the <b>Capacity</b> section, specify the budget amount and resources available for each month of the item's time range.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> You can only specify budget and resources for months that fall within the specified time range. If you shorten the time range, the budget and resources that fall outside the time range are discarded.</p>\n</div>\n<p>Click <b>Mass update</b> to configure multiple parameters for the following settings:</p>\n<ul>\n<li>In the <b>Budget by month</b> section, select <b>Increase</b> or <b>Decrease</b> from the drop-down list and enter a percentage to increase or decrease the amount that has been budgeted for each month. You can apply this value to the entire time range or to a selected portion of the time range. When you are finished, click <b>Apply</b> next to the selections.</li>\n<li>In the <b>Resource by month</b> section, select <b>Increase</b> or <b>Decrease</b> from the drop-down list and enter a percentage to increase or decrease the resource demand for each month. You can apply this value to all resources or to a specific resource type. When you are finished, click <b>Apply</b> next to the selections.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>When you are finished setting all constraints, click <a class=\"image\" href=\"/file/images/1/15/2018.08_Helpcenter/Resources/Images/Icons/Apply.png\" title=\"/file/images/1/15/2018.08_Helpcenter/Resources/Images/Icons/Apply.png\"> <img alt=\"Apply.png\" decoding=\"async\" height=\"33\" src=\"../../../images/Apply_49e5c5c5.png\" width=\"80\"/> </a>.</li>\n<li>\n<p>Click <a class=\"image\" href=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\" title=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\"> <img alt=\"SaveIcon.png\" decoding=\"async\" height=\"21\" src=\"../../../images/SaveIcon_5eb13ed6.png\" width=\"20\"/> </a> <b>Save Scenario</b> when you are finished.</p>\n<p>To save the scenario with a different name for future comparisons, click <a class=\"image\" href=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\" title=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\"> <img alt=\"SaveIcon.png\" decoding=\"async\" height=\"21\" src=\"../../../images/SaveIcon_5eb13ed6.png\" width=\"20\"/> </a> <b>Save Scenario as</b>.</p>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/optimscenario\" title=\"SMAX:25.1/OptimScenario\">How to optimize a scenario automatically using the embedded optimization engine</a></li>\n<li><a href=\"/doc/423/26.1/comparescenarios\" title=\"SMAX:25.1/CompareScenarios\">How to compare scenarios</a></li>\n<li><a href=\"/doc/423/26.1/ppusecase\" title=\"SMAX:25.1/ppUseCase\">Optimization use case</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}