{
  "title": "Catalog entitlement",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Using roles and entitlement rules, you can restrict the visibility of different catalogs of service categories and service offerings to specific people or groups. This way, you can configure combined environments so that users who are members only of non-HR groups (such as IT agents) can't see HR categories in Service Management Portal nor submit requests to HR offerings.</p>\n<div>\n<p><span id=\"cke_bm_1948S\" style=\"display: none;\"> </span>Audience entitlements define who can submit a type of request based on their Location, Role, or Organization.</p>\n<div><a class=\"image\" href=\"/file/images/c/ca/restricted_audience.png\" title=\"/file/images/c/ca/restricted_audience.png\"> <img alt=\"Audience entitlement\" height=\"238\" src=\"../../../images/restricted_audience_72767262.png\" width=\"800\"/> </a></div>\n</div>\n<p>In addition, the most sensitive types of HR cases can be further restricted to specialist HR agents. Confidentiality flags limit who may see the Request, for example allowing a manager to request an offering on behalf of an employee, but allowing visibility to the request only to the manager and HR.</p>\n<div><a class=\"image\" href=\"/file/images/9/9f/confidential_offering.png\" title=\"/file/images/9/9f/confidential_offering.png\"> <img alt=\"Offering with confidential public scope\" height=\"249\" src=\"../../../images/confidential_offering_7fa07588.png\" width=\"800\"/> </a></div>\n<p>For example, a manager submits an Employee Workforce Reduction request for one of her employees. The Request is assigned to an HR Workforce Reduction group, restricting domain visibility access to HR agents in that group only. The Request is flagged as Confidential, preventing the employee from seeing the Request.</p>\n<h3>Example: Set up catalog entitlement</h3>\n<p>Follow these steps to set up entitlement that separates access to the HR and IT catalogs:</p>\n<ol>\n<li>Create the following roles:\n\t<ul>\n<li>All Catalogs </li>\n<li>HR Catalog</li>\n<li>IT Catalog</li>\n</ul>\n<p>For more information about how to do this, see <a href=\"/doc/423/26.1/pplroles#How_to_create_a_role\" title=\"How to create a role\">How to create a role</a>.</p>\n</li>\n<li>\n<p>Create the following entitlement rules, and associate them with the corresponding role:</p>\n<table cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<thead>\n<tr>\n<th scope=\"col\">Entitlement rule</th>\n<th scope=\"col\">Associated role</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>All Catalogs Entitlement</td>\n<td>All Catalogs </td>\n</tr>\n<tr>\n<td>HR Catalog Entitlement</td>\n<td>HR Catalog</td>\n</tr>\n<tr>\n<td>IT Catalog Entitlement</td>\n<td>IT Catalog</td>\n</tr>\n</tbody>\n</table>\n<p>For more information about how to do this, see <a href=\"/doc/423/26.1/addediterules#Create_an_entitlement_rule\" title=\"Create an entitlement rule\">Create an entitlement rule</a>.</p>\n</li>\n<li>Restrict the audience of each IT catalog (for example, Phone and Mobile, Productivity and Collaboration, Network Connectivity and Security, OS, PC and Printer, and Cloud and Storage Audience) to the All Catalogs and IT Catalog roles.<br/>\n<br/>\n\tRestrict the audience of each HR catalog (for example, Benefits and Rewards, Employee Lifecycle, Facilities and Security, HR Support, Payroll, and Travel and Time Off) to the All Catalogs and HR Catalog roles.<br/>\n<br/>\n\tFor more information how to do this, see <a href=\"/doc/423/26.1/updatecatalog\" title=\"Update the Service Catalog\">Update the Service Catalog</a>.</li>\n<li>Add the following business rule to the <strong>After applying changes</strong> process event of the <strong>Person</strong> record. This rule ensures that all end users retain access to all offerings after you set up entitlement.\n\t<table cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<tbody>\n<tr>\n<td>If <code>${entity.IsPermitted(null,'IT Catalog')==false &amp;&amp; entity.IsPermitted(null,'HR Catalog')==false &amp;&amp; entity.IsPermitted(null,'All Catalogs')==false}</code><br/>\n\t\t\t\tAdd the following roles <code>All Catalogs</code></td>\n</tr>\n</tbody>\n</table>\n\tFor more information about how to do this, see <a href=\"/doc/423/26.1/embizrules\" title=\"Studio business rules\">Studio business rules</a>.\n\n\t<div class=\"admonition\">\n<div class=\"admonition-icon admonition-important-icon\"></div>\n<div class=\"admonition-content admonition-important-content\">\n<p>If a user is created by using the API and assigned either the HR Catalog role or IT Catalog role, this business rule will automatically assign the user the All Catalogs role also. This occurs because of Service Management system logic. To work around this, remove the role manually or disable the business rule before creating new users by using the API.</p>\n</div>\n</div>\n</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}