{
  "title": "EMS REST API",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><h2 id=\"Introduction\">Introduction</h2>\n<p>Service Management includes multiple <a href=\"https://en.wikipedia.org/wiki/Representational_state_transfer\" title=\"wikipedia:Representational state transfer\">REST</a> APIs that may be used to execute a variety of commands. This document describes using the Postman client to access the EMS REST API. EMS stands for Entity Management System, and is used to access and modify information for most record types in SMA-X, such as incidents, requests, services, and configuration items.</p>\n<p>Before using the information in this chapter it will be necessary to review the information found in the ‘Configuring Postman’ chapter of this guide. This chapter explains how to install the Postman client as well as how to find the master node and tenant Id for a specific Service Management instance.</p>\n<p>This chapter will cover:</p>\n<ul>\n<li>Understanding the data structure of the API</li>\n<li>Determining the entity type and field names</li>\n<li>Handling specific field types</li>\n<li>Locking system - service behavior</li>\n<li>Special considerations of the EMS API</li>\n<li>Retrieving information from Service Management</li>\n<li>Posting information to Service Management</li>\n<li>Determining entity type and field names</li>\n</ul>\n<h2 id=\"Understanding_the_data_structure_of_the_API\">Understanding the data structure of the API</h2>\n<p>The Service Management EMS REST API uses the JSON data format to exchange data with a client. Information on the JSON format may be found <a href=\"https://en.wikipedia.org/wiki/JSON\" rel=\"nofollow\" target=\"1\">here</a>.</p>\n<p>If your intent is to use a tool such as Microsoft Excel to view the information returned from the REST API, you will need to convert the data returned from Service Management using some type of scripting or other data conversion process. There are a variety of conversion tools on the web that will transform JSON into CSV (or vice versa). You could use one of these tools to convert information in a spreadsheet to the JSON format required by the Service Management REST API.</p>\n<p>An example of the JSON returned from the Service Management EMS REST API can be seen in the image below (please note that the image does not show the entire result returned by the API). The returned result is made up of multiple entities (records) from Service Management. In each returned record, the <b>entity_type</b> value specifies the type of record (in this example each entity is a ‘Request’). The <b>properties</b> section contains the attributes of the entity. The exact attributes returned are dependent on the query used to request the information. Finally, the <b>related_properties</b> shows information from other records that are linked to the requested entity. Again, the information included here is dependent on the initial request.</p>\n<p><a class=\"image\" href=\"/file/images/9/94/REST_Image2.png\" title=\"/file/images/9/94/REST_Image2.png\"> <img alt=\"REST Image2.png\" data-file-height=\"309\" data-file-width=\"497\" height=\"309\" src=\"../../../images/REST_Image2_1761a8a5.png\" width=\"497\"/> </a></p>\n<p>When sending (posting) information to Service Management, the data format needs to be in the same JSON format. The following image is an example of how to update a Request in Service Management using the EMS REST API. The entity_type needs to be set to the desired record type, and when posting information you must also specify the type of operation (such as CREATE or UPDATE). In this example, we set the <b>operation</b> to ‘UPDATE’ in order to update an existing request. Attributes for our  Request are set in the <b>properties</b> section. To add more fields to the request, simply add the field name in quotes, a colon, and the value for the field (again in quotes). For example, to set a status you would add ‘Status’, the ‘:’, and the value ‘RequestStatusSuspended’. Each attribute must be separated with a comma, but there is no comma after the last specified attribute.  The Id field is mandatory and is the Id of the Request that is being updated.</p>\n<p><a class=\"image\" href=\"/file/images/3/38/Request_Status.png\" title=\"/file/images/3/38/Request_Status.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/3/38/Request_Status.png\" height=\"326\" hspace=\"0\" src=\"../../../images/Request_Status_fe9909e8.png\" vspace=\"0\" width=\"543\"/> </a></p>\n<p>If the desired action is to create a Request then the payload would appear like the example below, note the Id number used for the \"RequestedForPerson\" and not the actual name:</p>\n<p><a class=\"image\" href=\"/file/images/c/cd/Rquest_create.png\" title=\"/file/images/c/cd/Rquest_create.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/c/cd/Rquest_create.png\" height=\"361\" hspace=\"0\" src=\"../../../images/Rquest_create_b56fc225.png\" vspace=\"0\" width=\"800\"/> </a></p>\n<h2 id=\"Determining_the_entity_type_and_field_names\">Determining the entity type and field names</h2>\n<p>All entity types can be updated using the EMS API (as long as you have a role that allows updating that specific entity type). In order to create or modify a specific field in an entity, you must know both the entity type and the field name. This information can be found in the Service Management interface. Navigate to the ‘Records’ utility (select <b>Administration &gt; Records</b> from the main menu) and find the correct entity type using the field in the top left section of the form. The entity name displayed here is the correct entity type that is used in the REST request.</p>\n<p>The field name can be found in the ‘Fields’ tab of the entity definition. It is important to use the value in the “Name” column of the fields list and not the ‘Multilingual label’ column.  Below the entity type \"Request\" and the field name \"Status\" are highlighted.</p>\n<p><a class=\"image\" href=\"/file/images/e/e4/Entity_type_field_name.png\" title=\"/file/images/e/e4/Entity_type_field_name.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/e/e4/Entity_type_field_name.png\" height=\"347\" hspace=\"0\" src=\"../../../images/Entity_type_field_name_97a0df46.png\" vspace=\"0\" width=\"800\"/> </a></p>\n<h2 id=\"Handling_specific_field_types\">Handling specific field types</h2>\n<p>It is also important to note the logical type of the field in question. There are certain types of fields that need special consideration. These types (and how to use them correctly in the API) are defined below.</p>\n<h3 id=\"Enumerations\">Enumerations</h3>\n<p>If the field in question has a Logical type of ‘ENUM’, which is an enumeration, you must pass the internal name of the enumeration value rather than the display name. To find the name, open the list in the List management interface, which will display both the internal name and display name of each list value. For example, in the list shown in the image below, the status value for ‘Ready’ would be ‘RequestStatusReady’.</p>\n<p><a class=\"image\" href=\"https://staging.docs.microfocus.com/file/images/5/59/SMAX202305List_enums.png\" title=\"https://staging.docs.microfocus.com/file/images/5/59/SMAX202305List_enums.png\"> <img alt=\"\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/5/59/SMAX202305List_enums.png\" height=\"302\" hspace=\"0\" src=\"../../../images/SMAX202305List_enums_ac44f657.png\" style=\"width: 800px; height: 302px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<p>The body of a REST request that would update the request with a status of ‘Ready’ is shown in the following image: </p>\n<h3 id=\"Entity_links\">Entity links</h3>\n<p>If the field type is an entity_link (a link to a related entity/record) type field you must specify the unique id of the related record in the REST API (rather than any display name or value). Therefore you must determine what the id is and incorporating that value into the REST call. In the example below, the user wants to set the assignment group in a request to ‘Accounting’. To do this the user will first find the id of the accounting group and then set the ‘AssignedToGroup’ field in the request to the Id of the accounting group in the rest payload. The id may be found by viewing the related record directly or viewing a list that includes the related record.</p>\n<p><a class=\"image\" href=\"https://staging.docs.microfocus.com/file/images/0/0f/SMAX202305Group_id.png\" title=\"https://staging.docs.microfocus.com/file/images/0/0f/SMAX202305Group_id.png\"> <img alt=\"\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/0/0f/SMAX202305Group_id.png\" height=\"309\" hspace=\"0\" src=\"../../../images/SMAX202305Group_id_89616679.png\" style=\"width: 800px; height: 309px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<p>Then the id is entered for the ‘AssignedToGroup’ attribute in the body of the REST request.</p>\n<p><a class=\"image\" href=\"/file/images/c/c5/Assigned_Group.png\" title=\"/file/images/c/c5/Assigned_Group.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/c/c5/Assigned_Group.png\" height=\"309\" hspace=\"0\" src=\"../../../images/Assigned_Group_5174266d.png\" vspace=\"0\" width=\"800\"/> </a></p>\n<h3 id=\"Date/time\">Date/time</h3>\n<p>If the field is a date or date_time you must specify the value using a <a href=\"https://en.wikipedia.org/wiki/Unix_time\" title=\"wikipedia:Unix time\">Unix timestamp</a>. Most scripting tools are capable of converting user-friendly date/times to Unix timestamps. Additionally, there are a number of online tools that can create these timestamps, including the one found <a href=\"http://www.epochconverter.com/\" rel=\"nofollow\" target=\"1\">here</a>. Service Management requires that you define the timestamp down to the millisecond.  In this example a field named InitialTime_c was created and the unix timestamp was used when the update was made.</p>\n<p><a class=\"image\" href=\"/file/images/e/e5/unixtimest.png\" title=\"/file/images/e/e5/unixtimest.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/e/e5/unixtimest.png\" height=\"302\" hspace=\"0\" src=\"../../../images/unixtimest_a801522b.png\" vspace=\"0\" width=\"800\"/> </a></p>\n<p>When the Requests history is viewed it will appear as a humain readable date:</p>\n<p><a class=\"image\" href=\"/file/images/a/a8/history_time.png\" title=\"/file/images/a/a8/history_time.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/a/a8/history_time.png\" height=\"227\" hspace=\"0\" src=\"../../../images/history_time_f4d3b1f5.png\" vspace=\"0\" width=\"800\"/> </a></p>\n<h2 id=\"Special_considerations_of_the_EMS_REST_API\">Special considerations of the EMS REST API</h2>\n<p>The EMS REST API has a few special considerations that must be followed:</p>\n<ul>\n<li>A query will fail if the result returns more than 4K records, unless the default maximum number of results is increased.</li>\n<li>Results are returned in batches of 250 records at a time by default, which can be modified using the “size” parameter. Information on the skip parameter below.</li>\n<li>When querying for fields that are entity links, the id of the related record is returned (rather than the display label).</li>\n<li>The maximum size of a request body is 1 MB. If the body size is larger than 1 MB, a \"413 Request Entity Too Large\" error will occur.</li>\n</ul>\n<h2 id=\"Locking_system_–_service_behavior\">Locking system – service behavior</h2>\n<p>The EMS data engine implements an optimistic locking system to prevent clients from accidentally overwriting each other’s data. Without appropriate validation, two clients can retrieve the same record, edit it and send it to the server for update. One of the changes is committed first and the second one overwrites the record. The optimistic locking approach checks the version or timestamp of the record when it arrives and only allows updates on it if the incoming version isn't lower than the version currently stored in the database.</p>\n<p>When a record is received for update, if it doesn't pass the optimistic locking version validation, the transaction fails. In such cases, the REST API returns HTTP status code 409. In case of a bulk API, the 409 status is returned in the body of the response, inside the JSON which represents the corresponding record result.</p>\n<p>Note  </p>\n<ul>\n<li>To use this locking system, the incoming record must include the <b>LastUpdateTime</b> property with the value assigned to it when it was retrieved from the server.</li>\n<li>The locking system isn't relevant to the Analytics REST API.</li>\n</ul>\n<h2 id=\"Retrieving_information_from_Service_Management_Automation_X\">Retrieving information from Service Management</h2>\n<p>The EMS API can retrieve any information available to the entity grid (list of records) in the Service Management user interface. Parameters are available to the REST request that allow you to apply specific Filters to the query, as well as specify which fields should be included in the returned result. Results are returned in the JSON data format, so you may need to use scripting or some data conversion process in order to get the data in the desired format.</p>\n<p>The following is an example of a ‘Get’ request that will retrieve results from Service Management. In the example the Id, DisplayLabel and Priority fields are being returned for request entities.</p>\n<p>The request URL is created as follows:</p>\n<p><a href=\"https://msast002pngx.domain.com/rest/844143557/ems/Request?layout=Id,DisplayLabel,Priority\" rel=\"nofollow\" target=\"1\">https://myhost.domain.com/rest/844143557/ems/Request?layout=Id,DisplayLabel,Priority</a></p>\n<p>The URL is created with the following information:</p>\n<ul>\n<li>https:// — specifies the protocol to use</li>\n<li>myhost.domain.com — the domain of the Service Management server master node which hosts the specific tenant</li>\n<li>rest — specifies the use of the REST API</li>\n<li>844143557 — the tenant ID of the desired Service Management instance</li>\n<li>ems — specifies the use of the EMS REST API</li>\n<li>Request — The entity type</li>\n<li>?layout=Id,DisplayLabel,Priority — specifies the comma delimited list of fields from the entity that should be included in the response (note that the LastUpdateTime field is always returned)</li>\n</ul>\n<p><a class=\"image\" href=\"/file/images/4/4a/rest_get.png\" title=\"/file/images/4/4a/rest_get.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/4/4a/rest_get.png\" height=\"532\" hspace=\"0\" src=\"../../../images/rest_get_1ab679d0.png\" vspace=\"0\" width=\"800\"/> </a></p>\n<p>The end of the query result will also return the number of records that matched the query, if the total count is more than 250, the skip command is required to display additional records after the first 250. In the example below the ‘&amp;skip=250’ parameter is added to retrieve the additional records. In cases where you expect more than 250 records to be returned, writing a script or code to process the queries and results is recommended.</p>\n<p><a class=\"image\" href=\"/file/images/f/ff/REST_Image11.png\" title=\"/file/images/f/ff/REST_Image11.png\"> <img alt=\"REST Image11.png\" data-file-height=\"129\" data-file-width=\"242\" height=\"129\" src=\"../../../images/REST_Image11_b1850687.png\" width=\"242\"/> </a> ￼</p>\n<p>The URL to skip the first 250 records of the query is: <a href=\"https://msast002pngx.domain.com/rest/844143557/ems/Request?layout=Id,DisplayLabel,Priority&amp;skip=250\" rel=\"nofollow\" target=\"1\">https://myhost.domain.com/rest/844143557/ems/Request?layout=Id,DisplayLabel,Priority&amp;skip=250</a></p>\n<p><a class=\"image\" href=\"/file/images/3/3b/rest_skip.png\" title=\"/file/images/3/3b/rest_skip.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/3/3b/rest_skip.png\" height=\"385\" hspace=\"0\" src=\"../../../images/rest_skip_4f349555.png\" vspace=\"0\" width=\"800\"/> </a></p>\n<p><br/>\nFiltering can be applied to any query sent through the REST API. The filter is specified as a parameter in the REST URL. In the example below, the results will be filtered based on the creation time of the entity using the parameter ‘filter=CreateTime+btw+(1466406000000,1466492399999)’ (note the use of the Unix timestamp).</p>\n<p><a href=\"http://link.com\">https://myhost.domain.com/rest/484980393/ems/Request?filter=CreateTime+btw+(1650085453000,1650344653000)&amp;layout=Id,DisplayLabel,Priority</a></p>\n<p><a class=\"image\" href=\"/file/images/3/30/rest_filter.png\" title=\"/file/images/3/30/rest_filter.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/3/30/rest_filter.png\" height=\"398\" hspace=\"0\" src=\"../../../images/rest_filter_109791f2.png\" vspace=\"0\" width=\"800\"/> </a></p>\n<h2 id=\"Posting_information_to_Service_Management_Automation_X\">Posting information to Service Management</h2>\n<p>Any type of standard entity can be created or updated in Service Management using the EMS REST API. The URL to post data for all entity types is https://&lt;master node&gt;/rest/&lt;tenantid&gt;/ems/bulk. The type of entity being sent is defined in the entity_type field. In the example below a request will be created.</p>\n<p><a class=\"image\" href=\"/file/images/2/2d/Bulk1.png\" title=\"/file/images/2/2d/Bulk1.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/2/2d/Bulk1.png\" height=\"274\" hspace=\"0\" src=\"../../../images/Bulk1_a0443214.png\" vspace=\"0\" width=\"800\"/> </a></p>\n<p>To create an Incident the following payload would be used:</p>\n<p><a class=\"image\" href=\"/file/images/e/e9/Bulk2.png\" title=\"/file/images/e/e9/Bulk2.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/e/e9/Bulk2.png\" height=\"306\" hspace=\"0\" src=\"../../../images/Bulk2_cb60fcd5.png\" vspace=\"0\" width=\"754\"/> </a></p>\n<p>To update an existing record the same process is used, but the Id of the entity is required and the operation would be ‘UPDATE’.</p>\n<p><a class=\"image\" href=\"/file/images/4/4c/bulk3.png\" title=\"/file/images/4/4c/bulk3.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/4/4c/bulk3.png\" height=\"374\" hspace=\"0\" src=\"../../../images/bulk3_b583f3d0.png\" vspace=\"0\" width=\"570\"/> </a></p>\n<p>To update an existing record by adding information to a field that is not currently populated just add the name of the field and value. Also note that multiple entities can be updated at the same time, as shown in the following example.</p>\n<p><a class=\"image\" href=\"/file/images/3/3b/bulk4.png\" title=\"/file/images/3/3b/bulk4.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/3/3b/bulk4.png\" height=\"396\" hspace=\"0\" src=\"../../../images/bulk4_b3ccd16d.png\" vspace=\"0\" width=\"506\"/> </a></p>\n<p>In some cases links between entities may be required for example adding a related record. In this example we are adding an Incident that the Request depends on.  In the UI it would appear like the example below:</p>\n<p><a class=\"image\" href=\"/file/images/5/5f/Related_record_Request.png\" title=\"/file/images/5/5f/Related_record_Request.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/5/5f/Related_record_Request.png\" height=\"418\" hspace=\"0\" src=\"../../../images/Related_record_Request_7eaa49a8.png\" vspace=\"0\" width=\"800\"/> </a></p>\n<p>The syntax to add this through the REST API can be seen in the example below.  The name is the type of relationship that is to be added, in this example we are making a Request depend on an Incident so we use \"IncidentCausedByRequest\" as the type.  We enter Incident and the Incident Id as the firstEndpoint.  The secondEndpoint is the Request and the Request Id and in the case we are creating the relationship so the operation is CREATE.</p>\n<p><a class=\"image\" href=\"/file/images/a/a6/Related_POSTMAN.png\" title=\"/file/images/a/a6/Related_POSTMAN.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/a/a6/Related_POSTMAN.png\" height=\"305\" hspace=\"0\" src=\"../../../images/Related_POSTMAN_65f91ad8.png\" vspace=\"0\" width=\"800\"/> </a></p>\n<p>Adding a user to a group is another common operation run through the REST API. To add 2 users to the \"Administrative Services\" we would create a PersonToGroup relationship and make the firstEndpoint the Person and their Id.  The secondEndpoint is the Id of the group.  In this example two users are added to the group, notice the Id for the Person changes but the Id group stays the same:</p>\n<p><a class=\"image\" href=\"/file/images/8/8b/add_groups.png\" title=\"/file/images/8/8b/add_groups.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/8/8b/add_groups.png\" height=\"353\" hspace=\"0\" src=\"../../../images/add_groups_e79326c4.png\" vspace=\"0\" width=\"800\"/> </a></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}