{
  "title": "Change Management roles and permissions",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>\n<p class=\"mw-empty-elt\"></p>\n</div>\n<p>There are specific roles associated with Change Management. Service Management uses role-based <a href=\"/doc/423/26.1/rolespermissions\" title=\"SMAX:25.1/RolesPermissions\">permissions</a> to enable you to complete a task that's appropriate to your role. System Administrators manage and assign these permissions.</p>\n<p>By default, the following roles are assigned to Change Management. These roles support change tracking and process ownership.</p>\n<table>\n<tbody>\n<tr>\n<th>Role</th>\n<th>Responsibilities</th>\n</tr>\n<tr>\n<td>Change Approver</td>\n<td>\n<ul>\n<li>Uses Service Management tools or the Change Advisory Board to approve or deny requested changes.</li>\n<li>Facilitates Emergency Change Advisory Board (ECAB) meetings.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Change Assignee</td>\n<td>Estimates and completes the change work.</td>\n</tr>\n<tr>\n<td>Change Coordinator</td>\n<td>\n<ul>\n<li>Creates change records and applies the correct change model and change detail.</li>\n<li>Schedules changes according to the change plan. Creates the change tasks for building, testing, and implementing a change.</li>\n<li>Coordinates risk and impact analysis of the change and creates a change plan based on the assessment information.</li>\n<li>Verifies that the change passes test criteria.</li>\n<li>Verifies that the change is deployed successfully in the production environment.</li>\n<li>Evaluates the change and closes the request after implementation.</li>\n<li>Activates a remediation plan to return the system to its original state if a change implementation fails.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Change Manager</td>\n<td>\n<ul>\n<li>Reviews all changes and forwards them to the assigned change approver.</li>\n<li>Organizes Change Advisory Board meetings.</li>\n<li>Updates the change record after approval.</li>\n<li>Periodically reviews changes in a post-implementation review.</li>\n<li>Evaluates and performs follow-up actions.</li>\n<li>Coordinates all activities for the emergency change handling process.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Change Owner</td>\n<td>\n<ul>\n<li>Assesses the validity of the request for change and participates in risk assessment.</li>\n<li>Closes change requests upon successful implementation.</li>\n<li>Performs post-implementation review.</li>\n<li>Convenes the ECAB members for emergency change approval.</li>\n<li>Coordinates with change process experts to schedule build and test activities.</li>\n<li>Reviews, revises, and updates schedules for emergency and standard changes.</li>\n<li>Plans change request approvals.</li>\n<li>Generates CMDB updates to be submitted to Service Asset and Configuration Management for processing.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Change Process Owner</td>\n<td>\n<ul>\n<li>Sponsors and designs the Change Management process.</li>\n<li>Ensures compliance with enterprise policies.</li>\n<li>Identifies Key Performance Indicators and monitors metrics.</li>\n<li>Ensures that the Change Management process integrates with other processes.</li>\n<li>Champions continual improvement of the Change Management process.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Change Requestor</td>\n<td>Submits a formal request for change that includes details of the proposed change.</td>\n</tr>\n<tr>\n<td>Change Task Assignee</td>\n<td>Estimates and completes the work that the task describes.</td>\n</tr>\n</tbody>\n</table>\n<p>Review the individual permission assignments for each role in <b>Administration &gt; Master Data &gt; People &gt; Roles</b>.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/pplroles\" title=\"SMAX:25.1/pplRoles\">Roles</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}