{
  "title": "Change Flows",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>\n<div>\n<div class=\"Admonition_Tip\"><span class=\"autonumber\">Change Flows</span>\n<div>\n<div>\n<p><br/>\nChange management has three distinct workflows that may be used, depending on the change being performed.</p>\n<p>Service Management provides some additional features that assist in scheduling changes and improving the overall change management process over time.</p>\n<div>\n<div><a class=\"image\" href=\"/file/images/2/21/Change_Data_Model.gif\" title=\"/file/images/2/21/Change_Data_Model.gif\"> <img alt=\"Change Data Model.gif\" border=\"0\" file=\"/mediawiki/images/2/21/Change_Data_Model.gif\" height=\"570\" hspace=\"0\" src=\"../../../images/Change_Data_Model_83aeff7d.gif\" style=\"width: 800px; height: 570px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<h2>Change Workflow</h2>\n<p>Change management has three separate workflows we will examine. Each corresponds to a different type of change request:</p>\n<ul>\n<li>Normal change - a change that will proceed through all steps of the change management process, and should be reviewed by the Change Advisory Board (CAB).</li>\n<li>Standard - a pre-approved change, an often repeated type of change that's low risk and has a well-understood plan.</li>\n<li>Emergency - an urgent change that needs to be evaluated and approved (or rejected) in a very short time frame. Sometimes an emergency change has to be opened in the system after the physical change has taken place.</li>\n</ul>\n<p>While each type of change has a different workflow, they all go through the same steps. The differences come in which phases the change goes through in each step.</p>\n<h2>Normal Change Workflow</h2>\n<p>The normal change workflow is the most common of new change requests. These changes must have an approved implementation plan and an approved deployment plan. Let’s take a look at each step in the process.</p>\n<p><a class=\"image\" href=\"/file/images/f/f1/ChangeNormalWorkflow.png\" title=\"/file/images/f/f1/ChangeNormalWorkflow.png\"> <img alt=\"ChangeNormalWorkflow.png\" border=\"0\" file=\"/mediawiki/images/f/f1/ChangeNormalWorkflow.png\" height=\"222\" hspace=\"0\" src=\"../../../images/ChangeNormalWorkflow_aaf1dd7b.png\" style=\"width: 800px; height: 222px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<h3>Classification</h3>\n<p>When creating a change, the agent must supply the details for the request. This includes filling out the following fields during the 'Log' phase:</p>\n<ul>\n<li>Title - A short description of the change</li>\n<li>Reason for change - Why the change is being made (from a list of defined choices)</li>\n<li>Description - A detailed description of the change</li>\n<li>Service - What service is driving the change (the change might affect multiple services, but which one is the primary reason we need the change made)</li>\n<li>Justification - A detailed explanation of why we need to make the change</li>\n</ul>\n<p>The agent may also specify the time which they think the change should be performed although they may change the actual time later in the workflow.</p>\n<p>During the next phase, 'Classification', the agent specifies the impact of the change on the existing service. They also need to categorize the change and set the group responsible for ensuring the change process is followed. The agent may also specify any configuration items (devices, system elements, etc.) that will be involved in the change.</p>\n<p>Once the agent specifies this information, they can move the change forward into the 'Planning' step.</p>\n<h3>Planning</h3>\n<p>The 'Planning' step involves gathering all the information needed to make the change and having this information validated and approved by the relevant stakeholders. This step starts in the 'Plan' phase, where the agent needs to specify the overall plan for the change, including:</p>\n<ul>\n<li>Implementation plan - How the change will be performed</li>\n<li>Remediation plan - What steps should be taken if the implementation plan fails</li>\n<li>Risk - The risk to our IT infrastructure due to the change being performed. This is a combination of how important the affected services are to the infrastructure, how difficult the change is to make, how often this change has failed in the past, and other considerations</li>\n<li>Owner - The person who will manage the change through the overall process (not necessarily the person who will make the physical changes happen)</li>\n<li>Scheduled start and end dates</li>\n</ul>\n<p>The agent may also determine whether this change needs to go through the 'Build and test' phase later in the process. Changes that have been performed numerous times and have a well-understood process (yet still need to go through the full approval process) might skip this step.</p>\n<p>After this information is complete, the agent can move the change to the 'Approve plan' phase. In this phase, the stakeholders will either approve or reject the change based on the specified plan. As we will see later, this isn't the final go/no-go approval. Rather, this is the overall approval that this change should happen and the planning is sufficient. The actual approval to deploy the change and start execution comes later. The Change Advisory Board (CAB) and other relevant stakeholders (such as the owner of the service being affected and the change owner) need to approve the plan in order for the change to move forward.</p>\n<p>Once the plan has been approved, the change enters either the 'Build and test' phase if necessary, or goes directly to the 'Approve deployment' phase.</p>\n<p>For those changes that need the 'Build and test' phase, the owner of the change coordinates the process with the individuals needed to complete the entire change. This is often done using tasks, which we have seen before and will look at in more detail later in this chapter. During the 'Build and test phase', the owner validates (or modifies) the change implementation and remediation plans. After they validate the plans, the owner moves the change into the 'Approve deployment' phase.</p>\n<p>In the 'Approve deployment' phase, the CAB and relevant stakeholders give the final approval or rejection of the overall change. This includes the updated plan and the actual scheduling of the change. Once the change is approved, it moves to the 'Deployment' step.</p>\n<h3>Deployment</h3>\n<p>Once we’re done with planning and scheduling the change, the actual work takes place during the 'Deployment' step. Primarily, the work is done in the 'Execute' phase. For most changes, the actual work will be defined in a task plan, with tasks assigned out to one or more agents that will perform the work. It's the job of the change owner to ensure the tasks are performed in the order that they defined during the planning step. Service Management gives the change owner a view into the overall status of the tasks.</p>\n<p>When all the tasks are completed, the Change moves into the next phase, depending on the outcome of the 'Execute' phase. If the change completes successfully, it moves to the next step of the process which is the 'Validation' step. Specifically, it moves into the 'CMDB Update' phase of the 'Validation' step.</p>\n<p>If the change was unsuccessful, it moves into the 'Remediate' step, where the change owner (and any other agents he needs to pull into the process) follows the remediation plan to back out any changes that need to be reversed. Once complete, the change is moved into the 'Validation' step, but in this case, it moves directly to the 'Review' phase.</p>\n<h3>Validation</h3>\n<p>When a successful change moves into the 'Validation' step, it begins in the 'CMDB Update' phase. Here, the change owner updates the details for any configuration items that were modified either directly in the SACM module, or in an external CMDB. Once complete they can then move the change into the final phase, 'Review'. The owner sets the final completion code that specifies the outcome of the change and enters the results of their review. Once this is complete they may close the change, ending the change management process.</p>\n<h2>Standard Change Workflow</h2>\n<p>Standard changes are types of changes that are well understood, considered relatively low risk, happen frequently, and follow an approved, documented process. These are the changes that our specialists think they can perform in their sleep (and sometimes I’m worried they do).</p>\n<p>So it shouldn’t come as a surprise that the primary difference in the standard and normal change workflows is in the 'Planning' step.</p>\n<p><a class=\"image\" href=\"/file/images/a/a5/ChangeStandardWorkflow.png\" title=\"/file/images/a/a5/ChangeStandardWorkflow.png\"> <img alt=\"ChangeStandardWorkflow.png\" border=\"0\" file=\"/mediawiki/images/a/a5/ChangeStandardWorkflow.png\" height=\"243\" hspace=\"0\" src=\"../../../images/ChangeStandardWorkflow_5d9f0989.png\" style=\"width: 800px; height: 243px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<p>In the normal change workflow, the 'Approve plan', 'Build and test', and 'Approve deployment' phases are removed. Once the 'Plan' phase is complete, the change moves directly to the 'Execute' phase of the 'Deployment' step.</p>\n<p>One goal of our change management process is to find those types of changes (represented in our change models) that we can move to use the standard change workflow. This will involve work on our part to create well-defined change models that dictate our approved process, but we also have tools in Service Management that will help us discover good candidates. We’ll take a look at that when we look at change analytics.</p>\n<h2>Emergency Change Workflow</h2>\n<p>Often when something breaks, or there is a major Incident that needs to be resolved quickly, we need to adjust the IT infrastructure as soon as possible. In these cases, it isn’t always possible to follow the normal change workflow, so we use the emergency change workflow instead.</p>\n<p>As you can see, again the difference from the normal workflow is in the 'Planning' step. The 'Approve plan' has been removed, and the 'Approve deployment' phase has been replaced with the 'ECAB' phase (which is where the emergency CAB performs approvals).</p>\n<p>While the emergency change workflow allows us to make changes more quickly, it also makes the 'Review' phase more important. Not only do we need to review whether the Change completed successfully and had the desired effect on the infrastructure, we also need to look into why this needed to be an emergency change. We need to make sure that this type of change is the exception to the process rather than the rule.</p>\n<p><a class=\"image\" href=\"/file/images/5/58/ChangeEmergencyWorkflow.png\" title=\"/file/images/5/58/ChangeEmergencyWorkflow.png\"> <img alt=\"ChangeEmergencyWorkflow.png\" border=\"0\" file=\"/mediawiki/images/5/58/ChangeEmergencyWorkflow.png\" height=\"188\" hspace=\"0\" src=\"../../../images/ChangeEmergencyWorkflow_efe688f6.png\" style=\"width: 800px; height: 188px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<h2>Change Tasks</h2>\n<p>Tasks and task plans are available inside of all the change workflows. Change often sees the heaviest use of tasks out of any module in the system. Taking the time to create the right task plan during the planning step of a change can have a huge positive impact on the overall success of the change process.</p>\n<p>As we find types of changes that have similar (or identical) task plans, we can create change models based on those plans to minimize the work the change owner needs to do for each individual change. Once we have our change models optimized, we can review them and “promote” those with low risk to use the standard change process.</p>\n<h2>Change Approvals</h2>\n<p>Service Management gives us the ability to visually design complex approval plans that can reference specific people or groups (such as our CAB group). These plans can look up people or groups from information related to the change (such as the owner of the related service).</p>\n<p><a class=\"image\" href=\"/file/images/5/5d/ApprovalPlan.png\" title=\"/file/images/5/5d/ApprovalPlan.png\"> <img alt=\"ApprovalPlan.png\" border=\"0\" file=\"/mediawiki/images/5/5d/ApprovalPlan.png\" height=\"611\" hspace=\"0\" src=\"../../../images/ApprovalPlan_5a57518c.png\" style=\"width:397px;height:611px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"397\"/> </a></p>\n<p>We can define our own Approval process for each of the three approval phases:</p>\n<ul>\n<li>Normal change - Approve Deployment</li>\n<li>Normal Change - Approve Plan</li>\n<li>Emergency Change - ECAB</li>\n</ul>\n<p>In addition, we can define approvals for each Change Model that has specific approval requirements above those in the overall process. When a Change is created for one of these Models, the specific approvals are added to the general process level approvals.</p>\n<p>Information on approval plans can be found <a href=\"/doc/423/26.1/approvaldefn\">here</a>.<br/>\n </p>\n<h2 id=\"Change_Calendar\">Change Calendar</h2>\n<p>Service Management’s change calendar feature helps us keep tabs on all of the changes happening in our IT infrastructure. This is useful not only for getting an overall picture of upcoming and current changes but also in scheduling new changes to ensure we are complying with our maintenance and blackout windows.</p>\n<p><a class=\"image\" href=\"/file/images/d/dc/ChangeCalendar.png\" title=\"/file/images/d/dc/ChangeCalendar.png\"> <img alt=\"ChangeCalendar.png\" border=\"0\" file=\"/mediawiki/images/d/dc/ChangeCalendar.png\" height=\"468\" hspace=\"0\" src=\"../../../images/ChangeCalendar_88fd0954.png\" style=\"width: 800px; height: 468px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<p>I think the change calendar will quickly become our change managers’ best friend. Using it, they can see all of the upcoming changes (or just those filtered by whatever criteria fits their needs). From a single view, they can see the changes scheduled start and end times, any planned downtime they might cause, who the change owner is, whether the change has been approved, and any changes out of compliance due to being scheduled outside of a maintenance window.</p>\n<p>The manager may also reschedule changes by dragging them to the new time frame on the calendar. This is useful for grouping changes in a single maintenance window, but also ensuring they all can get the needed time with a particular configuration item or group of CIs.</p>\n<p>A mini version of the change calendar is also available when viewing a single change. This view only shows the current change but allows the change owner to see upcoming maintenance windows and blackout periods. The system can also schedule a change for the next suitable maintenance window, provided the owner specifies the expected duration of the change.</p>\n<p><a class=\"image\" href=\"/file/images/a/a7/ChangeScheduling.png\" title=\"/file/images/a/a7/ChangeScheduling.png\"> <img alt=\"ChangeScheduling.png\" border=\"0\" file=\"/mediawiki/images/a/a7/ChangeScheduling.png\" height=\"463\" hspace=\"0\" src=\"../../../images/ChangeScheduling_b3f1900b.png\" style=\"width: 800px; height: 463px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<p>You can get more information about the change calendar in the <a href=\"/doc/423/26.1/changecalendar\">online documentation</a>.</p>\n<p class=\"mw-empty-elt\"></p>\n<h2 id=\"Change_Analytics\">Change Analytics</h2>\n<p>Service Management’s Change Analytics feature allows us insight into our own Change Management process, as well as making suggestions on how we can improve it. Currently, Service Management analyzes our performance against three KPIs and gives us an idea of how we can best improve our results.</p>\n<p>The three KPIs we are looking at are:</p>\n<ul>\n<li>Success rate</li>\n<li>Standard changes</li>\n<li>Change automation</li>\n</ul>\n<p><a class=\"image\" href=\"/file/images/c/cc/ChangeAnalytics.png\" title=\"/file/images/c/cc/ChangeAnalytics.png\"> <img alt=\"ChangeAnalytics.png\" border=\"0\" file=\"/mediawiki/images/c/cc/ChangeAnalytics.png\" height=\"468\" hspace=\"0\" src=\"../../../images/ChangeAnalytics_403af709.png\" style=\"width: 800px; height: 468px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<h3>Success rate</h3>\n<p>This system measures this KPI by calculating the percentage of successful changes out of the total changes in the filtered group. This starts by looking at all records, but we can filter to only look at changes against a specific service, in a certain time range, in a certain category, or those made for a specific reason. In fact, we can use a combination of any of these filter criteria to focus on exactly what we are looking for.</p>\n<p>Along with an overall picture of how we are doing against our goal, Service Management’s change analytics also shows us the areas where we will get the most “bang for the buck” against this KPI if we were to improve them. In the example shown above, the system is telling us we should focus our improvement efforts against the Exchange service and the Catalog service. Improvements in these services will result in a larger increase than if we were to focus on another service instead.</p>\n<p>Service Management gives us further insight into what types of changes completed successfully versus those that were not. In the example shown here, we can see that having a build a test plan and having an execution task plan were strong indicators of the overall success rate. This might lead us to either train our change owners on these features or even require these attributes for changes above a certain risk threshold.</p>\n<p><a class=\"image\" href=\"/file/images/b/b8/ChangeAnalytics2.png\" title=\"/file/images/b/b8/ChangeAnalytics2.png\"> <img alt=\"ChangeAnalytics2.png\" border=\"0\" file=\"/mediawiki/images/b/b8/ChangeAnalytics2.png\" height=\"469\" hspace=\"0\" src=\"../../../images/ChangeAnalytics2_35884a14.png\" style=\"width: 800px; height: 469px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<p>Finally, we can also take a look at the KPI measurement over time. This will give us a better idea whether any changes we make to our process affect the success rate of our changes. For example, if we were to perform the training we just mentioned in the middle of February, we might see a definite increase in the success rate after that point. We can also see that hiring my wife’s cousin Vinnie on February 27th might not have been such a great idea…</p>\n<p><a class=\"image\" href=\"/file/images/d/df/ChangeAnalytics1.png\" title=\"/file/images/d/df/ChangeAnalytics1.png\"> <img alt=\"ChangeAnalytics1.png\" border=\"0\" file=\"/mediawiki/images/d/df/ChangeAnalytics1.png\" height=\"469\" hspace=\"0\" src=\"../../../images/ChangeAnalytics1_b4101e89.png\" style=\"width: 800px; height: 469px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<h3>Standard Changes</h3>\n<p>This KPI measures the percentage of standard changes (those that use the standard workflow) out of the selected changes. In our IT environment, we should strive to create an approved and documented process for any repeatable change. This will result in many change models in the system being marked as standard, and we know from experience that these types of changes are more successful in a shorter time frame than other types. In fact, if we didn’t already know that, Service Management will tell us how much more efficient and successful they are as part of this analytic.</p>\n<p>Service Management will also nominate some change models that are following the normal workflow as candidates for the standard workflow. It looks at all of the change models to find the ones that have low impact, low risk, and a high rate of success.</p>\n<p>Again, we have the ability to look at this KPI over time to see how we are doing in an ongoing manner.</p>\n<h3>Change automation</h3>\n<p>This KPI displays the percentage of changes that contain automated tasks in their execution plan. Another way we can make our change management process more efficient is to automate as many repeatable steps of a change model as we can. Automated processes are faster and less error-prone than comparable manual ones.</p>\n<p>Not only will Service Management tell us how many of our changes we automated, it will also calculate:</p>\n<ul>\n<li>The difference in success rate in automated changes versus non-automated ones</li>\n<li>The percentage of fully automated changes (all tasks are automated) out of all automated changes</li>\n<li>The average duration of an automated change</li>\n</ul>\n<p>Additionally, the change automation panel will suggest specific change models it thinks may be suitable for automation.</p>\n<p><br/>\nAs you might expect, there is much more information about change analytics in Service Management’s <a href=\"./itom/SMAX:25.1/ChangeAnalytics\">online documentation</a>.</p>\n<!-- NewPP limit reportCached time: 20200217094244Cache expiry: 86400Dynamic content: falseCPU time usage: 0.036 secondsReal time usage: 0.179 secondsPreprocessor visited node count: 25/1000000Preprocessor generated node count: 60/1000000Post‐expand include size: 17264/2097152 bytesTemplate argument size: 0/2097152 bytesHighest expansion depth: 2/40Expensive parser function count: 0/100Unstrip recursion depth: 0/20Unstrip post‐expand size: 0/5000000 bytes--><!--Transclusion expansion time report (%,ms,calls,template)100.00%    0.000      1 -total--><!-- Saved in parser cache with key docops_wiki:pcache:idhash:875771-0!canonical and timestamp 20200217094244 and revision id 1577531 --></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}