{
  "title": "Change workflow",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Change management is responsible for the life cycle of all changes. The aim is to respond to changing business requirements while maximizing value and reducing incidents, disruption, and rework. The process minimizes the impact of change-related incidents on service quality, and consequently, improves the day-to-day operations of the organization. This process includes activities that ensure the measurability of the impact of a change within the environment.</p>\n<p>A change <span class=\"SAW_VariablesWorkflow\">workflow</span> is an end-to-end process from the change creation to the change closure.</p>\n<div class=\"Admonition_Note\"><span class=\"autonumber\">Note</span> The following describes the workflows of planned changes of the following types: Standard, Emergency, and Normal. For information about the workflow of retroactive changes of these change types, see <a href=\"/doc/423/26.1/retroactivechanges#Retroactive_change_workflow\" title=\"Retroactive change workflow\">Retroactive change workflow</a>.</div>\n<h2 id=\"Standard,_Emergency,_and_Normal\"><span class=\"mw-headline\" id=\"Standard.2C_Emergency.2C_and_Normal\">Standard, Emergency, and Normal</span></h2>\n<p>Each of the Service Management change workflows reflects ITIL process recommendations. The building blocks of each <span class=\"SAW_VariablesWorkflow\">workflow</span> are described below.</p>\n<h3 class=\"mw-headline\" id=\"Standard_change\">Standard change</h3>\n<p>This is a pre-approved change, of low risk. It's relatively common, and follows a standard procedure or work instruction.</p>\n<p><a class=\"image\" href=\"https://staging.docs.microfocus.com/file/images/b/bf/change_standard_change.png\" title=\"https://staging.docs.microfocus.com/file/images/b/bf/change_standard_change.png\"> <img alt=\"Standard change\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/b/bf/change_standard_change.png\" height=\"297\" hspace=\"0\" src=\"../../../images/change_standard_change_70ec8c81.png\" style=\"width:800px;height:297px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<div data-mc-conditions=\"SAWConditions.FullHelp\"></div>\n<h3 class=\"mw-headline\" id=\"Emergency_change\">Emergency change</h3>\n<p>This is an expedited process, which implements changes to the production environment when an emergency caused by a service outage occurs. This process proactively prevents a serious service outage.</p>\n<p><a class=\"image\" href=\"/file/images/7/7b/SMA_202108_emergency_change.png\" title=\"/file/images/7/7b/SMA_202108_emergency_change.png\"> <img alt=\"Emergency change\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/7/7b/SMA_202108_emergency_change.png\" height=\"290\" hspace=\"0\" src=\"../../../images/SMA_202108_emergency_change_aacf2f03.png\" style=\"width: 800px; height: 290px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<h3 class=\"mw-headline\" id=\"Normal_change\">Normal change</h3>\n<p>This is a change that must follow the complete change management process. It proceeds through all steps of the change management process, and if successfully completed, is reviewed by a Change Advisory Board (CAB).</p>\n<p><a class=\"image\" href=\"/file/images/8/8f/SMA_202108_normal_change.png\" title=\"/file/images/8/8f/SMA_202108_normal_change.png\"> <img alt=\"Normal change\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/8/8f/SMA_202108_normal_change.png\" height=\"313\" hspace=\"0\" src=\"../../../images/SMA_202108_normal_change_6e367583.png\" style=\"width: 800px; height: 313px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<h2 class=\"mw-headline\" id=\"Metaphases_and_phases\">Metaphases and phases</h2>\n<p>This section describes the metaphases and subordinate phases in the life cycle of a change.</p>\n<p>The change workflow relies on business rules. Rules repeat from one phase to another when the end user can make a change to a field affected by a business rule during that phase.</p>\n<h3 class=\"mw-headline\" id=\"Metaphase:_Classification\">Metaphase: Classification</h3>\n<p>A Change Requestor logs a request for a change, including selecting a change model. The process type of whether it's a normal (the default), emergency, or standard change, is based on the model. A user with the appropriate privileges can set the change as an emergency. The Change Coordinator reviews the information filled in by the Change Requestor to ensure there are no blanks, and checks for duplicate change records.</p>\n<table>\n<tbody>\n<tr>\n<th>Phase</th>\n<th>Transition</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Log</td>\n<td>Automatic</td>\n<td>\n<p>A Change Requestor logs a request for a change. As soon as the change is logged it's automatically queued for evaluation by the Change Coordinator or Change Owner.</p>\n<p><b>Next phase:</b> <b>Evaluate</b></p>\n</td>\n</tr>\n<tr>\n<td>Evaluate</td>\n<td>Manual</td>\n<td>\n<p>The Change Coordinator or Change Owner checks the information provided— including the change model, performs an initial analysis, and selects a category for the change.</p>\n<p>If the decision is to move on with the change, the Change Coordinator or Change Owner transitions it manually to the <b>Plan</b> phase.</p>\n<p>If not, the change is canceled, and the Change Coordinator or Change Owner manually transitions the change to the <b>Abandon</b> phase.</p>\n<p><b>Next phase:</b> <b>Plan</b> or <b>Abandon</b></p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 class=\"mw-headline\" id=\"Metaphase:_Planning\">Metaphase: Planning</h3>\n<p>The Change Owner plans the resources required, and reviews, revises, and updates the schedule for changes as necessary, including producing an implementation plan and remediation plan. The Change Owner also assesses the change by:</p>\n<ul>\n<li>Determining the risk and impact.</li>\n<li>Deciding whether it's necessary to test the change before deploying it.</li>\n</ul>\n<p>In addition, the Change Owner assigns each task to a Change Task Assignee. The Change Approver reviews the change and, if not satisfied, can return the change to one of the earlier phases.</p>\n<table>\n<tbody>\n<tr>\n<th>Phase</th>\n<th>Transition</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Plan</td>\n<td>Manual</td>\n<td>\n<p>The Change Owner analyzes the change, plans the resources required, and reviews, revises, and updates the schedule as necessary. The Change Owner also evaluates the risk and impact, documents the change plan, and submits it for approval.</p>\n<p>If the decision is to move on with the change, the Change Owner transitions it manually to following phase depending on the change type:</p>\n<ul>\n<li><b>Standard</b> change: <b>Execute</b></li>\n<li><b>Normal</b> change: <b>Approve plan</b></li>\n<li><b>Emergency</b> change: <b>Build and test</b></li>\n</ul>\n<p>If not, the change is canceled, and the Change Owner manually transitions the change to the <b>Abandon</b> phase.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><b>Approve plan</b> (Normal change only)</p>\n</td>\n<td>Automatic or Manual</td>\n<td>\n<p>The Change Approver reviews the plan and the impact, risks, and benefits of the change request, as well as the consequences of not implementing the change. The Change Approver may:</p>\n<ul>\n<li>Approve the change</li>\n<li>Require and review a build and test before approval</li>\n<li>Require more information, before approving the change</li>\n</ul>\n<p>In any of these cases, the change automatically transitions on to the <b>Approve deployment</b> or <b>Build and test</b> phase, or back to the <b>Plan</b> phase, depending on the information provided by the Change Approver.</p>\n<p>Alternatively, if the change isn't approved, the Change Approver manually transitions the change to the <b>Abandon</b> phase.</p>\n<p><b>Next phase</b>: <b>Build and test</b>, <b>Approve deployment</b>, back to <b>Plan</b>, or <b>Abandon</b></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><b>Build and test</b> (Normal and Emergency changes only)</p>\n</td>\n<td>Manual</td>\n<td>\n<p>The Change Owner arranges for a deployment package to be built and tested, and tests the implementation of the change and the remediation plan, then manually transitions the change to the following phase, depending on the change type:</p>\n<ul>\n<li><b>Normal</b> change: <b>Approve deployment</b></li>\n<li><b>Emergency</b> change: <b>ECAB</b></li>\n</ul>\n<p>Alternatively, the Change Approver can cancel the change by manually transitioning it to the <b>Abandon</b> phase.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><b>Approve deployment</b> (Normal change only)</p>\n</td>\n<td>Automatic or Manual</td>\n<td>\n<p>The Change Analyst reviews the testing of the change, and approves the proposed timing of the change.</p>\n<p>The change automatically transitions on to the <b>Execute</b> phase, or back to the <b>Plan</b> phase, depending on the information provided by the Change Analyst.</p>\n<p>Alternatively, the Change Analyst can cancel the change by manually transitioning it to the <b>Abandon</b> phase.</p>\n<p><b>Next phase:</b> <b>Execute</b>, back to <b>Plan</b>, or <b>Abandon</b></p>\n</td>\n</tr>\n<tr>\n<td>\n<p><b>ECAB</b> (Emergency change only)</p>\n</td>\n<td>Automatic</td>\n<td>\n<p>The relevant analyst considers:</p>\n<ul>\n<li>The impact, risks, and benefits of the change request</li>\n<li>The consequences of not implementing the change</li>\n<li>Whether the change is truly an emergency change</li>\n<li>The proposed timing and the testing of the change</li>\n</ul>\n<p>The change transitions automatically on to the <b>Execute</b> phase, or back to the <b>Plan</b> phase, depending on the information provided by the analyst.</p>\n<p><b>Next phase:</b> <b>Execute</b>, or back to <b>Plan</b></p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 class=\"mw-headline\" id=\"Metaphase:_Deployment\">Metaphase: Deployment</h3>\n<p>The change happens in this phase. The Change Owner coordinates and monitors the change implementation. If the change isn't affected, the Change Owner implements the remediation plan.</p>\n<table>\n<tbody>\n<tr>\n<th>Phase</th>\n<th>Transition</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Execute</td>\n<td>Manual</td>\n<td>\n<p>The change is implemented, and the Change Owner manually transitions the change to the <b>CMDB Update</b> phase.</p>\n<p>If the execution fails, the Change Owner manually transitions the change to the <b>Remediate</b> phase.</p>\n<p>Alternatively, the Change Owner can cancel the change by manually transitioning it to the <b>Abandon</b> phase.</p>\n<p><b>Next phase:</b> <b>CMDB Update</b>, <b>Remediate</b>, or <b>Abandon</b></p>\n</td>\n</tr>\n<tr>\n<td>Remediate</td>\n<td>Manual</td>\n<td>\n<p>The remediation plan is implemented.</p>\n<p><b>Next phase:</b> <b>Review</b></p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 class=\"mw-headline\" id=\"Metaphase:_Validation\">Metaphase: Validation</h3>\n<p>The Change Manager determines whether the change implementation was successful, and reviews the procedure taken for the purposes of process improvement.</p>\n<table>\n<tbody>\n<tr>\n<th>Phase</th>\n<th>Transition</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>CMDB Update</td>\n<td>Manual</td>\n<td>\n<p>The relevant analyst updates the CMDB to reflect the implemented change, and sends the change for review.</p>\n<p><b>Next phase:</b> <b>Review</b></p>\n</td>\n</tr>\n<tr>\n<td>Review</td>\n<td>Manual</td>\n<td>\n<p>The relevant manager reviews the result of the change, compares the actual and proposed implementation, and decides whether to create a change model. The analyst also sets the completion code. The change is manually transitioned to the <b>Close</b> phase.</p>\n<p><b>Next phase:</b> <b>Close</b></p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"Metaphase:_Done_(End)\"><span class=\"mw-headline\" id=\"Metaphase:_Done_.28End.29\">Metaphase: Done (End)</span></h3>\n<p>The Change Owner reviews the change implemented and closes it if the change has been successfully implemented.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> An unsuccessful change and an abandoned change are also kept in this metaphase.</p>\n</div>\n<table>\n<tbody>\n<tr>\n<th>Phase</th>\n<th>Transition</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Close</td>\n<td>None</td>\n<td>The change is closed.</td>\n</tr>\n<tr>\n<td>Abandon</td>\n<td>None</td>\n<td>Service Management doesn't allow you to delete change records. A change that's not implemented is classified as <b>Abandoned</b>. It's inactive and not implemented.</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/changetransitionrules\" title=\"Change transition rules\">Change transition rules</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}