{
  "title": "Change Management",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>\n<div>\n<div class=\"Admonition_Tip\"><span class=\"autonumber\">Change Management</span>\n<div>\n<div>\n<p><br/>\nChanges to IT infrastructure may be necessary to respond to problems or externally imposed requirements and to improve efficiency and effectiveness of existing services. The change management process ensures that standardized methods, processes, and procedures are used for all changes to facilitate efficient and safe handling of all changes to the infrastructure, and is used to determine that the need for change outweighs the potential detrimental impact of changes.</p>\n<p>ITIL defines the Change Management process with the following:</p>\n<p>“The goal of the change management process is to ensure that standardized methods and procedures are used for efficient and prompt handling of all changes, in order to minimize the impact of change-related incidents upon service quality, and consequently improve the day-to-day operations of the organization.”</p>\n<p>In a well-run environment, any change to an IT service (whether a business or infrastructure service) that affects one of the following should be controlled by change management:</p>\n<ul>\n<li>Hardware</li>\n<li>Communications equipment and software</li>\n<li>System software</li>\n<li>All documentation and procedures associated with the running, support and maintenance of live systems</li>\n</ul>\n<p>The change management process includes recording change requests, impact assessment, cost/benefit and risk analysis of proposed changes, business justification and approval of the change, managing and coordinating change implementation, monitoring implementation tasks, reviewing change results, and closing the completed change.</p>\n<div>\n<div><a class=\"image\" href=\"/file/images/2/21/Change_Data_Model.gif\" title=\"/file/images/2/21/Change_Data_Model.gif\"> <img alt=\"Change Data Model.gif\" border=\"0\" file=\"/mediawiki/images/2/21/Change_Data_Model.gif\" height=\"570\" hspace=\"0\" src=\"../../../images/Change_Data_Model_83aeff7d.gif\" style=\"width: 800px; height: 570px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<div>\n<div></div>\n</div>\n<h2>Using Change Management</h2>\n<p>Now that we have our services defined and have performed the hard work of mapping out all of their components and relationships, let’s just change everything, right? Unfortunately, that's how it feels sometimes. As the needs of our consumers change and grow, and new requirements bring the need for new systems and services, our IT infrastructure changes. What we need is a way to keep up with and control these changes.</p>\n<p>In order to control our IT environment, we shouldn’t allow any change to our existing infrastructure without some kind of documentation and approval process. Otherwise, we could negatively (and perhaps drastically) affect the services we are providing to our end users and customers.</p>\n<p>Luckily, we have change management and the change process. This process allows changes to the IT infrastructure to keep up with demand in a controlled way. Using it, we can evaluate the need for a specific change and weigh the possible benefits against the risk of unforeseen issues it might create. Additionally, we can define an approval process that won't let any change happen without the right stakeholders giving it the go-ahead.</p>\n<p>It also allows us to create a more standardized method of making these changes, and when we get good enough at a certain type of change, we can bypass the upfront evaluation and approval process. Even better, we can automate some or all of a specific type of change to make it as efficient as possible.</p>\n<h2>Setting up Change Management</h2>\n<p>Setting up change management is nearly identical to setting up the other modules we have addressed so far. Change uses the same record categories we have seen before, so we need to review those and create any that we need specifically for changes. We can also review the existing views and reports and add any we might find necessary.</p>\n<p>There are a few things, however, that are specific to change management we need to address to ensure the best experience for our agents. This includes setting up a few change models for common types of changes and defining the blackout and maintenance windows for the change calendar.</p>\n<h2>Creating Change Models</h2>\n<p>There are many pieces of information that go into creating a change request. Along with the actual SACM components that are being changed, the requester needs to provide various pieces of data that include:</p>\n<ul>\n<li>A description of the change, including the reason for the change and the justification for it</li>\n<li>Change classification information, including the categorization, risk, urgency, and projected impact of the change</li>\n<li>When the change will be made and how long it will take</li>\n<li>Who needs to review the change and approve it</li>\n<li>An implementation plan (and a remediation plan in case of failure, including specific tasks necessary to complete the change</li>\n</ul>\n<p>So you can see that creating a change isn't a simple procedure. However, over time we will most likely perform the same type of change multiple times.</p>\n<p>To make this process more efficient, Service Management provides the ability to create change models. Change models are much like service offerings as they define all the information needed to request a specific type of change.</p>\n<p><a class=\"image\" href=\"/file/images/1/18/ChangeModel.png\" title=\"/file/images/1/18/ChangeModel.png\"> <img alt=\"ChangeModel.png\" border=\"0\" file=\"/mediawiki/images/1/18/ChangeModel.png\" height=\"337\" hspace=\"0\" src=\"../../../images/ChangeModel_a82a6099.png\" style=\"width: 800px; height: 337px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<p>Not only does this make it easier to create changes, but Service Management also tracks the success rate and the risk criteria for all changes created with a specific change model. This will allow us to identify specific types of changes prone to failure or that have high risk. We can then work with our experts to modify the processes they use to make the change, with the goal of raising the success percentage and lowering the risk.</p>\n<p>The success analysis and risk statistics I mentioned are also visible on each change record as well as a list of the last few similar changes. These are visible on the right-hand side of each change in a separate section titled 'Additional information'. If you can’t see the graphs, you’ll need to expand it by clicking on the arrow at the top of the section.</p>\n<p>You can find more information about change models in the <a href=\"/doc/423/26.1/changemodels\">online documentation</a>.</p>\n<h2 id=\"Setting_up_Time_Periods\">Setting up Time Periods</h2>\n<p>One of the important aspects of a change is scheduling when it will occur. Because they may affect the services we are providing to our end users, it's important to minimize any impact the change may have on their operation. One way we try to minimize this impact is to schedule times for when changes may take place (maintenance windows) and times where they aren't (blackout periods).</p>\n<p>We create the maintenance windows and blackout periods in Service Management using time periods. With time periods, it's easy to define recurring events using a simple and easy to understand scheduling mechanism.</p>\n<p><a class=\"image\" href=\"/file/images/4/4d/TimePeriod.png\" title=\"/file/images/4/4d/TimePeriod.png\"> <img alt=\"TimePeriod.png\" border=\"0\" file=\"/mediawiki/images/4/4d/TimePeriod.png\" height=\"471\" hspace=\"0\" src=\"../../../images/TimePeriod_3d33fdf9.png\" style=\"width: 800px; height: 471px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<p>We can define the maintenance and blackout time periods to correspond to every service we have or only a specific service.</p>\n<p>When creating or reviewing a change, the requester will see the blackout and maintenance windows, which will assist them in the scheduling process. In fact, Service Management can even suggest a start time based on the duration of the change and the maintenance windows defined.</p>\n<p><a class=\"image\" href=\"/file/images/a/a7/ChangeScheduling.png\" title=\"/file/images/a/a7/ChangeScheduling.png\"> <img alt=\"ChangeScheduling.png\" border=\"0\" file=\"/mediawiki/images/a/a7/ChangeScheduling.png\" height=\"463\" hspace=\"0\" src=\"../../../images/ChangeScheduling_b3f1900b.png\" style=\"width: 800px; height: 463px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<p>Additional information about time periods may be found <a href=\"./itom/SMAX:25.1/TimePeriods\">here</a>.</p>\n<!-- NewPP limit reportCached time: 20200217094233Cache expiry: 86400Dynamic content: falseCPU time usage: 0.020 secondsReal time usage: 0.108 secondsPreprocessor visited node count: 14/1000000Preprocessor generated node count: 38/1000000Post‐expand include size: 7254/2097152 bytesTemplate argument size: 0/2097152 bytesHighest expansion depth: 2/40Expensive parser function count: 0/100Unstrip recursion depth: 0/20Unstrip post‐expand size: 0/5000000 bytes--><!--Transclusion expansion time report (%,ms,calls,template)100.00%    0.000      1 -total--><!-- Saved in parser cache with key docops_wiki:pcache:idhash:875772-0!canonical and timestamp 20200217094233 and revision id 1577532 --></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}