{
  "title": "Enable change collision detection",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>To enable change collision detection, you must add a business rule to the <b>After change</b> section of the Change process. If you want to also detect change collisions affecting the same device, you must also add a business rule to the <b>Before adding relationship</b> section of the Change process. For more information, see the following sections.</p>\n<div class=\"example\">\n<p>The business rule added to the <b>Before adding relationship</b> section of the Change process, checks collisions between change records with matching times when there is a change to their involved device.</p>\n<p>For example, assume two change records have matching times but different involved devices. At a later date, if one of the change records is modified so that they have the same involved device, the business rule generates a collision alert. However, where there is the appropriate business rule in the <b>After change</b> section, but <b>not</b> in the <b>Before adding relationship</b> section, change collision is only detected when start or end times are modified.</p>\n</div>\n<h2 class=\"mw-headline\" id=\"Change_collision_detection_business_rule\">Change collision detection business rule</h2>\n<p>This feature uses the <b>Validate no collisions</b> business rule template. There are the following versions:</p>\n<ul>\n<li>\n<p>In the <b>After change</b> section of the Change process</p>\n<p><a class=\"image\" href=\"/file/images/b/b4/2018.08_Helpcenter/Resources/Images/CM/br-chng-coll-all.png\" title=\"/file/images/b/b4/2018.08_Helpcenter/Resources/Images/CM/br-chng-coll-all.png\"> <img alt=\"Change collision business rule for all changes\" class=\"fit_width\" decoding=\"async\" height=\"75\" src=\"../../../images/br-chng-coll-all_829ebf16.png\" width=\"963\"/> </a></p>\n</li>\n<li>\n<p>In the <b>Before adding relationship</b> section of the Change process</p>\n<p><a class=\"image\" href=\"/file/images/3/30/2018.08_Helpcenter/Resources/Images/CM/br-chng-coll-devices.png\" title=\"/file/images/3/30/2018.08_Helpcenter/Resources/Images/CM/br-chng-coll-devices.png\"> <img alt=\"Change collision business rule for changes affecting devices\" class=\"fit_width\" decoding=\"async\" height=\"76\" src=\"../../../images/br-chng-coll-devices_eedaa2c9.png\" width=\"1184\"/> </a></p>\n</li>\n</ul>\n<p>After adding the rule, you should edit it as follows:</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Value</th>\n</tr>\n<tr>\n<td>expression</td>\n<td>\n<ul>\n<li>\n<p>Check for collisions with all changes</p>\n<p>To check for scheduling collisions with all changes, select a matching start and end time. For example, to check for collisions of Scheduled start time and Scheduled end time, type:</p>\n<p><code>${current_update.ScheduledStartTime.IsChanged || current_update.ScheduledEndTime.IsChanged}</code></p>\n</li>\n<li>\n<p>Check for collisions with changes affecting the same device</p>\n<p>When you check for collisions with changes that affect the same device (or devices) that the current change affects, you need to add two business rules: one to the <b>After change</b> section of the <b>Change &gt; Processes and Rules</b> tab, and one to the <b>Before adding relationship</b> section. For example, to check for collisions of Scheduled start time and Scheduled end time, and for collisions with changes affecting the same device, type:</p>\n<ul>\n<li>\n<p>In the <b>After change</b> section, type:</p>\n<p><code>${current_update.ScheduledStartTime.IsChanged || current_update.ScheduledEndTime.IsChanged}</code></p>\n</li>\n<li>\n<p>In the <b>Before adding relationship</b> section, type:</p>\n<p><code>${current_association_update.association_name == 'DeviceAffectedByChange'}</code></p>\n</li>\n</ul>\n</li>\n</ul>\n<div class=\"Admonition_Caution\">\n<p><span class=\"autonumber\">Caution</span> It's possible to create a simple rule using this template without the <b>\"If...Then\"</b> option and the <b>expression</b> parameter. However, such a rule would run every time a change record is saved (if defined in <b>After change</b>), and on every added association (if defined in <b>Before adding relationship</b>), likely having a materially adverse effect on performance.</p>\n<p>It's therefore recommended that you configure this rule template by always including an <b>expression</b> parameter.</p>\n</div>\n</td>\n</tr>\n<tr>\n<td>start time</td>\n<td>Select a suitable start time field. This is the start time of the current change being worked on that change collision detection checks. For example, <b>Scheduled start</b>.</td>\n</tr>\n<tr>\n<td>end time</td>\n<td>Select a suitable start time field. This is the end time of the current change being worked on that change collision detection checks. For example, <b>Scheduled end</b>.</td>\n</tr>\n<tr>\n<td>changes</td>\n<td>\n<p>Note: This field displays only for the rule in the <b>After change</b> section of the Change process.</p>\n<p>Select:</p>\n<ul>\n<li><b>All changes</b> to detect scheduling collisions with all changes.</li>\n<li><b>Changes affecting involved devices</b> to detect device collisions.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>filters</td>\n<td>\n<p>Select to filter the change records that the business rule is applied to.</p>\n<p>You may filter using fields of the following types only</p>\n<ul>\n<li>BOOLEAN</li>\n<li>DATE_TIME</li>\n<li>DOUBLE</li>\n<li>ENTITY_LINK</li>\n<li>ENUM</li>\n<li>INTEGER</li>\n<li>SMALL_TEXT</li>\n</ul>\n<p>For example, you might choose category, or change model, or owner.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>start time field</p>\n<p>end time field</p>\n</td>\n<td>\n<p>Select a suitable start time field and end time field.</p>\n<p>The business rule compares the start time to end time (as determined above) of the current change record being worked on, with the <b>start time field</b> to the <b>end time field</b> of other active changes.</p>\n<p>For example, you might have the following settings:</p>\n<ul>\n<li>start time - Scheduled start</li>\n<li>end time - Scheduled end</li>\n<li>start time field - Scheduled DT start</li>\n<li>end time field - Scheduled DT end</li>\n</ul>\n<p>The business rule then detects change collisions between the Scheduled start and Scheduled end of the current record being worked on, with the Scheduled DT start and Scheduled DT end for all other active changes.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"How_to_add_a_change_collision_detection_rule_to_the_After_change_section_of_the_Change_process\">How to add a change collision detection rule to the <b>After change</b> section of the Change process</h2>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu_Starter\">Main menu</span>, select <b>Administration &gt; Configuration &gt; Studio</b>.</li>\n<li>In the drop-down at the top of the page, select the <b>Change</b> record type.</li>\n<li>Select the <b>Processes and Rules</b> tab.</li>\n<li>In the left pane, select <b>Change</b> at the top of the tree.</li>\n<li>In the main panel, in the <b>After change</b> section:\n\t<ol>\n<li>Click <b>Add</b>.</li>\n<li>Click <b>“If…Then” rule</b>.</li>\n<li>Select the <b>Validate no collisions rule template</b>, and click <b>OK</b>.</li>\n</ol>\n</li>\n<li>Edit the newly created rule as required, and save your changes. For more information, see Change collision detection business rule.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"How_to_add_a_change_collision_detection_rule_to_the_Before_adding_relationship_section_of_the_Change_process\">How to add a change collision detection rule to the <b>Before adding relationship</b> section of the Change process</h2>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu_Starter\">Main menu</span>, select <b>Administration &gt; Configuration &gt; Studio</b>.</li>\n<li>In the drop-down at the top of the page, select the <b>Change</b> record type.</li>\n<li>Select the <b>Processes and Rules</b> tab.</li>\n<li>In the left pane, select <b>Change</b> at the top of the tree.</li>\n<li>In the main panel, in the <b>Before adding relationship</b> section:\n\t<ol>\n<li>Click <b>Add</b>.</li>\n<li>Click <b>“If…Then” rule</b>.</li>\n<li>Select the <b>Validate no collisions rule template</b>, and click <b>OK</b>.</li>\n</ol>\n</li>\n<li>Edit the newly created rule as required, and save your changes. For more information, see the <em>Change collision detection business rule </em>section.</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}