{
  "title": "Check the file system requirements",
  "content": "<div class=\"mw-parser-output\">\n<table>\n<tbody>\n<tr>\n<th>Role</th>\n<th>Location</th>\n<th>Privileges required</th>\n</tr>\n<tr>\n<td>System administrator</td>\n<td>All nodes</td>\n<td>Root or sudo</td>\n</tr>\n</tbody>\n</table>\n<div class=\"transcontent stn-begin--folder_space\"> </div>\n<p>The following sections are a conceptual overview of the directory structure and sizing requirements of OMT to help you set up a server or a virtual machine (VM) for the installation.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">In this topic, the definition of 1 GB is 1024 x 1024 x 1024 bytes.</div>\n</div>\n<h2 id=\"Directory_structure_for_installation_and_runtime_data1\">Directory structure </h2>\n<p>All Linux systems use space under the root filesystem (“/”). It's possible to assign enough space under one root partition to contain most of the directories used by OMT. However, a best practice <span class=\"mstp_suggestion_7_457_459\">is</span> to set up a few separate volumes or filesystems for directory trees such as <code>/tmp</code> or <code>/var</code>. You may follow your own system administration best practices to assign filesystems, as long as they have enough space in the directories specified below. One exception is the local Persistent Volumes that <span class=\"mstp_suggestion_7_494_497\">are</span> required on OMT worker nodes in production deployments, as discussed below. </p>\n<h3 id=\"/_(root_filesystem)1\">/ (root filesystem)</h3>\n<p>This is the root directory, which is used for various Linux operating system functions. The minimum recommended size for this directory is 10 GB on all nodes, assuming that all the subdirectories are in other filesystem partitions.</p>\n<h3 id=\"/var)1\">/var</h3>\n<p>This is the directory where the system logs <span class=\"mstp_suggestion_15_83_86\">are</span> located. If the <code>/var</code> directory and <code>root filesystem (/)</code> aren't on the same file system, the minimum recommended size for this directory is 10 GB on all nodes.</p>\n<h3 id=\"/tmp1\">/tmp</h3>\n<p>This directory is used by the operating system as a temporary location and is used for some application files. The minimum recommended size for this directory is 10 GB on all your systems. In the <code>install.properties</code> setup file, it's possible to specify an alternative location for temporary installation files (TMP_FOLDER), which would reduce this requirement if for some reason /tmp must be smaller.</p>\n<h3 id=\"Directory_to_contain_the_offline_download_of_the_Docker_images1\">Directory to contain the downloaded images</h3>\n<p>The installation process requires you to download the OMT and application images to the first control plane node or download them on a separate system and copy them to the first control plane node. You can specify a directory for the downloaded images or use the default directory (<code>/var/opt/cdf/offline</code>). The image processing done by the <code>uploadimages.sh</code> script requires free space in the target directory that equals up to twice the size of the images. This space is required only temporarily on the first control plane node, and isn't needed on any other node. You can remove the images once the installation is complete. </p>\n<h3 id=\"Kubernetes_Home_and_CDF_Runtime_directory1\">Home and OMT runtime directories</h3>\n<p>These can be in any location of your choice, but by default they're both under <code>/opt</code> (<code>/opt/cdf</code> and <code>/opt/cdf/data</code>). If you choose to install into a different home location or change the runtime directory location, then you need to edit the corresponding <code>CDF_HOME</code> and the <code>RUNTIME_CDFDATA_HOME</code> parameters in the <code>install.properties</code> file to point to the directories you wish to use. You can configure those parameters along with others while completing the preparation tasks. Ho<span class=\"mstp_warning_27_411_413\">we</span>ver, we recommend that you leave these as the default. </p>\n<p>The largest potential contributor to the space requirements of the OMT runtime directory <span class=\"mstp_suggestion_29_223_225\">is</span> the<code> /opt/cdf/data </code>directory. Note that the filesystem hosting the <code>/opt/cdf/data</code> directory (the directory can <span class=\"mstp_suggestion_29_196_198\">be</span> customized) must be an <code>xfs</code> filesystem with <code>ftype=1</code> (1 is the default <code>ftype</code> for <code>xfs</code>), or <code>ext4</code>.</p>\n<h2 id=\"Sizing\">Sizing</h2>\n<h3 id=\"OMT_hardware1\">Server sizing for control plane and worker nodes</h3>\n<table>\n<tbody>\n<tr>\n<th>Item</th>\n<th>Minimum requirements</th>\n<th>Recommended requirements</th>\n</tr>\n<tr>\n<td>RAM</td>\n<td>8 GB</td>\n<td>16 GB</td>\n</tr>\n<tr>\n<td>Processor</td>\n<td>4 cores</td>\n<td>8 cores</td>\n</tr>\n<tr>\n<td>Free disk space</td>\n<td>See table below.</td>\n<td>See table below.</td>\n</tr>\n</tbody>\n</table>\n<p>These sizing recommendations apply to OMT only. If you want to create a single node deployment for a non-production environment with the NFS volumes also exported on this node, the minimum memory for the node is 20 GB.</p>\n<p>The following sizing recommendations apply to control plane nodes only. For the recommended space on worker nodes, refer to the application documentation.</p>\n<table>\n<tbody>\n<tr>\n<th>Filesystem/device</th>\n<th>Recommended space (not including space for the NFS server)</th>\n</tr>\n<tr>\n<td><code>$CDF_HOME</code> (<code>/opt/cdf</code>, different to <code>$RUNTIME_CDFDATA_HOME</code>)</td>\n<td>8 GB</td>\n</tr>\n<tr>\n<td><code>$RUNTIME_CDFDATA_HOME</code>\n<p>(Different  $CDF_HOME)<br/>\n\t\t\t </p>\n</td>\n<td>100 GB</td>\n</tr>\n<tr>\n<td><code>$CDF_HOME</code> (same as $RUNTIME_CDFDATA_HOME)</td>\n<td>108 GB; Make sure the used disk size plus 200 GB is no more than 80% of the whole system disk space.</td>\n</tr>\n<tr>\n<td><code>/tmp</code></td>\n<td>10 GB</td>\n</tr>\n<tr>\n<td>Directory to contain the downloaded images (<code>/var/opt/cdf/offline</code>)</td>\n<td>At least twice the size of the images.</td>\n</tr>\n</tbody>\n</table>\n<h3>NFS server sizing</h3>\n<p>These sizing recommendations apply to OMT only.</p>\n<table>\n<tbody>\n<tr>\n<th>Item</th>\n<th>Recommended requirements</th>\n</tr>\n<tr>\n<td>RAM</td>\n<td>16 GB</td>\n</tr>\n<tr>\n<td>Processor</td>\n<td>8 cores</td>\n</tr>\n<tr>\n<td>Free disk space</td>\n<td>100 GB</td>\n</tr>\n</tbody>\n</table>\n<h3>Database sizing</h3>\n<p>On your external database systems, follow the database specific documentation and guidelines for filesystem allocation. In general, most databases allow you to specify the directories you wish to contain the database catalog and data. The required capacity of your database systems will vary depending on load and retention policies.</p>\n<div class=\"transcontent stn-end--relatedTopics\"> </div>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}