{
  "title": "Use case: Enable IaC Gateway in Cloud Management",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div class=\"admonition\">\n<div class=\"admonition-icon admonition-caution-icon\"></div>\n<div class=\"admonition-content admonition-caution-content\"> Support for IaC Gateway is a beta feature and therefore may contain defects. The primary objective of this feature is to obtain feedback on its functionality and quality, and to identify functional enhancement. Customer is advised to safeguard its data, use caution, and not rely in any way on the correct functioning or performance of this feature and its artifacts. Customer assumes all risks and all costs associated with their use of this feature, including, without limitation, any damage to any equipment, software, information, or data. OpenText disclaims any liability for any loss, damage, or inconvenience caused by using or relying on this feature. </div>\n</div>\n<p>The services that enable the functionality of IaC Gateway (IaCGw) are shipped with the ESM platform. IaC Gateway gives customers who are developing Infrastructure as Code (IaC) using Terraform the ability to store Terraform state files in ESM’s database. Storing these state files in ESM’s database gives Operation teams and other users of the ESM platform visibility into Terraform deployments in three ways:</p>\n<ul>\n<li>First, through subscriptions that get created based on Terraform state files</li>\n<li>Second, cost estimation through a third-party provider</li>\n<li>Third, if Native SACM is enabled, through the ability to see realized CI Topologies in UD/UCMDB and in the Native SACM UI based on those state files that contain cloud resources. If a customer has the ability to run Universal Discovery, further enhancements and enrichment to those CI Topologies will be made.</li>\n</ul>\n<p>This topic describes the following:</p>\n<ul>\n<li>How to enable IaC Gateway in Cloud Management</li>\n<li>How to configure your Terraform configuration file to leverage Cloud Management in ESM as a Terraform State backend</li>\n<li>How to use the IaCGw \"Request On Behalf\" functionality</li>\n<li>How to configure an out-of-the-box report that leverages subscriptions created by IaC Gateway</li>\n<li>CMS prerequisite steps if Native SACM is enabled</li>\n<li>How to enable a third-party cost integration that can provide a cost estimation based on your Terraform plan</li>\n<li>Known issues with IaC Gateway</li>\n</ul>\n<h2>Enablement of IaC Gateway</h2>\n<p>You can enable IaCGw by configuring your Terraform configuration file to utilize ESM as the backend to store Terraform state files through Terraform HTTP backend configuration. Once you have configured a Terraform configuration file to use ESM, the first instantiation of a Terraform state file being stored in the ESM platform will trigger an underlying automated flow that creates the scaffolding necessary to create a subscription in ESM based on that state file. The following is the ordered flow that this process follows:</p>\n<ol>\n<li>It creates a Category with the name of <strong>IAC_CATALOG</strong> if one doesn’t exist by that name.</li>\n<li>It creates a Service Definition with the name of <strong>IAC_SERVICE_DEFINTION</strong> if one doesn’t already exist by that name.</li>\n<li>It creates and publishes a Service Design with the name of <strong>IAC_SERVICE_DESIGN</strong> if one doesn’t exist by that name.</li>\n<li>It creates an Offering with the name of <strong>IaC Terraform Offering</strong> if one doesn’t exist by that name. This offering is based on the aggregated service design in step 3 above.\n\t<p>The Offering is configured with a status of <strong>Unpublished</strong> and has the Service Desk Group and Expert Group fields set to the value of <strong>ECAB Group</strong> to enable subscription requests to be processed automatically.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-important-icon\"></div>\n<div class=\"admonition-content admonition-important-content\">The Offering Status is intentionally set to <strong>Unpublished</strong> to prevent the accidental ordering of the offering by a subscriber in the Service Portal and to prevent an agent from issuing requests for this offering in the Agent Interface. Changing the Offering Status to something other than Unpublished can result in unexpected behavior when users directly interact with the Offering to create a request through the Service Portal or Agent Interface.</div>\n</div>\n</li>\n<li>On successful Terraform state save and creation of a request, a Subscription is created based on the Terraform State file. \n\t<div class=\"admonition\">\n<div class=\"admonition-icon admonition-important-icon\"></div>\n<div class=\"admonition-content admonition-important-content\">All interactions through a Request (Create, Modify, and Cancel) with the Offering and/or subscription should be done through the Terraform CLI and a Terraform state file configured to use IaC as its backend (which will be discussed later), or through direct integration with IaCGw APIs.</div>\n</div>\n</li>\n<li>If Native SACM has been enabled within ESM, once a subscription has been created, a representative CMS topology is created based on the resources from the Terraform plan.\n\t<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>This feature is still evolving and doesn't support some CIs and relationships.</li>\n<li>If you change the name of the category, service definition, service design, or offering after it has been created, the next <strong>Terraform apply</strong> operation will result in the recreation of the item with the expected name.</li>\n</ul>\n</div>\n</div>\n</li>\n</ol>\n<h2>Enablement of IaCGw as Terraform state backend</h2>\n<p>IaCGw supports the Terraform HTTP backend specification, so you can configure IaCGw as the state backend for a Terraform plan file. Below is an example of the required block within a terraform state file, and an explanation of each of the fields of the required HTTP backend configuration, which you must specify in a Terraform plan to enable integration with IaCGw.</p>\n<div><a class=\"image\" href=\"/file/images/d/d2/SMAX202211_terraform_state_IaC_Gateway_Whitepaper.png\" title=\"/file/images/d/d2/SMAX202211_terraform_state_IaC_Gateway_Whitepaper.png\"> <img alt=\"example terraform plan\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/d/d2/SMAX202211_terraform_state_IaC_Gateway_Whitepaper.png\" height=\"164\" hspace=\"0\" src=\"../../../images/SMAX202211_terraform_state_IaC_Gateway_Whitepaper_01c1b105.png\" style=\"width:800px;height:164px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<thead>\n<tr>\n<th scope=\"col\">Field</th>\n<th scope=\"col\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>address</strong></td>\n<td>URL of the REST endpoint. The &lt;&gt; notations indicate values that you must substitute in the URL.</td>\n</tr>\n<tr>\n<td><strong>hostName</strong></td>\n<td>The external hostname of ESM.</td>\n</tr>\n<tr>\n<td><strong>tenantId</strong></td>\n<td>The ID of the ESM tenant on which IaCGw is deployed and enabled.</td>\n</tr>\n<tr>\n<td><strong>stateName</strong></td>\n<td>The unique name of the Terraform state to be stored in IaCGw. The <strong>stateName</strong> must also be a valid URI path and can’t contain forward slashes.</td>\n</tr>\n<tr>\n<td><strong>lock_address</strong></td>\n<td>URL of the lock REST endpoint.</td>\n</tr>\n<tr>\n<td><strong>unlock_address</strong></td>\n<td>URL of the unlock REST endpoint.</td>\n</tr>\n<tr>\n<td><strong>lock_method</strong></td>\n<td>The HTTP method to use when locking.</td>\n</tr>\n<tr>\n<td><strong>unlock_method</strong></td>\n<td>The HTTP method to use when unlocking.</td>\n</tr>\n<tr>\n<td><strong>username</strong></td>\n<td>The username of the HTTP basic authentication. This user must be a member of the <strong>DND Administrators</strong> group. The username format: <strong>&lt;tenantId&gt;/&lt;username&gt;</strong>. </td>\n</tr>\n<tr>\n<td><strong>password</strong></td>\n<td>The password for HTTP basic authentication. The recommended approach is using the environment variable “TF_HTTP_PASSWORD” to pass in the password to the configuration file HTTP Backend section.</td>\n</tr>\n<tr>\n<td><strong>skip_cert_verification</strong></td>\n<td>Whether to skip TLS verification.</td>\n</tr>\n</tbody>\n</table>\n<p>After adding the required HTTP backend configuration to your Terraform plan file, run the <strong>terraform init </strong>command to configure Terraform to use IaCGw as the Terraform state backend for this configuration file. After running <strong>terraform init</strong>, you can use the standard <strong>terraform plan</strong>, <strong>terraform apply</strong>, and <strong>terraform destroy</strong> commands for this configuration file, with IaC Gateway serving as the state backend. The first time the Terraform state is saved into IaCGw, the scaffolding creation process discussed in the \"Enablement of IaC Gateway\" section automatically occurs.</p>\n<h2>Using the IaCGw \"Request On Behalf\" functionality</h2>\n<p>IaCGw also supports the concept of Request On Behalf of another user. This feature allows a request to be made on behalf of another user, resulting in the ESM resources being associated with the other user. For example, you would have a service account make the request on behalf of another user. To enable this, you would pass in another query parameter on the address field in the Terraform HTTP backend configurations to specify the user. In the example below, the <strong>RequestUsername</strong> value of <strong>OnBehalfOfUser</strong> must be a valid ESM service portal user. The username must be a user that's a member of the <strong>DND Administrators</strong> group. See the example below for the HTTP Backend configuration section of your Terraform configuration file.</p>\n<div><a class=\"image\" href=\"/file/images/8/83/SMAX202211_terraform_state2_IaC_Gateway_Whitepaper.png\" title=\"/file/images/8/83/SMAX202211_terraform_state2_IaC_Gateway_Whitepaper.png\"> <img alt=\"example terraform plan\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/8/83/SMAX202211_terraform_state2_IaC_Gateway_Whitepaper.png\" height=\"151\" hspace=\"0\" src=\"../../../images/SMAX202211_terraform_state2_IaC_Gateway_Whitepaper_7a7cc235.png\" style=\"width:800px;height:151px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">In the example above, the given Terraform state name,  <strong>demoVcenter </strong>is locked to an owner the first time we save the state as that user. The owner is either the OnBehalfOfUser if specified, or if not specified, is the username provided in the HTTP backend block.</div>\n</div>\n<h2>Optional step: configure a basic IaCGw subscription report</h2>\n<p>To make basic subscription reports visible within the agent interface, you can create a report within ESM based on the IaC Service Definition. Below are the steps to configure an IaCGw subscription report.</p>\n<ol>\n<li>As the tenant admin, log in to the agent interface within ESM.</li>\n<li>Navigate to <strong>Reports</strong>.<br/>\n<a class=\"image\" href=\"/file/images/2/20/SMAX202211_Navigate1_IaC_Gateway_Whitepaper_2.jpeg\" title=\"/file/images/2/20/SMAX202211_Navigate1_IaC_Gateway_Whitepaper_2.jpeg\"> <img alt=\"reports on the dashboard\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/2/20/SMAX202211_Navigate1_IaC_Gateway_Whitepaper_2.jpeg\" height=\"366\" hspace=\"0\" src=\"../../../images/SMAX202211_Navigate1_IaC_Gateway_Whitepaper_2_e78947fc.jpeg\" style=\"width:800px;height:366px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></li>\n<li>Click <strong>New</strong> on the upper right-hand corner, and choose <strong>Operational raw data report</strong>.</li>\n<li>Fill in the required fields:\n\t<ul>\n<li>Report name – Specify a report name. For example, <strong>IaCGw Subscription Report</strong>.</li>\n<li>Record Type – Choose <strong>Subscription</strong> from the drop-down list.</li>\n</ul>\n</li>\n<li>Create <strong>Filter By</strong>:\n\t<ul>\n<li>Filter By – Select <strong>Based on service definition</strong></li>\n<li>Add Value – “IAC_SERVICE_DEFINITION”</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">This value will show up after the first instantiation of the Terraform state file being stored in ESM.</div>\n</div>\n</li>\n<li>Update <strong>Columns</strong>:\n\t<ul>\n<li>Remove the <strong>Infrastructure and peripheral</strong> and <strong>Device</strong> columns by clicking the “x” to the right of the item in the list.</li>\n<li>Optionally, if you want to add Cost related columns, click in the Columns box and add the following columns:\n\t\t<ul>\n<li><strong>Initial charge</strong></li>\n<li><strong>Recurring charge</strong></li>\n<li><strong>Recurring period</strong></li>\n<li><strong>Currency</strong></li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Click <strong>Save</strong>.</li>\n<li>By default, the report has an Access setting of Private. You can change the Access setting to Public if desired. To do this, go to the <strong>Details</strong> tab in the Report properties panel at the right, change the Access setting, and then click <strong>Save</strong>.</li>\n</ol>\n<h2>UD/UCMDB configuration prerequisites</h2>\n<p>This section describes a prerequisite step that you must perform within UD/UCMDB if you have Native SACM enabled. The purpose of this step is to avoid issues with Business Service CI uniqueness because it’s possible to create services with the same name as IaC Gateway. This step requires the use of the UCMDB Local Client to interact with UCMDB. See <a href=\"/doc/401/25.4/logucmdbdesktop\" title=\"Launch UCMDB Local Client from UCMDB Local Client\">How to install the Local Client</a>.</p>\n<p>To deactivate the service name uniqueness constraint, do the following:</p>\n<ol>\n<li>Log in to the UCMDB Local Client using the UCMDB Local Client tool.</li>\n<li>Navigate to the <strong>CI Type Manager</strong> and make sure you are in the CI Types view.</li>\n<li>Navigate the tree structure to find <strong>Business Service CI</strong>.</li>\n<li>Double click to get Details and in the Identification section choose “<strong>No Identification</strong>”.</li>\n<li>Save and exit.<br/>\n<a class=\"image\" href=\"/file/images/3/36/SMAX202211_install_local_client_IaC_Gateway_Whitepaper.png\" title=\"/file/images/3/36/SMAX202211_install_local_client_IaC_Gateway_Whitepaper.png\"> <img alt=\"UCMDB Local Client\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/3/36/SMAX202211_install_local_client_IaC_Gateway_Whitepaper.png\" height=\"201\" hspace=\"0\" src=\"../../../images/SMAX202211_install_local_client_IaC_Gateway_Whitepaper_f4968f0b.png\" style=\"width:800px;height:201px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></li>\n</ol>\n<h2>Optional step: enable cost estimation for Terraform Plan</h2>\n<p>IaC Gateway supports the optional ability to estimate the cost of an input Terraform state. This calculation uses a third-party service called<strong> </strong>Infracost, and supports native AWS, Azure, and GCP resources provisioned through Terraform.</p>\n<p>Below are the steps to enable Infracost cost estimation on a tenant within IaC Gateway and allow it to be propagated into ESM.</p>\n<h3>Install Infracost</h3>\n<p>Install Infracost, register, and set up an API Key to get access. For details, see<a href=\"https://www.infracost.io/docs/\" title=\" Install Infracost\"> Install Infracost</a>.</p>\n<h3>Set up integration between IaC Gateway and Infracost</h3>\n<p>Call an IaC Gateway API to set up an integration between IaC Gateway and Infracost using the API Key you registered with Infracost.</p>\n<ul>\n<li>https://&lt;hostName&gt;/iac-controller/v1/&lt;tenantId&gt;/integration/infracost</li>\n<li>HTTP POST Method\n\t<ul>\n<li>Basic Authentication\n\t\t<ul>\n<li>Username - The username of the HTTP basic authentication. This user must be a member of the <strong>DND Administrators</strong> group.</li>\n<li>Password – The password for HTTP basic authentication.</li>\n</ul>\n</li>\n<li>Request Body\n\t\t<ul>\n<li>name – User specified name of the Infracost integration.</li>\n<li>apiKey – API key you received after installing and registering with Infracost.</li>\n<li>proxyConfig – This section is optional if you are not behind a proxy server.</li>\n<li>host – Hostname of your proxy server.</li>\n<li>port – Port of your proxy server.</li>\n<li>username – Option parameter if you need to authenticate with your proxy server.</li>\n<li>password – Option parameter if you need to authenticate with your proxy server.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<div><a class=\"image\" href=\"/file/images/1/1d/SMAX202211_Request_Body_IaC_Gateway_Whitepaper.png\" title=\"/file/images/1/1d/SMAX202211_Request_Body_IaC_Gateway_Whitepaper.png\"> <img alt=\"IaC Gateway API\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/1/1d/SMAX202211_Request_Body_IaC_Gateway_Whitepaper.png\" height=\"163\" hspace=\"0\" src=\"../../../images/SMAX202211_Request_Body_IaC_Gateway_Whitepaper_7cb6de82.png\" style=\"width:800px;height:163px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h3>Set up additional configuration options within ESM</h3>\n<p>Set up additional configuration options within ESM to get the estimated cost on the request. </p>\n<p>To do this, add a business rule in Studio to Request: </p>\n<ol>\n<li>Log in to the agent interface with the Tenant Admin account, and navigate to <strong>Administration</strong> &gt; <strong>Studio</strong>.</li>\n<li>Choose the <strong>Request</strong> record type from the drop-down list, and choose the <strong>Processes and Rules</strong> tab.</li>\n<li>In the top-level Request, add a business rule in the \"After change\" section.\n\t<ol start=\"1\">\n<li>Click the <strong>+Add</strong> button and choose “<strong>If…Then</strong>” Rule.</li>\n<li>In the Actions section, choose <strong>Set multiple fields</strong>, and then click <strong>OK</strong>.</li>\n<li>For the <strong>If </strong>expression, add <strong>If ${entity.RequestsOffering.Service.DisplayLabel=='IAC_SERVICE_DEFINITION'}</strong>.</li>\n<li>In the <strong>Set field values</strong> section, add the following fields:\n\t\t<ul>\n<li>Currency: set Expression Language and add <strong>${entity.UserOptions.CostCurrency_c}</strong></li>\n<li>Recurring period: set Expression Language and add <strong>${entity.UserOptions.RecurringPeriod_c}</strong></li>\n<li>Recurring price: set Expression Language and add <strong>${entity.UserOptions.RecurringPrice_c}</strong></li>\n<li>Price: set Expression Language and add <strong>${entity.UserOptions.InitialPrice_c}</strong><br/>\n<a class=\"image\" href=\"/file/images/2/23/SMAX202211_Price_Set_IaC_Gateway_Whitepaper.png\" title=\"/file/images/2/23/SMAX202211_Price_Set_IaC_Gateway_Whitepaper.png\"> <img alt=\"additional configurations options within ESM\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/2/23/SMAX202211_Price_Set_IaC_Gateway_Whitepaper.png\" height=\"458\" hspace=\"0\" src=\"../../../images/SMAX202211_Price_Set_IaC_Gateway_Whitepaper_23e5f3d2.png\" style=\"width:741px;height:458px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"741\"/> </a></li>\n</ul>\n</li>\n</ol>\n</li>\n<li>Click <strong>OK</strong> and then click the pencil icon and add a description for the rule.</li>\n<li>Move the Business Rule that you just created under the out-of-the-box Business Rule for Pricing by clicking the up arrows. <br/>\n<a class=\"image\" href=\"/file/images/a/ac/SMAX202211_offer_example_IaC_Gateway_Whitepaper.png\" title=\"/file/images/a/ac/SMAX202211_offer_example_IaC_Gateway_Whitepaper.png\"> <img alt=\"moving the business rule\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/a/ac/SMAX202211_offer_example_IaC_Gateway_Whitepaper.png\" height=\"164\" hspace=\"0\" src=\"../../../images/SMAX202211_offer_example_IaC_Gateway_Whitepaper_36c25b1b.png\" style=\"width:800px;height:164px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></li>\n</ol>\n<p><span style=\"color: rgb(0, 0, 0); font-family: Roboto, sans-serif; font-size: 20px;\">Integrate cost estimation into the Financial Management module</span></p>\n<p>An optional step is to integrate the cost estimation into the Financial Management module of ESM. This might give you additional tracking and some estimated cost insights. For information about an additional overview and the setup steps, see <a href=\"/doc/423/2022.05/finmanoverview\" title=\"Financial Management\">Financial Management</a>.</p>\n<h2>Known Issues of IaC Gateway</h2>\n<p>There might be certain scenarios that you get into where after the Terraform state file is saved into IaC Gateway and the request is issued to ESM, the request gets stuck, and IaC Gateway never gets a subscription id from ESM.</p>\n<p>If you run into this issue, you can resolve it by issuing a couple of APIs calls.</p>\n<h3>API calls</h3>\n<p>First, run a GET API call to retrieve Terraform state file data out of the database to ensure that the state entries are there in the database, and then run a DELETE API call to remove the state entries from the database.</p>\n<ol>\n<li>Run a GET API call to retrieve Terraform state data to validate that the Terraform state entry is in the database.\n\t<ul>\n<li class=\"15\">https://&lt;hostName&gt;/iac-controller/v1/&lt;tenantId&gt;/ terraform/&lt;terraform-state-name&gt;/backend\n\t\t<ul>\n<li>GET Method</li>\n<li>Basic Authentication\n\t\t\t<p>Partial example output from GET Call:</p>\n<div><a class=\"image\" href=\"/file/images/b/b4/SMAX202211_Get_Call_IaC_Gateway_Whitepaper.png\" title=\"/file/images/b/b4/SMAX202211_Get_Call_IaC_Gateway_Whitepaper.png\"> <img alt=\"a GET API call to retrieve Terraform state file data\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/b/b4/SMAX202211_Get_Call_IaC_Gateway_Whitepaper.png\" height=\"178\" hspace=\"0\" src=\"../../../images/SMAX202211_Get_Call_IaC_Gateway_Whitepaper_234c247b.png\" style=\"width:800px;height:178px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<ul>\n<li>Username - The username of the HTTP basic authentication. This user must be a member of the <strong>DND Administrators</strong> group.</li>\n<li>Password – The password for HTTP basic authentication.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Run a DELETE API call to remove entries from the database.\n\t<ul>\n<li class=\"15\">https://&lt;hostName&gt;/iac-controller/v1/&lt;tenantId&gt;/ terraform/&lt;terraform-state-name&gt;/backend\n\t\t<ul>\n<li>DELETE Method</li>\n<li>Basic Authentication\n\t\t\t<ul>\n<li>Username - The username of the HTTP basic authentication. This user must be a member of the <strong>DND Administrators</strong> group.</li>\n<li>Password – The password for HTTP basic authentication.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n</ol>\n<h3>Optional step</h3>\n<p>Some of the CIs may not show up in the Native SACM UI because they aren't included in the out-of-the-box configuration of CMS.</p>\n<p>If you find that there are discrepancies between the topology in UD/UCMDB and what's in Native SACM, you can change the out-of-the-box configuration to add those CIs to be included in ESM. </p>\n<ol>\n<li>Log in to the UCMDB Local Client using the local client or through the browser.</li>\n<li>Navigate to <strong>Modeling Studio</strong> on the left-side navigation.</li>\n<li>Make sure you are in the Resources view, click <strong>Resources </strong>on the top of the screen.</li>\n<li>In the tree view, expand SMAX Topology and double click <strong>SMAX_Direct_Linked_CI</strong>.</li>\n<li>Click the <strong>Direct_Linked_CI</strong> Icon in the canvas and click <strong>Edit</strong> in the lower right corner.\n\t<div><a class=\"image\" href=\"/file/images/3/30/SMAX202211_Modeling_Studio_IaC_Gateway_Whitepaper.png\" title=\"/file/images/3/30/SMAX202211_Modeling_Studio_IaC_Gateway_Whitepaper.png\"> <img alt=\"the UCMDB Local Client\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/3/30/SMAX202211_Modeling_Studio_IaC_Gateway_Whitepaper.png\" height=\"389\" hspace=\"0\" src=\"../../../images/SMAX202211_Modeling_Studio_IaC_Gateway_Whitepaper_27aacb02.png\" style=\"width:800px;height:389px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n</li>\n<li>Click the <strong>Element Type</strong> view on the top right area.</li>\n<li>In the tree view on the left side, find the CI Type that you want to add.\n\t<div><a class=\"image\" href=\"/file/images/7/75/SMAX202211_CI_Type_IaC_Gateway_Whitepaper.png\" title=\"/file/images/7/75/SMAX202211_CI_Type_IaC_Gateway_Whitepaper.png\"> <img alt=\"find the CI Type that you want to add\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/7/75/SMAX202211_CI_Type_IaC_Gateway_Whitepaper.png\" height=\"446\" hspace=\"0\" src=\"../../../images/SMAX202211_CI_Type_IaC_Gateway_Whitepaper_5abfd027.png\" style=\"width:800px;height:446px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n</li>\n<li>Click the<strong> CI Type</strong> and in the Condition drop-down choose <strong>Include &lt;CI Type Name&gt; in the query</strong>.</li>\n<li>Make sure the <strong>By CI types</strong> radio button and the check box <strong>Apply this condition recursively</strong> are chosen.</li>\n<li>Click <strong>OK</strong> and then the <strong>Save</strong> Icon on the top left.\n\t<p>The figure below shows an example of Amazon EC2 Config.</p>\n<div><a class=\"image\" href=\"/file/images/8/82/SMAX202211_Amazon_EC2_IaC_Gateway_Whitepaper.png\" title=\"/file/images/8/82/SMAX202211_Amazon_EC2_IaC_Gateway_Whitepaper.png\"> <img alt=\"an example of Amazon EC2 Config\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/8/82/SMAX202211_Amazon_EC2_IaC_Gateway_Whitepaper.png\" height=\"448\" hspace=\"0\" src=\"../../../images/SMAX202211_Amazon_EC2_IaC_Gateway_Whitepaper_cc1e3b1b.png\" style=\"width:800px;height:448px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}