{
  "title": "Upload container images for UD/UCMDB to a registry (OpenShift)",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p><span style=\"letter-spacing: 0.15pt; font-family: Arial, sans-serif; font-size: 11.5pt;\">Upload the installation images to your image registry. The image registry is a local registry on your cluster nodes or an external registry, such as your enterprise repository.</span></p>\n<p>To upload the images:</p>\n<ol>\n<li>Log on to one of the bastion nodes.</li>\n<li>On the bastion node, go to the <code>$CDF_HOME/scripts/</code> directory. Run the following command:<br/>\n<code>cd $CDF_HOME/scripts</code></li>\n<li>Run the following command to upload the suite images to the local registry:<br/>\n<code>./uploadimages.sh [-r &lt;image repository URL&gt;] [-u &lt;username&gt;]  [-d &lt;image download directory&gt;</code><br/>\n\tWhere:\n\t<ul>\n<li>&lt;image repository URL&gt;: Specify the <code>-r</code> option if you want to upload the images to an external registry other than the local registry.</li>\n<li>Replace &lt;<i>username</i>&gt; with the registry username.  Use the \"registry-admin\" user for the local registry. The local registry refers to the default registry or the registry URL that is \"localhost:5000 \".</li>\n<li>If you do not specify the credentials here, you will be prompted to specify them when you run the command.</li>\n<li>&lt;image download directory&gt;: The directory where the container images will be downloaded. The default value is /var/opt/kubernetes/offline. The <code>-d</code> option is the image directory where you placed the images you have downloaded. Specify the <code>-d </code> option if the images are not available in the <code>/var/opt/kubernetes/offline/</code> directory. You can use the <code>-d</code> option multiple times when the images are in different directories. However, if you have specified the <code>-l</code> option to \"false\", then you can only specify one image directory. The images can be either the images download by the <code>downloadimages.sh</code> or the images generated by <code>docker save</code>. However, if there are both, the <code>uploadimages.sh</code> script will not upload the images generated by <code>docker save</code>. Only the .tar, .tgz, and .tar.gz images are supported. Make sure the image file type matches the file extension. </li>\n</ul>\n<p>To see the full list of options for the <code>uploadimages.sh</code> command, run the following command:<br/>\n<br/>\n<code>./uploadimages.sh -h </code><br/>\n\tFor example: </p>\n<pre><code>./uploadimages.sh -y -c 4 -u registry-admin</code></pre>\n<p><br/>\n\tThe <code>-p</code> option is the password of the \"registry-admin\" user. The initial value of the \"registry-admin\" password is the password you set while you run the <code>install</code> to install OPTIC Management Toolkit (OMT). You can also change the registry-admin password with the script <code>$CDF_HOME/scripts/updateLocalRegistryInfo.sh</code>.</p>\n<div class=\"Admonition_Note\"><span class=\"autonumber\">Note</span><br/>\n\tBy selecting the -p option, you are disabling or bypassing security features, thereby exposing the system to increased security risks. By using this option, you understand and agree to assume all associated risks and hold <code>OpenText</code> harmless for the same.<br/>\n<code>OpenText</code> encourages you to use some other password options, which are not provided by <code>OpenText</code>. By implementing the -p option, you may expose the system to increased security risks. You understand and agree to assume all associated risks and hold <code>OpenText</code> harmless for the same. It remains at all times your sole responsibility to assess its own regulatory and business requirements. <code>OpenText</code> does not represent or warrant that its products comply with any specific legal or regulatory standards applicable to you in conducting your business.</div>\n</li>\n<li>Wait until the images are successfully uploaded. Your terminal resembles the following:\n\t<pre>Upload-process successfully completed.\n</pre>\n</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}