{
  "title": "Download container images for UD/UCMDB (OpenShift)",
  "content": "<div class=\"mw-parser-output\"><span class=\"snippet-start\" data-sname=\"423-25.4-423-25.3-DownloadSuiteImagesHelm|intro|N\"></span><p>To install an application, you will need to download the required installation images. You need:</p>\n<ul>\n<li>Generate an image download tool package</li>\n<li>Run the download script inside the tool package to download the required installation images.</li>\n</ul>\n<p><br/>\n</p><span class=\"snippet-end\" data-sname=\"423-25.4-423-25.3-DownloadSuiteImagesHelm|intro|N\"></span><h2 id=\"Generate_the_download_bundle\">Generate the download bundle</h2><p>The <code>generate_download_bundle.sh</code> compares the images listed in the <code>image-set.json</code> file with the images that already exist in the specified image organization of the specified registry. It will only download the missing images.</p><ol><li>Log on to the first bastion node.</li><li>Run the following command to change the directory. \n\t<pre><code>cd  ${CDF_HOME}/tools/generate-download</code></pre></li><li>Run the command together with the options required by your deployment. For example, run the following command:\n\t<pre><code>./generate_download_bundle.sh --chart &lt;UCMDB helm chart file&gt; -o &lt;org name&gt; [-d &lt;destination dir&gt;]</code></pre><br/>\n\tWhere:\n\t<ul><li><code>&lt;UCMDB helm chart file&gt;</code>: The absolute path to the downloaded UD/UCMDB helm chart package.</li><li><code>&lt;org name&gt;</code>: The organization in the image registry that contains the images for installation. By default, it is \"hpeswitom\".</li><li><code>&lt;destination dir&gt;</code>: The directory where the output .zip file is created. The default location is the current directory.</li></ul></li></ol><p>The generate_download_bundle.sh compares the images needed by the suite with the images that already exist in the cluster, and generates a .zip file, offline-download.zip, that enables you to download the required images from Docker Hub.<br/>\nFor example:</p><pre><code>./generate_download_bundle.sh --chart UCMDB_Helm_Chart-2x.x/ucmdb-helm-charts/charts/ucmdb-1.xx.x-xxx+2x.x.x.tgz -o hpeswitom</code></pre><p><br/>\nThe <code>offline-download.zip</code> is placed under the current working directory unless the \"<code>-d</code>\" option is specified. You receive the following messages indicating that you have successfully generated the offline-download.zip file:</p><pre>[INFO] 2020-07-31 17:58:46 : ** Generating the offline image download bundle ...\n[INFO] 2020-07-31 17:58:50 : Completed generation of offline-download.zip in /tmp\n</pre><h2>Download the required installation images</h2><ol><li>Log on to the first bastion node. If the first bastion node cannot access Docker Hub, transfer the  <code>offline-download.zip</code>  file to a Linux server that can access Docker Hub.</li><li>Extract the .zip package to a directory. If you cannot access Docker Hub directly, set up the HTTP/HTTPS proxy. For example, run the following commands to set the HTTP/HTTPS proxy. Replace the placeholders with your actual server and port. <br/><code>export http_proxy=\"&lt;http://PROXY_SERVER:PORT&gt;\"<br/>\n\texport https_proxy=\"&lt;https://PROXY_SERVER:PORT&gt;\"</code></li><li>Go to the directory where you extracted the <code>offline-download.zip</code> package.</li><li>Run the following command:<br/>\n\t \n\t<pre><code>./downloadimages.sh [-r &lt;image repository URL&gt;] [-u &lt;username&gt;]  [-d &lt;image download directory&gt;] [-c on|off]</code></pre><br/>\n\tWhere:\n\t<ul><li>&lt;image repository URL&gt;: Specify the <code>-r</code> option if you want to download the images from a repository other than Docker Hub.</li><li>Replace &lt;<i>username</i>&gt; with the Docker Hub username.</li><li>If you do not specify the credentials here, you will be prompted to specify them when you run the command.</li><li>&lt;image download directory&gt;: The directory where the container images will be downloaded. The default value is /var/opt/kubernetes/offline.</li><li>The <code>-c</code> option is used to verify the digital signature of the images during the download. The default setting is off, which does not verify the signature.</li></ul></li></ol><p>To see the full list of options for the downloadimages.sh command, run the following command:<br/><code>./downloadimages.sh -h</code><br/>\nThe command also has a <code>-p</code> option to provide your password. The <code>-p</code>  option does not support single quotes (that is, do not include single quotes in the password).</p><div class=\"Admonition_Note\"><p><span class=\"autonumber\">Note</span><br/>\nBy selecting the -p option, you are disabling or bypassing security features, thereby exposing the system to increased security risks. By using this option, you understand and agree to assume all associated risks and hold <code>OpenText</code> harmless for the same.</p><code>OpenText</code> encourages you to use some other password options, which are not provided by <code>OpenText</code>. By implementing the -p option, you may expose the system to increased security risks. You understand and agree to assume all associated risks and hold <code>OpenText</code> harmless for the same. It remains at all times your sole responsibility to assess its own regulatory and business requirements. <code>OpenText</code> does not represent or warrant that its products comply with any specific legal or regulatory standards applicable to you in conducting your business.</div><h2>Transfer the images to the bastion node</h2><p>If you downloaded the images to a server other than the first bastion node, transfer the images to a directory on the first bastion node. By default, the images should be placed under the  <code>/var/opt/kubernetes/offline</code> directory.</p><p><b>Note</b>:<br/>\nThe images will be uploaded by the <code>uploadimages.sh</code> script later. The image upload requires up to 2 times of the image size space in the target image directory. For example, if you choose to use the default <code>/var/opt/kubernetes/offline</code> directory, ensure that you have 2 times of the OMT and suite image size space under <code>/var/opt/kubernetes/offline</code> directory of the bastion node.  <br/>\n </p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}