{
  "title": "Upload container images for UD/UCMDB to a registry",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><span class=\"snippet-start\" data-sname=\"423-25.4-423-25.3-UploadInstallationImagesHelm||N\"></span><div class=\"transcontent lst-ITOM_Container_Deployment_Foundation:24.2/UploadInstallationImagesHelm\">\n<div class=\"transcontent stn-begin--intro\"> </div>\n<p>Upload the installation images to your image registry. The image registry is a local registry on your cluster nodes or an external registry, such as your enterprise repository.</p>\n<div class=\"transcontent stn-end--intro\"> </div>\n<div class=\"transcontent stn-begin--UploadImages\"> </div>\n<p>To upload the images:</p>\n<ol>\n<li>Log on to the control plane node where you downloaded or copied the images.</li>\n<li>Run the following command to the <code>$CDF_HOME/scripts/</code> directory:\n\t<pre><code>cd $CDF_HOME/scripts</code></pre>\n</li>\n<li>Run the following command to upload the suite images to the local registry:\n\t<pre><code>./uploadimages.sh [-r &lt;image repository URL&gt; -u &lt;username&gt; -d &lt;image download directory&gt; -o &lt;org name&gt;]</code></pre>\n<p> <br/>\n\tWhere:\n</p>\n<ul>\n<li>&lt;image repository URL&gt;: Specify the <code>-r</code> option if you want to upload the images to an external registry other than the local registry.</li>\n<li>Replace &lt;<i>username</i>&gt; with the registry username.  Use the <code>registry-admin</code> user for the local registry. The local registry refers to the default registry or the registry URL that's <code>localhost:5000</code>.</li>\n<li>If you don't specify the credentials here, the <code>./uploadimages.sh</code> script prompts you to specify them when you run the command.</li>\n<li>&lt;image download directory&gt;: The directory where the script downloads the container images. The default value is <code>/var/opt/cdf/offline</code>. The <code>-d</code> option is the image directory where you placed the downloaded images. Specify the <code>-d </code> option if the images aren't available in the <code>/var/opt/cdf/offline/</code> directory. You can use the <code>-d</code> option multiple times when the images are in different directories. The images can be the images downloaded by the <code>downloadimages.sh</code>. Make sure the image file type matches the file extension. </li>\n<li><code>&lt;org name&gt;</code>: The organization in the image registry that contains the images for installation. By default, this is <code>hpeswitom.</code> This option is mandatory if you aren't using the default organization name.</li>\n<li><code>--cleanup</code>: Delete the image source folder to save disk space. It only works when all images are uploaded successfully.</li>\n</ul>\n<p>To see the full list of options for the <code>uploadimages.sh</code> command, run the following command:<br/>\n<br/>\n<code>./uploadimages.sh -h </code><br/>\n\tFor example: </p>\n<pre><code>./uploadimages.sh -y -c 4 -u registry-admin</code></pre>\n<p><br/>\n\tThe <code>-p</code> option is the password of the <code>registry-admin</code> user. The initial value of the <code>registry-admin</code> user password is the password you set while you run the <code>install</code> to install OMT. You can also change the <code>registry-admin</code> user password with the script <code>$CDF_HOME/scripts/updateLocalRegistryInfo.sh</code>.</p>\n<div class=\"Admonition_Note\"><span class=\"autonumber\">Note: </span>OpenText encourages you to use some other password options, which aren't provided by OpenText. By implementing the -p option, you may expose the system to increased security risks. You understand and agree to assume all associated risks and hold OpenText harmless for the same. It always remains your sole responsibility to assess its own regulatory and business requirements. OpenText doesn't represent or warrant that its products comply with any specific legal or regulatory standards applicable to you in conducting your business.</div>\n</li>\n<li>Wait until the images are successfully uploaded. Your terminal resembles the following:\n\t<pre>Upload-process successfully completed.\n</pre>\n</li>\n</ol>\n<div class=\"transcontent stn-end--UploadImages\"> </div>\n</div><span class=\"snippet-end\" data-sname=\"423-25.4-423-25.3-UploadInstallationImagesHelm||N\"></span></div><p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}