{
  "title": "Built-in actions",
  "content": "<div class=\"mw-parser-output\"><br/><p>This page describes the built-in actions that you can use when working with integration scenarios. Unlike actions associated with <a href=\"/doc/423/26.1/xiesupportedconnectors\" title=\"Connectors\">connectors</a>, built-in actions are available to all scenarios by default, and don't require you to add any connector in the integration. When you add a scenario rule and open the <strong>Select action</strong> form, you can find built-in actions in these categories:</p>\n<ul>\n<li>Local system</li>\n<li>Common</li>\n</ul>\n<p>In the following sections, we refer to these actions by using their category names: local system actions and common actions.</p>\n<h2 id=\"Local\">Local system actions</h2>\n<p>Local system actions enable you to call Service Management REST APIs against the current Service Management system. The following lists the available local system actions.</p>\n<h3>Case Exchange API actions</h3>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Action</th>\n<th scope=\"col\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Get attachment</td>\n<td>Gets an attachment by specifying an FRS id.</td>\n</tr>\n<tr>\n<td>\n<p>Upload attachment</p>\n</td>\n<td>\n<p>Uploads a multipart file attachment. The multipart POST method does not accept any query parameters. You must specify the files[] key in the File parameter section.</p>\n</td>\n</tr>\n<tr>\n<td>Manage record</td>\n<td>\n<p>Creates, updates, or resolves records by using the Service Management CES API. Supported record types are Change, Incident, Problem, and Request.</p>\n<p><strong>Example</strong>: Create, update, and resolve records in the target system with the advanced functions provided by the <a href=\"/doc/423/26.1/caseexchangeapi\" title=\"Case Exchange REST API\">CES API</a>. </p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3>Cloud Service API actions</h3>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Action</th>\n<th scope=\"col\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Manage cloud service data</td>\n<td>Creates or updates multiple cloud service data. Maximum 50 records in a call. Using this action will execute a POST request against the API: <code>/rest/&lt;TenantId&gt;/cloud-service/syncData</code>.</td>\n</tr>\n</tbody>\n</table>\n<h3>Comments API actions</h3>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Action</th>\n<th scope=\"col\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Create comment</td>\n<td>\n<p>Creates one single comment by using the <a href=\"/doc/423/26.1/commentsapi\" title=\"Comments API\">Comments API</a>. </p>\n<p><strong>Example</strong>: Create a standalone comment without updating other properties of a record. </p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3>Manage Persons API actions</h3>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Action</th>\n<th scope=\"col\">Description</th>\n</tr>\n<tr>\n<td>\n<p>Create or update persons (single (v1))</p>\n</td>\n<td>\n<p>Creates or updates person records by using the<a href=\"/doc/423/26.1/managepersonsapi\" title=\"Manage Persons API\"> Manage Persons API</a> from Service Management.</p>\n<p>The action enables you to specify only one role and one functional group.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Create or update persons (single (v2))</p>\n</td>\n<td>\n<p>Creates or updates person records by using the<a href=\"/doc/423/26.1/managepersonsapi\" title=\"Manage Persons API\"> Manage Persons API</a> from Service Management. </p>\n<p>This action allows you to specify several roles, functional groups, and licenses.</p>\n</td>\n</tr>\n<tr>\n<td>Create or update persons (bulk)</td>\n<td>\n<p>Creates, updates, or deletes person records in bulk using the <a href=\"/doc/423/26.1/managepersonsapi\" title=\"Manage Persons API\">Manage Persons API</a> from Service Management. At maximum 50 records are allowed in one bulk operation.</p>\n<p>This action allows you to specify several roles, functional groups, and licenses.</p>\n</td>\n</tr>\n<tr>\n<td>Get job status for Manage Persons</td>\n<td>Gets the status of the job associated with the Manage Persons action that you executed previously. Using this action will execute a GET request against this API: <code>/rest/&lt;TenantId&gt;/ums/managePersonsJobStatus/$JOBID</code>. Please refer to the Manage Persons API specifications in the documentation.</td>\n</tr>\n</thead>\n</table>\n<h3>Impersonation API actions</h3>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Action</th>\n<th scope=\"col\">Description</th>\n</tr>\n<tr>\n<td>\n<p>Create comment</p>\n</td>\n<td>\n<p>Creates a comment by impersonating the end user. Please refer to the comments API specifications in the documentation. Using this action will execute a POST request against the comments API: <code>/rest/&lt;TenantId&gt;/ess/impersonation/Request/$EntityId/addComments?impersonate=&lt;User Id&gt;</code>. </p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Create request</p>\n</td>\n<td>\n<p>Creates a request by impersonating the end user. The integration user needs to have the OPB/Integration Administrator permission to impersonate the end user. Using this action will execute a POST request against the EMS API: <code>/rest/&lt;TenantId&gt;/ess/impersonation/createRequest?impersonate=&lt;User Id&gt;</code>. <br/>\n<strong>Note</strong>: If you don't add RequestBy or RequestFor property for the request, then the impersonate user will be set as the RequestBy or RequestFor person.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Perform IDOL search</p>\n</td>\n<td>\n<p>Returns results from an IDOL search by impersonating the end user. </p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Perform User action</p>\n</td>\n<td>\n<p>Performs a user action by impersonating the end user. Using this action will execute a POST request against the EMS API: <code>/rest/&lt;TenantId&gt;/ess/impersonation/userAction?impersonate=&lt;User Id&gt;</code>. </p>\n</td>\n</tr>\n</thead>\n</table>\n<h3>Aviator API actions</h3>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Action</th>\n<th scope=\"col\">Description</th>\n</tr>\n<tr>\n<td>\n<p>Start chat</p>\n</td>\n<td>\n<p>Sends message with context data to Aviator.</p>\n</td>\n</tr>\n<tr>\n<td>Get conversation by reference tag</td>\n<td>Gets a conversation based on the reference tag.</td>\n</tr>\n<tr>\n<td>Create conversation</td>\n<td>Creates a conversation.</td>\n</tr>\n</thead>\n</table>\n<h3>Search API actions</h3>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Action</th>\n<th scope=\"col\">Description</th>\n</tr>\n<tr>\n<td>\n<p>Perform IDOL search</p>\n</td>\n<td>\n<p>Returns results from an IDOL search.</p>\n</td>\n</tr>\n</thead>\n</table>\n<h3>Virtual Agent API actions</h3>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Action</th>\n<th scope=\"col\">Description</th>\n</tr>\n<tr>\n<td>\n<p>Query</p>\n</td>\n<td>\n<p>Gets the response from the Virtual Agent.</p>\n</td>\n</tr>\n</thead>\n</table>\n<h3>SAM API actions</h3>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Action</th>\n<th scope=\"col\">Description</th>\n</tr>\n<tr>\n<td>Create or update license</td>\n<td>Creates or updates a license record and the associated license model (if not exist).</td>\n</tr>\n<tr>\n<td>\n<p>Create license consumption</p>\n</td>\n<td>\n<p>Creates license consumption in SAM.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Create or update user entitlement</p>\n</td>\n<td>\n<p>Creates or updates a user entitlement in SAM.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Initialize user entitlement</p>\n</td>\n<td>\n<p>Initializes user entitlement for existing products.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Update job status</p>\n</td>\n<td>\n<p>Updates job status.</p>\n</td>\n</tr>\n</thead>\n</table>\n<h3>Operations Orchestration Central API actions</h3>\n<div>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>The Operations Orchestration Central APIs are available from version 25.2.1.</div></div></div>\n</div>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Action</th>\n<th scope=\"col\">Description</th>\n</tr>\n<tr>\n<td>Retrieve entitlements</td>\n<td>\n<p>Retrieves the entitlements for the requested roles and paths. </p>\n<p>This action sends the following GET request:</p>\n<p><code>/oo/rest/v1/&lt;TenantId&gt;/roles/&lt;rolesNames&gt;/entitlements/&lt;path&gt;</code></p>\n</td>\n</tr>\n<tr>\n<td>Change the status of an execution</td>\n<td>\n<div>Updates the status of existing executions. Each request includes an action and its associated data. You can set the status of one or more executions in the same call. You can change the run status if the following conditions are met:</div>\n<ul>\n<li>The user has the <strong>Run </strong>permission (entitlement) for the executed flow.</li>\n<li>The run is either currently assigned to the user or the user has the <strong>Manage Others' Runs</strong> permission.</li>\n</ul>\n<div><strong>Note: </strong>You cannot change the status of an execution using this API in the following scenarios:</div>\n<ul>\n<li>The execution has completed.</li>\n<li>If the status you are trying to set is the same as the current status of the ongoing execution. For example, If the current execution status is <strong>Running</strong>, you cannot set it to <strong>Running</strong>. </li>\n</ul>\n<div>This action sends the following PUT request:</div>\n<div><code>/oo/rest/v1/&lt;TenantId&gt;/executions/&lt;executionIds&gt;/status</code></div>\n</td>\n</tr>\n<tr>\n<td>Execute a flow by UUID</td>\n<td>\n<p>Starts a flow using its UUID in Operations Orchestration. The flow input parameter depends on the selected flow.</p>\n<p>This action sends the following POST request:</p>\n<p><span>/oo/rest/v1/&lt;TenantId&gt;/executions</span></p>\n</td>\n</tr>\n<tr>\n<td>Get execution log</td>\n<td>\n<p>Gets a detailed summary of a specific execution, including additional information such as, inputs and outputs. This API is an extension of the <em>Execution Summary API</em> .</p>\n<p>This action sends the following GET request:</p>\n<p><code>/oo/rest/v1/&lt;TenantId&gt;/executions/&lt;executionId&gt;/execution-log</code> </p>\n</td>\n</tr>\n</thead>\n</table>\n<h2 id=\"Common\">Common actions</h2>\n<p>Unlike other actions, which correspond to REST API calls against the local system or a target system, common actions assist the formulation of the scenario logic by providing the following capabilities:</p>\n<ul>\n<li>Data management</li>\n<li>Logic control</li>\n<li>Scenario execution control</li>\n<li>Sending HTTP responses</li>\n</ul>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div><em>rule</em><em>action</em></div></div></div>\n<p><strong>Data management actions</strong></p>\n<p>Actions in this category enable you to manage (define, change, etc.) object properties that can be used by other actions. This category includes these actions: <strong>Prepare Data</strong>, <strong>Change Data</strong>, <strong>Store Data</strong>. The <a href=\"/doc/423/26.1/xieobjects\" title=\"Objects\">Objects</a> page contains more information about how you can use these actions as well as other Integration Studio functionalities to define, change, store, retrieve, and reference data.</p>\n<p><strong>Logic control actions</strong></p>\n<p>Actions in this category enable you to control the flow of a collection of rules—whether, when, or how these rules will be run.</p>\n<p>On the scenario configuration UI, logic control rules have a block structure, with rules that are controlled by them nested inside the rule block. The rule block for logic control rules can contain logic control rules, forming a rules hierarchy. The Integration Studio supports 12 levels of nested rules.</p>\n<p>Logic control actions can be further categorized as conditional actions (<strong>If</strong>, <strong>Else</strong>), loop actions (<strong>Apply to Each</strong>, <strong>Do Until</strong>), and error handling actions (<strong>Try-Catch</strong>).</p>\n<p><strong>Scenario execution control actions</strong></p>\n<p>Actions in this category enable you to control the scenario execution. For example, pausing the scenario execution for a certain amount of time (<strong>Sleep</strong>).</p>\n<p><strong>Send response action</strong></p>\n<p>The <strong>Send Response</strong> action enables you to send HTTP responses with data in the payload for synchronous scenarios.  </p>\n<h3>Prepare Data</h3>\n<p>Use this action to define <a href=\"/doc/423/26.1/xieobjects\" title=\"Objects\">object</a> properties that can be referenced in subsequent rules or fields.</p>\n<p>To define an object:</p>\n<ol>\n<li>Enter a name for the object.</li>\n<li>Click <strong>Add Property</strong> to add key-value pairs for the properties of the object.</li>\n<li>Enter the key and value in the respective field for each property.</li>\n</ol>\n<p>See <a href=\"/doc/423/26.1/xieobjects#PrepareData\" title=\"Prepare Data example\">Prepare Data example</a> for an example of how to define and reference object properties created by using this action.</p>\n<h3>Change Data</h3>\n<p>Use this action to change the value of object properties defined in preceding rules.</p>\n<p>To change a property value:</p>\n<ol>\n<li>Click <strong>Add Property</strong>.</li>\n<li>In the <strong>key</strong> field, select a property whose value you want to change.</li>\n<li>Enter the new value in the <strong>value</strong> field.</li>\n</ol>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div><strong>Prepare Data</strong><strong>Store Data</strong></div></div></div>\n<h4 id=\"set_label\">Use label to track a certain property value in scenario history</h4>\n<p>The Integration Studio provides a <code>label </code>property in the scenario-level execution history. You can set a <code>label</code> to highlight a certain aspect of your scenario execution. For example, if your scenario contains loop rules, you can set the label in the loop rule block to track the value of a property in each iteration. Knowing the property value in the failing rule might help troubleshoot in case the scenario fails. The <code>label</code> property has a default value (the name of the triggering record type and record Id; for example \"Incident 15964\") only for scenarios triggered by business rules.</p>\n<p>To set a label, add a <strong>Change Data</strong> rule, add a property, select <code>currentScenario.label</code> as the key, and then enter the label value in the <strong>value</strong> field.</p>\n<h3>Store Data</h3>\n<p>Use this action to define \"stored\" object properties that can be referenced in subsequent runs of the same scenario (Scenario scope) or in another scenario of the same integration (Integration scope).</p>\n<p>To define a stored object:</p>\n<ol>\n<li>Select the scope for the object: <strong>Integration</strong> or <strong>Scenario</strong>.</li>\n<li>Enter a name for the object.</li>\n<li>Click <strong>Add Property</strong> to add key-value pairs for the properties of the object.</li>\n<li>Enter the key and value in the respective field for each property.</li>\n</ol>\n<p>Note the following:</p>\n<ul>\n<li>You can use the <a href=\"/doc/423/26.1/keyexpressionsxie\" title=\"JSON payload expressions\">JSON payload expressions</a> in the property <strong>key</strong> fields to construct child objects in the object.</li>\n<li>You can use the expression language in the <b>Object name</b> field to dynamically create different objects, for different records that triggered the integration, for example.</li>\n</ul>\n<p>See <a href=\"/doc/423/26.1/xieobjects#StoreData\" title=\"Store Data example\">Store Data example</a> for an example of how to define and reference object properties created by using this action.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div><strong>Store Data</strong></div></div></div>\n<h4>Clean up stored data</h4>\n<p>The objects defined via the <strong>Store Data</strong> rule (referred to as \"stored data\") are temporary in nature. They will expire in 30 days (starting from the last time when the Store Data rule that defines the object is executed). The system will clean up the data after they expire.</p>\n<p>The system also has a limit for how many objects you can create, which is 60,000 for both integration- and scenario-scoped objects in an integration or scenario, respectively. If you have reached this limit and want to use <strong>Store Data</strong> rules to create new objects, you can use the <strong>Manage stored data</strong> action on the Integration page to delete the objects that you no longer need.</p>\n<h3>If/If-Else</h3>\n<p>The <strong>If</strong> action can be used to group actions that share the same execution condition. The actions nested inside the <strong>If</strong> block are executed when the condition of the <strong>If</strong> rule evaluates to <code>true</code>.</p>\n<p>You can add an <strong>Else</strong> rule after an <strong>If</strong> rule to dictate what actions to execute when the condition specified in the <strong>If </strong>rule evaluates to <code>false</code>. The <strong>Else</strong> rule is optional—you can have an If rule without the corresponding <strong>Else</strong> rule. You can add the <strong>Else</strong> rule only from the menu of an <strong>If</strong> rule—the <strong>Else </strong>action isn't available in the Actions list that the system displays when you add a rule.</p>\n<p>Note that when you remove an <strong>If</strong> rule that has an <strong>Else</strong> rule added, the system also removes the corresponding <strong>Else</strong> rule.</p>\n<h4>Using the If rule versus specifying conditions on individual rules</h4>\n<p>You can also specify a condition on normal rules (except for logic control rules) to implement the conditional logic.</p>\n<p>Here are the guidelines for when to use which condition-setting method:</p>\n<ul>\n<li>Specify a condition on individual rules when the condition controls the execution of only a single rule.</li>\n<li>Use the If rule when you need to use the condition to control the execution of multiple rules. </li>\n</ul>\n<h3>Apply to Each</h3>\n<p>This action executes a collection of actions nested inside it for each item in the input array. Typically, the input array comes from the response data of a preceding rule; this way, you can iterate through the data you retrieved from another system and perform various operations against the data.</p>\n<p>You can use the value of the items from the input array in the nested rules. To do this, reference the item for the current iteration by using <code>item</code> in the expression you enter in the Value field for one of the nested rules. For example, if the input array is <code>['1', '2', '3']</code>, and you use <code>item</code> in the expression for one of the input parameters of a rule, the Integration Studio assigns <code>'1'</code> to <code>item</code> in the first iteration, <code>'2'</code> in the second iteration, and so on.</p>\n<p>If you want to pass data produced by each iteration of the <strong>Apply to Each</strong> rule to subsequent rules, you can configure the <strong>Apply to Each</strong> rule to allow output data. To do this, select <strong>Enable output data</strong> from the menu of the <strong>Apply to Each</strong> rule. The Integration Studio then adds an <strong>Output Data</strong> rule at the end of the <strong>Apply to Each</strong> rule block.</p>\n<p>Note the following for the <strong>Output Data</strong> rule:</p>\n<ul>\n<li>The system doesn't allow you to change the position of this rule.</li>\n<li>To remove the rule, select <strong>Disable output data</strong> from the menu of the parent rule.</li>\n</ul>\n<h3>Do Until</h3>\n<p>This action repeatedly executes a collection of actions nested inside it until the exit condition (configured on the header bar of the rule) is satisfied. Note that in each iteration, the Integration Studio evaluates the exit condition after running the nested rules; this means that the nested rules will be run at least once.</p>\n<p>If you want to pass data produced by each iteration of the <strong>Do Until</strong> rule to subsequent rules, you can configure the <strong>Do Until</strong> rule to allow output data. To do this, select <strong>Enable output data</strong> from the menu of the <strong>Do Until </strong>rule. The Integration Studio then adds an <strong>Output Data</strong> rule at the end of the <strong>Do Until</strong> rule block.</p>\n<p>Note the following for the <strong>Output Data</strong> rule:</p>\n<ul>\n<li>The system doesn't allow you to change the position of this rule.</li>\n<li>To remove the rule, select <strong>Disable output data</strong> from the menu of the parent rule.</li>\n</ul>\n<h3 id=\"Try-Catch\">Try-Catch</h3>\n<p>This pair of actions can be used to implement error-handling logic. Both actions have a block structure. The Integration Studio will attempt to execute rules contained in the <strong>Try</strong> block. If all rules in the <strong>Try</strong> block are executed successfully, it will skip the <strong>Catch</strong> block. Otherwise, if the Integration Studio encounters an error while executing any rule in the <strong>Try</strong> block, it will skip the remaining rules in the <strong>Try</strong> block, and execute the rules in the <strong>Catch</strong> block. In the <strong>Catch</strong> block, you can add specific error-handling rules, like creating an incident in Service Management or sending an email to the user.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>The Integration Studio deems the following as errors: failure to construct the request data to be sent, the target system unreachable, the received response data contains an error code (larger than 300), failure to parse the response data, expression evaluation errors.</div></div></div>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>The setting \"Stop processing upon failure\" of a rule affects whether the error will be detected by the Try rule. If the setting is set to false in a rule in the Try block, the error will be ignored and won't trigger the rules in the Catch block.</div></div></div>\n<p>The <strong>Try</strong> and <strong>Catch</strong> rules are removed, enabled, and disabled together. Use the corresponding menu item on the <strong>Try</strong> rule to perform the operations on both rules.</p>\n<h3>Sleep</h3>\n<p>This action pauses the scenario execution for the specified period of time. After the pause time has elapsed, the rest of the rules after the <strong>Sleep</strong> rule will continue to run. This action is usually added when the scenario contains rules that depend on data returned from external systems and the data retrieval takes a significant amount of time. In this case, you add the <strong>Sleep</strong> rule <em>before</em> such rules to make sure they have the required data.</p>\n<p>The maximum pause time allowed is 60 minutes. If you configure a value larger than this, the system will set the pause time to 60 minutes.</p>\n<p>The Count field accepts whole numbers. If you enter a decimal value, the system will round it to the nearest whole number.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-tip-icon\"></div><div class=\"admonition-content admonition-tip-content\"><div><strong>Sleep</strong><strong>Do Until</strong></div></div></div>\n<h3>End Scenario</h3>\n<p>When this rule is executed, it ends the current scenario. If we set this rule in a loop, such as Apply to Each or Do Until, it doesn't just exit the loop; it ends the entire scenario.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>In the End Scenario, the filed message supports String. If any other type is used, the rule fails.</div></div></div>\n<h3>Send Response</h3>\n<p>Use this action to send HTTP responses with payload data to the target system. </p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div><strong> Send Response</strong></div></div></div>\n<p>To define the response:</p>\n<ol>\n<li>Add a <strong>Send Response</strong> rule to the scenario.</li>\n<li>In the <strong>Status</strong> field,  enter the HTTP status code of the response. For example, <code>200</code>.</li>\n<li>In the <strong>Header </strong>section, enter the HTTP headers. For example,  <code>Content-Type</code><strong> </strong>in the <strong>key</strong> field and <code>'application/json'</code> in the <strong>value</strong> field.</li>\n<li>In the <strong>Body</strong> section, define the response body content by adding properties as key/value pairs. If you want to specify the response body content directly in a textbox, clear the <strong>JSON key expression </strong>check box. For more information, see <a href=\"/doc/423/26.1/keyexpressionsxie\" title=\"JSON payload expressions\">JSON payload expressions</a>.</li>\n</ol>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}