{
  "title": "Create component template properties",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><ol>\n<li>In the left pane of the Sequenced Components area, select the component palette that contains the component type whose template properties you want to create.</li>\n<li>Click the component type whose template properties you want to create.</li>\n<li>Select the <b>Templates</b> tab.</li>\n<li>In the component templates list, click the component template whose properties you want to create.</li>\n<li>Click <b>Create</b>.</li>\n<li>In the Create Property dialog, select a type and enter values, and then click <b>Create</b>.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Property_types_and_values\">Property types and values</h2>\n<table>\n<tbody>\n<tr>\n<th>Type</th>\n<th>Property information</th>\n</tr>\n<tr>\n<td>All</td>\n<td>\n<ul>\n<li><b>Name</b> — A unique name for the property.</li>\n<li><b>Display Name</b> — A unique name for the property.</li>\n<li><b>Description</b> — A description of the property.</li>\n<li><b>Consumer Visible</b> — Select this option to indicate that this property will be made visible in the Service Portal.</li>\n<li><b>Deploy Settings</b> — These attributes influence whether the property will be visible and/or required in the Management Console’s <b>Deploy a New Instance</b> dialog.\n\t\t\t\t<ul>\n<li><b>Visible</b> — This property and its value will be visible to the user performing deployments from the Management Console’s deploy dialogs.</li>\n<li><b>Required</b> — This property will be mandatory when performing deployments from the Management Console’s deploy dialogs.</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Boolean</td>\n<td>\n<ul>\n<li><b>Property Value</b> — Select either <b>True</b> or <b>False</b>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Integer</td>\n<td>\n<ul>\n<li><b>Resource Type and Unit for a Measurable Property</b> — Select the resource type and unit, which are used to influence provider and pool selection and resource accounting. You must set this to a value other than <b>None</b> to make this property measurable and available for configuration on a resource offering. You can also specify the resource type and unit simply to clarify the intent of the property. Note that when creating a <b>Source Binding</b> for a service component, a best practice is that both the service component property you are creating and the service component property you are binding to will have the same <b>Resource Type and Unit</b> value.</li>\n</ul>\n<ul>\n<li><b>Property Value</b> — Select or type a positive or negative whole number or zero. If you enter a decimal number, the value will be truncated to the nearest integer. The maximum allowed integer value is 2147483647 and the minimum is -2147483648; if you enter a value outside these bounds the value will be automatically converted to the closest maximum or minimum value.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>List</td>\n<td>\n<ul>\n<li><b>Property Value</b>\n<ul>\n<li>Click the <b>Add Value</b> icon to add a new list item, and provide the following information:\n\t\t\t\t\t<ul>\n<li><b>Display Name</b>- The label that will be displayed for the list item.</li>\n<li><b>Value</b> - The value of the list item.</li>\n<li><b>Description</b> A description of the list item.</li>\n<li>Click <b>Create</b> to add the list item.</li>\n</ul>\n</li>\n<li>Click the <b>Edit</b> icon to edit the selected list item.</li>\n<li>Click the <b>Remove</b> icon to remove a selected list item.</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>String</td>\n<td>\n<ul>\n<li><b>Property Value</b> — Type a string of characters. Click the <span class=\"UIElementsgear icon\">gear icon</span> to select a property value token. See the topic on Select tokens for a description of the tokens.</li>\n<li><b>Confidential Data</b> — Select this box to mask the values so that they can't be read in the Service Portal; no encryption of the value is performed.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/mgmtconssddeploy\" title=\"SMAX:25.1/MgmtConsSDDeploy\">Create and deploy a new instance</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}