{
  "title": "Create component templates",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><h2 class=\"mw-headline\" id=\"To_create_component_templates\">To create component templates</h2>\n<ol>\n<li>In the left pane of the Service Components area, select the component palette that contains the component type from which you want to create a template.</li>\n<li>Click the component type on which you want to base the template.</li>\n<li>Select the <b>Templates</b> tab and click <b>Create</b>.</li>\n<li>In the <b>Create Component Template</b> dialog, enter the following information and click <b>Create</b>.</li>\n</ol>\n<table>\n<tbody>\n<tr>\n<th>Item</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Base Component Type</td>\n<td>The component type from which this template is created; this field can't be edited.</td>\n</tr>\n<tr>\n<td>Display Name</td>\n<td>The name you that's displayed for the component template.</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>The description you provide for the component template.</td>\n</tr>\n<tr>\n<td>Image</td>\n<td>An image that displays for the component type. Click <b>Change Image</b>, as desired. Choose the image you want, and click Select. Click Upload Image to add your own image. Supported file extensions include .jpg, .jpeg, .gif, and .png. The recommended image size is 256 by 256 pixels, and the image will be scaled to the appropriate size.</td>\n</tr>\n<tr>\n<td>Consumer Visible</td>\n<td>Select this box to specify that the service component is visible in the Service Portal. De-select it to specify that the service component will not be visible.</td>\n</tr>\n<tr>\n<td>Pattern</td>\n<td>Select this box to mark the service component as a pattern by default. When you create a pattern service component, you must also create a Clone Pattern action in the parent service component. For example, the out-of-the-box component type, Server, is typically marked as a pattern, and its parent service component, Server Group, includes the Clone Pattern action. At subscription time, the Clone Pattern action creates one or more service component instance from this service component pattern.</td>\n</tr>\n</tbody>\n</table>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}