{
  "title": "Property mappings panel",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Use the Property Mappings panel to view and configure mapping between resource offering properties and component properties. Property mappings enable property values to be passed between the component and the resource offering.</p>\n<h2 class=\"mw-headline\" id=\"Tasks\">Tasks</h2>\n<ul>\n<li><b>Navigate to</b> or <b>View</b> (the Property Mappings panel) — In the left pane of the <b>Sequenced Components</b> area, select the tag associated with the component template. Select the component type and, in the Templates tab, select the component template. In the Resource Offerings tab, click the name of the resource offering whose property mappings you want to view. Finally, select the Property Mappings panel on the right.</li>\n<li><b>Auto-Configure</b> — Automatically map each resource offering property to a best-match component property. If no best match is found, a new property is automatically created.</li>\n<li><b>Configure Property Mapping</b> — Click the <span class=\"UIElementsgear icon\">gear icon</span> next to a mapped resource offering property and then select <b>Configure Mapping</b>. Select one of the following options in the Configure Property Mapping dialog:\n\t<ul>\n<li><b>Not Mapped</b> — The resource offering property isn't mapped to the property on the component.</li>\n<li><b>Auto-Configure</b> — Automatically maps the resource offering property to a best-match component property. If no best match is found, a new property is created automatically.</li>\n<li><b>Mapped to Component Property</b> — Select a component property from the list.</li>\n<li>Click <b>Save</b>.</li>\n</ul>\n</li>\n<li><b>Delete Mapping</b> — Click the <span class=\"UIElementsgear icon\">gear icon</span> next to a mapped resource offering property and then select <b>Delete Mapping</b>. Click <b>Yes</b> to confirm. Deleting the mapping doesn't delete the property on the component.</li>\n</ul>\n<p>A property mapping between a resource offering and a service component can't be deleted if it's part of a published design.</p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}