{
  "title": "Configure the UCMDB browser URL",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Your Universal Discovery and CMDB (UD/UCMDB) is the database where you manage device information. If you are a Service Asset and Configuration Management (SACM) administrator, follow these steps to configure a UCMDB browser URL so that users can view UCMDB CI details directly in the SACM interface.</p>\n<div class=\"Admonition_Note\"><span class=\"autonumber\">Note</span> Use the procedure below only if you have set up an OPB-based UCMDB integration. If you've enabled Native SACM in your environment, see <a href=\"/doc/423/26.1/ssoucmdb\">Single Sign-On with UCMDB</a> instead.</div>\n<p>To configure the UCMDB browser URL:</p>\n<ol>\n<li>Make sure that you have already set up an integration of SMA with the remote UCMDB Server. For details, see Related topics.</li>\n<li>Make sure that you have already set up synchronization with the remote UCMDB Server. For details, see Related topics.</li>\n<li>To permit users to navigate to the external UCMDB through the UCMDB browser, add the UCMDB host domain as an authorized domain. To do this, navigate to <b>Administration &gt; Configuration &gt; Application Settings</b> and add the UCMDB host domain (for example, myhost.example.com) to the <strong>Authorized domains for navigation</strong> field. See <a href=\"/doc/423/26.1/appsettings#Authorized_domains_for_navigation\">Authorized domains for navigation</a> for details.</li>\n<li>Configure the UCMDB browser URL in SACM:\n\t<ol start=\"1\">\n<li>From the main menu, select <b>Build &gt; Service Asset &amp; Configuration</b>.</li>\n<li>Click the <b>SACM configuration</b> link in the upper right corner. Service Management displays a pop-up window.</li>\n<li>Select the <b>Enable UCMDB browser</b> check box. </li>\n<li>You are prompted to enter the location of the external UD/UCMDB in the <b>UCMDB browser URL</b> text box. The UCMDB Browser URL resembles <code>https://&lt;UCMDB_Server_Host&gt;:&lt;UCMDB_Server_Port&gt;/ucmdb-browser</code>. You don't need to specify the UCMDB customer ID, when a user tries to open the UCMDB browser in Service Management, a corresponding customer ID will be automatically appended to the URL. </li>\n<li>Click <b>Save</b>. When you configure these settings, they apply to all users.<br/>\n<b>Note:</b> After you specify a valid UCMDB browser location, Service Management will display an <b>Explore</b> button at the top of each SACM record page. Then, an item called <b>UCMDB UI</b> will appear on the <b>SACM</b> menu, by clicking it, you are able to use the UCMDB browser in the SACM user interface. If you try to open the UCMDB Browser by entering the URL in a web browser, you must manually append the UCMDB customer ID to the URL if UD/UCMDB multi-customer is enabled. For example, <code>https://&lt;UCMDB_Server_Host&gt;:&lt;UCMDB_Server_Port&gt;/ucmdb-browser?customerID=xxxxxxxxx.</code></li>\n</ol>\n</li>\n</ol>\n<p>The configuration settings take effect as soon as Service Management refreshes the settings cache. You might experience a delay of up to an hour before the cache is refreshed.</p>\n<p><b>Note</b>: The <b>Download modeling template</b> link on the SACM configuration page enables you to download a modeling template package, which contains modeling templates. When using the Assisted Modeling feature in the UCMDB browser to define service models that will be pushed to SMA, you must use one of these templates. Otherwise, relationships may be defined in the models that don't meet the integration TQLs and therefore will not be pushed to Service Management.</p>\n<p>Once you have set up automatic or custom synchronization with the remote UCMDB Server, these modeling templates are already available in the UCMDB browser. If they aren't, you can click the <b>Download modeling template</b> link to download the modeling template package, save the package locally and deploy it in the UCMDB Package Manager.</p>\n<h2 id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/integexternalucmdb\" title=\"SMAX:25.1/IntegExternalUCMDB\">Integrate with external UCMDB</a></li>\n<li><a href=\"/doc/423/26.1/setupautomaticsync\" title=\"SMAX:25.1/SetUpAutomaticSync\">How to set up automatic synchronization with UCMDB</a> <a href=\"/doc/423/26.1/integexternalucmdb\" title=\"SMAX:25.1/IntegExternalUCMDB\">through OPB</a></li>\n<li><a href=\"/doc/423/26.1/setupcustomsync\" title=\"SMAX:25.1/SetUpCustomSync\">How to set up custom synchronization with UCMDB</a> <a href=\"/doc/423/26.1/integexternalucmdb\" title=\"SMAX:25.1/IntegExternalUCMDB\">through OPB</a></li>\n<li><a href=\"/doc/423/26.1/sacmconfig\" title=\"SMAX:25.1/sacmConfig\">Configure Service Asset and Configuration Management</a></li>\n<li><a href=\"/doc/423/26.1/connectremotedesktop\" title=\"SMAX:25.1/ConnectRemoteDesktop\">How to create a remote desktop connection</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}