{
  "title": "Configure Service Management",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div class=\"mw-collapsible-content\">\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-tip-icon\"></div>\n<div class=\"admonition-content admonition-tip-content\">\n<div class=\"mw-collapsible\">\n<div class=\"mw-collapsible-content\">\n<p>Service Management provides an excellent experience out of the box. However, it's likely that each customer of the product will have different processes they would like to follow, and most have different services they wish to provide to their own customers.</p>\n<p>Service Management provides a variety of ways to configure each process to better provide the correct experience for every customer. It's very important to understand the different customization options available. Just as important is understanding the correct methods to use them to provide a seamless transition between the development of these custom configurations and the activation of them in a production environment.</p>\n<p>The configuration abilities in Service Management fit into one of two primary categories:</p>\n<ul>\n<li>System configuration</li>\n</ul>\n<ul>\n<li>Data configuration</li>\n</ul>\n<p><br/>\nSystem configuration changes affect the underlying structure, workflow, business rules, or other low-level definition of a particular process (such as incident or change management). Configuration changes at this level will affect every record created for the specific process. System configuration changes can't be made directly in a production system, and instead must follow a specific development to production (dev2prod) process.</p>\n<p>Data configuration changes are created by creating or modifying specific records that support the higher level processes. An example of a data configuration change is the creation of a new service offering that will be used in the request management process. Changes at this level only affect a process record that references it. Data configuration changes are almost always made directly in the production environment.</p>\n<p><br/>\n </p>\n</div>\n</div>\n</div>\n</div>\n</div>\n<h2 class=\"mw-headline\" id=\"Making_Changes_to_our_System_Behavior\">Making Changes to our System Behavior</h2>\n<p>If there is anything certain in this world, it’s that some of the more important managers in the company will want us to change how our Service Management system works. In truth, Service Management has some great functionality built in, but there's no way that it can know the intricacies (and sometimes straight-up craziness) of how we handle the processes in our company.</p>\n<p>Luckily, Service Management comes with a wide array of configuration options that we can use to tune each process to our “real world” methodologies. While we aren't going into the nuts and bolts of all of the methods right now, I think it's important to go over the best practices for making certain types of configuration changes. Otherwise, we might lose some changes that we make, or even put our system in a bad state, by not following the proper procedures.</p>\n<p>We can classify our configuration changes into two categories: <b>system configuration</b> and <b>data configuration</b>. This is an important distinction to make because the best practices for making changes in each category is very different.</p>\n<h2 class=\"mw-headline\" id=\"System_Configuration\">System Configuration</h2>\n<p>System configuration changes include modifications tied to a process at a low level. When we make changes at this level, it can change the behavior in every record of a specific type (like an incident or a change). For example, adding a field to the incident records is a system configuration type of change — that field is now available in every incident record.</p>\n<p>Because these type of changes have such a large effect, system configuration changes can't be made directly in our production system. Service Management simply won't allow us to do so. There is a specific process we need to follow to create these changes in a development system, test them, and then move them into production. We'll look at this process (called dev2prod for short) in detail, but first, let’s make sure we understand what types of changes are system configuration changes.</p>\n<p>System configuration changes are primarily made in the 'Records' utility. This utility allows us to add fields, change forms, add custom actions, or modify the process workflow of a specific record type. It should be clear that changes to this low-level information are system configuration changes, but there are a few other places we need to consider.</p>\n<p>Lists, roles, and localization resources are also considered system configuration information. These bits of information are so tied into the underlying structure of the record definitions they need to use the same process to ensure everything keeps working correctly.</p>\n<p>So it looks like our system configuration information includes any changes made to the following areas:</p>\n<ul>\n<li>Records -&gt; Fields</li>\n<li>Records -&gt; Forms</li>\n<li>Records -&gt; Rules</li>\n<li>Records -&gt; Processes</li>\n<li>Records -&gt; Notifications</li>\n<li>Records -&gt; Custom actions</li>\n<li>Lists</li>\n<li>Roles</li>\n<li>Localization (for field labels, notifications, etc.)</li>\n</ul>\n<p>We know that we can’t change any of these areas in our production system, so how do we do it? We need to follow the dev2prod process and the accompanying tools that Service Management provides. This will ensure that all of our changes apply to production correctly, causing no problems or downtime.</p>\n<p>One important point of clarification: fields that are created as user options (as part of an offering or model definition) and any lists specific to a user option aren't considered system configuration items and aren't included in the dev2prod process. User options are part of the data configuration process.</p>\n<h2 class=\"mw-headline\" id=\"Data_Configuration\">Data Configuration</h2>\n<p>Data configuration doesn't change the behavior of a process directly. Instead, it's referenced by a record, which may have an effect on the overall process. An obvious example here is a service offering. While a specific service offering doesn't affect the workflow of every request, selecting an offering will influence the behavior of that specific record.</p>\n<p>Changes in data configuration areas <b>aren't handled as part of the dev2prod process</b> and must be either made directly in the production system or imported into production from an external file (although importing isn't always an option for every type of configuration data).</p>\n<p>There are numerous examples of data configuration areas in Service Management, and while the overall method of creating these types of data is similar, there are small differences we will investigate. For now, let’s list out the record types that are considered part of data configuration:</p>\n<ul>\n<li>Service Portal settings</li>\n<li>Routing definitions</li>\n<li>Record categories</li>\n<li>Integration settings</li>\n<li>Service categories</li>\n<li>Service definitions</li>\n<li>Service offerings</li>\n<li>Fulfillment plans</li>\n<li>Time periods</li>\n<li>Service/support agreements</li>\n<li>Change/incident/release models</li>\n<li>Templates</li>\n<li>Approval definitions</li>\n<li>SLT settings</li>\n</ul>\n<p>Changes in these areas must be performed in the production system, which may seem risky at first. However, there are a few best practices that will ensure that we will not cause any issues in the production system if we follow them.</p>\n<!-- NewPP limit reportCached time: 20200217074451Cache expiry: 86400Dynamic content: falseCPU time usage: 0.012 secondsReal time usage: 0.022 secondsPreprocessor visited node count: 14/1000000Preprocessor generated node count: 38/1000000Post‐expand include size: 7223/2097152 bytesTemplate argument size: 0/2097152 bytesHighest expansion depth: 2/40Expensive parser function count: 0/100Unstrip recursion depth: 0/20Unstrip post‐expand size: 0/5000000 bytes--><!--Transclusion expansion time report (%,ms,calls,template)100.00%    0.000      1 -total--><!-- Saved in parser cache with key docops_wiki:pcache:idhash:875773-0!canonical and timestamp 20200217074451 and revision id 1577533 -->\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}