{
  "title": "Configure a load balancer on BYOK",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><h2>What is load balancing</h2>\n<p>A load balancer (LB) will accept client traffic and forward it to the control plane, the worker nodes, or all nodes in the cluster to spread the network load. Inside the cluster, application pods accept the traffic, either through an NGINX Ingress Controller or more directly through the Kubernetes Service abstraction.</p>\n<p>There are two types of load balancing:</p>\n<ol>\n<li>Network load balancing (NLB): works at Layer 4, and supports protocols such as TCP and UDP. HTTP(S) traffic is also forwarded and load balanced across a set of endpoints. </li>\n<li>Application load balancing (ALB): works at Layer 7, supports protocols such as HTTP(S), and acts as a reverse proxy including the ability to load balance requests across a set of endpoints.</li>\n</ol>\n<h2>Installation and configuration</h2>\n<p>You must install and configure the load balancer and also modify the OMT and the suite configuration to enable them to accept traffic from clients accessing them through a load balancer. After configuring your load balancer, you must enable websocket.</p>\n<p>There are different load balancers such as F5, HAProxy, NGINX, and Apache. However, in this document, will use NGINX as an example to describe how to configure a load balancer for OMT and the suite.</p>\n<h3>Increase request payloads</h3>\n<p>Nginx has a conservative request body size limit, typically set to 1MB or smaller, and the suite Helm chart package is approximately 3MB. This might cause excessive resource consumption, denial-of-service attacks, or other performance-related issues, hence you need to increase the maximum limit of request body size by modifying the <code>client_max_body_size</code> directive.</p>\n<ol>\n<li>Modify the nginx configuration file (nginx.conf) like below:\n\t<pre>http {  \n  ...\n  client_max_body_size 5M;\n  }</pre>\n</li>\n<li>Restart Nginx.</li>\n</ol>\n<h3>Configure a load balancer for ports 5443 and 443</h3>\n<p>You can configure the LB on any port you wish. Refer to the links below for detailed steps. </p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>You don't need to configure a load balancer for port 5443 if you didn't install OMT.</p>\n</div>\n</div>\n<ul>\n<li>Configure a load balancer for port 5443: <a href=\"/doc/423/26.1/configurelbforport5443\" rel=\"nofollow\" title=\"Configure a load balancer for port 5443\">Configure a LB for port 5443</a></li>\n<li>Configure a load balancer for port 443: <a href=\"/doc/423/26.1/configurelbforport443\" rel=\"nofollow\" title=\"Configure a load balancer for port 443\">Configure a LB for port 443</a></li>\n</ul>\n<h3>Enable websocket</h3>\n<p>Please enable websocket on the load balancer.</p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}