{
  "title": "Configure Parameters for Input Validation",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p><br/>\nIn the <b>Configure Parameters</b> dialog, you configure the parameters that should be supplied to the <b>Input Validation</b> script when it's run.</p>\n<p>You can also enter a value to perform validation against to test the script. Click the <b>Validate</b> button to run the script using the supplied parameters and the supplied value. You may also edit the JavaScript file in this dialog.</p>\n<p>You can enter parameter values manually, or use the <b>Select Token</b> link in the gear menu to select a token value. To delete a parameter, select <b>Delete Parameter</b> in the gear menu.</p>\n<p>In the Subscriber Options context, you can additionally use the <b>Create Mapping</b> link in the gear menu to configure an option property mapping. When a mapping has been configured, it can be updated using <b>Update Mapping</b> or deleted using <b>Delete Mapping</b>.</p>\n<p>In the User Operations context, option property mappings aren't applicable; therefore, the <b>Create Mapping</b>, <b>Update Mapping</b>, and <b>Delete Mapping</b> links aren't present.</p>\n<p>In the Subscriber Options context, the following three parameters are added automatically:</p>\n<ul>\n<li><code>value = [CLIENT:&lt;property_name&gt;]</code></li>\n<li><code>current_value = [CURRENT_VALUE:&lt;property_name&gt;]</code></li>\n<li><code>lang = [LOCALE:lang]</code></li>\n</ul>\n<p>The <code>value</code> parameter references the value a user is supplying for this option property. The <code>current_value</code> parameter references the previously supplied value for this option property, in case of subscription modification. The <code>lang</code> parameter references the locale.</p>\n<p>In the User Operations context, the following two parameters are added automatically:</p>\n<ul>\n<li><code>value = [CLIENT:&lt;property_name&gt;]</code></li>\n<li><code>lang = [LOCALE:lang]</code></li>\n</ul>\n<p>The <code>value</code> parameter references the value a user is supplying for this action parameter input. The <code>lang</code> parameter references the locale.</p>\n<p>For more information on tokens, see <a href=\"/doc/423/26.1/mgmtconscomptypeselecttokens\">Select tokens</a>.<br/>\nFor more information on option property mapping, see <a href=\"/doc/423/26.1/selectpropertytomaptoscriptparameter\">Select Property to Map to Script Parameter</a>.</p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}