{
  "title": "(Optional) Configure data domain segmentation for Native SACM",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>If you aren't using and don't plan to use the data domain segmentation feature in OpenText Service Management, you can skip the steps in this topic. By skipping this topic, the solution will have an out-of-the-box active data domain called \"Public\" and a UCMDB setup without any tenants assigned to CIs.</p>\n<p>If you are using data domain segmentation, you must enable UCMDB multi-tenancy as described in <a href=\"/doc/423/26.1/enableucmdbmt\" title=\"(Optional) Enable UCMDB Multi-Tenancy\">(Optional) Enable UCMDB Multi-Tenancy</a> and you must also initially synchronize data domains and UCMDB tenants. By following the steps below, the solution will have an out-of-the-box active data domain called \"Public\" as well as additional configured domains and the UCMDB will have the default tenant and all synchronized Service Management data domains as UCMDB tenants.</p>\n<p>After enabling Native SACM, the Service Management data domain segmentation, and the UCMDB Tenant feature, follow these steps to synchronize Service Management data domains and UCMDB tenants. </p>\n<h2>Push Service Management data domains to UCMDB</h2>\n<p>Perform the following steps in the Service Management agent interface.</p>\n<ol>\n<li>In Studio, go to the <strong>Data domains</strong> list page, and click <strong>Sync</strong>. The consistency check detects that the default UCMDB tenant doesn't exist as a data domain in Service Management, click <strong>Yes</strong> to load the default UCMDB tenant to Service Management. The default UCMDB tenant is configured when you set up the UCMDB Tenant feature. </li>\n<li>Make sure to click <strong>Save</strong> for the UCMDB default domain to be created as a data domain in Service Management. </li>\n<li>Manually create additional Service Management data domains.</li>\n<li>Click <strong>Save.</strong> This will push the additional Service Management data domains into UCMDB where they're created as UCMDB tenants. </li>\n<li><a href=\"/doc/423/26.1/assigndomainprimary\" title=\"Assign data domain permissions to persons, groups, or roles\">Assign data domain permissions to persons, groups, or roles</a>.</li>\n<li><a href=\"/doc/401/2023.05/userpmtn\" title=\"Assign tenant permissions to UCMDB users\">Assign tenant permissions to UCMDB users</a> (Classic UD/UCMDB) or <a href=\"/doc/403/25.4/userpmtn\" title=\"Assign tenant permissions to UCMDB users\">Assign tenant permissions to UCMDB users</a> (Containzerized UD/UCMDB).</li>\n</ol>\n<h2>Create tenant association rules in UCMDB</h2>\n<p>In the UCMDB Local Client, create tenant association rules in each UCMDB customer so a newly created/discovered CI has a UCMDB tenant assigned. The UCMDB tenant value will be automatically synchronized to the Service Management data domain value of the corresponding record in Service Management. To do this, follow these steps:</p>\n<ol start=\"1\">\n<li>In UCMDB, go to Enrichment Manager.</li>\n<li>Click the <strong>*</strong> icon and create a <strong>New Tenant Association Rule</strong>.</li>\n<li>In the <strong>New Tenant Association Rule</strong> wizard, name the rule and finish.</li>\n<li>In the <strong>CI Type Selector</strong> list, right-click a CI type, and then click Add CI Type to Map. Add all required CI types or add the top-level CI type called \"Configuration Item\". </li>\n<li>In the main window, change <strong>Query Mode</strong> to <strong>Enrichment Mode</strong>.</li>\n<li>Right-click the CI type icon, and click <strong>Update Consumer Tenants</strong>.</li>\n<li>Select a tenant and add it to the <strong>Selected Tenants</strong> box.</li>\n<li>Select <strong>Override original value</strong>.</li>\n<li>Click OK.</li>\n<li>Right-click the rule and click <strong>Activate Rule</strong>.</li>\n</ol>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">For more information about how to use enrichment rules to assign UCMDB tenants, see <a href=\"/doc/401/2023.05/uptenantassocrul\" title=\"Tenant Association Rules (Classic UD/UCMDB)\">Tenant Association Rules (Classic UD/UCMDB)</a> or <a href=\"/doc/403/25.4/uptenantassocrul\" title=\"Tenant Association Rules (Containzerized CMS)\">Tenant Association Rules (Containzerized UD/UCMDB)</a>.<br/>\n<br/>\nPlease note that enrichment rules take effect within each UCMDB customer. Therefore, if you have a newly created UCMDB customer, you need to create new enrichment rules to achieve UCMDB tenant and Service Management data domain synchronization.</div>\n</div>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}