{
  "title": "Configure a load balancer on OpenShift",
  "content": "<div class=\"mw-parser-output\">\n<h2>What is load balancing</h2>\n<p>A load balancer (LB) will accept client traffic and forward it to the control plane, the worker nodes, or all nodes in the cluster to spread the network load. Inside the cluster, application pods accept the traffic, either through an NGINX Ingress Controller or more directly through the Kubernetes Service abstraction.</p>\n<div>\n<h2>Prerequisites</h2>\n<p>Before you configure the LB, you must know the correct Kubernetes networking service that you must use for your LB. The Suite supports the following types of services:</p>\n<ul>\n<li><strong>NodePort service</strong>: This type of service exposes a specific port on all the nodes in a cluster. It enables communication between external clients and the pods inside the cluster. If you use applications such as F5, HAProxy, ngnix, or Apache as the LB service in your deployment, you must configure the Suite to use the NodePort service.<br/>\n\t </li>\n<li><b>ClusterIP service: </b>This type of service exposes internal service within the cluster for external access.  It enables internal communication between pods within the cluster and is not accessible from outside the cluster. If you use an application such as the OpenShift Router as the LB in your deployment, you must enable the LB to allow external traffic on port 443 and configure the Suite to use the ClusterIP service.</li>\n</ul>\n<div><strong>Based on your requirements, you can choose any of the following</strong>:</div>\n<ul>\n<li><strong>Network load balancing (NLB)</strong> operates at Layer 4 and supports protocols such as TCP. HTTP(S) traffic is also forwarded and load-balanced across a set of endpoints. </li>\n<li><strong>Application load balancing (ALB)</strong> operates at Layer 7, supports protocols such as HTTP(S), and functions as a reverse proxy. It can also load balance requests across a set of endpoints.</li>\n</ul>\n</div>\n<h2>Set up LB using ClusterIP service</h2>\n<div>If you plan to use an LB that requires ClusterIP service such as OpenShift Router in your Suite deployment, you must complete the following steps to set it up.</div>\n<ol>\n<li>Make sure you set the <code>global.expose.type</code> parameter value to <strong>ClusterIP</strong> in the <strong>my-values.yaml</strong> file. For details, see the <em>Expose external load balancer</em> section for OpenShift in <a href=\"/doc/423/26.1/createesmyaml\" title=\"Create my-values.yaml\">Create my-values.yaml</a>.</li>\n<li>Add a route to allow access to the suite user interface on port 443. For details, see the<i> Expose port 443 on external LB (ClusterIP service)</i> section in <a href=\"/doc/423/26.1/configurelbforport443\" style=\"\" title=\"Configure a load balancer for port 443\">Configure a load balancer for port 443</a>.</li>\n</ol>\n<h2>Set up LB using NodePort service</h2>\n<div>If you plan to use an LB that requires NodePort service such as F5, HAProxy, nginx, or Apache in your Suite deployment, you must complete the following steps to set it up.\n<p>The following instructions are for exposing port 443 on nginx. For other LBs, refer to the application's official documentation</p>\n</div>\n<ol>\n</ol>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>If you have installed OMT, we recommend that you use same nginx as the OMT deployment to set up LB for the suite. </div></div></div>\n<p>Complete the following steps to set up LB for the suite usnig ngnix:</p>\n<ol>\n<li>\n<p>Before you configure the nginx as the LB, you must first increase the request body size limit. This is typically set to 1MB or smaller, and the suite Helm chart package is approximately 3MB. This might cause excessive resource consumption, denial-of-service attacks, or other performance-related issues.  To avoid this, you must increase the maximum limit of request body size. Complete the following steps to update the limit:</p>\n<ol>\n<li>Update the<code>client_max_body_size</code> directive in the <strong>nginx.conf</strong> file. See the following example of the updated directive:\n\n\t\t<pre>http {  \n  ...\n  client_max_body_size 5M;\n  }</pre>\n</li>\n<li>Restart nginx.</li>\n</ol>\n</li>\n<li>If you use the same nginx as the OMT deployment to set up the LB for the Suite, you must add rules to allow access to the suite user interface on port 5443. For details, see <a href=\"/doc/423/26.1/configurelbforport5443\" rel=\"nofollow\" title=\"Configure a load balancer for port 5443\">Configure a LB for port 5443</a>.</li>\n<li>Set up LB for port 443 on the Suite\n\t<ol>\n<li>Make sure you set the <code>global.expose.type</code> parameter value to <b>NodePort </b>in the <strong>my-values.yaml</strong> file. For details, see the <em>Expose external load balancer</em> section for OpenShift in <a href=\"/doc/423/26.1/createesmyaml\" title=\"Create my-values.yaml\">Create my-values.yaml</a>.</li>\n<li>Configure the ingress rule to allow clients to access the suite user interface.  For details, see the<i> Expose port 443 on external LB (NodePort service)</i> section in <a href=\"/doc/423/26.1/configurelbforport443\" style=\"\" title=\"Configure a load balancer for port 443\">Configure a load balancer for port 443</a>.</li>\n</ol>\n</li>\n</ol>\n<h4>Enable websocket</h4>\n<p>Enable websocket on the load balancer. Refer to the LB's official documentation for details.</p>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}