{
  "title": "Configure SSL for outbound integrations",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The suite supports one-way SSL for outbound integrations so that it can communicate with external applications in a secure manner. </p>\n<p>The outbound integration SSL solution works as follows: when a suite component connects to an external server as a client, the suite validates the server's certificate. To achieve this, the suite imports the external server's CA certificate file (in PEM format) from the global NFS share directory to a trust store file and a bundled PEM file. When the suite attempts to connect to the external server, the trust store and PEM file are used to validate the external server's certificate. The suite is allowed to connect to the server only when the validation has passed.</p>\n<div class=\"Admonition_Note\"><span class=\"autonumber\">Note</span><br/>\nIn a production system, third-party or corporate CA-signed certificates are recommended; self-signed certificates can be used in non-production systems. The certificates must be in PEM format. Note that a PEM certificate file may use the <b>.pem</b> extension or a different extension such as <b>.crt</b>.</div>\n<p>To configure one-way SSL for an external server, perform the following steps:</p>\n<ol>\n<li>Upload the server's certificate to the suite's NFS server. <br/>\n\tYou need to upload the CA certificate file of the external server to the <i>&lt;suite global NFS folder&gt;/certificate/source</i> directory on the NFS server, where <i>&lt;suite global NFS folder&gt;</i> is the global NFS directory that you set when installing the suite.</li>\n<li>Restart the corresponding pod.</li>\n<li>Configure SSL in the external application. <br/>\n\tTo use SSL for an outbound integration, you also need to configure SSL in the external application. For details, see the specific product documentation.</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}