{
  "title": "Cost Centers",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div id=\"tag-premium\"></div>\n<p>A cost center is a business unit that's only responsible for the costs that it incurs. The cost center is the main dimension to aggregate the actual cost. Its performance is usually measured through the comparison between the incurred and budgeted costs. The Cost Centers feature enables you to view or refer to financial details such as the cost center effective date, manager, and reporting center. It manages both active and inactive cost centers.</p>\n<p>There are two ways to view the cost center records: tree view and table view.</p>\n<ul>\n<li>The tree view is the default view when there are 100 or less parent cost centers.</li>\n<li>The table view is the only view when there are more than 100 parent cost centers.</li>\n</ul>\n<p>For more information about views, see <a href=\"/doc/423/26.1/views\" title=\"SMAX:25.1/Views\">Views</a>.</p>\n<h2 class=\"mw-headline\" id=\"In_the_tree_view\">In the tree view</h2>\n<ul>\n<li>Click a cost center record to display the connected next lower level of cost center records.</li>\n<li>Continue to click each lower level of cost center records to drill down the levels of cost centers.</li>\n<li>As you drill down, Service Management displays a navigation bar with a set of links. Click the appropriate link to go to the required cost center level.</li>\n<li>As you click a cost center record, Service Management displays a summary in the right panel.</li>\n<li>To go to the table view, click <b>Table view</b>.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"In_the_table_view\">In the table view</h2>\n<ul>\n<li>As you click a cost center record, Service Management displays a summary in the right panel.</li>\n<li>To go to the tree view, click <b>Tree view</b>.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/createcostcenter\" title=\"SMAX:25.1/CreateCostCenter\">How to create a cost center record</a></li>\n<li><a href=\"/doc/423/26.1/editcostcenter\" title=\"SMAX:25.1/EditCostCenter\">How to edit a cost center record</a></li>\n<li><a href=\"/doc/423/26.1/costcenterwflw\" title=\"SMAX:25.1/CostCenterWflw\">Cost center workflow</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}