{
  "title": "Create and edit aggregation providers",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Aggregation providers represent end-point systems that are integrated with the suite to provide services such as cloud services. After an aggregation provider is created, the catalog manager who has the proper privilege can create aggregated offerings based on the services from this provider.</p>\n<p><strong>Notes</strong>:</p>\n<ul>\n<li>To see the <strong>AGGREGATION PROVIDER</strong> menu item from <strong>Administration </strong>&gt; <strong>Utilities </strong>&gt; <strong>Providers</strong>, make sure that:\n\n\t<ul>\n<li>The tenant admin turns on <strong>Enable aggregation</strong> in  <strong>Administration</strong> &gt; <strong>Configuration</strong> &gt; <strong>Application Settings</strong>.</li>\n<li>At least one of the experience modes available in the current release is selected in <strong>Administration</strong> &gt; <strong>Configuration</strong> &gt; <strong>Application Settings</strong>.</li>\n<li>The users' role has the <strong>Ability to view all administration modules</strong> privilege.</li>\n<li>The users' role has the <strong>Create/View/Update/Delete</strong> privilege to the Provider record.</li>\n</ul>\n</li>\n<li>Before you add an aggregation provider, make sure that you create the tenant key chain in  <strong>Administration</strong> &gt; <strong>Configuration</strong> &gt; <strong>Application Settings &gt; Tenant key chain</strong>. Otherwise, you can't save the provider record because the <strong>Password</strong> field for the integration user is an encrypted field that requires the tenant key chain for encryption.</li>\n</ul>\n<h2>Create an aggregation provider</h2>\n<p><strong>Note</strong>: This section is to add a DND provider that's deployed and enabled in the same suite system. </p>\n<p>To add an aggregation provider that's deployed and enabled in the current suite system, follow these steps:</p>\n<ol>\n<li>From the main menu of Service Management, select <strong>Administration </strong>&gt; <strong>Utilities </strong>&gt; <strong>Providers</strong>.</li>\n<li>In the <strong>AGGREGATION PROVIDER</strong> view, click the <strong>New</strong> button.</li>\n<li>In the <strong>New Provider</strong> page, fill in and select <strong>Basic provider properties</strong>:\n\t<ol>\n<li>In the <strong>Title</strong> field, type a descriptive name for the new provider</li>\n<li>Select the <strong>System type</strong> such as <strong>Service Design and Deployment</strong>. After the <strong>System Type</strong> is selected, additional <strong>General</strong> and <strong>Integration user</strong> sections are displayed.</li>\n</ol>\n</li>\n<li>In the <strong>General </strong>section, type the <strong>URL</strong> to the provider system. In the URL field enter <code>https://itom-dnd-controller-svc:8444/dnd</code></li>\n<li>In the <strong>Integration user</strong> section, type the<strong> Login name</strong> and <strong>Password</strong> of the integration user who can access the provider system.<br/>\n<strong>Note</strong>: To add a DND provider, you must use the DND Integration user that the suite admin has created and configured when deploying the DND capability. You can get the username and password of the DND Integration user from your suite admin.</li>\n<li>(Optional) In the <strong>Fulfillment plan</strong> section, select a fulfillment plan, which will be used as the fulfillment plan for the offerings aggregated from this provider.<br/>\n\tOnly the plans in the Cloud Service Request type can be selected. If no fulfillment plan is selected, the default fulfillment task plan will be added to aggregated offerings.</li>\n<li>Click <strong>SAVE</strong>. The aggregation provider is created.</li>\n</ol>\n<h2>Edit an aggregation provider</h2>\n<ol>\n<li>From the main menu of Service Management, select <strong>Administration </strong>&gt; <strong>Utilities </strong>&gt; <strong>Providers</strong>.</li>\n<li>In the <strong>AGGREGATION PROVIDER</strong> view, click the provider in the ID column to display the selected provider.</li>\n<li>In the provider detail page, type new values for the provider's properties that you want modify.</li>\n<li>Click <strong>Save</strong> to save your changes.</li>\n</ol>\n<p><strong>Important</strong>: Do not delete the aggregation provider when you have offerings (active or inactive) aggregated from this provider.</p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}