{
  "title": "Create a public request",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>A public request can be created in the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span> by the following methods:</p>\n<h2 class=\"mw-headline\" id=\"Method_1\">Method 1</h2>\n<p>If a user submits a request based on an offering with the <b>Allow public</b> field set to <b>Always</b>, that request is automatically a public request, with the public scope as defined in the <b>Public audience</b> section of the offering.</p>\n<h2 class=\"mw-headline\" id=\"Method_2\">Method 2</h2>\n<p>If a user submits a request based on an offering with the <b>Allow public</b> field set to <b>Optional</b>, after the request is created, the user is asked if the request is to be shared as a public request. As with the first method, the request has the default public scope as defined in the <b>Public audience</b> section of the offering, but the user is given the option to edit this.</p>\n<p>This also applies if using email integration.</p>\n<h2 class=\"mw-headline\" id=\"Exceptions\">Exceptions</h2>\n<p>In the following cases, the request doesn't become a public request:</p>\n<ul>\n<li>If a request is created with the public scope setting of <b>Location</b>, and the user creating the request doesn't have an associated location.</li>\n<li>If a request is created with the public scope setting of <b>Organization</b>, and the user creating the request doesn't have an organizational group.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/publicrequestsinteraction\" title=\"SMAX:25.1/PublicRequestsInteraction\">How public requests interact with other Service Management features</a></li>\n<li><a href=\"/doc/423/26.1/publicrequestssetup\" title=\"SMAX:25.1/PublicRequestsSetUp\">How to set up public requests</a></li>\n<li><a href=\"/doc/423/26.1/publicrequestsview\" title=\"SMAX:25.1/PublicRequestsView\">How to view and follow a public request in the Service Portal</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}