{
  "title": "Service Portal custom widgets",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>In addition to the standard options for <a href=\"/doc/423/26.1/settheme\">Service Portal display theme settings</a>, you can also use a custom widget to embed your own Web Components or static HTML contents to certain theme areas.</p>\n<p>Note that the custom widgets are all associated with the themes. That is to say, the configured custom widgets are only displayed to the users who are assigned with the associated theme.<br/>\nAlso, you can only create the custom widgets for your custom display themes. The custom widget is not available for the out-of-the-box display themes.</p>\n<p>Custom widget configuration also supports live preview in Service Portal. After a configuration is saved, the widget will be display in the corresponding position for preview.</p>\n<h4>Quick links to use cases</h4>\n<p paraeid=\"{88cf2f6e-ad46-4d5b-b6ba-f5c6e0224d78}{164}\" paraid=\"585704913\">Here is the list of usage examples provided in the online documents and <code>OpenText</code> Marketplace. </p>\n<table align=\"center\">\n<thead>\n<tr role=\"row\">\n<th scope=\"col\">Encapsulation type </th>\n<th scope=\"col\">Use case</th>\n<th scope=\"col\">Document link</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td colspan=\"1\" rowspan=\"2\">HTML (iframe) </td>\n<td>Useful Links as sidebar widget (HTML file)</td>\n<td><a href=\"/doc/423/25.1/htmlcustomwidget#Display_external_links\">Display external links</a> </td>\n</tr>\n<tr>\n<td>Power BI Report as full page widget (HTML file)</td>\n<td><a href=\"/doc/423/25.1/htmlcustomwidget#Embed_web_pages_%E2%80%94_Power_BI_report\">Embed web pages</a></td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"2\">Web Component (Shadow DOM) </td>\n<td data-celllook=\"0\">Simple header widget with drop-down menu (JavaScript file) </td>\n<td data-celllook=\"0\"><a href=\"/doc/423/25.1/webcomponentscustomwidget#Embed_a_custom_header_with_dropdown_navigation\">Embed a custom header with dropdown navigation </a></td>\n</tr>\n<tr aria-rowindex=\"4\" role=\"row\">\n<td>Power BI Report as full page widget (Web Components implemented by Stencil) </td>\n<td><a href=\"/doc/423/25.1/webcomponentscustomwidget#Create_components_with%C2%A0Stencil\">Create components with Stencil</a></td>\n</tr>\n</tbody>\n</table>\n<p>There are also sample contents available from the marketplace (<a href=\"https://marketplace.opentext.com/itom/content/service-management-automation-custom-widgets\">Service Management Automation Custom Widgets</a>):</p>\n<ul>\n<li>Embed Business Value Dashboard in Service Portal</li>\n<li>Header widget (Web Component implemented by Stencil)</li>\n<li>ESMHoneycomb playground widget (Web Component implemented by Stencil)</li>\n<li>Footer widget (Web Component implemented by Fast)</li>\n<li>Useful Links as sidebar widget\n\t<ul>\n<li>Web Component implemented by Lit</li>\n<li>HTML contents</li>\n</ul>\n</li>\n</ul>\n<h2>Supported content types</h2>\n<p>You can embed either of Web Components or static HTML contents into Service Portal.</p>\n<h3>HTML document</h3>\n<p>You can directly embed a static HTML document into Service Portal without further changes. It's useful to wrap and inject existing HTML or content shared from third-party applications without converting it to a web components.</p>\n<h3>Web Components</h3>\n<p>You can embed your self-developed and fully-featured custom elements by following the standard <a href=\"http://github.com/WICG/webcomponents\">Web Components specifications</a>. Web Components is an emerging web standard that allows developers to create their own elements and to make these components reusable. Web Components now is a widely used and natively available feature in many web applications.</p>\n<h2>Supported encapsulation types</h2>\n<p>You can use either iframe or Shadow DOM as the encapsulation type for a custom widget.</p>\n<h3>iframe</h3>\n<p>You can use iframe to define a static HTML document or a Web Component. iframe provides a completely isolated sandbox for your Web Components and HTML document, which is very lenient on how you develop the components and what contents or libraries are imported into the components, without concerns for their impacts on Service Portal. For example, you can use any version of Angular or Vue to generate your Web Components, which can run and interact with Service Portal.</p>\n<div class=\"Admonition_Note\"><strong>Note:</strong> For content created with iframe, you must define a size limit. Scroll bars will appear if the content exceeds the defined range.</div>\n<h3>Shadow DOM</h3>\n<p>Shadow DOM is a lightweight way to isolate the DOM elements, which doesn't strictly limit the JavaScript context to a boxed boundary like iframe. You can place elements inside Shadow DOM through absolute or relative positioning. Thus you can generate a better UI layout by Shadow DOM if you want to use drop-down menus or pop-ups as the front-most element in the Header or Footer area.</p>\n<p>However, if your contents won't exceed the widget boundary, we still recommend that you use iframe due to the following reasons:<br/>\nShadow DOM doesn't isolate the JavaScript execution, so there are some limitations during Web Components implementation. For example, Web Components in Shadow DOM are likely to introduce conflicts and break the existing UI layouts or functions in Service Portal. Therefore, third-party libraries with global impact are not allowed. When you need to bring in a third-party library to your Web Components development, be sure to perform a complete evaluation and test to confirm there are no negative impacts on Service Portal.</p>\n<h2>Supported browsers</h2>\n<p>Since Web Components are run natively in all widely used browsers, the support matrix is also the same with Service Portal, which includes the latest version of Chrome, Firefox, and Chromium-based Edge.</p>\n<p>Also, you can use the latest version of JavaScript to implement the Web Components.</p>\n<div class=\"Admonition_Tip\"><strong>Note:</strong> Be sure to take the supported browsers for non-standard APIs into consideration, even if you use the latest versions of JavaScript in the Web Components development. You can check the browser compatibility for the technology in <a href=\"https://developer.mozilla.org/\">MDN</a> or <a href=\"https://caniuse.com/\">CanIUse</a> to make sure your contents can work in all supported browsers.</div>\n<h2>Security configurations for custom widgets</h2>\n<p><code>OpenText</code> isn't responsible for the security issues introduced by the custom widget components. Be cautious if you decide to bypass the out-of-the-box security restrictions in your own web components and HTML documents.</p>\n<h3>Add authorized domains for accessing external resources</h3>\n<div class=\"Admonition_Important\"><span class=\"autonumber\"><span id=\"cke_bm_4826S\" style=\"display: none;\"> </span>Important:</span> By enabling redirects to external links, you might be exposing the system to increased privacy and security vulnerabilities and exploitation. You accept that any actions taken conform to your regulatory obligations. You understand and agree to assume all associated risks and hold the company harmless for the same.</div>\n<p>The widget source file may refer to an external URL or the widget contents contain external resources. The following are examples:<span id=\"cke_bm_4826E\" style=\"display: none;\"> </span></p>\n<ul>\n<li>Loading external resources</li>\n<li>iframe from third-party applications</li>\n<li>Accessing Rest APIs in external servers</li>\n</ul>\n<p>In this case, you need to set the trusted domain in <a href=\"/doc/423/25.1/appsettings#Authorized_domains_for_navigation\">Application Settings</a></p>\n<div class=\"Admonition_Note\"><strong>Note:</strong> If you don't add the external resource as a trusted domain, the custom widgets may not load or work as expected and the resources may be blocked due to a violation of the CPS policy. In such cases, users may get an error message from the browser console stating which resources are blocked and why.</div>\n<h3>Configure the Access-Control-Allow-Origin header</h3>\n<p>Service Portal uses the default Referrer Policy when performing cross domain requests. When your widgets refer to external resources, if the remote server has CORS (Cross-Origin-Resource-Sharing) restrictions, you need to configure the <code>Access-Control-Allow-Origin</code> header.</p>\n<p>For example, the custom Header widget may refer to an image from an external web server, but the server doesn't allow sharing this image resource to Service Management. In this case, you must add the Service Portal domain in the value of the response header:</p>\n<pre>Access-Control-Allow-Origin: https://serviceportal.example.com</pre>\n<h3>Set the file allowlist for custom widget configurations</h3>\n<div class=\"Admonition_Important\"><span class=\"autonumber\">Important:</span> By selecting to change the default file type upload option, you are disabling or bypassing security features, thereby exposing the system to increased security risks. By using this option, you understand and agree to assume all associated risks and hold the company harmless for the same.</div>\n<p>By default, the file types for custom widget (.js, .css, .html) aren't allowed by the system. Before you configure the widgets, be sure to set an appropriate <strong>Max file size</strong> and add the .js, .html, or .css file type (which depends on what type of source file you will use) to the file allowlist. The file settings can be configured in the tenant details form from Suite Administration. For SaaS users, contact the SaaS operations team to change these settings.</p>\n<p>Note that this change will impact the entire tenant. For security concerns, you can rollback these configuration changes after all widgets are configured. The file setting changes afterwards won't impact on the existing custom widget configurations.</p>\n<h2>Create custom widgets in Service Portal</h2>\n<p>To create a custom widget in Service Portal, follow the steps:</p>\n<h3>Set the name of the widget</h3>\n<p>Define the name of your custom widget. For the Full page widgets, the name will be used as the page title.</p>\n<h3>Set the position and the size of the widget</h3>\n<p>Select the position where you want to add this widget. Then, define the size of your custom widget.</p>\n<p>You may add the widget to the in the predefined locations as follows. The configurations for each location may slightly vary based on the context in the viewport.</p>\n<ul>\n<li><strong>Header</strong>: Above the out-of-the-box header in Service Portal.<br/>\n\tHere you may place an additional header which is consistent with your corporate brand. This custom header will co-exist with the Service Portal header and always displayed at the top of the screen\n\t<ul>\n<li><strong>Height:</strong> Set the height in terms of pixels</li>\n</ul>\n<a class=\"image\" href=\"/file/images/5/5c/Add_custom_widgets_Header.png\" title=\"/file/images/5/5c/Add_custom_widgets_Header.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/5/5c/Add_custom_widgets_Header.png\" height=\"225\" hspace=\"0\" src=\"../../../images/Add_custom_widgets_Header_271329f3.png\" style=\"width:300px;height:225px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"300\"/> </a></li>\n<li><strong>Footer</strong>: At the bottom of the pages in Service Portal. The footer is always displayed at the bottom of the screen.\n\t<ul>\n<li><strong>Height:</strong> Set the height in terms of pixels</li>\n</ul>\n<a class=\"image\" href=\"/file/images/d/d4/Add_custom_widgets_Footer.png\" title=\"/file/images/d/d4/Add_custom_widgets_Footer.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/d/d4/Add_custom_widgets_Footer.png\" height=\"195\" hspace=\"0\" src=\"../../../images/Add_custom_widgets_Footer_00015af6.png\" style=\"width:300px;height:195px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"300\"/> </a></li>\n<li><strong>Landing page</strong>\n<ul>\n<li>Custom widgets can be added along with the category tiles in the landing page. You can set the size of the custom widgets in this area relative to the sizing of the category tiles.\n\t\t<ul>\n<li><strong>Above the Categories</strong>: 1 unit = the width/height of 1 category tile\n\t\t\t<ul>\n<li><strong>Number of category tile columns for width:</strong> Set the width in terms of category tile columns. If you set a number larger than the total number of category tile columns, the widget will be displayed with the width equal to the width of total category tile columns.</li>\n<li><b>Number of category tile rows for height:</b> If you define a widget above the categories, its height can only be set as 1 unit.</li>\n</ul>\n</li>\n<li><strong>Below the Categories</strong>: 1 unit = the width/height of 1 category tile\n\t\t\t<ul>\n<li><strong>Number of category tile columns for width:</strong> Set the width in terms of category tile columns. If you set a number larger than the total number of category tile columns, the widget will be displayed with the width equal to the width of total category tile columns.</li>\n<li><strong>Number of category tile rows for height:</strong> Set the height in terms of category tile rows. Maximum height: 6 units.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<a class=\"image\" href=\"/file/images/2/29/Add_custom_widgets_Landing.png\" title=\"/file/images/2/29/Add_custom_widgets_Landing.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/2/29/Add_custom_widgets_Landing.png\" height=\"227\" hspace=\"0\" src=\"../../../images/Add_custom_widgets_Landing_07531ba7.png\" style=\"width:300px;height:227px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"300\"/> </a></li>\n<li><strong>Sidebar</strong>\n<ul>\n<li><strong>Height:</strong> Set the height in terms of pixels</li>\n<li><strong>Position in sidebar : </strong>You can place the sidebar custom widgets to the following positions.<br/>\n\t\tThe <strong>Landing Page Sidebar</strong> widgets are only displayed in the sidebar of landing page. The <strong>All Other Page Sidebars</strong> widgets are displayed in all other pages apart from the landing page.\n\t\t<ul>\n<li><strong>Top - Landing Page Sidebar:</strong> At the top of the sidebar in the landing page</li>\n<li><strong>Bottom - Landing Page Sidebar:</strong> At the bottom of the sidebar in the landing page</li>\n<li><strong>Top - All Other Page Sidebars: </strong>At the top of the sidebar in all other pages apart from the landing page</li>\n<li><strong>Bottom - All Other Page Sidebars:</strong> At the bottom of the sidebar in all other pages apart from the landing page</li>\n</ul>\n</li>\n</ul>\n<a class=\"image\" href=\"/file/images/4/42/Add_custom_widgets_Sidebar.png\" title=\"/file/images/4/42/Add_custom_widgets_Sidebar.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/4/42/Add_custom_widgets_Sidebar.png\" height=\"225\" hspace=\"0\" src=\"../../../images/Add_custom_widgets_Sidebar_df340ed6.png\" style=\"width:300px;height:225px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"300\"/> </a></li>\n<li><strong>Full page</strong><br/>\n\tFull page isn't placed in a specific position in Service Portal. This type of widget can be displayed as a whole page with consistent appearance like other functionality pages, such as the Offering details pages or Request Tracking pages.<br/>\n\tTo embed a full page in Service Portal, you can firstly upload the source file to generate a URL for accessing this widget. Then, you can copy this URL from the configuration list (For example, the \"BI Report\" link in below image) and then place the link in other widgets or even in a category tile.\n\t<ul>\n<li><strong>Height auto-fit with content: </strong>When selected, the height of the page will be automatically adjusted to properly display the contents.\n\t\t<div class=\"Admonition_Note\"><strong>Note: </strong>For Web Components, since the internal scrollbar may still appear inside the widget, so the <strong>Height auto-fit with content</strong> option isn't always reliable. For example, some SVG contents or the contents with collapsing margins are likely to meet with this issue. To avoid such issues, you can directly use the CSS stylesheet and make the height of the contents predictable, or you may set a fixed height which is larger than the expected height to accommodate the contents.</div>\n</li>\n</ul>\n<a class=\"image\" href=\"/file/images/c/c9/Add_custom_widgets_FullpageLink.png\" title=\"/file/images/c/c9/Add_custom_widgets_FullpageLink.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/c/c9/Add_custom_widgets_FullpageLink.png\" src=\"../../../images/Add_custom_widgets_FullpageLink_50a0fe42.png\" vspace=\"0\"/> </a><br/>\n<a class=\"image\" href=\"/file/images/7/7a/Add_custom_widgets_FullPage.png\" title=\"/file/images/7/7a/Add_custom_widgets_FullPage.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/7/7a/Add_custom_widgets_FullPage.png\" height=\"221\" hspace=\"0\" src=\"../../../images/Add_custom_widgets_FullPage_7a4b6aa2.png\" style=\"width:300px;height:221px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"300\"/> </a></li>\n</ul>\n<h4>A glance of all custom widget locations:</h4>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Position</th>\n<th scope=\"col\">Content</th>\n<th scope=\"col\">Supported Encapsulation</th>\n<th scope=\"col\">Sizing</th>\n<th scope=\"col\">Lifecycle</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Header</td>\n<td>Web Components<br/>\n\t\t\tHTML document</td>\n<td>Shadow DOM<br/>\n\t\t\tiframe</td>\n<td>Fixed height, responsive width.</td>\n<td>External</td>\n</tr>\n<tr>\n<td>Footer</td>\n<td>Web Components<br/>\n\t\t\tHTML document</td>\n<td>Shadow DOM<br/>\n\t\t\tiframe</td>\n<td>Fixed height, responsive width.</td>\n<td>External</td>\n</tr>\n<tr>\n<td>Sidebar</td>\n<td>Web Components<br/>\n\t\t\tHTML document</td>\n<td>Shadow DOM<br/>\n\t\t\tiframe</td>\n<td>Fixed height, align with Sidebar width</td>\n<td>Current page</td>\n</tr>\n<tr>\n<td>Landing page</td>\n<td>Web Components<br/>\n\t\t\tHTML document</td>\n<td>Shadow DOM<br/>\n\t\t\tiframe</td>\n<td>Height and width relative to the category tile.</td>\n<td>Landing page only</td>\n</tr>\n<tr>\n<td>Full page</td>\n<td>Web Components<br/>\n\t\t\tHTML document</td>\n<td>Shadow DOM<br/>\n\t\t\tiframe</td>\n<td>Fixed height or auto fit with content. Responsive width.</td>\n<td>Current page of this widget</td>\n</tr>\n</tbody>\n</table>\n<h3>Upload the source file</h3>\n<p>You may create the widget with the following encapsulation types:</p>\n<ul>\n<li>Web Components (Shadow DOM)</li>\n<li>Web Components (iframe)</li>\n<li>HTML (iframe)</li>\n</ul>\n<p>Pay attention to the following:</p>\n<ul>\n<li>You can't use the same CustomElement name for different custom widgets encapsulated with Web Components (Shadow DOM) due to the Web Components specification.<br/>\n\tThe following table gives examples.\n\t<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<thead>\n<tr>\n<th scope=\"col\">Example</th>\n<th scope=\"col\">Allowed?</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Two custom widgets, with the same CustomElement name, both encapsulated with Web Components (Shadow DOM)</td>\n<td>No</td>\n</tr>\n<tr>\n<td>Two custom widgets, with the same CustomElement name, both encapsulated with Web Components (iframe)</td>\n<td>Yes</td>\n</tr>\n<tr>\n<td>Two custom widgets, with the same CustomElement name, one encapsulated with Web Components (Shadow DOM), another encapsulated with Web Components (iframe)</td>\n<td>Yes</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>You need to follow the restrictions of <a href=\"https://html.spec.whatwg.org/#valid-custom-element-name\">Web Components Standard</a> when creating and naming the custom element.</li>\n</ul>\n<p>See the following for details for each encapsulation type.</p>\n<p><strong>Web Components (Shadow DOM)</strong></p>\n<p>If you use Shadow DOM to create Web Components in JavaScript, select this option and upload your .js source file.</p>\n<p>For<strong> CustomElement name</strong>, specify the name of the custom element from your Web Components.</p>\n<p><strong>Web Components (iframe)</strong></p>\n<p>If you use iframe to create Web Components in JavaScript, select this option and upload your .js source file.</p>\n<ul>\n<li><strong>CustomElement name:</strong> Specify the name of the custom element from your Web Components.</li>\n<li><strong>(Optional) CSS file source:</strong> If you need to add CSS styles to the Web Components, upload your .css source file in this field.</li>\n</ul>\n<p><strong>HTML (iframe)</strong></p>\n<p>If you use iframe to create the HTML contents, select this option and upload your .html source file.</p>\n<p><strong>A glance of all custom widget types:</strong></p>\n<table>\n<thead>\n<tr>\n<th scope=\"row\"></th>\n<th scope=\"col\">Custom element name</th>\n<th scope=\"col\">JavaScript file</th>\n<th scope=\"col\">CSS file</th>\n<th scope=\"col\">HTML file</th>\n<th scope=\"col\">Notes</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<th scope=\"row\">Web Components (Shadow DOM)</th>\n<td>Required</td>\n<td>Required</td>\n<td>-</td>\n<td>-</td>\n<td>In Shadow DOM, all the contents should be self-contained in a single file.</td>\n</tr>\n<tr>\n<th scope=\"row\">Web Components (iframe)</th>\n<td>Required</td>\n<td>Required</td>\n<td>Optional</td>\n<td>-</td>\n<td>The CSS contents can be separated from Web Components.</td>\n</tr>\n<tr>\n<th scope=\"row\">HTML (iframe)</th>\n<td>-</td>\n<td>-</td>\n<td>-</td>\n<td>Required</td>\n<td>All contents can be bundled into one HTML file; JavaScript or CSS can be coded inline or linked to an external web server.</td>\n</tr>\n</tbody>\n</table>\n<h2>Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/htmlcustomwidget\">Development guide for HTML widgets</a> </li>\n<li><a href=\"/doc/423/26.1/webcomponentscustomwidget\">Development guide for Web Components widgets</a></li>\n<li><a href=\"/doc/423/26.1/communicationbetweenwidgetssmax\">Communication between widgets and SMAX</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}