{
  "title": "Create an offering",
  "content": "<div class=\"mw-parser-output\">\n \n\n<p>You define offerings in the Service Catalog Management module. From Service Catalog, you can create standard offerings and aggregated offerings.</p>\n<h2 class=\"mw-headline\" id=\"Create_an_offering\">Create an offering</h2>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Plan &gt; Service Catalog</b>.</li>\n<li>\n<p>Do one of the following:</p>\n<ul>\n<li><b>Service Catalog &gt; Catalog</b>: Select a category, and a service definition under which to add the offering, and in the <b>Offering</b> pane, click <b>Add</b>.</li>\n<li>\n<p><b>Service Catalog &gt; Offerings</b>: Click <a class=\"image\" href=\"\"> <img alt=\"NewIcon.png\" data-file-height=\"18\" data-file-width=\"17\" src=\"../../../images/NewIcon_7074e789.png\" style=\"width: 17px; height: 18px;\"/> </a> <b>New</b>.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>In the <b>New Offering</b> dialog box, complete the <b>Offering details</b> section.</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Display label</td>\n<td>The name of the offering. This is used as the display label.</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>A description of the offering.</td>\n</tr>\n<tr>\n<td>Offering bundle</td>\n<td>\n<p>Select this check box to indicate that the offering is an offering bundle, that is, a bundle of offerings.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<p>An offering bundle can only be a <b>Service Offering</b> or <b>HR Support Offering</b>.</p>\n</div></div></div>\n</td>\n</tr>\n<tr>\n<td>Default offering</td>\n<td>\n<p>Select this check box to define the offering as a default offering. Default offerings are used in the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span> in the Request Support screen. When the system suggests offerings and no suitable offering is selected by the user, the default offering is used. See <a href=\"/doc/423/26.1/setfeature#Request_offering_on_Self-Service_Portal_request\" title=\"Request offering on Self-Service Portal request\">Request offering on Self-Service Portal request</a>.</p>\n<p>You can create multiple default offerings, for example based on a user’s entitlement rules.</p>\n<p><b>Use-case example</b>: In multinational organizations, local IT can set default offerings for all users with the same location. This way the offering is ready to be routed to the right help desk in the right location.</p>\n</td>\n</tr>\n<tr>\n<td>Service definition</td>\n<td>The service to which the offering belongs.</td>\n</tr>\n<tr>\n<td>Offering type</td>\n<td>\n<ul>\n<li><b>Support Offering.</b> Offering related to support requests.</li>\n<li><b>Service Offering.</b> Offering related to service requests.</li>\n<li><b>HR Support Offering.</b> Offering related to human resources requests.</li>\n<li><strong>Case Offering</strong>: Offering related to case requests.</li>\n</ul>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<p>If <b>Offering bundle</b> is selected, this value is restricted to <b>Service Offering</b> and <b>HR Support Offering</b>.</p>\n</div></div></div>\n</td>\n</tr>\n<tr>\n<td>Status</td>\n<td>\n<ul>\n<li>\n<p><b>Active</b>. The offering is available in the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span> and in the Service Request Management module, depending on the entitled audience. The offering is also available to an Agent dealing with a Live Support call.</p>\n</li>\n<li>\n<p><b>Inactive</b>. The offering isn't available in the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span>, nor in the Service Request Management module.</p>\n</li>\n<li>\n<p><b>Internal</b>. The offering isn't available to a user in the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span>, but it's available in the Service Request Management module. The offering is also available to an Agent dealing with a Live Support call.</p>\n</li>\n<li>\n<p><strong>Unpublished. </strong>This status is used when the offering isn't active in the catalog but is still available for cloud subscription operations. For example, when a subscription is migrated from CSA to Cloud Management, although the associated offering in CSA has been deleted, an \"Unpublished\" offering should still be available in Cloud Management to support the cloud subscription lifecycle. When the offering is in the \"Unpublished\" status, the offering isn't available in Service Portal, nor in the Service Request Management module. However, end users can still modify or cancel the associated subscriptions in Service Portal.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Promote</td>\n<td>\n<p>The value in this field controls the order in which offerings (and articles, using a similar field) display on the catalog and category pages of the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span>.</p>\n<p>The priority order of the display is:</p>\n<ul>\n<li>\n<p>Recommended</p>\n</li>\n<li>\n<p>Normal</p>\n</li>\n<li>\n<p>Deprecated</p>\n</li>\n</ul>\n<p>This feature allows the IT department to promote offerings. For example, they may want to promote a new Skype for Business headset so that more users start using Skype for Business. It can also help them phase out old offerings, but still keep the offerings at hand in case they are needed again.</p>\n</td>\n</tr>\n<tr>\n<td>Action type</td>\n<td>\n<p>If appropriate, select the action to match the offering.</p>\n<p>For example, for an offering that creates a subscription, select <b>Create subscription</b>. For an offering that cancels a subscription, select <b>Cancel</b>. For an offering that updates a record, select <b>Update</b>.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>If you set <b>Action type</b> as<strong> Update</strong>, <strong>Cancel </strong>or <strong>Pause</strong> rather than<strong> </strong><b>Create subscription</b>, and select the <b>Required asset information</b> as <b>Subscription</b> in an offering, then create a request based on this offering, the subscription won't be changed even if the request is fulfilled.</div></div></div>\n</td>\n</tr>\n<tr>\n<td>Required asset information</td>\n<td>\n<p>Defines the asset - device, infrastructure, actual service, enterprise asset, or subscription - required to classify a request under this offering. This is sometimes connected to <b>Action type</b>.</p>\n<p>For example, assume there is an offering <b>Increase VM memory</b>. The <b>Action type</b> for the offering is <b>Update</b>. The <b>Required asset information</b> would be <b>Device</b>, because to fulfill the request, the help desk first needs to know which VM should have its memory increased, and fulfilling the request would update the VM record.</p>\n<p>As another example, assume there is an offering <b>Check my PC age</b>. Again the help desk needs to know which PC the request is for. So, the <b>Required asset information</b> would be <b>Device</b>. But in this case, <b>Action type</b> would be left empty, because the offering isn't intended to create, update, cancel, or pause the device.</p>\n<p><b>Available when: Action type</b> is <b>not </b><i>Create</i><i> subscription</i>.</p>\n</td>\n</tr>\n<tr>\n<td>Require company information</td>\n<td>This field is available when CSM is enabled and the offering type is Service, Support, or Case. Selecting the checkbox makes the <strong>Requested by company</strong> and <strong>Requested for company</strong> information mandatory when creating a service, support, or case request.</td>\n</tr>\n<tr>\n<td>Required entitlement information</td>\n<td>\n<div>This field is available only when CSM is enabled and the offering type is Service, Support, or Case. It has two options:</div>\n<ul>\n<li><strong>Product</strong>: Selecting this option makes the<strong> Product instance</strong> information mandatory when creating a service, support, or case request.</li>\n<li><strong>Product and Entitlement</strong>: Selecting this option makes both <strong>Product instance</strong> and <strong>Entitlement</strong> information mandatory when creating a service, support, or case request.</li>\n</ul>\n<div>If no option is selected, <strong>Product Instance</strong> and <strong>Entitlement</strong> information are not required when creating a service, support, or case request.</div>\n</td>\n</tr>\n<tr>\n<td>Image</td>\n<td>A representative icon for the offering.</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p>Select an SLA and an OLA/UC in the <b>Agreements</b> session. Only active agreements appear in the drop-down lists. Selected agreements determine the Service Level Target for the request based on this offering. For more information, see <a href=\"/doc/423/26.1/servicelevelmgmt\" title=\"SMAX:Main/ServiceLevelMgmt\">Service Level Management</a>.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<p>The maximum number of offerings that can be assigned to an agreement is 250.</p>\n</div></div></div>\n</li>\n<li>\n<p>If Offering bundle is selected, add offerings in the <b>Bundled offering</b> session.</p>\n<ol>\n<li>\n<p>Click <b>Add</b> or the grid icon <a class=\"image\" href=\"\"> <img alt=\"Grid icon\" data-file-height=\"16\" data-file-width=\"16\" src=\"../../../images/EntityPickerIcon_40fcd801.png\" style=\"width: 16px; height: 16px;\"/> </a> .</p>\n</li>\n<li>Select the required records. The added items appear in yellow</li>\n</ol>\n</li>\n<li>Save your changes.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Create_an_aggregated_offering\">Create an aggregated offering</h2>\n<p>An aggregated offering is an offering based on a service in a provider. For example, if you have enabled service design and deployment in Service Management as a provider, you can create aggregated offerings.</p>\n<p><b>Notes</b>:</p>\n<ul>\n<li>To enable Service Management agents to create aggregated offerings, the tenant admin first needs to turn on the <b>Enable aggregation</b> feature and make sure that at least one of the experience modes available in this release is selected in <b>Administration</b> &gt; <b>Configuration</b> &gt; <b>Application Settings</b>. Then, the tenant admin has to add service providers in the <b>AGGREGATION PROVIDERS</b> view from <b>Administration</b> &gt; <b>Utilities</b> &gt; <b>Providers</b> before the catalog admin can see the offerings to be aggregated.</li>\n<li>The catalog admin who creates an aggregated offering must have the \"View\" right on the \"Provider\" table. Otherwise, the provider list will not be listed in the <b>New Aggregated Offering</b> dialog box. This right has been added to the out-of-the-box \"Catalog Administrator\" role in this release while in a system upgraded to the current version, you need to manually add the \"View\" right on the \"Provider\" table.</li>\n</ul>\n<p>To create an aggregated offering, follow these steps:</p>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Plan &gt; Service Catalog &gt; Catalog</b>. <b>Note</b>: You can't create an aggregated offering by clicking the <b>New</b> button from <b>Plan</b> &gt; <b>Service Catalog</b> &gt; <b>Offerings</b>.</li>\n<li>Select a category, and then select a service definition.</li>\n<li>In the <b>Offering</b> pane, click <b>Add</b>, and then click <b>Add an aggregated offering</b>. The <b>New Aggregated Offering</b> dialog box is displayed.</li>\n<li>Select a service provider, and then select a service from the provider. You can filter services by using tags, or run a search against the display title, description of services, or service versions.<br/>\n<strong>Note</strong>: The search allows you to search for published services only from the selected provider.</li>\n<li>Define a display label for the aggregated offering.</li>\n<li>Click <b>SAVE &amp; EDIT</b> to create the offering. The <b>Offering details</b> page is displayed. When the aggregated offering is created, the following fields are populated with default values:\n\t<ul>\n<li><b>Status</b>: <code>Inactive</code></li>\n<li><b>Offering type</b>: <code>Service Offering</code></li>\n<li><b>Provider</b>: &lt;The provider name of the service.&gt;</li>\n<li><b>Action type</b>: <code>Create, update, cancel or pause</code> In addition, a default fulfillment task plan is added to the aggregated offering to support these action types. In this release, Create Subscription, Modify Subscription, and Cancel Subscription are supported in the out-of-the-box task plan.</li>\n</ul>\n</li>\n<li>Update your offering settings as needed. For example, you must change the status to <b>Active</b> for the offering to be displayed in Service Portal.<br/>\n\t </li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Duplicate_an_offering\">Duplicate an offering</h2>\n<p>Duplicating offerings is useful if you want to use the same or a very similar definition of a complex offering but for a different purpose. For example, you may have an offering for a new laptop which has a complex task plan and user options. You can duplicate this offering, and use it as a basis for an offering for a new monitor.</p>\n<p>To duplicate an offering:</p>\n<ol>\n<li>\n<p>In the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Service Catalog &gt; Offerings</b>.</p>\n</li>\n<li>\n<p>Select the offering you want to clone.</p>\n<p>To filter the record list, click the <b>Add filter</b>  <a class=\"image\" href=\"\"> <img alt=\"FilterByIcon.png\" data-file-height=\"18\" data-file-width=\"19\" src=\"../../../images/FilterByIcon_8e3dccb1.png\" style=\"width: 19px; height: 18px;\"/> </a> button. For more information, see <a href=\"/doc/423/26.1/filters\" title=\"SMAX:Main/Filters\">Filters</a>.</p>\n</li>\n<li>\n<p>Click the record identifier in the <b>ID</b> column to display the selected record.</p>\n</li>\n<li>\n<p>On the toolbar, click <b>Duplicate</b>.</p>\n<p>The offering is duplicated, and given the same name as the source offering with the suffix, <b>-Copy</b>. For example, <b>NewPC-Copy</b>.</p>\n<p>The following are copied:</p>\n<ul>\n<li>\n<p>All general details</p>\n</li>\n<li>\n<p>Task and approval plans/Fulfillment plan</p>\n</li>\n<li>\n<p>User options/Fulfillment plan</p>\n</li>\n<li>\n<p>Default values</p>\n</li>\n<li>\n<p>In the case of an offering bundle, the bundled offerings and the user option mappings.</p>\n</li>\n<li>\n<p>Prices</p>\n</li>\n<li>\n<p>Business rules</p>\n</li>\n</ul>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<p>The following aren't copied:</p>\n<ul>\n<li>History</li>\n<li>Discussions</li>\n<li>The popularity of the offering</li>\n<li>The number of times the offering has been requested</li>\n</ul>\n</div></div></div>\n</li>\n<li>Edit the new offering as desired and save the offering.</li>\n</ol>\n<div class=\"transcontent stn-end--duplicateanoffering\"></div>\n<h2 class=\"mw-headline\" id=\"Fulfillment_plan\">Fulfillment plan</h2>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<p>This isn't relevant for offering bundles.</p>\n</div></div></div>\n<p>If you defined user options and a task plan for the offering record in the steps above, you can publish these definitions as a fulfillment plan, which can subsequently be used as a fulfillment plan for other offerings, instead of defining them all over again.</p>\n<p>To publish the user options and task plan as a fulfillment plan:</p>\n<ol>\n<li>In the <b>User Options</b> or <b>Task plan</b> tab, click <b>Publish as fulfillment plan</b>.</li>\n<li>Enter a name and a description for the fulfillment plan.</li>\n<li>\n<p>Select the plan type.<br/>\n\tFor a service offering, you can select <strong>Service Request</strong> or <strong>Cloud Service Request</strong>; for a support offering, you can select<strong> Support Request</strong>; for a case offering, you can select<strong> Case Request</strong>. <br/>\n\tFor the \"Service Request\", \"Case Request\", or \"Support Request\"<strong> </strong>plan<strong> </strong>type, the user option names and task plan are saved to the fulfillment plan, while the user option values are not saved to the fulfillment plan. For the \"Cloud Service Request\" plan type, only the task plan is saved to the fulfillment plan. The new fulfillment plan will not be automatically applied to the offering. <br/>\n<strong>Note</strong>: If the fulfillment plan is published from a service offering and the plan type is selected as \"Cloud Service Request\", the reference to user options in the task plan will not work and you need to further modify the task plan in the fulfillment plan as needed.</p>\n</li>\n<li>\n<p>Save the fulfillment plan.</p>\n</li>\n</ol>\n<p>For more details about fulfillment plans, see <a href=\"/doc/423/26.1/fulfillmentplan\" title=\"SMAX:Main/FulfillmentPlan\">How to create or edit a fulfillment plan</a>.</p>\n<div class=\"transcontent stn-end--FulfillmentPlan\"></div>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}