{
  "title": "Create and configure custom application and record type",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>In addition to managing existing applications and records, you can also create custom applications and their record types by using the <b>Menu</b> tab of Studio, and then configure and activate them.</div>\n<h2>Create the custom application and record type</h2>\n<div>Use the <b>Menu</b> tab of Studio to create an application and its record type:</div>\n<ol>\n<li>Open <b>Administration</b> &gt; <b>Configuration</b> &gt; <b>Studio</b>.</li>\n<li>Click the <b>MENU</b> tab.</li>\n<li>Select a <b>Category</b>, click <b>Add</b> in the <b>Application</b> panel.</li>\n<li>Enter the following fields:\n\t<ul>\n<li><b>Application name</b>, the name of the application, with the suffix <b>_c</b>, indicating that it's a custom application.</li>\n<li><b>Multilingual title</b>, the display name on the <b>Application</b> panel and Service Management menu.</li>\n<li><b>Multilingual header</b>, the menu header.</li>\n<li><b>Insert after</b>, where you want to place the application.</li>\n</ul>\n</li>\n<li>Select the application you created, then click <b>Add</b> in the <b>Record type</b> panel.</li>\n<li>Enter the following fields:\n\t<ul>\n<li><b>Record type</b>, the name of the record type, with the suffix <b>_c</b>, indicating that it's a custom record type.<br/>\n<b>Note:</b> The maximum length of a record type is 23 characters including _c.</li>\n<li><b>Multilingual label</b>, the label of the right-side panel when you select a record.</li>\n<li><b>Display name (sub menu)</b>, the sub menu header.</li>\n<li><b>Display name (browser)</b>, the display name of the browser tab.</li>\n<li><b>Insert after</b>, where you want to place the record type.</li>\n<li><b>Primary key definition</b>, the primary key of this record type. You can choose to have no primary key, use DisplayLabel as the primary key, or create a new field as the primary key.</li>\n</ul>\n</li>\n</ol>\n<div class=\"Admonition_Note\"><span class=\"autonumber\">Note</span> Currently, the maximum number of custom record types is 100 per tenant. Please be aware that after a custom record type is created, the quota will be used and will not be released even if you deactivate it. In addition, once a custom application type is created, it can be removed from the menu but can't be removed from Studio.</div>\n<h2 class=\"mw-headline\" id=\"Configure_Forms_of_the_record_type\">Configure forms of the record type</h2>\n<p>After creating a record type, define the following three forms before you can activate the record type:</p>\n<ul>\n<li><b>New form</b></li>\n<li><b>Preview form</b></li>\n<li><b>Full form</b></li>\n</ul>\n<p>Refer to <a href=\"/doc/423/26.1/forms\" title=\"SMAX:25.1/Forms\">Forms</a> for more information about how to define forms.</p>\n<h2 class=\"mw-headline\" id=\"Configure_processes_and_rules_of_the_record_type\">Configure processes and rules of the record type</h2>\n<p>After creating a record type, define processes and business rules for it before you can activate it.</p>\n<p>Refer to <a href=\"/doc/423/26.1/processes\" title=\"SMAX:25.1/Processes\">Processes and Rules</a> for more information about how to define processes and rules.</p>\n<h2 class=\"mw-headline\" id=\"Activate_the_application_and_record_type\">Activate the application and record type</h2>\n<p>After the workflow and forms are configured, you can go back to the <b>Menu</b> tab of the Studio, click <b>Activate</b> in the drop-down list of the record type. The application will show up on the main menu.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> You may also want to set up more behaviors for the custom record type through the other features of the Studio. See <a href=\"/doc/423/26.1/records\" title=\"SMAX:25.1/Records\">Studio</a> for more information.</p>\n</div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}