{
  "title": "How to create an account",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><ol>\n<li>\n<p>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, click <b>Accounts</b>.</p>\n</li>\n<li>\n<p>Click <a class=\"image\" href=\"/file/images/c/cc/2018.08_Helpcenter/Resources/Images/Icons/NewIcon.png\" title=\"/file/images/c/cc/2018.08_Helpcenter/Resources/Images/Icons/NewIcon.png\"> <img alt=\"New\" data-file-height=\"18\" data-file-width=\"17\" height=\"18\" src=\"../../../images/NewIcon_7074e789.png\" width=\"17\"/> </a> <b>New</b>.</p>\n</li>\n<li>\n<p>In the <b>New account</b> dialog box, provide all requested information. This dialog box requests values for the basic attributes.</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Enable suite SSO</td>\n<td>\n<p>Suite Single Sign-On (SSO) enables the users to use single identity and password to log in to all connected suite applications. If Enable suite SSO is Yes, the configured authentications of this account are shared by all connected suite applications. For example, if you create a suite SSO enabled account and specify LDAP as the authentication type, this LDAP connection configuration is shared by all connected suite applications.</p>\n<p>You can only specify one account to enable suite SSO.</p>\n<p>This field is displayed only when UCMDB is installed in the suite and no account is enabled suite SSO.</p>\n</td>\n</tr>\n<tr>\n<td>Authentication type</td>\n<td>\n<p>This field appears only when<strong> Enable suite SSO</strong> is <strong>Yes</strong>.</p>\n<p>Specify the authentication type.</p>\n<ul>\n<li>\n<p><b>SAML:</b> User credentials are stored in federated identity providers using SAML protocol. Users with this authentication type can log in to Service Management tenants that belong to this account and UCMDB instance using SSO. Go to <a href=\"/doc/423/26.1/editaccount#Authentication\" title=\"SMAX:25.1/EditAccount\">Authentication tab</a> to configure the SAML settings.</p>\n<p>Note:</p>\n<p>To log in to UCMDB with the user credentials of SAML, perform the following steps:</p>\n<ol>\n<li>Before enable suite SSO and configure SAML authentication, create a user in UCMDB with the same login name of the user in SAML.</li>\n<li>Configure admin role and right for this user in UCMDB.</li>\n<li>\n<p>Enable suite SSO and configure SAML authentication type. Now this user can log in to Service Portal and UCMDB with SSO.</p>\n</li>\n<li>For the other users without admin role, they need to log in to Service Portal first, and then the user with admin role can configure role and right for them in UCMDB.</li>\n</ol>\n</li>\n<li>\n<p><b>LDAP:</b> User credentials are stored in LDAP servers. Users with this authentication type can log in to Service Management tenants that belong to this account and UCMDB instance using SSO. Go to <a href=\"/doc/423/26.1/saconfig#LDAP\" title=\"SMAX:25.1/saConfig\">LDAP for UCMDB tab</a> in Configurations to configure the LDAP settings.</p>\n</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>To visit UCMDB from Service Management, users except Tenant Admin need to be assigned with Allows view service modeling permission in Service Management.</p>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>Shared service type</td>\n<td>\n<p>Select the shared service type of the account, which determines the shared service type of the tenant.</p>\n<ul>\n<li><b>Provider:</b> Provider tenants can manage the business data of managed tenants.</li>\n<li><b>Managed:</b> Managed tenants are client tenants hosted by shared service providers. The shared service agents in the provider tenant manage the service cases.</li>\n<li><b>Standard</b>: Standard tenants are ordinary tenants and are irrelevant to shared service.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Shared service customer code</td>\n<td>\n<p>Enter 3 characters consisting of uppercase letters or numbers to identify the managed tenant. This code needs to be unique and appears in the MT Console as the prefix to all incidents and requests belonging to this managed tenant.</p>\n<p>This field appears only for the managed accounts.</p>\n</td>\n</tr>\n<tr>\n<td>Name</td>\n<td>Enter the account name.</td>\n</tr>\n<tr>\n<td>DB user login identifier</td>\n<td>Specify the login identifier that DB users use as the login user name:\n\t\t\t\t<ul>\n<li><b>Login name</b></li>\n<li><b>Email</b></li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p class=\"mw-empty-elt\"></p>\n<ul>\n<li>If you select <b>Email</b>, make sure that the email addresses for users (including all authentication types) in this account are unique. Otherwise, unexpected issues might occur if two users have the same email.</li>\n<li>\n<p>If you select <b>Email</b>, you can't change the login identifier to <b>Login name</b> after the account is created.</p>\n</li>\n</ul>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>Customer</td>\n<td>Specify the parent customer.</td>\n</tr>\n<tr>\n<td>Tier</td>\n<td>\n<p>Specify the account tier, this can be used for account rating.</p>\n<ul>\n<li>Bronze</li>\n<li>Silver</li>\n<li>Gold</li>\n<li>Platinum</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>On boarding date</td>\n<td>Specify the on boarding date of the account.</td>\n</tr>\n<tr>\n<td>Region</td>\n<td>\n<p>Specify the region of the account:</p>\n<ul>\n<li>APJ</li>\n<li>EMEA</li>\n<li>AMS</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p>Click <b>Save</b>.</p>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/accountsmgmt\" title=\"SMAX:25.1/AccountsMgmt\">Accounts</a></li>\n<li><a href=\"/doc/423/26.1/editaccount\" title=\"SMAX:25.1/EditAccount\">How to edit an account</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}