{
  "title": "Overview",
  "content": "<div class=\"mw-parser-output\">\n<h2><a id=\"Introduction\" name=\"Introduction\" title=\"Introduction\"></a><span style=\"color: rgb(22, 22, 22); font-size: clamp(1.59375rem, 18.7895px + 1.39803vw, 2.125rem);\">Introduction</span></h2>\n<p>At its core, CSM involves managing the interactions between the organization and its customers through multiple channels—such as phone, email, live chat, and in-person support. The goal is to ensure that customers receive timely, accurate, and helpful assistance, which leads to improved loyalty and retention.</p>\n<p>The broader goal of CSM is not only to solve problems but also to create positive experiences that encourage customers to remain loyal and recommend the company to others. As businesses increasingly prioritize customer experience, CSM has become a competitive differentiator, influencing both customer retention and brand reputation. By optimizing service delivery, organizations can enhance customer satisfaction, reduce churn, and ultimately, drive business success.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>Traditionally, OpenText Service Management has focused on enabling IT and business units to support their own employees within an organization. CSM extends this capability to support entire <strong>external organizations (B2B)</strong> rather than just individual users.</div></div></div>\n<p>Key components of CSM include:</p>\n<ol style=\"padding-left: 0px;\"><li style=\"--number-width: 10px; --number-spacing: 24px; margin-left: 36px; position: relative;\"><strong>Service Requests / Cases and Fulfillment</strong>: Customers often contact service teams to request information or initiate transactions. CSM involves handling these requests, whether they relate to product inquiries, technical assistance, or service changes. Efficient fulfillment processes ensure that customers get the information or service they need in a timely manner.</li><li style=\"--number-width: 13px; --number-spacing: 24px; margin-left: 36px; position: relative;\">I<strong>ncident &amp; Problem Management</strong>: This process revolves around the efficient handling of customer issues or complaints. It involves tracking, prioritizing, and resolving problems to minimize customer dissatisfaction. A strong incident management process ensures that issues are dealt with quickly and effectively, enhancing the customer experience.</li><li style=\"--number-width: 13px; --number-spacing: 24px; margin-left: 36px; position: relative;\"><strong>Knowledge Management</strong>: Providing customers with accurate and useful information is crucial in CSM. Knowledge management involves creating and maintaining a repository of frequently asked questions (FAQs), troubleshooting guides, and instructional content that both customers and support teams can access to solve common issues independently.</li><li style=\"--number-width: 13px; --number-spacing: 24px; margin-left: 36px; position: relative;\"><strong>Service Level Management</strong>: Organizations often set predefined service level agreements (SLAs) to ensure customers receive timely service. Service level management involves tracking and monitoring performance against these agreements, ensuring that response times and resolutions meet customer expectations. Adhering to SLAs builds trust and reliability.</li><li style=\"--number-width: 12px; --number-spacing: 24px; margin-left: 36px; position: relative;\"><strong>Customer Feedback and Continuous Improvement</strong>: CSM also includes gathering and analyzing customer feedback through surveys, reviews, or direct communication. This feedback helps organizations identify areas for improvement and refine their service processes, ensuring they remain aligned with customer needs and expectations.</li><li style=\"--number-width: 12px; --number-spacing: 24px; margin-left: 36px; position: relative;\"><strong>Automation and Self-Service</strong>: In today’s digital age, many customer service functions can be automated or offered as self-service options. Tools like chatbots, help centers, and knowledge bases allow customers to find solutions without direct interaction with support agents. However, when complex issues arise, human intervention is still crucial.</li></ol>\n<p><span style=\"font-size: 14px;\">In general, CSM puts customers into focus, by making it simple to access their data, by giving assistance to find answers to their questions and services they want, in a self-service manner with minimizing the need to contact an agent. </span><span style=\"font-size: 14px;\">Account managers, support agents or other representatives will get the visibility and context they need to manage the customer successfully. Providing detailed information for each customer, allow teams to easily get an overview of the customer status to create an action plan for the next steps. Such context is critical since it visualizes the unique needs and concerns of each customer and enables teams to provide personalized, effective and automated assistance.</span>​​​​​​</p>\n<p><strong>As a summary:</strong></p>\n<p>The focus of CSM is to enhance customer interactions by ensuring efficient, consistent, and high-quality service across all touchpoints. It aims to create a seamless customer experience by managing service teams, processes, and technologies effectively. CSM prioritizes customer satisfaction, quick issue resolution, and proactive engagement to build strong relationships and foster loyalty.</p>\n<p>The purpose of CSM is to improve customer retention, strengthen brand reputation, and drive business growth. By addressing customer needs efficiently, businesses can increase satisfaction and encourage repeat business. CSM also helps organizations streamline communication, optimize service operations, and use data-driven insights to enhance service quality. </p>\n<p>Additionally, CSM plays a vital role in gathering customer feedback, analyzing trends, and implementing improvements to meet evolving expectations. It aligns customer service with broader business goals, ensuring that every interaction adds value to the customer journey. Ultimately, CSM helps organizations create a customer-centric culture that leads to long-term success.</p>\n<h2><a id=\"CSM_vs_ITSM\" name=\"CSM_vs_ITSM\" title=\"CSM vs. ITSM\"></a><a id=\"CSM-vs-ITSM\" name=\"CSM-vs-ITSM\" title=\"CSM vs. ITSM\"></a><a id=\"CSM_vs._ITSM\" name=\"CSM_vs._ITSM\" title=\"CSM vs. ITSM\"></a>CSM vs. ITSM</h2>\n<p><strong>IT Service Management</strong> (ITSM) helps IT teams deliver, manage, and support IT services effectively. It focuses on optimizing IT infrastructure, ensuring system reliability, and aligning IT services with business goals.</p>\n<p><b>CSM</b> focuses on improving customer interactions by managing service teams, workflows, and technologies. It ensures that customer inquiries, complaints, and requests are handled efficiently, leading to higher satisfaction and retention.</p>\n<p>ITSM and CSM can be integrated to enhance service delivery, improve efficiency, and provide a seamless experience for both internal users and customers.</p>\n<h3><a id=\"Why_should_ITSM_and_CSM_integrate_\" name=\"Why_should_ITSM_and_CSM_integrate_\" title=\"Why should ITSM and CSM integrate?\"></a><a id=\"Why-should-ITSM-and-CSM-integrate\" name=\"Why-should-ITSM-and-CSM-integrate\" title=\"Why should ITSM and CSM integrate?\"></a><a id=\"Why_should_ITSM_and_CSM_integrate?\" name=\"Why_should_ITSM_and_CSM_integrate?\" title=\"Why should ITSM and CSM integrate?\"></a>Why should ITSM and CSM integrate?</h3>\n<ul style=\"padding-left: 0px;\"><li style=\"margin-left: 28px; position: relative;\"><strong>Improved Customer Experience</strong> – Many customer issues are related to IT services (e.g., system outages, software glitches). Integrating ITSM and CSM ensures that customer service teams can quickly escalate IT-related problems, leading to faster resolutions.  </li><li style=\"margin-left: 28px; position: relative;\"><strong>Seamless Workflow &amp; Collaboration</strong> – Integration allows customer service and IT teams to collaborate more effectively, reducing duplication of effort and ensuring that service requests, incidents, and changes are handled efficiently.  </li><li style=\"margin-left: 28px; position: relative;\"><strong>Better Visibility &amp; Tracking</strong> – A unified system provides a complete view of customer interactions and IT incidents, enabling proactive service management and preventing recurring issues.  </li><li style=\"margin-left: 28px; position: relative;\"><strong>Automation &amp; Efficiency</strong> – With integration, service requests from customers can automatically generate IT tickets and trigger predefined workflows that speed up issue resolution.  </li><li style=\"margin-left: 28px; position: relative;\"><strong>Data-Driven Insights</strong> – Combining ITSM and CSM data helps businesses identify trends, prevent common issues, and enhance both IT service quality and customer satisfaction.  </li></ul>\n<p><br/>\nBy integrating ITSM and CSM, organizations can deliver faster, more effective services, ultimately improving both operational efficiency and customer satisfaction.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"CSM with ITSM\" src=\"../../../images/CSM_ITSM2_5ab8397d.png\" style=\"border: 3px solid rgb(26, 106, 255);  width:1073px;height:472px\"/> </a></div>\n<h2><a id=\"Key-concepts-and-features\" name=\"Key-concepts-and-features\" title=\"Key concepts and features\"></a><a id=\"Key_concepts_and_features\" name=\"Key_concepts_and_features\" title=\"Key concepts and features\"></a>Key concepts and features</h2>\n<p>The following section describes several functional areas leveraged and enhanced by CSM</p>\n<table cellpadding=\"1\" cellspacing=\"1\" style=\"width: 1800px;\">\n<tbody>\n<tr>\n<td><strong>Functional area</strong></td>\n<td><strong>Description</strong></td>\n<td><strong>Related topics</strong></td>\n</tr>\n<tr>\n<td>\n<p>Product model</p>\n</td>\n<td>\n<p>Product model represents the products a company is selling. Product models can be organized hierarchically to build a product catalog. A product model can be a <strong>category</strong>, <strong>bundle</strong>, or <strong>product</strong>. Product models can have versions and modules.  </p>\n</td>\n<td>\n<p><a href=\"/doc/423/26.1/manageproductmodel\" title=\"Product model\">Manage product models</a></p>\n</td>\n</tr>\n<tr>\n<td>Product version</td>\n<td>Product versions define the available versions of a product, including the maintenance dates.</td>\n<td><a href=\"/doc/423/26.1/manageproductversion\" title=\"Product version\">Manage product versions</a></td>\n</tr>\n<tr>\n<td>Product module</td>\n<td>Product modules allow to break down the product in components, which can be used in the request handling to classify and route the requests.</td>\n<td><a href=\"/doc/423/26.1/mngprdctmodule\" title=\"Product modules\">Manage product modules</a></td>\n</tr>\n<tr>\n<td>Product Bundle Item</td>\n<td>Product Bundle Item refers to an individual product model that is part of the bundle.</td>\n<td><a href=\"/doc/423/26.1/vieworeditproductmodel#Bundled_products_tab\" title=\"Bundled products tab\">Bundled products tab</a></td>\n</tr>\n<tr>\n<td>Product instance</td>\n<td>Product instances represent the product models purchased by a customer, hence the ownership is with the entity purchased the product. A product instance is owned by a customer and can have a related version, environment and contract. In case a customer purchased a bundle, each item in the bundle will create a product instance.</td>\n<td><a href=\"/doc/423/26.1/manageproductinstance\" title=\"Product instance\">Manage product instances</a></td>\n</tr>\n<tr>\n<td>\n<p>Company and Related Parties</p>\n</td>\n<td>\n<p>Customers, partners, service providers etc are managed as Company record. Within a company record the system allows to track the type of company (customer, partner, service provider) as well as other details to know about.</p>\n<p>Within a company record the system allows to link companies with other companies to track relationships between companies, partners or service providers. These relations will then allow to entitle related companies to access services in the self service portal or work on behalf of the customer.</p>\n<p>In the related parties sections its also possible to track which users of the related companies may get entitled to services purchased by the customer.</p>\n<p>Furthermore, within the company record, an account manager or support representative gets a direct overview about the customers cases, products, licenses, contracts and entitlements.</p>\n</td>\n<td>\n<p><a href=\"/doc/423/26.1/managecompany\" title=\"Company\">Manage companies</a>, <a href=\"/doc/423/26.1/vieworeditcompanydetails#Related_parties_tab\" title=\"Related parties\">Related parties</a></p>\n</td>\n</tr>\n<tr>\n<td>Entitlements</td>\n<td>\n<p>Entitlements are owned by the company who purchased a product. It documents what level of support, for which products a customer and its users are entitled to, which means for which products the users of a customer can see Articles, Offerings or can open Requests.</p>\n<p>The owner company can delegate entitlements can to other companies like partners or child companies when a relation between the companies exists.</p>\n<p>Partner customers like Multi Service Providers can delegate entitlements to their customers, to allow their customers to find articles in the portal or to create requests themselves for the products the MSP entitled them.</p>\n<p>Once a user from the owner company or an delegated company is added to the entitlement, this user gets permissions to create/update requests for the entitled products or view articles for the entitled products.</p>\n</td>\n<td><a href=\"/doc/423/26.1/manageentitlement\" title=\"Entitlements\">Manage entitlements</a></td>\n</tr>\n<tr>\n<td>Requests / Cases</td>\n<td>Track the requests and cases the customer is raising via different channels like Email, Portal, Chat. Requests can be opened against the requester's company, but also on behalf of another company, depending on the entitlement settings. In addition Requests can be linked with Products, Entitlements, Versions and Environments to document the customer situation as detailed as possible and drive case resolution. </td>\n<td>\n<p><a href=\"/doc/423/26.1/servicerequestmgmt\" title=\"Request management\">Service request management</a></p>\n</td>\n</tr>\n<tr>\n<td>Contracts</td>\n<td>Within contract management it is possible to document the contracts made with the various stakeholders. With CSM its now also possible to track which products are covered by a contract.</td>\n<td><a href=\"/doc/423/26.1/contractsoverview\" title=\"Contract management\">Contract management</a></td>\n</tr>\n<tr>\n<td>Licenses</td>\n<td>Within licenses it is possible to document the licenses sold to the customer. As part of CSM a new license workflow called Sold Licenses was added which allows to track the products and other details covered by the license.</td>\n<td><a href=\"/doc/423/26.1/managelicense\" title=\"License\">Manage licenses</a></td>\n</tr>\n<tr>\n<td>Environments</td>\n<td>\n<p>Environments are useful to understand where, in which context, the product of a customer are running. Environments allow to track cloud-based and off-cloud environments.</p>\n<ul style=\"padding-left: 0px;\"><li style=\"margin-left: 28px; position: relative;\">Cloud based environments give an overview what instances are running on the environment Linking such environments to an actual service in SACM, gives end 2 end overview about the underlying infrastructure supporting this environment.</li><li style=\"margin-left: 28px; position: relative;\">Tracking off cloud environments from the customer can give support agents the right context to handle cases faster.</li></ul>\n</td>\n<td>\n<p><a href=\"/doc/423/26.1/manageenvironment\" title=\"Environment\">Manage environments</a></p>\n</td>\n</tr>\n<tr>\n<td>Offerings</td>\n<td>Offerings and in particular case offerings, allow customers to open requests for the issues and products. Offerings can be linked with products. In addition the Entitlement filter can be set to 'Entitled products' to ensure only users which have an entitlement for the associated products, can request the offering.</td>\n<td>\n<p><a href=\"/doc/423/26.1/servicecatalogmgmt\" title=\"Service Catalog Management\">Service Catalog Management</a></p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Articles and News</p>\n</td>\n<td>Articles and news allow customers to find and read product specific documents. Articles can be linked with products. In addition the Entitlement filter can be set to 'Entitled products' to ensure only users which have an entitlement for the associated products, can view the articles.</td>\n<td>\n<p><a href=\"/doc/423/26.1/knowledgemanagement\" title=\"Understand Knowledge management\">Understand Knowledge management</a>, <a href=\"/doc/423/26.1/knowledgemgmt\" title=\"Knowledge management\">Use Knowledge management</a></p>\n</td>\n</tr>\n<tr>\n<td>Service Level Management</td>\n<td>Service Level Management (SLM) allows you to measure the quality of service delivery by defining service level agreements with your customers to deliver their required services within pre-defined objectives.</td>\n<td><a href=\"/doc/423/26.1/servicelevelmanagement\" title=\"Understand Service level management\">Understand Service Level Management</a>, <a href=\"/doc/423/26.1/servicelevelmgmt\" title=\"Use Service level management\">Use Service Level Management</a></td>\n</tr>\n<tr>\n<td>Time Period Management </td>\n<td>Time Period Management module enables users with the appropriate permissions to create, edit, and manage time periods for use in Change and Service Level Management. </td>\n<td><a href=\"/doc/423/26.1/timemgmt\" title=\"Use Time Period Management\">Use Time Period Management</a></td>\n</tr>\n</tbody>\n</table>\n<p>The following diagram shows the relations between the different components leveraged in Customer Service Management. The diagram differentiates between minimal CSM and advanced CSM. Advanced CSM fully leverages all newly added features and enhancements about Products, Entitlements, Companies etc. Whereas minimal CSM can leverage the enhancements made in the Request module.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"Conceptional view CSM\" src=\"../../../images/CSM_Conceptional10_8984fdf0.png\" style=\"border: 3px solid rgb(26, 106, 255);  width:1185px;height:864px\"/> </a></div>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}