{
  "title": "Company management for CSM",
  "content": "<div class=\"mw-parser-output\">\n \n\n<div>This page explains the entities in the Company management module that are relevant to Customer Service Management (CSM). </div>\n<div>\n<table cellpadding=\"1\" cellspacing=\"1\">\n<tbody>\n<tr>\n<td><strong>Entity</strong></td>\n<td><strong>Description</strong></td>\n<td><strong>Related topics</strong></td>\n</tr>\n<tr>\n<td>\n<p>Product model</p>\n</td>\n<td>\n<div>\n<div>A product model captures the structure and details of what your company offers — whether it’s a standalone product, a bundle of products, or simply a way to group and classify products.</div>\n<div>Each product model falls under one of the following types:</div>\n<div><strong>Category </strong>-<strong> </strong>Use this to define logical groupings of products. Categories are not actual products — they help organize your product catalog. Example: Hardware, Software, Services.</div>\n<div><strong>Product</strong> - This represents a specific item your company sells. Example: A software application, or a hardware product.</div>\n<div><strong>Bundle</strong> - A collection of products sold together as a single unit.<br/>\n\t\t\t </div>\n</div>\n<div>Product models can also have versions and modules.</div>\n</td>\n<td>\n<p><a href=\"/doc/423/26.1/manageproductmodel\" title=\"Product model\">Manage product models</a></p>\n</td>\n</tr>\n<tr>\n<td>Product version</td>\n<td>Product versions define the available versions of a product, including the maintenance dates.</td>\n<td><a href=\"/doc/423/26.1/manageproductversion\" title=\"Product version\">Manage product versions</a></td>\n</tr>\n<tr>\n<td>Product module</td>\n<td>A product module is a subset of a product model. It can represent a specific set of features or a specific subcomponent of the product.<br/>\n\t\t\tProduct modules help break a product into manageable components, making it easier to classify and route requests effectively during request handling.</td>\n<td><a href=\"/doc/423/26.1/mngprdctmodule\" title=\"Product modules\">Manage product modules</a></td>\n</tr>\n<tr>\n<td>Product bundle item</td>\n<td> A product bundle item refers to an individual product model that is part of the bundle.</td>\n<td><a href=\"/doc/423/26.1/vieworeditproductmodel#Bundled_products_tab\" title=\"Bundled products tab\">Bundled products tab</a></td>\n</tr>\n<tr>\n<td>Product instance</td>\n<td>A product instance represents a specific product or bundle purchased by a customer.<br/>\n\t\t\tIt captures key details such as the product model (product or bundle) that was purchased, the company that purchased it, the version of the product model, the environment where the product is deployed, and the associated contract. </td>\n<td><a href=\"/doc/423/26.1/manageproductinstance\" title=\"Product instance\">Manage product instances</a></td>\n</tr>\n<tr>\n<td>\n<p>Company and Related Parties</p>\n</td>\n<td>\n<p>Customers, partners, service providers, and other organizations are managed as company records. Within a company record, the system allows you to track the type of company (such as customer, partner, or service provider) along with other relevant details.<br/>\n<br/>\n\t\t\tYou can link a company to other companies to track business relationships between them using the <strong>Related parties</strong> tab. These relationships allow related companies to be entitled to access services through the service portal or act on behalf of the customer. Using the <strong>Related parties</strong> tab, you can also track which users from related companies may be entitled to services purchased by the customer.</p>\n</td>\n<td>\n<p><a href=\"/doc/423/26.1/managecompany\" title=\"Company\">Manage companies</a>, <a href=\"/doc/423/26.1/vieworeditcompanydetails#Related_parties_tab\" title=\"Related parties\">Related parties</a></p>\n</td>\n</tr>\n<tr>\n<td>Entitlements</td>\n<td>\n<p>Entitlements are owned by the company that purchased a product. An entitlement defines the level of support and the specific products a customer and its users are entitled to. In other words, it determines for which products the customer company's users can view knowledge articles for, access offerings, or submit requests.<br/>\n\t\t\tThe owner company can delegate entitlements to other companies, such as partners or child companies, if a relationship between the companies has been defined using the <strong>Related</strong> <strong>Parties</strong> feature.<br/>\n\t\t\tPartner customers, such as Managed Service Providers (MSPs), can delegate entitlements to their own customers, if a relationship between the companies has been defined using the <strong>Related</strong> <strong>Parties</strong> feature. This allows their customers to view articles in the portal or create requests for the products the MSP has entitled them to.<br/>\n<br/>\n\t\t\tOnce a user from the owner company or an delegated company is added to the entitlement, this user gets permissions to create/update requests for the entitled products or view articles for the entitled products.</p>\n</td>\n<td><a href=\"/doc/423/26.1/manageentitlement\" title=\"Entitlements\">Manage entitlements</a></td>\n</tr>\n<tr>\n<td>Licenses</td>\n<td>Within licenses it is possible to document the licenses sold to the customer. As part of CSM a new license workflow called Sold Licenses was added which allows to track the products and other details covered by the license.</td>\n<td><a href=\"/doc/423/26.1/managelicense\" title=\"License\">Manage licenses</a></td>\n</tr>\n<tr>\n<td>Environments</td>\n<td>\n<p>Environments are useful to understand where and in what context a customer's product is running. Environments allow to track cloud-based and off-cloud environments.</p>\n<ul>\n<li>Cloud based environments give an overview of what instances are running within the environment. Linking such environments to an actual service in SACM, gives end-to-end overview about the underlying infrastructure supporting the environments.</li>\n<li>Tracking off cloud environments from the customer can give support agents the right context to handle cases faster.</li>\n</ul>\n</td>\n<td>\n<p><a href=\"/doc/423/26.1/manageenvironment\" title=\"Environment\">Manage environments</a></p>\n</td>\n</tr>\n</tbody>\n</table>\n</div>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}