{
  "title": "Data domain segmentation",
  "content": "<div class=\"mw-parser-output\">\n<div></div>\n<p>Data domain segmentation in Service Management provides the ability to restrict the visibility of specific records and actions (such as tasks and approvals) to specific people, roles, or groups.</p>\n<h2 class=\"mw-headline\" id=\"Supported_record_types\">Supported record types</h2>\n<p>Service Management supports data domain segmentation for the following record types:</p>\n<ul>\n<li>Operational data record types: Approval, Article, Change, Incident, Problem, Request, Service Level Target (SLT), Task, Device, System Element, Service Component, Actual Service, Infrastructure and Peripherals, Enterprise Asset, and Enterprise Asset Subtype.</li>\n<li>Reference data record types: Location, Person, Company, Group, Record Category, and Contract.</li>\n<li>Custom record types.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"How_data_domain_segmentation_works\">How data domain segmentation works</h2>\n<p>Data domain segmentation consists of two parts:</p>\n<ul>\n<li><i>Assignment of permissions to view particular data domains to a person, role, or group</i>: the automatic assignment of permissions to view a specific data domain is best done by selecting a <b>Primary domain</b> for a group or user or by specifying permissions for a role. For more information, see <a href=\"/doc/423/26.1/assigndomainprimary\" title=\"SMAX:25.1/AssignDomainPrimary\">Assign data domain permissions to a user, group, or role</a>.\n\n\t<p><b>Note</b>: A user with the Tenant Admin role has access to all data domains.</p>\n</li>\n<li><i>Assignment of data domains to records</i>: the automatic assignment of data domains to records because of business rules running in Service Management is the recommended best practice. You can also assign data domains to records manually in specific instances, but this isn't recommended as maintenance and automation become much more complicated. For more information, see <a href=\"/doc/423/26.1/assigndomainrec\" title=\"SMAX:25.1/AssignDomainRec\">Assign a record to a data domain</a>.\n\t<p>A record must have at least one data domain assigned to it. Service Management provides the <b>Public</b> data domain out of the box, which enables access to all agent users and is automatically assigned to a record if no other data domain is automatically obtained or manually selected.</p>\n</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Data_domain_assignments_and_entitlement_rules\">Data domain assignments and entitlement rules</h3>\n<p>Data domain segmentation isn't supported for the Service Portal. Data domain assignments aren't the same as entitlement rules.</p>\n<ul>\n<li>Entitlement rules restrict offerings, knowledge articles, service definitions, service catalog categories, and custom themes in the Service Portal to limited audiences in specified locations, and belonging to specified user groups; entitlement rules apply only to these record types (including articles and offerings) in the Service Portal, and also apply to fields related to the Service Portal, such as the Catalog offering field in Request records.</li>\n<li>Data domain assignments, on the other hand, restrict access to specific records in a user's view in the agent interface. </li>\n</ul>\n<p><b>Note: </b>Data domain segmentation has no effect on the offerings that an agent has permission to view. Agents can view all active offerings, but can only request offerings for users entitled to them.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"DS entitlement.png\" class=\"z_migration_tba_PDF\" data-file-height=\"540\" data-file-width=\"960\" height=\"540\" src=\"../../../images/DS_entitlement_0ee1bb2f.png\" width=\"960\"/> </a></div>\n<h2 class=\"mw-headline\" id=\"Basic_automated_procedure\">Basic automated procedure</h2>\n<p>The following is the basic automated procedure for implementing data domain segmentation:</p>\n<ol>\n<li>\n<p>Updating the out of the box <b>Data domains</b> list in the Lists Management module with the data domains required for your organization. For more information, see <a href=\"/doc/423/26.1/managedatadomains\" title=\"Manage the data domains list\">Manage the data domains list</a>.</p>\n</li>\n<li>\n<p>Configure all relevant group and person forms to include the <b>Primary domain</b> field. For more information, see <a href=\"/doc/423/26.1/editform\" title=\"SMAX:25.1/EditForm\">How to edit a form</a>.</p>\n</li>\n<li>\n<p>Assign a primary domain to groups and users, and assign permissions for data domains to roles, as required. For more information, see <a href=\"/doc/423/26.1/assigndomainprimary\" title=\"SMAX:25.1/AssignDomainPrimary\">Assign data domain permissions to a user, group, or role</a>.</p>\n</li>\n<li>If necessary, manually assign permission to people outside a particular group to access a data domain.</li>\n<li>\n<p>(Optional) Create business rules to add or remove data domains. For more information, see <a href=\"/doc/423/26.1/assigndomainrec\" title=\"SMAX:25.1/AssignDomainRec\">Assign a record to a data domain</a>.</p>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/dsusecases\" title=\"SMAX:25.1/dsUseCases\">Data domain segmentation (use cases)</a></li>\n<li><a href=\"/doc/423/26.1/impact\" title=\"SMAX:25.1/Impact\">Impact of data domain segmentation</a></li>\n<li><a href=\"/doc/423/26.1/addediterules\" title=\"SMAX:25.1/AddEditERules\">How to manage entitlement rules</a></li>\n</ul>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}