{
  "title": "Data Configuration",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><p class=\"mw-empty-elt\"></p><div class=\"mw-collapsible-content\"><div class=\"Admonition_Tip\"><span class=\"autonumber\">Data Configuration Changes</span><div class=\"mw-collapsible\"><div class=\"mw-collapsible-content\"><p><br/>Data configuration changes must be performed directly on the production system. While they can (and most times should) be performed in the development system for testing, there is no automatic mechanism for moving them into a separate production system.The records used to make data configuration changes have a specific status or workflow phase which specifies that they aren't ready for users. This specification will keep anyone from using these new records before you are ready to activate them.</p></div></div></div></div><p class=\"mw-empty-elt\"></p><h2 class=\"mw-headline\" id=\"Making_changes_to_Configuration_Data\">Making changes to Configuration Data</h2><p>Data configuration changes are modifications to records that can affect specific actions or calculations in a process without changing the process itself. There are several examples of configuration data in Service Management, and each may have a different effect on the processes. Some examples include:</p><ul> <li>Service offerings: change what can be selected from the service catalog, add user options to a request, add specific business rules to a request, define the tasks for a request</li> <li>Time periods: affect the calculations for service level targets and change calendars</li> <li>Approval definitions: determine what approvals are needed for specific process, and in what order those approvals need to be performed</li></ul><p>As you can see, even though we aren't changing the system configuration, we can have quite an effect on the overall process by creating or changing configuration data. Because data configuration changes need to be made manually in the production system, we should ensure that we follow the right procedures to minimize the chances of causing any problems for our end users and agents.</p><p>The following is a list of best practices we can use to ensure our data configuration changes go smoothly:</p><ol> <li>When changing a new area or making a new type of change to any area, make the change in the development system first. When creating a time period for the first time, or adding a new type of functionality like an external REST call in a service offering task plan, it's best to take the time to create and test it outside of the production environment. Even though the entire record may not be moved automatically between systems, by first testing the data configuration change we can ensure there is no issues or conflicts when we create it in the production system (and we can copy and paste the more difficult pieces such as any business rules or DSL).</li> <li>To minimize the chance of affecting users, the configuration data changes should be created in an “inactive” state. Then the changes can be activated when a minimum amount of users are active on the system (such as immediately after a system configuration change is made using the dev2prod process). Data configuration records have a flag, a status, or a workflow phase that can mark them as inactive (and thus hidden to the end users). When it's time to activate the records, in most cases it's possible to activate all records of a certain type at once using the multiple record selection and update feature from a list.</li></ol><!-- NewPP limit reportCached time: 20200217094404Cache expiry: 86400Dynamic content: falseCPU time usage: 0.008 secondsReal time usage: 0.019 secondsPreprocessor visited node count: 11/1000000Preprocessor generated node count: 32/1000000Post‐expand include size: 3301/2097152 bytesTemplate argument size: 0/2097152 bytesHighest expansion depth: 2/40Expensive parser function count: 0/100Unstrip recursion depth: 0/20Unstrip post‐expand size: 0/5000000 bytes--><!--Transclusion expansion time report (%,ms,calls,template)100.00%    0.000      1 -total--><!-- Saved in parser cache with key docops_wiki:pcache:idhash:875775-0!canonical and timestamp 20200217094404 and revision id 1577535 --><p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}