{
  "title": "After an upgrade, cloud cost data collection fails for Azure",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>After you upgrade to 24.1, cloud billing data collection fails for Azure.</p>\n<h2>Cause</h2>\n<p>This issue occurs because the method of data collection from Azure changed in 24.1. Previously, the integration used an API to collect data from Azure. As of 24.1, this data is pulled from the Azure blob store.</p>\n<h2>Solution</h2>\n<p>If you have an existing integration, you must create storage for your billing data on the Azure portal, and then update the integration to collect data from this storage.</p>\n<h4>Set up storage for the billing data</h4>\n<ol>\n<li>Log in to the Azure portal as an enterprise administrator.</li>\n<li>Select <b>Cost Management + Billing</b>, and then select <b>Cost Management</b> from the navigation menu.</li>\n<li>Select <b>Exports</b> from the navigation menu, and then click <strong>Create</strong>.</li>\n<li>Enter a name for the export.</li>\n<li>Select the <strong>File Partitioning</strong> option. If you don't do this, Azure won't export billing data in the format required by CMP FinOps.</li>\n<li>Enter the required information to create a new directory in either a new or existing storage account. Make a note of the Storage account, Container, and Directory. You will need these when configuring the billing data retrieval integration.</li>\n<li>Click <strong>Create</strong>.</li>\n</ol>\n<h4 id=\"Set_up_new_fields_for_Azure_cost_reporting_integration\">Update the Azure billing data retrieval integration</h4>\n<ol>\n<li>Log in to Agent Interface as the cloud integration administrator.</li>\n<li>Go to <b>Administration </b>&gt; <b>Providers </b>&gt; <b>Cloud Cost Data Providers.</b></li>\n<li>Click the <strong>Settings</strong> icon on the existing Azure cost reporting integration, and then click <b>Edit Connection</b>.</li>\n<li>In the <strong>Actual Cost Export Path </strong>field, enter the path to directory you created to store the billing data. This path is composed of the Storage account, Container, and Directory that you configured earlier. \n\t<div class=\"Admonition_Note\"><span class=\"autonumber\">Note: </span>If the <strong>Actual Cost Export Path</strong> field is not visible when you edit the connection, clear the browser cache.</div>\n</li>\n<li>Click <strong>SAVE</strong>.</li>\n</ol>\n<h2>Related topics</h2>\n<p><a href=\"/doc/423/26.1/syncazureprovider\" title=\"Integrate with Azure for CMP FinOps\">Integrate with Azure for CMP FinOps</a></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}