{
  "title": "Database user can't login after configuring LDAP authentication flow",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>In the following case, LDAP and Database authentication flows in one organization could be conflicted with each other.</p>\n<ul>\n<li>There is a Database authentication configuration, the loginName is \"email\" and the Username is \"username\";</li>\n<li>There is also a LDAP authentication configuration, the User Search Filter(work as loginName) is \"mail\"(or \"email\"), and the Username Attribute (work as Username) is \"uid\"(or some other LDAP user attribute).</li>\n<li>The LDAP users have a email attribute with the same values as Database users' email attribute, which means a LDAP user and a database user with same email are actually mapping to the same end user.</li>\n</ul>\n<p>When Login with LDAP user, everything is fine, but Database users cannot be able to login.</p>\n<h2>Cause</h2>\n<p>When create a LDAP authentication authenticaiton from SMA BO portal, it will create a authenticaiton user key mapping to IdM automatically.<br/>\nThen the user key mapping configuration will overwrite the LDAP authentication configuration's Username Attribute from \"username\" to \"email\", it means the abstract user's unique user identifier(user key) is changed to \"email\", then IdM will use user attribute email to identify the user.</p>\n<p>But the Database authentication configuration's Username(user key) is still \"username\", so when a Database user tries to login, IdM will use username attribute to find if there is already an exiting abstract user in database, but after LDAP users loaded to database automatically, it will overwrite the abstract users' username to the setting of Username Attribute, then the database user will fail to find the exiting abstract user by username attribute, so IdM will try to create a new abstract user using the username(Database authentication configuration's user key) as the name, which will be duplicated since the DB user's username can be got from database_user_metadata table, and this username has been the same value of \"name\" column in database_user table. Then database users will fail to login IdM.</p>\n<h2>Solution</h2>\n<p>Since the LDAP users' user key is \"email\", database users' user key should modify from \"username\" to \"email\" because their \"email\" attribute values are same.</p>\n<ol>\n<li>Log in to your database and modify the data in the IdM schema by updating the type of sysbo to \"provider\". You can use the query “select type from organizations where name='sysbo'; ” to get the sysbo organization type. If the returned value isn't “PROVIDER” (probably is “CONSUMER”), run the query “update organizations set type='PROVIDER' where name='sysbo';”</li>\n<li>\n<p>Log in to a control plane node or a bastion node as root or a sudo user, run the following command to get the IdM pod name:</p>\n<pre>kubectl get pod -n &lt;namespace&gt; |grep idm\n</pre>\n</li>\n<li>\n<p>Run the following command to access the IdM pod:</p>\n<pre> kubectl exec -it &lt;pod-name&gt; -n &lt;namespace&gt; -c idm -- /bin/sh</pre>\n</li>\n<li>\n<p>Run the following command to get a password:</p>\n<pre>get_secret idm_transport_user_password_secret_key</pre>\n</li>\n<li>\n<p>Note the password. <a href=\"/doc/423/26.1/connecttorestapi\">Connect to the REST API</a>, send a POST request to get the token:</p>\n<pre>POST https://&lt;hostname&gt;/idm-service/v2.0/tokens\n BODY:\n {\n   \"passwordCredentials\" : {\n     \"username\" : \"admin\",\n     \"password\" : \"&lt;password you get in step 4&gt;\"\n   },\n   \"tenantName\" : \"provider\"\n }\n</pre>\n</li>\n<li>\n<p>Send a POST request to add a userKeyName mapping for SEEDED_REPRESENTATION:</p>\n<pre>POST https://&lt;hostname&gt;/idm-service/api/scim/organizations/&lt;orgName_Or_OrgId&gt;/representations/SEEDED_REPRESENTATION/userKeyName\n BODY:\n {\n   \"representationType\":\"SEEDED_REPRESENTATION\",\n   \"userKeyName\":\"email\"\n }\n</pre>\n</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}