{
  "title": "Debug tool",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The Debug tool enables you to debug issues that arise in the workflow of a record. When you perform an action within a debug session, all the steps of the action are recorded in a debug file. For each step in the flow, such as the evaluation of a condition or Expression Language phrase within the rule, there is a row representing the start and end of the step. For Expression Language phrases composed of multiple sub-expressions, there is a separate row for each sub-expression.</p>\n<p>For example, if an error occurs due to a business rule that was not defined properly, the debug tool can help you identify the specific rule and parameter causing the problem. If you are unable to determine the source of the issue by reading the debug file, contact Support for assistance in debugging the issue.</p>\n<p>To run the Debug tool:</p>\n<ol>\n<li>\n<p>From the login drop-down, select <b>Start debug</b>.</p>\n<p><a class=\"image\" href=\"/file/images/d/d4/2018.08_Helpcenter/Resources/Images/Start_debug.png\" title=\"/file/images/d/d4/2018.08_Helpcenter/Resources/Images/Start_debug.png\"> <img alt=\"Start debug.png\" decoding=\"async\" height=\"157\" src=\"../../../images/Start_debug_9dbbae08.png\" width=\"340\"/> </a></p>\n<p>A message appears at the top of the screen that the debug session has started.</p>\n</li>\n<li>Proceed with the required action. For example, create a new record.</li>\n<li>At any point, click <b>Stop</b> to stop the debug session. An Excel file is automatically downloaded with details of your debug session.</li>\n<li>Open the file to review all the actions that occurred during the workflow.</li>\n</ol>\n<p>The following table describes some of the columns in the debug file which provide important information for each step of the action:</p>\n<table>\n<tbody>\n<tr>\n<th>Column name</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Timestamp</td>\n<td>The time of the action.</td>\n</tr>\n<tr>\n<td>Severity</td>\n<td>\n<ul>\n<li>DEBUG for regular actions.</li>\n<li>ERROR for actions resulting in an error.</li>\n<li>PERFORMANCE for a row measuring performance results for an action.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Component</td>\n<td>\n<ul>\n<li><b>Workflow</b> for steps involving workflow components.</li>\n<li><b>Expression Language</b> for steps involving Expression Language.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Message</td>\n<td>Description of the action.</td>\n</tr>\n<tr>\n<td>Workflow action</td>\n<td>The type of action. For example, <b>Start condition evaluation</b> or <b>End condition evaluation</b>.</td>\n</tr>\n<tr>\n<td>Duration</td>\n<td>The duration of the action in milliseconds. Only relevant for ending actions.</td>\n</tr>\n<tr>\n<td>Process event</td>\n<td>The process event under which the business rule is defined.</td>\n</tr>\n<tr>\n<td>Rule path</td>\n<td>The full path of the location of the business rule (Record type, process, metaphase, phase).</td>\n</tr>\n<tr>\n<td>Business rule source</td>\n<td>\n<p>The source of the business rule.</p>\n<p>It could be a user-defined rule for the record type, or a system rule, not editable by the user. Alternatively, it could be a rule defined for the model on which the record is based, such as a rule defined for an offering which runs on the requests based on that offering.</p>\n</td>\n</tr>\n<tr>\n<td>Operation</td>\n<td>\n<ul>\n<li>CREATE for creation of a record.</li>\n<li>UPDATE for editing an existing record.</li>\n<li>DELETE for deletion of an existing record.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span>  </p>\n<ul>\n<li>To run the debug tool, you must have the Tenant Admin role. For more information about this role, see <a href=\"/doc/423/26.1/pplroles#Defaultroles\" title=\"SMAX:25.1/pplRoles\">Default roles</a>.</li>\n<li>The debug tool is available for actions performed by business rules only. You can't perform other actions, such as workflow configuration changes, while running a debug session.</li>\n<li>The maximum duration of a debug session is 15 minutes. After that time, the session automatically ends and the debug file is downloaded.</li>\n<li>The debug file is limited to a maximum of 25,000 rows. Beyond that point, the session continues but no data is recorded.</li>\n<li>Two users on the same tenant can open separate debug sessions at the same time. Each tenant is limited to two simultaneous debug sessions.</li>\n<li>There is an option to include the workflow simulation in the debug file. If you select this option, when you perform an action on a record without clicking <b>Save</b>, the steps of the action are recorded as a simulation. When you click <b>Save</b>, the same steps are recorded again as an actual operation. To select this option, go to the Application Settings, select <b>Include simulation in debug report</b>, and select <b>True</b>.</li>\n<li>By default, the debug file doesn't include performance data. If you want to add performance data to the debug file, submit a request to <span class=\"_HPb_Branding_Variables_HP_Company_Acronym\">the</span> Support team. The performance data consists of additional rows for the different elements involved in the evaluation of an Expression Language phrase which provide the duration of each element.</li>\n</ul>\n</div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}