{
  "title": "Silent installation of OO Workflow Designer",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>This section describes how to perform a silent installation of an OO Workflow Designer.</p>\n<p>To install an OO Workflow Designer in a silent mode:</p>\n<ol>\n<li>\n<p>From the extracted installation zip file, using a text editor, open the text file <code>sample-oo-designer-silent.properties</code> that has the required installation and configuration settings. </p>\n</li>\n<li>\n<p>Save a copy of the text file as <code>silent.properties</code>.</p>\n</li>\n<li>Remove the comment sign (#) from the properties that you need, and add the value for each of these properties.</li>\n<li>From a command line, type the following example code: <code>installer-oo-designer-win-&lt;version&gt;.exe -gm2 -s c:\\\\temp\\my-silent.properties</code></li>\n<li>To disable the extracting installation files progress bar, add to the command line <code>-gm2</code> before <code>-s</code>.</li>\n<li>You can use the <code>-n</code> option if you don't want to start OO Workflow Designer after the installation has completed.</li>\n<li>The <code>gm2</code> isn't supported with Linux.</li>\n<li>The <code>-s</code> property accepts either a full or a relative path depending on the operating system:<br/>\n<strong>Windows</strong>: Relative to the location of the <code>.exe</code> file.<br/>\n\tFor example, if <strong><code>dirA</code></strong> is the current directory, and <strong><code>dirB</code></strong> located under <strong><code>dirA</code></strong> contains the installer and silent.properties file, open a command prompt window in <code>dirA</code> and enter the following command: <code>dirB\\\\installer.exe -s silent.properties.</code><br/>\n\tYou must add two backslashes \\\\ and not one backslash \\.<br/>\n\tMake sure the installation folder where you download the installation file doesn't contain any spaces in the name.<br/>\n<strong>Linux</strong>: Relative to the location of the directory from where you launch the installer.</li>\n<li>Delete the <code>my-silent.properties</code> file.</li>\n</ol>\n<h2>Linux guided install option</h2>\n<p>As an alternative to manually editing the <code>silent.properties</code> file, you can use a script to perform a silent installation on <strong>Linux </strong>operating systems. This script collects the necessary data to build up the <code>silent.properties</code> file and install OO Workflow Designer through a series of questions. The script is called <code>oo_workflow_designer_guided_install.sh</code> and is located under the <code>config </code>folder in the zip file. </p>\n<p>The script generates a <code>silent.properties</code> file in the same location from which it's being run and can trigger the silent installation for the product.</p>\n<p>To install OO Workflow Designer on a <strong>Linux </strong>server using the guided installer follow these steps:</p>\n<ol>\n<li>From a command line, run the <code>oo_workflow_designer_guided_install.sh</code> script.</li>\n<li>Fill in the requested details when prompted.</li>\n<li>Leave the prompt blank if a value is set between square brackets to use that value as default.</li>\n<li>After providing all the required information, you will be prompted to start the silent installation.</li>\n<li>If you type <code>&lt;yes&gt;</code>, the script prompts for the OO silent installer location and starts the silent installation.</li>\n<li>If you type <code>&lt;no&gt;</code>, the script displays the contents of the generated <code>silent.properties</code> file and exits installation.</li>\n</ol>\n<p>All files generated by the script will be located in the same folder from which the script is being run.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-tip-icon\"></div>\n<div class=\"admonition-content admonition-tip-content\"><code>OpenText</code> encourages the customer to <strong>delete the &lt;</strong><code>my-silent.properties</code><strong>&gt;, </strong>which isn't provided by <code>OpenText</code>. By not <strong>deleting the properties file</strong> you may be exposing the system to increased security risks. You understand and agree to assume all associated risks and hold <code>OpenText </code>harmless for the same. It remains <strong>at all times</strong> the Customer’s sole responsibility to assess its own regulatory and business requirements. <code>OpenText </code>doesn't represent or warrant that its products comply with any specific legal or regulatory standards applicable to Customer in conducting Customer's business.</div>\n</div>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-caution-icon\"></div>\n<div class=\"admonition-content admonition-caution-content\">The <strong>Python Executor</strong> will install on the <strong>default port</strong> for <strong>OO Workflow Designer (8003)</strong>. If the port is already in use, the Python Executor service won't start and Python based expressions will continue to be evaluated with the Python interpreter. To change the port for the Python Executor please follow the instructions on the <a href=\"/doc/423/26.1/configurepythonexecutor\" title=\"Configure Python Executor\">Configure Python Executor</a> page and restart the OO Workflow Designer service.</div>\n</div>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}