{
  "title": "Deploy and manage content packs",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>This topic describes an overview and the instructions related to deploying and managing the content packs in Operations Orchestration (OO) Central. </p>\n<p>The deployment of content packs may be required for development, testing, and production environments. Deployment is usually performed at least twice in the promotion process.</p>\n<p>It's highly recommended to deploy the Base Content Pack first and then any other OO content packs before deploying your own content packs.</p>\n<p>You can deploy the content packs in OO Central:</p>\n<ul>\n<li>After downloading the content packs from ITOM Marketplace and then deploying them from your local file system.</li>\n<li>After installing an on-premises OO Workflow Designer and then deploying the content packs to OO Central. For more details, see the related topics section.</li>\n</ul>\n<h2 id=\"Validate_the_dependencies_on_the_content_pack\">Deploy a content pack</h2>\n<p>When you deploy a content pack, OO checks the content pack for a digital signature:</p>\n<ul>\n<li>If a content pack with a digital signature has been altered, it can't be deployed.</li>\n<li>If the signature has expired, you will need to select the <b>Ignore expiry of digital signature</b> check box to deploy the content pack.</li>\n<li>If there is no digital signature on the content pack, you can deploy it, but a warning is displayed because there is no verification that the content pack was created by a known sender and that it wasn't altered in transit.</li>\n<li>If a content pack is signed, but the signature isn't from a known and trusted authority, you can still deploy it.</li>\n</ul>\n<ol>\n<li>Click the <b>Content Management</b> button to display the Content Management workspace.</li>\n<li>Under the <b>Content Packs</b> tab, click the <b>Deploy New Content</b> <a class=\"image\" href=\"/file/images/1/11/2018.02/Resources/Images/Central/but_add.png\" title=\"/file/images/1/11/2018.02/Resources/Images/Central/but_add.png\"> <img alt=\"but add.png\" border=\"1\" data-file-height=\"27\" data-file-width=\"27\" file=\"/mediawiki/images/1/11/2018.02/Resources/Images/Central/but_add.png\" height=\"27\" hspace=\"0\" src=\"../../../images/but_add_81bca26c.png\" style=\"width:27px;height:27px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:1px solid black;\" vspace=\"0\" width=\"27\"/> </a> button.</li>\n<li>In the <strong>Deploy New Content</strong> dialog box, click the <b>Add</b> <a class=\"image\" href=\"/file/images/1/11/2018.02/Resources/Images/Central/but_add.png\" title=\"/file/images/1/11/2018.02/Resources/Images/Central/but_add.png\"> <img alt=\"but add.png\" border=\"1\" data-file-height=\"27\" data-file-width=\"27\" file=\"/mediawiki/images/1/11/2018.02/Resources/Images/Central/but_add.png\" height=\"27\" hspace=\"0\" src=\"../../../images/but_add_81bca26c.png\" style=\"width:27px;height:27px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:1px solid black;\" vspace=\"0\" width=\"27\"/> </a> button.</li>\n<li>\n<p>Browse to and select one or more content packs, and then click <b>Open</b>.</p>\n<div class=\"Admonition_Tip\">You can also use the drag-and-drop functionality to drag the content pack from your file management system and drop it into the <strong>Deploy New Content</strong> dialog box.</div>\n</li>\n<li>\n<p>During the upload process, OO Central verifies the selected content packs. Icons next to the content packs indicate if there are any issues with their certification.</p>\n<p>Select a content pack to display its certification details.</p>\n<p><a class=\"image\" href=\"/file/images/c/c0/2018.02/Resources/Images/Central/Deploy_new_content.png\" title=\"/file/images/c/c0/2018.02/Resources/Images/Central/Deploy_new_content.png\"> <img alt=\"Deploy new content.png\" border=\"1\" data-file-height=\"691\" data-file-width=\"899\" file=\"/mediawiki/images/c/c0/2018.02/Resources/Images/Central/Deploy_new_content.png\" height=\"615\" hspace=\"0\" src=\"../../../images/Deploy_new_content_14083af8.png\" vspace=\"0\" width=\"800\"/> </a></p>\n<ul>\n<li>\n<p>If a content pack appears with a <b>Delete</b> icon <a class=\"image\" href=\"/file/images/c/c7/2018.02/Resources/Images/Management/icon_deploy_delete.png\" title=\"/file/images/c/c7/2018.02/Resources/Images/Management/icon_deploy_delete.png\"> <img alt=\"icon deploy delete.png\" border=\"1\" data-file-height=\"20\" data-file-width=\"18\" file=\"/mediawiki/images/c/c7/2018.02/Resources/Images/Management/icon_deploy_delete.png\" height=\"20\" hspace=\"0\" src=\"../../../images/icon_deploy_delete_b1d066a7.png\" style=\"width:18px;height:20px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:1px solid black;\" vspace=\"0\" width=\"18\"/> </a> , this content pack can't be deployed. You need to click the <b>Delete</b> <a class=\"image\" href=\"/file/images/0/0c/2018.02/Resources/Images/Central/but_delete.png\" title=\"/file/images/0/0c/2018.02/Resources/Images/Central/but_delete.png\"> <img alt=\"but delete.png\" border=\"1\" data-file-height=\"23\" data-file-width=\"30\" file=\"/mediawiki/images/0/0c/2018.02/Resources/Images/Central/but_delete.png\" height=\"23\" hspace=\"0\" src=\"../../../images/but_delete_9d601730.png\" style=\"width:30px;height:23px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:1px solid black;\" vspace=\"0\" width=\"30\"/> </a> button in the toolbar to remove this content pack from the dialog box.</p>\n<p>For example, a content pack whose digital signature has been altered can't be deployed.</p>\n</li>\n<li>\n<p>If a content pack appears with a <b>Warning</b> icon <a class=\"image\" href=\"/file/images/e/ec/2018.02/Resources/Images/Management/icon_deploy_info.png\" title=\"/file/images/e/ec/2018.02/Resources/Images/Management/icon_deploy_info.png\"> <img alt=\"icon deploy info.png\" border=\"1\" data-file-height=\"22\" data-file-width=\"23\" file=\"/mediawiki/images/e/ec/2018.02/Resources/Images/Management/icon_deploy_info.png\" height=\"22\" hspace=\"0\" src=\"../../../images/icon_deploy_info_696c6960.png\" style=\"width:23px;height:22px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:1px solid black;\" vspace=\"0\" width=\"23\"/> </a> , this content pack can be deployed, but there is information you need to check about it.</p>\n<p>For example, the signature has expired. In this situation, you need to select the <b>Ignore expiry of digital signature</b> check box to deploy the content pack.</p>\n</li>\n<li>If a content pack appears with an <b>OK</b> icon <a class=\"image\" href=\"/file/images/8/8c/2018.02/Resources/Images/Management/icon_deploy_ok.png\" title=\"/file/images/8/8c/2018.02/Resources/Images/Management/icon_deploy_ok.png\"> <img alt=\"icon deploy ok.png\" border=\"1\" data-file-height=\"20\" data-file-width=\"18\" file=\"/mediawiki/images/8/8c/2018.02/Resources/Images/Management/icon_deploy_ok.png\" height=\"20\" hspace=\"0\" src=\"../../../images/icon_deploy_ok_910cf270.png\" style=\"width:18px;height:20px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:1px solid black;\" vspace=\"0\" width=\"18\"/> </a> , this content pack is okay to be deployed.</li>\n<li>If a content pack has no digital signature, and appears with a <b>None</b> icon <a class=\"image\" href=\"/file/images/e/ec/2018.02/Resources/Images/Management/icon_deploy_info.png\" title=\"/file/images/e/ec/2018.02/Resources/Images/Management/icon_deploy_info.png\"> <img alt=\"icon deploy info.png\" border=\"1\" data-file-height=\"22\" data-file-width=\"23\" file=\"/mediawiki/images/e/ec/2018.02/Resources/Images/Management/icon_deploy_info.png\" height=\"22\" hspace=\"0\" src=\"../../../images/icon_deploy_info_696c6960.png\" style=\"width:23px;height:22px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:1px solid black;\" vspace=\"0\" width=\"23\"/> </a> you can deploy the content pack, but be aware that there is no verification of the content pack.</li>\n</ul>\n</li>\n<li>Repeat steps 3 - 5 to add more content packs to the <strong>Deploy New Content</strong> dialog box, if desired.</li>\n<li>\n<p>Click <b>Deploy</b>.</p>\n<p>The deployment may take a few minutes. A progress bar displays the progress of the deployment, showing when each step is completed.</p>\n<p>it'sn't possible for two users to deploy a content pack to the same Central at the same time. If you try to deploy content to Central while another user is already deploying content, you will see an error message, indicating that another deployment is currently in progress.</p>\n<ul>\n<li>If deployment was successful, an icon indicating success is displayed in the dialog box and you can click <b>Close</b>.</li>\n<li>\n<p>If the deployment fails, messages are displayed, describing the causes of the failure.</p>\n<p>For example, a content pack will fail deployment if it lacks structural integrity (for example, missing references, duplicate universally unique identifiers (UUID), duplicate flow paths, duplicate system property names).</p>\n<p>If the deployment failed, especially in the case of dependency failure, you can click the <b>Back</b> button to return to the <b>Deployment</b> page. There, you can verify the dependency data, clear the pane, upload all required content packs, and try again.</p>\n</li>\n</ul>\n</li>\n<li>Click <b>Close</b> to close the dialog box.</li>\n</ol>\n<h2>Content pack validations during the deployment process</h2>\n<p>The following validations are performed during the content pack deployment process.</p>\n<h3 id=\"Content_packs_tab_-_statistics_pane\">Validate the digital signatures of the content pack</h3>\n<p>A valid digital signature on a content pack verifies that the content pack was created by a known sender and that it wasn't altered in transit.</p>\n<p>During the upload process, before deployment, Central checks that content packs with digital signatures haven't been altered or expired, and displays the details of the certificate. OO verifies the following common signature types: <code>.DSA, .RSA, .EC, .SF</code></p>\n<p>If a signed content pack has been altered, that content pack can't be deployed. If the signature has expired, the content pack can be deployed only if you select a check box agreeing to ignore this expiry.</p>\n<p>The scenarios for signatures are the following:</p>\n<ul>\n<li>The out-of-the-box content packs created by OO are signed with the private key.</li>\n<li>\n<p>When you buy a content pack from a content pack vendor, the vendor uses an official certificate authority (CA) certificate.</p>\n<p>If the signing authority isn't already in the OO Central TrustStore, you will need to import the CA certificate into it to enable Central to verify the content pack's certificate.</p>\n</li>\n<li>\n<p>When OO authors create content packs in-house, they need a CA private key to be able to add a signature to a content pack. You can request this certificate from  providers such as Symantec VeriSign, for example. it's also possible to use a self-signed signature, but this isn't recommended, for security reasons.</p>\n<ul>\n<li>The user with the permission <strong>oo_cpManage</strong> adds a digital signature to the content pack, using an external signing tool, such as Java <strong>JarSigner</strong>.</li>\n<li>The administrator<span style=\"color:#e74c3c;\"> </span>adds the trusted root certificate authority (CA) into the OO <code><b>client.truststore</b></code> file (under <b>central/var/security</b>). In a cluster, import the CA to the <code><b>client.truststore</b></code> file for all nodes. it's recommended to verify the digital signature of a content pack manually using well-known tools before importing it.</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"Validate_the_dependencies_on_the_content_pack\">Validate the dependencies on the content pack</h3>\n<p>During the upload process, before deployment, OO Central checks whether the content pack has any dependencies. If you are deploying a content pack that uses elements (for example, operations or properties) that are in a different content pack, the content pack that you are deploying will have a dependencies file that points to this other content pack.</p>\n<p>However, what happens if any of these items were deleted from the other content pack, and the new version of this content pack has been deployed in your environment? If this occurs, the content pack that you are now trying to deploy will have missing dependencies, and this could cause the deployment to fail.</p>\n<p>If there are missing dependencies, OO Central displays a warning icon in the <strong>Deploy New Content</strong> dialog box and displays the expected version of the content pack that contained these dependencies. This gives you an opportunity to add the expected version of this content pack to the deployment so that the deployment of the content pack that depends on it will be successful.</p>\n<p>You have an option to continue with the deployment without adding the dependencies.</p>\n<h3 id=\"Validate_duplication_of_the_content_pack\">Validate duplication of the content pack</h3>\n<p>During the deployment process, Central performs complete path validation for all elements that have a unique path on Central (such as flow, group alias, domain term, system property, system account, and selection list).</p>\n<p>If there is any duplication of these elements (either within the deployment unit or within previously deployed entities), an error message is displayed, listing the duplication.</p>\n<h3 id=\"Validate_structural_integrity_of_the_content_pack\">Validate structural integrity of the content pack</h3>\n<p>During the deployment process, Central validates the content packs to make sure that the structural integrity of the deployed content is intact.</p>\n<p>Checking the structural integrity includes checking that there are no missing references, there are no duplicate universally unique identifier (UUID), the flows in the content packs are correctly formed, and there are no duplicate flow paths or duplicate system property names.</p>\n<p>For example:</p>\n<p><a class=\"image\" href=\"/file/images/5/53/2018.02/Resources/Images/Management/Failed_deployment.png\" title=\"/file/images/5/53/2018.02/Resources/Images/Management/Failed_deployment.png\"> <img alt=\"Failed deployment.png\" border=\"1\" data-file-height=\"195\" data-file-width=\"908\" file=\"/mediawiki/images/5/53/2018.02/Resources/Images/Management/Failed_deployment.png\" height=\"172\" hspace=\"0\" src=\"../../../images/Failed_deployment_24b3b3f1.png\" vspace=\"0\" width=\"800\"/> </a></p>\n<h2 id=\"Deployment_after_making_changes_to_a_content_pack\">Deployment after making changes to a content pack</h2>\n<p>Each entity (flow, operation, and configuration item) in deployed content packs must have a unique UUID. If you try to deploy a content pack with a duplicated entity (with the same UUID as an entity in another deployed content pack), the deployment will fail.</p>\n<p>If you move an entity from one content pack to another, this may result in a duplication, which will cause the deployment to fail. For example, you have two content packs; A and B. You deploy content pack A to Central, and then you move entity X from A to B. When you try to deploy content pack B, the deployment will fail because entity X appears in both A and B.</p>\n<p>In such a situation, the correct workflow is to deploy <b>both A and B</b> together after moving the entity, and not to deploy B on its own. The new version of A, without entity X, overwrites the previous version on Central, so there is no duplication.</p>\n<p>When you want to promote content from one Central environment to another, you will only need to deploy all the latest versions of the content packs that were deployed in the original Central environment.</p>\n<h2>View content pack details</h2>\n<p>After content packs have been deployed, they're displayed on the <b>Content Packs</b> tab.</p>\n<ul>\n<li>The <b>Content</b> details pane on the right side displays more details about the selected content pack. This information includes the version, publisher, description, digital signature details, the name of the user who deployed it, the Source Control Management (SCM) tag, SCM revision (for SVN), and the entities inside the content pack. The contents are arranged in a tree, under <b>Library</b> and <b>Configuration</b> folders, reflecting the way that the content pack appeared in Studio. You can drill down into the folders and see exactly which items exist in the content pack and where they're stored. This includes flows, operations, and configuration items.</li>\n<li>The <b>Changes</b> pane displays the changes that have been made to the selected content pack since the version that was previously deployed on OO Central. This information lets you know which items have been added, deleted, updated, or moved.</li>\n</ul>\n<h2>Content pack versions</h2>\n<p>You can deploy a content pack to a server multiple times, as the content is updated by flow authors, and new versions of the content pack are created.</p>\n<p>After a content pack has been deployed, it's possible to roll back to the last deployment version. This might be useful if you find that there are problems with the flows in a new deployment.</p>\n<p>Note that when you roll back to the last deployment, you return the content to the state that it was in before your most recent deployment. If the most recent deployment involved multiple content packs, the rollback returns all these content packs to the state they were in, previously.</p>\n<p>Also, note that you can only roll back one version. You can't roll back to earlier versions than the last one.</p>\n<h2 id=\"Content_packs_tab_-_statistics_pane\">Deploying multiple content packs</h2>\n<p>A single user can deploy multiple content packs at once, by using the <b>Add</b> <a class=\"image\" href=\"/file/images/3/3e/2018.02/Resources/Images/Management/but_add2.png\" title=\"/file/images/3/3e/2018.02/Resources/Images/Management/but_add2.png\"> <img alt=\"but add2.png\" border=\"1\" data-file-height=\"14\" data-file-width=\"16\" file=\"/mediawiki/images/3/3e/2018.02/Resources/Images/Management/but_add2.png\" height=\"14\" hspace=\"0\" src=\"../../../images/but_add2_efa0ea34.png\" style=\"width:16px;height:14px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:1px solid black;\" vspace=\"0\" width=\"16\"/> </a> button in the <strong>Deploy New Content</strong> dialog box.</p>\n<p>However, it'sn't possible for two users to deploy content packs to the same Central at the same time. If you try to deploy content to Central while another user is already deploying content, you will see an error message, indicating that another deployment is currently in progress.</p>\n<h3 id=\"Split_deployment\"><span style=\"color: rgb(0, 115, 231); font-size: 24px;\">Rollback to the last deployment</span></h3>\n<p>After a content pack has been deployed, it's possible to roll back to the last deployment. This might be useful if you find that there are problems with the flows in a new deployment.</p>\n<p><b>Note:</b> If you roll back after a content pack has been deleted, this will undo the deletion.</p>\n<ol>\n<li>Click the <b>Content Management</b>&gt; <b>Content Packs</b> tab.</li>\n<li>Select a content pack and click the <b>Roll Back Deployment</b> <a class=\"image\" href=\"/file/images/4/4f/2018.02/Resources/Images/Central/but_roll_back.png\" title=\"/file/images/4/4f/2018.02/Resources/Images/Central/but_roll_back.png\"> <img alt=\"but roll back.png\" border=\"1\" data-file-height=\"25\" data-file-width=\"27\" file=\"/mediawiki/images/4/4f/2018.02/Resources/Images/Central/but_roll_back.png\" height=\"25\" hspace=\"0\" src=\"../../../images/but_roll_back_340375d1.png\" style=\"width:27px;height:25px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:1px solid black;\" vspace=\"0\" width=\"27\"/> </a> button.</li>\n<li>Choose a specific content pack version, and then click <b>OK</b> in the confirmation dialog box.</li>\n</ol>\n<p><a class=\"image\" href=\"/file/images/2/23/2018.02/Resources/Images/Central/rollback_cp_ver.jpg\" title=\"/file/images/2/23/2018.02/Resources/Images/Central/rollback_cp_ver.jpg\"> <img alt=\"rollback cp ver.jpg\" border=\"1\" data-file-height=\"239\" data-file-width=\"554\" file=\"/mediawiki/images/2/23/2018.02/Resources/Images/Central/rollback_cp_ver.jpg\" height=\"216\" hspace=\"0\" src=\"../../../images/rollback_cp_ver_e9f58771.jpeg\" vspace=\"0\" width=\"500\"/> </a></p>\n<h2 id=\"Delete_a_deployed_content_pack\">Delete a deployed content pack</h2>\n<ol>\n<li>Click the <b>Content Management</b> &gt; <b>Content Packs</b> tab.</li>\n<li>Select a content pack and click the <b>Delete</b> <a class=\"image\" href=\"/file/images/0/0c/2018.02/Resources/Images/Central/but_delete.png\" title=\"/file/images/0/0c/2018.02/Resources/Images/Central/but_delete.png\"> <img alt=\"but delete.png\" border=\"1\" data-file-height=\"23\" data-file-width=\"30\" file=\"/mediawiki/images/0/0c/2018.02/Resources/Images/Central/but_delete.png\" height=\"23\" hspace=\"0\" src=\"../../../images/but_delete_9d601730.png\" style=\"width:30px;height:23px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:1px solid black;\" vspace=\"0\" width=\"30\"/> </a> button.</li>\n<li>Click <b>Delete</b> in the confirmation dialog box.</li>\n</ol>\n<h2 id=\"Export_content_packs\">Export content packs</h2>\n<ol>\n<li>\n<p>Navigate to <b>System Configuration&gt;System Settings&gt;Content Pack</b> and select <b>Export Content Pack</b> checkbox. The functionality is enabled.</p>\n</li>\n<li>\n<p>Click the <b>Content Management</b> &gt; <b>Content Packs</b> tab.</p>\n</li>\n<li>Select a content pack, and then click the <b>Export Content Pack</b> <a class=\"image\" href=\"/file/images/3/32/2018.02/Resources/Images/Central/export.PNG\" title=\"/file/images/3/32/2018.02/Resources/Images/Central/export.PNG\"> <img alt=\"export.PNG\" border=\"1\" data-file-height=\"24\" data-file-width=\"25\" file=\"/mediawiki/images/3/32/2018.02/Resources/Images/Central/export.PNG\" height=\"24\" hspace=\"0\" src=\"../../../images/export_80ad46e3.png\" style=\"width:25px;height:24px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:1px solid black;\" vspace=\"0\" width=\"25\"/> </a> button. The content pack is downloaded onto your local machine.</li>\n</ol>\n<h2 id=\"Filter_content_packs\">Filter content packs</h2>\n<ol>\n<li>Click the <b>Content Management</b> &gt; <b>Content Packs</b> tab.</li>\n<li>\n<p>In the filter box under <b>CP Name</b> or <b>Deployed By</b>, enter a content pack name, or part of a name, to filter the displayed content packs.</p>\n<p><a class=\"image\" href=\"/file/images/e/ea/2018.02/Resources/Images/Central/CP_filter.png\" title=\"/file/images/e/ea/2018.02/Resources/Images/Central/CP_filter.png\"> <img alt=\"CP filter.png\" border=\"1\" data-file-height=\"73\" data-file-width=\"543\" file=\"/mediawiki/images/e/ea/2018.02/Resources/Images/Central/CP_filter.png\" height=\"73\" hspace=\"0\" src=\"../../../images/CP_filter_1ee0b01b.png\" style=\"width:543px;height:73px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:1px solid black;\" vspace=\"0\" width=\"543\"/> </a></p>\n</li>\n<li>To remove the filter, click the <b>Clear Filters</b> <a class=\"image\" href=\"/file/images/0/05/2018.02/Resources/Images/Central/but_filter_clear.png\" title=\"/file/images/0/05/2018.02/Resources/Images/Central/but_filter_clear.png\"> <img alt=\"but filter clear.png\" data-file-height=\"25\" data-file-width=\"23\" height=\"25\" src=\"../../../images/but_filter_clear_e801a9c6.png\" width=\"23\"/> </a> button.</li>\n</ol>\n<h2 id=\"Display_details_of_a_selected_content_pack\">Display details of a selected content pack</h2>\n<ol>\n<li>Click the <b>Content Management</b> &gt; <b>Content Packs</b> tab.</li>\n<li>Select a deployed content pack from the list.</li>\n<li>Click the <b>Content</b> tab in the Details pane, to the right.</li>\n<li>View the displayed details about the version, publisher, signature, description, and the user who deployed it.</li>\n<li>See how the entities in the content pack are arranged in a tree, under <b>Library</b> and <b>Configuration</b> folders.</li>\n<li>Expand and collapse the nodes to see the contents of different folders within the content pack.</li>\n<li>Clear the check box next to the name of a content pack to remove its details from the <strong>Details</strong> pane.</li>\n</ol>\n<h2 id=\"Display_changes_that_were_made_to_a_selected_content_pack\">Display changes that were made to a selected content pack</h2>\n<ol>\n<li>Click the <b>Content Management</b> &gt; <b>Content Packs</b> tab.</li>\n<li>Select a deployed content pack from the list.</li>\n<li>\n<p>Click the <b>Changes</b> tab in the Details pane, to the right, to see which items have been added, deleted, updated, or moved in the content pack.</p>\n<p>For an item that has been moved, hover the mouse over the item to see where it has been moved from.</p>\n</li>\n<li>\n<p>If desired, you can filter the changes so that only certain types of changes are displayed:</p>\n<ul>\n<li>Under <b>Type</b>, select one or more entity types to display only the changes relating to this type of entity. Options are <b>Flow</b>, <b>Operation</b>, <b>Configuration Item</b>, or <b>All</b>.</li>\n<li>Under <b>Path</b>, enter part or full path to display only changes to entities in a path containing this string.</li>\n<li>\n<p>Under <b>Change</b>, select one or more types of change to display only this type of change. Options are <b>Added</b>, <b>Deleted</b>, <b>Modified</b>, <b>Moved</b>, or <b>Content pack moved</b>.</p>\n<p><a class=\"image\" href=\"/file/images/a/aa/2018.02/Resources/Images/Central/Change_list.png\" title=\"/file/images/a/aa/2018.02/Resources/Images/Central/Change_list.png\"> <img alt=\"Change list.png\" border=\"1\" data-file-height=\"269\" data-file-width=\"293\" file=\"/mediawiki/images/a/aa/2018.02/Resources/Images/Central/Change_list.png\" height=\"269\" hspace=\"0\" src=\"../../../images/Change_list_d655565d.png\" vspace=\"0\" width=\"293\"/> </a></p>\n</li>\n</ul>\n</li>\n</ol>\n<h2 id=\"Adjust_the_display_of_panes\">Adjust the display of panes</h2>\n<p>Use the open/close button in the slider on the edge of the panes to toggle between hiding and displaying the pane.</p>\n<p>Drag the slider to adjust the size of a pane.</p>\n<h2 id=\"Related_topics\">Related topics</h2>\n<ul>\n<li>To know more about managing flow library, see <a href=\"/doc/423/26.1/manageooflowlibrary\" title=\"SMAX:25.1/ManagingContentPacks\">Manage the flow library</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}