{
  "title": "Hybrid authoring in OO Workflow Designer",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p><br/>\nAs an author you can now open and use the native OO content packs steps along with CloudSlang content pack steps together to create flows or operations and vice-versa.</p>\n<p>The following actions can be performed in hybrid authoring:</p>\n<p>When you drag and drop the native step with configurations items set at flow level (system accounts, system property, and so on) the native configuration settings is lost requiring manual authoring and CloudSlang alignment.</p>\n<ol>\n<li>Open the native OO content packs flows, operation, system account, and system property. It must be noted that the linking of system account, system property, and configuration items such as selection lists, domain terms etc are disabled.</li>\n<li>\n<p>View a proper reason for an invalid native OO items.</p>\n</li>\n<li>\n<p>Drag and drop the native OO items into CloudSlang flows.</p>\n</li>\n<li>\n<p>Link native OO step to CloudSlang step.</p>\n</li>\n<li>\n<p>Link flow variables into native OO steps such as inputs and outputs.</p>\n</li>\n<li>\n<p>Click <b>Outputs</b> and select <a class=\"image\" href=\"/file/images/0/0d/2018.02/OO_Designer/but_add_arrow.png\" title=\"/file/images/0/0d/2018.02/OO_Designer/but_add_arrow.png\"> <img alt=\"but add arrow.png\" data-file-height=\"29\" data-file-width=\"30\" height=\"29\" src=\"../../../images/but_add_arrow_a21ac586.png\" width=\"30\"/> </a> to view and use the <i>output field</i> of the OO native content pack flows.</p>\n</li>\n</ol>\n<dl>\n</dl>\n<h2 id=\"Related_topics\">Related topics</h2>\n<ul>\n<li>For information related to authoring flows, see <a href=\"/doc/423/26.1/designercreateflows\" title=\"SMAX:25.1/DesignerCreateFlows\">Author flows</a>.</li>\n<li>For information related to authoring operations, see <a href=\"/doc/423/26.1/designerauthoroperations\" title=\"SMAX:25.1/DesignerAuthorOperations\">Author operations</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}