{
  "title": "Author operations",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>An operation is an executable that performs a single action. It has metadata like a flow (inputs, outputs and results). For example, one operation checks a web page to see whether it contains specific text, and another operation copies a file.</p>\n<p>Following are the different types of actions in CloudSlang:</p>\n<ul>\n</ul>\n<ul>\n<li><b>Python based actions.</b></li>\n<li><b>Java or Jython based actions.</b></li>\n</ul>\n<p>You can create all the above types of operations except for Java or Jython based operations. The Java based operations must exist externally to get imported:</p>\n<ul>\n<li>As part of content packs, the operations display in the <b>DEPENDENCIES</b> panel. Operations are read-only and can't be copied.</li>\n<li>Via Source Control Management (SCM), the operations display in the <b>PROJECTS</b> panel.</li>\n</ul>\n<p>In OO Workflow Designer, you can use operations in flows by dragging the operation from the relevant content pack from the <b>DEPENDENCIES</b> pane. You can also import a repository that includes the operation by dragging it from the <b>PROJECTS</b> panel.</p>\n<h2 id=\"File_structure_of_an_operation\">File structure of an operation</h2>\n<p>An operation file must end with the <b>.sl</b> extension and start with a namespace.</p>\n<p>Example of an operation file with its namespace.</p>\n<pre>namespace: io.cloudslang.base.comparisons\noperation:\n  name: less_than_percentage\n  inputs:\n    - first_percentage\n    - second_percentage\n  python_action:\n    script: |\n      error_message = \"\"\n      result = \"\"\n      first_percentage_nr = first_percentage.replace(\"%\", \"\")\n      second_percentage_nr = second_percentage.replace(\"%\", \"\")\n      try:\n          int_value1 = int(first_percentage_nr)\n          int_value2 = int(second_percentage_nr)\n          result = int_value1 &lt; int_value2\n      except ValueError:\n          error_message = \"Both inputs have to be integers\"\n  outputs:\n    - error_message\n\n  results:\n    - LESS: ${error_message == \"\" and result}\n    - MORE: ${error_message == \"\" and not result}\n    - FAILURE\n</pre>\n<p>All CloudSlang files start with a namespace, which mirrors the folder structure in which the files are found. The namespace can be used by flows that call this operation.</p>\n<h2 id=\"Validate_operations\">Validate operations</h2>\n<p>Operations are validated and will <b>not</b> work when:</p>\n<ul>\n<li><b>Missing action.</b> Operations must contain an action.</li>\n<li><b>Corrupted YAML.</b></li>\n<li><b>Duplicate inputs.</b> When an input is duplicated, or two inputs have the same name but use different cases (for example: Ping and ping).</li>\n<li>\n<p>Input\\output\\result name or value.</p>\n<ul>\n<li>Name cannot be empty</li>\n<li>\n<p>The combined input name, flow name, and folder path of the input (under the <b>Library</b> folder) must add up to no more than 255 characters.</p>\n<p>For localized characters, this limit is even lower. For example, in Japanese, the 255 characters need to be divided by 4, so the number of characters is only 64.</p>\n</li>\n<li>Name must be unique.</li>\n</ul>\n<p>It is recommended to manually validate the inputs that your operation will receive. For example, if you expect a number, make sure that the input is a string representing a number. If you expect an email address, check that the format complies with an email address format.</p>\n</li>\n<li><b>Missing rules in operation results.</b> Operation with more than one empty result (with no defined rule).<br/>\n\tOperations can have multiple expression results, but can have only one mandatory empty default result, and it must be the last one.</li>\n<li>\n<p><b>Incorrect operation name.</b> When the name of the operation does not comply with the rules below:</p>\n<p>Name cannot be identical to the following reserved word: \"on_failure\".</p>\n<p>Names must be unique within their folders.</p>\n<p>Names are not case-sensitive, so names such as \"Ping\" and \"ping\" are considered duplicates. However, when calling an item, make sure to use the correct case.</p>\n<p>Names can contain alphanumeric characters, and underscores ( _ ).</p>\n<p>Names cannot contain parentheses ( () ), square brackets ( [] ), curly braces ( {} ), hypens ( - ), spaces ( ), and dots (.).</p>\n<p>Names cannot be identical to the following Windows reserved words: <b>CON</b>, <b>PRN</b>, <b>AUX</b>, <b>CLOCK$</b>, <b>COM1</b>, <b>COM2</b>, <b>COM3</b>, <b>COM4</b>, <b>COM5</b>, <b>COM6</b>, <b>COM7</b>, <b>COM8</b>, <b>COM9</b>, <b>NUL</b>, <b>LPT1</b>, <b>LPT2</b>, <b>LPT3</b>, <b>LPT4</b>, <b>LPT5</b>, <b>LPT6</b>, <b>LPT7</b>, <b>LPT8</b>, <b>LPT9</b> .</p>\n</li>\n<li>\n<p><b>Decisions</b>. A Decision is a step that serves as a gateway for a decision in a flow. A Decision performs a calculation and then controls the direction of the flow, based on rules that are used to calculate the result. Decisions do not perform actual operations but only calculate where to navigate next. They are read-only. Their inputs, outputs and results can be viewed but not edited.</p>\n</li>\n</ul>\n<h2 id=\"Use_Java_based_actions\">Use Java based actions</h2>\n<p>A Java-based operation includes inputs, outputs, results, and one action.</p>\n<p>Java-based actions are read-only, and you cannot add\\copy\\edit them. They can only be found under the <strong>DEPENDENCIES</strong> pane or imported using Source Control Management (SCM) or Git.</p>\n<p>You cannot edit and copy them even if they are in the <strong>PROJECTS</strong> pane. You can use them as steps in flows by dragging them from the <b>DEPENDENCIES</b> or the <b>PROJECTS</b> pane.</p>\n<p>Use the Operation Editor to display information about an operation.</p>\n<h3 id=\"Java_Actions\">Java Actions</h3>\n<p>Java action contains the following elements:</p>\n<ul>\n<li><b>GAV.</b> GAV is short for \"Group, Artifact, Version\". The GAV coordinate standard is the foundation for how Maven manages dependencies.\n\n\t<ul>\n<li>A group identifier groups a set of artifacts into a logical group.</li>\n<li>An artifact is an identifier for a software component.</li>\n<li>The version of a project follows the established convention of Major, Minor, and Point release versions.</li>\n</ul>\n</li>\n<li><b>Class Name.</b> This is the class within the GAV where the running method can be found.</li>\n<li><b>Method Name. </b>This is the method to run within the action.</li>\n</ul>\n<h3>Jython based operations created outside the Workflow Designer</h3>\n<p>If you have already created the jython based operation outside the Workflow Designer, review the following notes:</p>\n<ul>\n<li>You can no longer create a new jython based operations in the Workflow Designer.</li>\n<li>You can only update an already existing jython based operations created from outside the Workflow Designer.</li>\n<li>The subprogram invocations using the shell script aren't supported. To prevent failures at runtime, its recommended to set the value of <code>shell=False</code>.</li>\n<li>You can identify the jython or python based operations:\n\t<ul>\n<li>If the operation has the parameter <code>use_jython</code> set to <code>false</code> it's interpreted as a python based action.</li>\n<li>If the parameter <code>use_jython</code> is missing or is set to <code>true</code> it's interpreted as a jython based operation.</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"View_the_properties_of_a_Java_operation\">View the properties of a Java operation</h3>\n<ol>\n<li>\n<p>Double-click an operation in the <b>PROJECTS </b>or <b>DEPENDENCIES </b>pane to open it in the Operation Editor as read-only.</p>\n<p>The <b>Java Action</b> view displays the GAV (group, artifact, version), class name, and method name that define the Java action in the operation.</p>\n<p><a class=\"image\" href=\"/file/images/e/ed/OOD_2018.12_Operation_java_action.png\" title=\"/file/images/e/ed/OOD_2018.12_Operation_java_action.png\"> <img alt=\"OOD 2018.12 Operation java action.png\" data-file-height=\"277\" data-file-width=\"1513\" height=\"277\" src=\"../../../images/OOD_2018.12_Operation_java_action_046a7333.png\" width=\"1513\"/> </a></p>\n</li>\n<li>\n<p>Click the <b>PROPERTIES</b> button to display the <b>Properties</b> view.</p>\n<p>You can return to the <b>Java Action</b> view, by clicking either the <b>Java Action</b> button or the <b>Back to Action</b>  <a class=\"image\" href=\"/file/images/7/77/2018.02/OO_Designer/but_Back_to_action.png\" title=\"/file/images/7/77/2018.02/OO_Designer/but_Back_to_action.png\"> <img alt=\"but Back to action.png\" data-file-height=\"21\" data-file-width=\"117\" height=\"21\" src=\"../../../images/but_Back_to_action_f9149f97.png\" width=\"117\"/> </a>  button.</p>\n</li>\n<li>\n<p>Under the <b>Inputs</b> tab, view the inputs that the operation receives. Each input in an operation has a value that can be set in a number of ways. It may be a constant value, a python expression, the value of a flow variable or system property, and more.</p>\n</li>\n<li>\n<p>Under the <b>Outputs</b> tab, view the values returned from the Java code. They will be sent back to the calling step.</p>\n<p>The Outputs tab lists any information that needs to be sent back to the calling step. The outputs are a list of key:value pairs where the key is the name of the output and the value is the expression to be returned, blank, constant, or more.</p>\n</li>\n<li>\n<p>Under the <b>Results</b> tab, view the results that will be returned to the calling flow.</p>\n</li>\n<li>Under the <b>Description</b> tab, view a description of what the operation does, if one was entered.</li>\n<li>\n<p>To view the code behind the operation, click the <b>Show as Text</b>  <a class=\"image\" href=\"/file/images/2/2c/2018.02/OO_Designer/but_text.png\" title=\"/file/images/2/2c/2018.02/OO_Designer/but_text.png\"> <img alt=\"but text.png\" data-file-height=\"20\" data-file-width=\"18\" height=\"20\" src=\"../../../images/but_text_86f84093.png\" width=\"18\"/> </a>  button. A text box appears, displaying the code.</p>\n</li>\n<li>Click <b>OK</b> to close the text box.</li>\n</ol>\n<ul>\n</ul>\n<h2 id=\"Related_topics\">Related topics</h2>\n<ul>\n<li>For instructions to add decisions to a flow, see <a href=\"/doc/423/26.1/designeradddecisionflow\" title=\"SMAX:25.1/DesignerAddDecisionFlow\">Add decisions to a flow</a>.</li>\n<li>To debug a flow, see <a href=\"/doc/423/26.1/designerdebugflow\" title=\"SMAX:25.1/DesignerDebugFlow\">Debug the flow</a>.</li>\n</ul>\n<ul>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}