{
  "title": "How to design category tiles for the Service Portal",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The category tiles on the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span> home page can be comprised of several graphic designs. It's recommended to mix and match these designs for an interesting and attractive look. You can use available background images and solid background colors.</p>\n<p>To access the category settings, from the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Plan &gt; Service Catalog &gt; Categories</b>. </p>\n<p>The settings are per category so you must enter each category and expand the <b>Category display settings</b>.</p>\n<div class=\"Admonition_Note\"><strong>Note </strong><br/>\nSetting default open tab per category isn't supported. If your suite is upgraded from previous version, tenant admin may need to manually remove the<strong> Default open tab</strong> field in your category form if you still see this field in the UI. You may set default open tab for all categories through <strong>Service Portal Settings &gt; Feature Settings &gt; Category page type</strong>.</div>\n<ol>\n<li>Set the background by selecting one of the following:\n\t<ul>\n<li>\n<p>Select <b>Background image</b> per category from the drop-down list. You can choose from the available category background images.</p>\n</li>\n<li>\n<p>Set <b>Background color</b> per category. Make sure the <b>Background image</b> field is clear and enter an RGB number or click to open the color selector.</p>\n</li>\n<li>\n<p>Set <b>Background color</b> with an <b>Image</b> icon. Make sure the <b>Background image</b> field is clear and select one of the background colors from the drop-down list. Click <b>Upload image</b> to select an icon to use for the category. You can use one of the icons supplied in the downloadable sample images pack available from the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span> Settings page. It's highly recommended to use a white image icon.</p>\n</li>\n<li>\n<p>Use the <b>Default category background</b>. If no background image or background color is selected, default color is selected</p>\n</li>\n<li>\n<p>It's highly recommended that you mix and match the different category background styles. The recommended ratio is 3:2:1 per the details in the following table:</p>\n<table class=\"contenttable\">\n<tbody>\n<tr>\n<th>Option 1</th>\n<th>Option 2</th>\n</tr>\n<tr>\n<td>3 solid color tiles using different colors</td>\n<td>3 solid color tiles using different colors</td>\n</tr>\n<tr>\n<td>\n<p>2 background images</p>\n</td>\n<td>\n<p>2 default color tiles which are usually a darker color</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>1 default color tile which is usually a darker color</p>\n</td>\n<td>1 background image</td>\n</tr>\n</tbody>\n</table>\n</li>\n</ul>\n</li>\n<li>\n<p>You have the option to enter a URL in the <b>URL</b> field and this category links to that site. This must be a category that doesn't include a service or offering. The category appears in the portal and links to the URL you enter. For example, you can link to an external ticketing system.</p>\n</li>\n<li>\n<p>Set the <b>Display order</b> of the category as it appears in the portal.</p>\n</li>\n</ol>\n<p>Click <b>Save</b> and refresh the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span> page to view the results of your selections.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li>See <a href=\"/doc/423/26.1/buildcatalog\" title=\"SMAX:25.1/BuildCatalog\">How to build the Service Catalog</a> for more information on how to build a Service Catalog. </li>\n<li>See <a href=\"/doc/423/26.1/serviceportaladm\" title=\"SMAX:25.1/ServicePortalAdm\">Service Portal Administration</a> for more information on how to design the look and feel of Service Portal</li>\n<li>See <a href=\"/doc/423/26.1/quickguide\" title=\"SMAX:25.1/QuickGuide\">Quick guide to customizing the Service Portal</a> for more information on how to customize Service Portal.</li>\n<li>See <a href=\"/doc/423/26.1/settheme\" title=\"SMAX:25.1/SetTheme\">How to configure Service Portal display theme settings</a> for more information on how to configure Service Portal display themes.</li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}