{
  "title": "Create and deploy a content pack",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>When you have finished authoring your content, you can export it as a content pack.</p>\n<h2>Get the project ready to export as a content pack</h2>\n<p>To export a project as a content pack, complete the following steps:</p>\n<ol>\n<li>\n<p>Make sure that you have saved all changes in the workspace.</p>\n</li>\n<li>\n<p>Check that the content in the project is valid and that there are no errors.</p>\n<p>Before exporting your content to a content pack, it's strongly recommended to check that your flows are valid. If the project contains invalid flows, decisions, operations, or system properties, a warning message displays listing the number of invalid items that will get excluded from the content pack. If this occurs, it's recommended to fix the errors and then to try again as invalid content won't get exported.</p>\n</li>\n</ol>\n<h2 id=\"Download_a_project_as_a_content_pack\">Create and download a content pack</h2>\n<p>To create a content pack, complete the following steps:</p>\n<ol>\n<li>In the <b>PROJECTS</b> pane, select the project from which you want to create a content pack.</li>\n<li>\n<p>Click <b>Create Content Pack</b> <a class=\"image\" href=\"/file/images/c/c8/OO_2021.11_CreateCPIcon.PNG\" title=\"/file/images/c/c8/OO_2021.11_CreateCPIcon.PNG\"> <img alt=\"\" border=\"1\" file=\"/mediawiki/images/c/c8/OO_2021.11_CreateCPIcon.PNG\" height=\"24\" hspace=\"0\" src=\"../../../images/OO_2021.11_CreateCPIcon_4e489c0f.png\" vspace=\"0\" width=\"29\"/> </a>  and select <b>Download as content pack</b>.<br/>\n<a class=\"image\" href=\"/file/images/5/53/OO_2021.11_CreateCP.PNG\" title=\"/file/images/5/53/OO_2021.11_CreateCP.PNG\"> <img alt=\"\" border=\"1\" file=\"/mediawiki/images/5/53/OO_2021.11_CreateCP.PNG\" height=\"286\" hspace=\"0\" src=\"../../../images/OO_2021.11_CreateCP_86d4b79d.png\" vspace=\"0\" width=\"467\"/> </a>  </p>\n</li>\n<li>\n<p>If there are unsaved editors open, the <strong>Save Changes</strong> dialog box gives you the option to save the changes. Click <b>Save All</b> to save all changes in the open editors.</p>\n</li>\n<li>\n<p>OO Workflow Designer validates the project before creating a content pack. If the project contains invalid flows, decisions, operations, or system properties, these aren't included.</p>\n</li>\n<li>In the <b>Download as content pack</b> dialog, enter the <strong>Content Pack Version</strong> number. The version numbers can be a maximum of 50 characters long and mustn't include invalid characters, such as: <strong><code>\\/:*?\"&lt;&gt;|</code></strong></li>\n<li>At the bottom left corner of the screen, on the warning dialog, click <strong>Keep</strong> to save the content pack onto your file system.</li>\n</ol>\n<h2>Deploy a content pack to OO Central tenant</h2>\n<p>Before you begin, ensure you have <strong>oo_ContentManage</strong> permission in OO Central.</p>\n<ol>\n<li>In the <b>PROJECTS</b> pane, select the project from which you want to create a content pack.</li>\n<li>\n<p>Click <b>Create Content Pack</b> <a class=\"image\" href=\"/file/images/c/c8/OO_2021.11_CreateCPIcon.PNG\" title=\"/file/images/c/c8/OO_2021.11_CreateCPIcon.PNG\"> <img alt=\"\" border=\"1\" file=\"/mediawiki/images/c/c8/OO_2021.11_CreateCPIcon.PNG\" height=\"24\" hspace=\"0\" src=\"../../../images/OO_2021.11_CreateCPIcon_4e489c0f.png\" vspace=\"0\" width=\"29\"/> </a>  and select <b>Deploy as content pack to OO Central.</b></p>\n</li>\n<li>\n<p>Enter the URL of OO Central tenant.</p>\n<ul>\n<li>If the URL uses the HTTP protocol, a warning message displays the recommended protocol HTTPS, for security reasons. The OO Central <b>Username</b> and <b>Password</b> credential fields are disabled. However, you are still able to deploy the content pack.<br/>\n\t\tThe validation only checks the format of the URL, not its existence. The format should be <strong><code>&lt;protocol&gt;://&lt;hostname&gt;:&lt;port&gt;/oo/[?tenantId=&lt;tenantId&gt;]</code></strong><br/>\n\t\tFor example, <code>https://my.OO.Central.net:8443/oo/?tenantId=123456789</code></li>\n<li>If the URL uses the recommended HTTPS protocol, the OO Central tenant <b>Username</b> and <b>Password</b> credential fields are enabled for inputs.</li>\n</ul>\n</li>\n<li>\n<p>Enter the OO Central tenant <b>Username</b> and <b>Password</b> credentials, and then Click <b>Deploy</b>.<br/>\n<a class=\"image\" href=\"/file/images/a/ab/OO_2021.11_DeployCPDesigner.PNG\" title=\"/file/images/a/ab/OO_2021.11_DeployCPDesigner.PNG\"> <img alt=\"\" border=\"1\" file=\"/mediawiki/images/a/ab/OO_2021.11_DeployCPDesigner.PNG\" height=\"497\" hspace=\"0\" src=\"../../../images/OO_2021.11_DeployCPDesigner_410c3354.png\" vspace=\"0\" width=\"771\"/> </a></p>\n<p>If there is invalid content in the project, the dialog box displays a warning that there are invalid items that won't pack inside the content pack.</p>\n<p>If the operation fails before the deployment to OO Central tenant, for example, during the creation of the content pack, an error appears in the dialog box.</p>\n<p>If the operation fails during the deployment in OO Central tenant, the list of problematic items appears in the dialog box.</p>\n<p>You can download the content pack locally even if the deployment fails by clicking <b>Click to download the content pack</b>.</p>\n</li>\n<li>If the content pack deployment to the OO Central tenant is successful, you can also save the content pack locally by clicking <b>Click to download the content pack</b>.<br/>\n\tIf you are deploying to OO Central using an HTTPS URL, and the OO Central server certificate isn't trusted, a dialog box opens showing the certificate details.<br/>\n\tThe deployment process starts only if you approve the certificate.</li>\n</ol>\n<h2 id=\"Related_topics\">Related topics</h2>\n<ul>\n<li>For instructions to how to validate flows, see <a href=\"/doc/423/26.1/designervalidateflow\" title=\"SMAX:25.1/DesignerValidateFlow\">Validate flows</a>.</li>\n</ul>\n<ul>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}