{
  "title": "Differences from Service Manager",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>New users of OpenText Service Management often start their implementation with the expectation that it's simply a new version of Service Manager. While Service Management incorporated lessons learned from decades of ITSM experience, it was created with a completely new way of looking at the processes, user interactions, and overall experiences.</p>\n<p>Service Management focuses on the organization's ability to provide services to end users, and is proactive in solving end user issues versus managing IT \"tickets\". For new users (and administrators), some adjustment to the old mindset and approach will be necessary. This doesn't mean that the old mindset or approach is \"wrong\", but simply that it doesn't apply to Service Management.</p>\n<p>This document will investigate some of the concepts that are markedly different between Service Management and Service Manager. While not every difference can be reviewed in detail, we will concentrate on areas pointed out by real customers of both products.</p>\n<h2>Concept changes</h2>\n<h3>Service based support</h3>\n<p>One of the primary differences between Service Management and other solutions is that it was designed around services. The most important step of a successful Service Management implementation is defining the business and infrastructure services that make up your company's IT portfolio.</p>\n<h4>Service Definitions</h4>\n<p>The ITIL process documentation defines an IT Service as \"a service provided to one or more customers by an IT service provider.\" In the real world, it means that any subject of a call, email, or portal request from an end user that IT supports is part of an IT Service. By clearly defining these services, the IT department can accurately and succinctly define the supported processes around these services. This will result in a much higher (and faster) return on the investment made in implementing Service Management.<br/>\n<br/>\nBy creating the list of supported IT Services, the number of calls or emails pertaining to issues that the Service Desk has no control over is lowered. This still leaves those requests that might be related to an IT Service that are simply not under the control of IT. In order to inform the end users about what's available through the Service Desk, as well as to better control and categorize incoming requests, Service Management allows the definition of specific Offerings under an IT Service. These Offerings make up what's known as the Service Catalog -- literally a listing of everything the IT Service Desk supports.</p>\n<h4>Service Catalog</h4>\n<p>Service Management designed the Service Catalog around the service definitions (as the name would suggest). Think about the catalog as the menu that end users use to \"consume\" the defined services. And if the users are ordering from a menu, the IT agents are in the kitchen working to fulfill these requests.<br/>\n<br/>\nCreating a complete service catalog can be one of the more time-consuming parts of a Service Management implementation. And as the IT department changes and takes on more responsibilities, the number of service definitions and associated offerings will continue to grow. The Service Catalog should be thought of as a living thing, and change should be expected (and even embraced).</p>\n<h4>Categorization and the search-focused end portal</h4>\n<p>One of the most visible differences between the End User Portal in Service Manager and Service Management is in the categorization hierarchy of the Service Catalog. While the Service Manager catalog allows multiple layers of categorization, Service Management has only three levels of navigation. These levels are:<br/>\n<br/>\nCategory -&gt; Service Definition -&gt; Offering<br/>\n<br/>\nThe flattened structure of the Service Management Service Catalog makes it easier for both the administrators and the end users to determine where a specific offering should reside. However, navigating the categories and service definitions manually isn't the most efficient way for an end user to find what they are looking for.<br/>\n<br/>\nThe End User Portal was designed with search as the primary method for users to find the correct Offering. A single search will return both Offerings and Knowledge Articles that most reflect what the user is looking for.<br/>\n<br/>\nFor more detailed information about working with the Service Catalog, see <a href=\"/doc/423/26.1/servicesandtheservicecatalog\" title=\"Services and the Service Catalog\">Services and the Service Catalog</a>.  </p>\n<h2>How do I do \"X\" in Service Management?</h2>\n<p><span style=\"color: rgb(0, 0, 0); font-family: Roboto, sans-serif; font-size: 20px;\">Create multiple workflows for incidents</span></p>\n<p>Processes within Service Management use a pre-defined workflow or set of workflows to create and track records using that specific process. You can configure these workflows to fit specific requirements not included in the out-of-box definitions, but you can't add new workflows within the processes.</p>\n<p>The use of only the existing workflows enforces commonality to the records within a process. This results in easier integrations, consistency in reporting, the ability to use a common set of performance indicators, and allows the use of common views.</p>\n<p>You can modify existing workflows by adding new phases within the defined set of steps (also called meta-phases). Those phases will be used by every record within the associated process.</p>\n<p>In Service Manager, administrators often add categories to display unique fields, add business logic, add approvals, or add tasks. In Service Management,this same functionality can be added by using models.</p>\n<p>If you need unique flow and/or functionality within a specific process, Service Management provides models (called Offerings inside the Service Request process). These models allow you to extend the process in a number of ways, including:</p>\n<ul>\n<li>\n<p>adding specific fields, called “User options” to the process</p>\n</li>\n<li>\n<p>adding rules that apply to the process using the model</p>\n</li>\n<li>\n<p>adding approvals (to applicable processes)</p>\n</li>\n<li>\n<p>setting default values</p>\n</li>\n<li>\n<p>adding tasks (in series or parallel) to one or more phases of the process</p>\n</li>\n</ul>\n<p>For further information about workflows and models, see <a href=\"/doc/423/26.1/enhancingworkflowwithmodels\" title=\"Enhancing Workflow with Models\">Enhancing Workflow with Models</a>.</p>\n<h3>Create unique forms for different categories of incidents</h3>\n<p>Service Management has a single workflow defined for Incidents. Every Incident category uses the same workflow and therefore the same forms. In order to display information differently for different types of Incidents, fields may be hidden or disabled based on the category. Additionally, different Models may be used to add unique fields to one or more categories. It's actually more manageable to use the Model to hide or disable fields on a form, then associate the Model based on specific categories using workflow rules.<br/>\n<br/>\nFor more information on these methods, please view the <a href=\"/doc/423/26.1/workingwithforms\" title=\"Working with Forms\">Working with Forms</a> and <a href=\"/doc/423/26.1/enhancingworkflowwithmodels\" title=\"Enhancing Workflow with Models\">Enhancing Workflow with Models</a> articles.</p>\n<h3>\"Kill\" a user session</h3>\n<p>When a Service Manager user leaves a session running while they are away or their session stops responding, they are still using a license and may block other users from updating a record if they have it locked (due to SM's pessimistic locking strategy). Even if the user logs in to another session, the old session is still \"active\" and taking up resources. In these cases, the Service Manager administrator may \"kill\" the users' session, freeing up resources, licenses, and any record locks.</p>\n<p>Service Management users can have multiple concurrent sessions (even from multiple devices) and still only consume a single license. Session timeouts are handled by the Service Management engine, and any inactive sessions are closed automatically. Additionally, Service Management uses optimistic locking, so viewing or updating a record doesn't lock it for other users.</p>\n<p>For these reasons, there is no need for the administrator to kill a Service Management user session. </p>\n<h3>Create ad-hoc approvals</h3>\n<p>Approvals in ITIL processes ensure that requests or changes affecting the business are within the scope and direction of the IT directives. With that purpose in mind, approvals are most often defined ahead of time with the proper persons or groups needed to be the gatekeeper of the associated request or change.<br/>\n<br/>\nApproval Plans in Service Management allow the administrator to pre-define the approvals needed for a particular process based on information in the appropriate record. For example, if a specific Service is set in a Change, the approval can be defined to include the owner of that Service. Additionally, Change Models (or Offerings for Request) can define approval persons or groups for that particular Model or Offering. Using these methods, it's possible to set the Approval Plans to correctly assign approvals for any particular type of Request or Change without any intervention from a user.<br/>\n<br/>\nHowever, in some less mature or non-ITIL implementations, changes and requests may include manual (or ad-hoc) approvals that are added to the process after it has begun. While this is by no means a best practice, Service Management allows multiple methods to modify the Approval Plan beyond its original definition.<br/>\n<br/>\nThe first method involves a user directly updating the Approval Plan for a specific record. Greatly heightened permissions are needed to update the plan in this way, and this isn't an appropriate method for the average user. However, it does allow administrators to make modifications when the situation demands it.<br/>\n<br/>\nA more controlled solution involves adding fields to the form that specifically contain persons or groups that should be added to the Approval Plan. These \"ad-hoc\" approvers may then be specified by a regular user without the need to edit the Approval Plan directly.<br/>\n<br/>\nThese approvals may be defined at the Record (Request or Change) level or in a specific Offering or Model. <br/>\n<br/>\n </p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}