{
  "title": "Limitations for aggregated offerings",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>\n<p>This release supports aggregated offerings based on service design and deployment with the following limitations and known issues:</p>\n<ul>\n<li>Default value validation defined in service design and deployment might not take effect on the offering definition page.</li>\n<li>In the default value panel of the offering definition page, the value of a user option can't be retrieved from a dynamic list defined in DND.</li>\n<li>User option value dependency doesn't work in the default value panel of the offering definition page.</li>\n<li>The offering type is predefined as “Service Offering” in an aggregated offering. As a task plan is also auto-created in the aggregated offering, it might cause unpredictable issues if the offering type is manually changed to another value.</li>\n<li>The prefix (\"Request: \", \"Modify: \", and \"Cancel: \") in the title of a request based on an aggregated offering from a cloud service doesn't support localization.</li>\n<li>If the icon of an option set is in the SVG format in service design and deployment, the system ignores the icon during the aggregation process.</li>\n<li>Custom Regular Expression defined in DND isn't supported in the aggregated offerings.</li>\n<li>Some tokens defined in DND aren't supported in the aggregated offerings, such as TOKEN:REQ_USER_ID, TOKEN:REQ_ORG_ID, TOKEN:SVC_SUBSCRIPTION_ID, and so on.</li>\n<li>\n<p>If the display name returned from the DND dynamic script includes special characters \"&lt;\" and \"&gt;\", the content between \"&lt;\" and \"&gt;\" is treated as HTML tags and is rendered accordingly. Therefore, if no valid HTML tags are found, nothing is rendered and displayed on UI.</p>\n</li>\n<li>Limitations for using aggregated offerings in a bundle:\n\t<ul>\n<li>The bundle itself must support the \"Create Subscription\" action. Otherwise, the child request based on aggregated offerings can't be created.</li>\n<li>The \"Set user option mappings\" interface in the bundle definition isn't displayed well and behaves incorrectly for aggregated offerings.</li>\n<li>The default title of the request created from an aggregated offering (\"Request: &lt;offering name&gt;\") is no longer available if it belongs to a bundle. </li>\n</ul>\n</li>\n<li>\n<li>Limitations for pricing mode:\n\t<ul>\n<li>The Quantity Multiplier isn't supported in aggregated offerings. For example, the pricing of a DND subscription will not change if we modify the subscription by scaling the resources up or down. Due to this, there will be no change in the projected expense line when subscriptions are scaled up or down.</li>\n<li>Defining price on user options of the Integer type isn't supported in aggregated offerings.</li>\n<li>Recurring period Daily/Hourly/Per Minute isn't supported in aggregated offerings.</li>\n<li>Using Externalized Prices isn't supported in aggregated offerings.</li>\n</ul>\n</li>\n</li></ul>\n</div>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}