{
  "title": "Download and upload container images to a registry",
  "content": "<div class=\"mw-parser-output\"><br/><p>Before you install OMT and/or the suite, you need to download the images from the official Docker Hub to a registry. This Docker image registry is where you will store the container images required for OMT and/or the suite. Download the container images from Docker Hub and upload them to your own target Docker image registry. Alternatively, if a source registry that contains the container images is already available, you can download the images from this source registry to your target registry.</p><h2>Prepare the registry</h2><div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"> </div><div class=\"admonition-content admonition-note-content\">[For BYOK] If your cluster platform comes with an internal Docker registry, refer to the Docker registry documentation specific to your platform. Alternatively, you can also create the Docker registry on a different platform.</div></div><p>[For OpenShift ] OpenShift Container Platform comes with an internal Docker registry, which is normally automatically deployed during the installation of your OpenShift cluster. You can also install a standalone OpenShift container registry. For details, see the OpenShift documentation. You can also create a Docker registry on a platform other than OpenShift. For details, see the Docker registry documentation specific to your platform. </p><p>The \"target registry\" refers to your registry in the next steps. You need the following information to continue with the next steps: </p><ul><li>Your registry URL</li><li>The organization name of your registry</li><li>The user name and password to access your registry</li></ul><h2 id=\"Generate_the_Image_Set\">Generate the image set</h2><p>Before downloading and uploading the images, you need to generate the image set. Complete the following steps to generate download bundle for helm based installations.</p><ol><li>Log on to the bastion and then navigate to the $CDF_HOME/tools/generate-download directory.</li><li>Run the <code>generate_download_bundle.sh</code> command together with the options required by your deployment. For the full list of command options, run the command with the -h option.\n\t<pre>generate_download_bundle.sh -f &lt;image_set_file&gt; [ -d &lt;output_directory&gt;]</pre><p>Where:</p><ul><li><code>&lt;image_set_file&gt;</code>: The absolute path to the image set file. To locate this file, untar the esm-1.0.0+2x.x-xxx.tar  and check the scripts folder. </li><li><code>&lt;output_directory&gt;</code>: The directory where the script saves the offline-download.zip file. If you don't specify a value, the script saves the file to the default directory, which is the current working directory.</li></ul><p>Example command:</p><pre>generate_download_bundle.sh -f  &lt;ESM_Helm_Chart-2x.x.x&gt;/scripts/image_sets/_image-set.json -d /tmp</pre><p>You will see a similar message indicating that you have successfully generated the <code>offline-download.zip</code> file:</p><pre>INFO offline-download.zip is generated under /tmp\nINFO For more details, please refer: /home/centos/cdf/log/generate_download_bundle/generate_download_bundle.20240129084204.log\n</pre>\n\tThe generated file contains the image download bundle. This bundle downloads the images required for installation.</li></ol><h2>Download the required installation images</h2><span class=\"snippet-start\" data-sname=\"423-25.4-423-25.3-UploadImagestoExternalRegistry|DownloadImages|N\"></span><ol>\n<li>Log on to the first control plane node or the bastion node. If that node can't access Docker Hub, transfer the  <code>offline-download.zip</code>  file to a Linux server that can access Docker Hub.</li>\n<li>Extract the .zip package to a directory. If you can't access Docker Hub directly, set up the HTTP/HTTPS proxy. For example, run the following commands to set the HTTP/HTTPS proxy. Replace the placeholders with your actual server and port. <br/>\n<code>export http_proxy=\"&lt;http://PROXY_SERVER:PORT&gt;\"<br/>\n\texport https_proxy=\"&lt;https://PROXY_SERVER:PORT&gt;\"</code></li>\n<li>Go to the directory you extracted the <code>offline-download.zip</code> package into.</li>\n<li>Run the following command:<br/>\n\t \n\t<pre><code>./downloadimages.sh -u &lt;username&gt;  -d &lt;image download directory&gt; -c on|off -o &lt;org name&gt;</code></pre>\n<p>\tWhere:\n</p>\n<ul>\n<li>Replace &lt;<i>username</i>&gt; with the Docker Hub username.</li>\n<li>If you don't specify the credentials here, you will be prompted to specify them when you run the command.</li>\n<li>&lt;<em>image download directory</em>&gt;: The directory where the container images will be downloaded. The default value is /var/opt/cdf/offline.</li>\n<li>The <code>-c</code> option is used to verify the digital signature of the images during the download. The default setting is off, which doesn't verify the signature.</li>\n<li><code>&lt;org name&gt;</code>: The organization in the image registry that contains the images for installation. By default, this is <code>hpeswitom.</code> This option is mandatory if you aren't using the default organization name.</li>\n</ul>\n</li>\n</ol>\n<p>To see the full list of options for the <code>downloadimages.sh</code> command, run the following command:<br/>\n<code>./downloadimages.sh –h</code><br/>\nThe command also has a <code>-p</code> option to provide your password. The <code>-p</code>  option doesn't support single quotes (don't include single quotes in the password).</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note:</span> OpenText encourages you to use some other password options, which aren't provided by OpenText. By implementing the -p option, you may expose the system to increased security risks. You understand and agree to assume all associated risks and hold OpenText harmless for the same. It remains at all times your sole responsibility to assess its own regulatory and business requirements. OpenText doesn't represent or warrant that its products comply with any specific legal or regulatory standards applicable to you in conducting your business.</p>\n</div>\n<p><br/>\n</p><span class=\"snippet-end\" data-sname=\"423-25.4-423-25.3-UploadImagestoExternalRegistry|DownloadImages|N\"></span><h2>(Optional) Transfer the images to the bastion node</h2><p>If you downloaded the images to a server other than the bastion node, transfer the images to a directory on the bastion node. By default, the images should be placed under the  <code>/var/opt/cdf/offline</code> directory.</p><div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"> </div><div class=\"admonition-content admonition-note-content\"><p>The images will be uploaded with the <code>uploadimages.sh</code> script in the next step. The image upload requires up to 2 times of the image size space in the target image directory. For example, if you choose to use the default <code>/var/opt/cdf/offline</code> directory, ensure that you have 2 times of the suite image size space under <code>/var/opt/cdf/offline</code> directory of the bastion node. </p></div></div><h2>Upload the images</h2><p>Follow these steps to upload the installation images to your image registry:</p><ol><li>Log on to one of the bastion nodes. The node must be able to connect to the registry.</li><li>Go to the directory you extracted the <code>offline-download.zip</code> package into.</li><li>Run the following command to upload the suite images to the registry:\n\t<pre>./uploadimages.sh -r &lt;registry&gt; -u &lt;username&gt; -p &lt;password&gt; -d &lt;image download directory&gt; -o &lt;org name&gt;</pre>\n\tWhere:\n\n\t<ul><li>&lt;<code>registry</code>&gt; is the URL of the registry.</li><li>&lt;<code>username</code>&gt; and &lt;password&gt; are the user name and password of your docker registry. Obtain it from the admin of the registry.</li><li><code>&lt;image download directory&gt;</code>: The directory to which you downloaded the container images. The default value is <code>/var/opt/cdf/offline</code>. Specify the <code>-d </code> option if the images aren't in the <code>/var/opt/cdf/offline/</code> directory. You can use the <code>-d</code> option multiple times when the images are in different directories. The images can be the images downloaded by the <code>downloadimages.sh</code>. Make sure the image file type matches the file extension. </li><li><code>&lt;org name&gt;</code>: The organization in the image registry that contains the images for installation. By default, this is <code>hpeswitom.</code> This option is mandatory if you aren't using the default organization name.</li><li><code>--cleanup</code>: Delete the image source folder to save disk space. It only works when all images are uploaded successfully.</li></ul><p>To see the full list of options for the <code>uploadimages.sh</code> command, run the following command:<br/><br/><code>./uploadimages.sh -h </code></p></li><li>Wait until the images are successfully uploaded. Your terminal should resemble the following:\n\t<pre>Upload-process successfully completed.\n</pre></li></ol></div>",
  "modifiedon": "2025-10-24 08:51:12"
}