{
  "title": "Validation rule examples",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The following examples demonstrate how to formulate rules for each of the validation rule templates.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\"> By design:\n<ul>\n<li>Validation rules do not take effect if they are placed in <strong>Leaving</strong>/<strong>Entering</strong> process events. We recommend that you either manually perform the validation or place the validation rules in <strong>After change</strong> process events. The only exception is the object <strong>current_update</strong> used in Expression Language, if only <strong>current_update</strong> is used in your validation rules, you can keep them in Leaving/Entering process events.</li>\n<li>Starting version 2023.05, validation rules can no longer be added in the <strong>Before Change</strong> process event. Instead, we recommend that you configure validation rules in the <strong>After Change</strong> process event. </li>\n</ul>\n</div>\n</div>\n<h2 class=\"mw-headline\" id=\"Define_field_as_mandatory\">Define fields as mandatory</h2>\n<p>The only parameter in this rule template is <strong>fields</strong>. Click the link and select the required fields. When the rule runs, the fields become mandatory fields and they are indicated with a red asterisk on any forms on which they appear.</p>\n<h2 class=\"mw-headline\" id=\"Define_field_as_read-only\">Define fields as read-only</h2>\n<p>The only parameter in this rule template is <b>fields</b>. Click the link and select the required fields. When the rule runs, the <b>Read Only</b> property is marked as read-only for the selected fields.</p>\n<p>Example: In Change Management, you can define a rule to set the <b>ImpactScope</b> field to read-only. When the rule runs, the <b>Impact</b> field on the Change form isn't editable.</p>\n<h2 class=\"mw-headline\" id=\"Validate_expression\">Validate expression</h2>\n<ol>\n<li>For the <b>expression</b> parameter, enter an Expression Language phrase that returns a boolean value. For a full list of Expression Language functions, see <a href=\"/doc/423/26.1/explangfunctions\" title=\"SMAX:25.1/ExpLangFunctions\">Expression Language functions and syntax</a>.</li>\n<li>For the <b>error message</b> parameter, enter an error message in the relevant languages.</li>\n</ol>\n<p>Example: There is a rule in Change Management called <b>CanCreateEmergencyChange</b> which evaluates the expression <b>${current_user.IsPermitted('Can-Create-Emergency-Change()')}</b>. The Expression language phrase returns a boolean value based on whether the current user has permission to create an emergency change. For the error message, enter: <b>User isn't permitted to create emergency Change</b>, which is returned when the expression evaluates as <b>false</b>.</p>\n<p><strong>Note </strong>The entity.&lt;RecordType&gt;.count expression can't be used to control the number of allowed relationships. Because there is concurrency and many2many relationships are updated by asynchronous jobs, the counted number is not always accurate.</p>\n<p>For example, the following rule won't always work:</p>\n<pre>If ${current_association_update.association_name == 'RequestCausesRequest'}\n\nValidate ${entity.RequestCausesRequest.count == 0} and display Cannot add one more relationship in case of a failure</pre>\n<h2>Validate if field matches pattern</h2>\n<ol>\n<li>The <strong>field</strong> parameter can be a TEXT (SMALL, LARGE, MEDIUM), EMAIL, or URL field.</li>\n<li>The values of the <strong>pattern</strong> parameter are defined by the <strong>Input Validation Pattern</strong> list.  </li>\n<li>For the <strong>current user(optional)</strong> parameter, select an ENTITY_LINK field that references to <strong>Person</strong>. This parameter is optional, when it is set, it will get the locale of the person, otherwise, it will get the locale of the user who is currently logged in. The locale will be used to select the corresponding regular expression defined in the <strong>Input Validation Pattern</strong> list.</li>\n<li>The <strong>error message</strong> parameter allows you to show an error message if the <strong>field</strong> parameter does not match the <strong>pattern </strong>parameter.</li>\n</ol>\n<h3>The Input Validation Pattern list</h3>\n<p>The <strong>Input Validation Pattern</strong> list consists of string patterns defined by regular expressions. In Service Management,regular expressions are affected by the <a href=\"/doc/423/26.1/appsettings#Enable_full_character_set_for_regular_expressions\" title=\"Enable full character set for regular expressions\">Enable full character set for regular expressions</a> application setting. This option is set to Off by default, which only allows the use of “?” and “*” metacharacters in regular expressions. When this option is set to On, all metacharacters are allowed in regular expressions.</p>\n<p>Some out-of-the-box patterns are provided, for example, Email, URL, IPAddress, PhoneNumber, and StringWithLetterNumberOnly, all of which are defined by regular expressions. You can also create a new pattern written with a regular expression in <strong>Display name</strong>. When a custom pattern is active, it can be selected in the <strong>pattern</strong> parameter of the <strong>Validate if field matches pattern </strong>rule. </p>\n<p>In addition, when this application setting is turned on, this rule will have a timeout of 100 milliseconds. After 100 milliseconds, a false value will always be returned. A timeout indicates that the regular expression gets stuck on crafted input, or \"evil.\" See <a href=\"https://owasp.org/www-community/attacks/Regular_expression_Denial_of_Service_-_ReDoS\" title=\"Regular expression Denial of Service - ReDoS\">Regular expression Denial of Service - ReDoS</a> for more information about how to optimize regular expressions. </p>\n<p>In different languages, the same field can have different patterns according to the conventions of the language or culture. Therefore, this list is designed to be multilingual, you can define different patterns for the same field when the locale changes. To do so, simply click the <strong>...</strong> button and enter a regular expression in the desired language. The locale will be retrieved from the <strong>current user(optional)</strong> parameter.</p>\n<h2 class=\"mw-headline\" id=\"Validate_no_collisions\">Validate no collisions</h2>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-caution-icon\"></div>\n<div class=\"admonition-content admonition-caution-content\">\n<p>It's possible to create a simple rule using this template without the <b>\"If...Then\"</b> option and the <b>expression</b> parameter. However, such a rule would run every time a change record is saved (if defined in <b>After change</b>), and on every added association (if defined in <b>Before adding relationship</b>), likely having a materially adverse effect on performance.</p>\n<p>It's therefore recommended that you configure this rule template by always including an <b>expression</b> parameter.</p>\n</div>\n</div>\n<ol>\n<li>\n<p>The value for the <b>expression</b> parameter depends on the detection required:</p>\n<ul>\n<li>\n<p>Check for collisions with all changes</p>\n<p>To check for scheduling collisions with all changes, select a matching start and end time. For example, to check for collisions of Scheduled start time and Scheduled end time, type:</p>\n<p><code>${current_update.ScheduledStartTime.IsChanged || current_update.ScheduledEndTime.IsChanged}</code></p>\n</li>\n<li>\n<p>Check for collisions with changes affecting same device</p>\n<p>When you check for collisions with changes that affect the same device (or devices) that the current change affects, you need to add two business rules: one to the <b>After change</b> section of the <b>Change &gt; Processes and Rules</b> tab, and one to the <b>Before adding relationship</b> section. For example, to check for collisions of Scheduled start time and Scheduled end time, and for collisions with changes affecting the same device, type:</p>\n<ul>\n<li>\n<p>In the <b>After change</b> section, type:</p>\n<p><code>${current_update.ScheduledStartTime.IsChanged || current_update.ScheduledEndTime.IsChanged}</code></p>\n</li>\n<li>\n<p>In the <b>Before adding relationship</b> section, type:</p>\n<p><code>${current_association_update.association_name == 'DeviceAffectedByChange'}</code></p>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<p>For the <b>start time</b> parameter, select a suitable start time field. For example, <b>Scheduled start</b>.</p>\n</li>\n<li>\n<p>For the <b>end time</b> parameter, select a suitable end time field. For example, <b>Scheduled end</b>.</p>\n</li>\n<li>\n<p>For the <b>changes</b> parameter, select:</p>\n<ul>\n<li><b>All changes</b> to detect scheduling collisions with all changes.</li>\n<li><b>Changes affecting involved devices</b> to detect device collisions.</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>This field displays only for the rule in the <b>After Change</b> section of the Change process.</p>\n</div>\n</div>\n</li>\n<li>\n<p>For the <b>filters</b> parameter, select to filter the change records that the business rule is applied to.</p>\n</li>\n<li>\n<p>For the <b>start time field</b> and <b>end time field</b> parameters, select a suitable start time field and end time field.</p>\n<p>The business rule compares the start time to end time (as determined above) of the current change record being worked on, with the <b>start time field</b> to the <b>end time field</b> of other active changes.</p>\n<p>For example, you might have the following settings:</p>\n<ul>\n<li>\n<p>start time - Scheduled start</p>\n</li>\n<li>\n<p>end time - Scheduled end</p>\n</li>\n<li>\n<p>start time field - Scheduled DT start</p>\n</li>\n<li>\n<p>end time field - Scheduled DT end</p>\n</li>\n</ul>\n<p>The business rule then detects change collisions between the Scheduled start and Scheduled end of the current record being worked on, with the Scheduled DT start and Scheduled DT end for all other active changes.</p>\n</li>\n<li>\n<p>When the rule runs, it detects change collisions according to how the rule is configured. For more information, see <a href=\"/doc/423/26.1/changecollision\" title=\"SMAX:25.1/ChangeCollision\">Change collision detection</a>.</p>\n</li>\n</ol>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>This validation rule is for Change Management only.</p>\n</div>\n</div>\n<h2 class=\"mw-headline\" id=\"Validate_that_field_is_in_list\">Validate that field is in list</h2>\n<ol>\n<li>\n<p>For the <b>field</b> parameter, select the required field from the drop-down list. Only fields of logical type Enum/Enum Set are available.</p>\n</li>\n<li>\n<p>For the <b>list</b> parameter, select one of the following options:</p>\n<ul>\n<li><b>Select data.</b> Select an item from the drop-down list.</li>\n<li><b>Expression Language.</b> Enter an Expression Language phrase that returns a value matching the type of the selected field.</li>\n</ul>\n<p>Click the <b>Expression Language</b> <a class=\"image\" href=\"/file/images/thumb/f/f3/SMAiconfx.png/30px-SMAiconfx.png\" title=\"/file/images/thumb/f/f3/SMAiconfx.png/30px-SMAiconfx.png\"> <img alt=\"SMAiconfx.png\" height=\"28\" src=\"../../../images/30px-SMAiconfx_894ae630.png\" width=\"30\"/> </a> button to toggle between these options. When the button is selected (blue), the field is in Expression Language mode. When it's not selected (white), the field is in Simple mode. For a full list of Expression Language functions, see <a href=\"/doc/423/26.1/explangfunctions\" title=\"SMAX:25.1/ExpLangFunctions\">Expression Language functions and syntax</a>.</p>\n<p>To select multiple values, click <b>Add item</b> to open another box.</p>\n</li>\n<li>\n<p>When the rule runs, it verifies that the value of the selected field is included in the list.</p>\n</li>\n</ol>\n<p>Example: The following rule is used to restrict the process from proceeding unless the status of the request is <b>In Progress</b> or <b>Suspended</b>:</p>\n<p>The<b> Status</b> field is selected as the <b>field</b> parameter, and the following collection is entered as the <b>list</b> parameter, forming the list of required values:</p>\n<p>(RequestStatusInProgress, RequestStatusSuspended)</p>\n<h2 class=\"mw-headline\" id=\"Validate_that_field_is_in_range\">Validate that field is in range</h2>\n<ol>\n<li>\n<p>For the <b>field</b> parameter, select the required field from the drop-down list. Only fields of a numeric or date/time type are available.</p>\n</li>\n<li>\n<p>For the <b>from</b> and <b>to</b> parameters, select one of the following options:</p>\n<ul>\n<li><b>Select data.</b> Select the date and/or time using the calendar or enter it manually (for non-date/time numeric values).</li>\n<li><b>Expression Language.</b> Enter an Expression Language phrase that returns a numeric or date/time value.</li>\n</ul>\n<p>Click the <b>Expression Language</b> <a class=\"image\" href=\"/file/images/thumb/f/f3/SMAiconfx.png/30px-SMAiconfx.png\" title=\"/file/images/thumb/f/f3/SMAiconfx.png/30px-SMAiconfx.png\"> <img alt=\"SMAiconfx.png\" height=\"28\" src=\"../../../images/30px-SMAiconfx_894ae630.png\" width=\"30\"/> </a> button to toggle between these options. When the button is selected (blue), the field is in Expression Language mode. When it's not selected (white), the field is in Simple mode. For a full list of Expression Language functions, see <a href=\"/doc/423/26.1/explangfunctions\" title=\"SMAX:25.1/ExpLangFunctions\">Expression Language functions and syntax</a>.</p>\n</li>\n<li>\n<p>When the rule runs, it verifies that the value of the selected field is within the range bounded by the <b>from</b> and <b>to</b> values.</p>\n</li>\n</ol>\n<p>Example: In Incident Management, if there is a <b>priorityNumber</b> field which contains a numeric value, the following rule is used to restrict the process from proceeding unless the priority is between 1 and 3:</p>\n<p><b>priorityNumber</b> is selected as the field parameter, <b>1</b> is entered as the <b>from</b> parameter, and <b>3</b> is entered as the <b>to</b> parameter, forming the required range of the field.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>All of the rules can be formulated with the <b>\"If...Then\"</b> option, which includes an <b>expression</b> parameter for the condition. Make sure to enter an Expression Language phrase that returns a boolean value.</p>\n</div>\n</div>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/processes\" title=\"SMAX:25.1/Processes\">Processes and Rules</a></li>\n<li><a href=\"/doc/423/26.1/embizrules\" title=\"SMAX:25.1/emBizRules\">Studio business rules</a></li>\n<li><a href=\"/doc/423/26.1/dslactionrules\" title=\"SMAX:25.1/DSLActionRules\">Action rule examples</a></li>\n<li><a href=\"/doc/423/26.1/renderingrules\" title=\"SMAX:25.1/RenderingRules\">Rendering rule examples</a></li>\n<li><a href=\"/doc/423/26.1/fieldselectionrulesexamples\" title=\"SMAX:25.1/FieldSelectionRulesExamples\">Field selection rule examples</a></li>\n<li><a href=\"/doc/423/26.1/executerest\" title=\"SMAX:25.1/ExecuteREST\">REST Execution</a></li>\n<li><a href=\"/doc/423/26.1/wflwusecase\" title=\"SMAX:25.1/WflwUseCase\">Studio - use case</a></li>\n<li><a href=\"/doc/423/26.1/addbizrule\" title=\"SMAX:25.1/AddBizRule\">How to add a business rule</a></li>\n<li><a href=\"/doc/423/26.1/modifybizrule\" title=\"SMAX:25.1/ModifyBizRule\">How to edit, remove, or disable a business rule</a></li>\n<li><a href=\"/doc/423/26.1/enrichmentrules\" title=\"SMAX:25.1/EnrichmentRules\">Enrichment rules</a></li>\n<li><a href=\"/doc/423/26.1/rulesdescriptionstags\" title=\"SMAX:25.1/RulesDescriptionsTags\">Business rule descriptions and tags</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}