{
  "title": "Data domain segmentation example 1",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p class=\"mw-empty-elt\"></p>\n<p>The following is an example based on the images shown below. This example revolves around Sally and Rob, who are members of different groups, and therefore don't by default see the same records.</p>\n<p>Sally is a member of the group called <b>DBA team</b>. The <b>DBA team</b> group has been assigned a Primary domain called <b>Database</b>.</p>\n<p>The request called <b>Extend schema size</b> is based on an offering that has a default group assignment of the <b>DBA team</b> group, whose Primary domain is <b>Database</b>. All service requests based on this offering are assigned to the <b>DBA team</b> group and are therefore populated with the <b>Database</b> domain. Sally, as a member of the <b>DBA team</b> group, is automatically granted access to the new <b>Extend schema size</b> service request.</p>\n<p>(Not illustrated in a diagram) If an incident is also opened based on this request (for example <b>DB out of space</b>), the incident is also automatically populated with the <b>Database</b> data domain as a result of the request's assignment to the <b>DBA team</b> group.</p>\n<p><a class=\"image\" href=\"/file/images/9/9a/2018.08_Helpcenter/Resources/Images/DS/dsDefinitions.png\" title=\"/file/images/9/9a/2018.08_Helpcenter/Resources/Images/DS/dsDefinitions.png\"> <img alt=\"dsDefinitions.png\" class=\"z_migration_tba_PDF\" decoding=\"async\" height=\"264\" src=\"../../../images/dsDefinitions_b641c8a1.png\" width=\"534\"/> </a></p>\n<p>In this example, the group is the only place in the system where the data domain is assigned. All other records are populated with the data domain assignment as a result of the assigned group’s Primary domain. For example, in this example, the person, offering, service request, and incident records are all automatically populated with the <b>Database</b> data domain all as a result of the <b>DBA team</b> group’s Primary domain assignment.<br/>\n<a class=\"image\" href=\"/file/images/a/a6/2018.08_Helpcenter/Resources/Images/DS/dsConclusions.png\" title=\"/file/images/a/a6/2018.08_Helpcenter/Resources/Images/DS/dsConclusions.png\"> <img alt=\"dsConclusions.png\" class=\"z_migration_tba_PDF\" decoding=\"async\" height=\"326\" src=\"../../../images/dsConclusions_b93396eb.png\" width=\"530\"/> </a></p>\n<p>Rob isn't a member of the <b>DBA team</b> group but also has access to view any records that have been assigned the <b>Database</b> data domain. This is because he has been assigned the <b>VP Engineering</b> role, which also has permission to view the <b>Database</b> data domain.</p>\n<p><a class=\"image\" href=\"/file/images/1/11/2018.08_Helpcenter/Resources/Images/DS/dsUserNotInGroup.png\" title=\"/file/images/1/11/2018.08_Helpcenter/Resources/Images/DS/dsUserNotInGroup.png\"> <img alt=\"dsUserNotInGroup.png\" class=\"z_migration_tba_PDF\" decoding=\"async\" height=\"435\" src=\"../../../images/dsUserNotInGroup_6fff252c.png\" width=\"583\"/> </a></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}