{
  "title": "Data domain segmentation – use cases",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>This topic describes sample use cases of data domain segmentation.</p>\n<h2 id=\"Line_of_Business_(LOB)_use_case\"><span class=\"mw-headline\" id=\"Line_of_Business_.28LOB.29_use_case\">Line of Business (LOB) use case</span></h2>\n<p>The following diagram shows a sample LOB use case that uses the IT and HR departments within one organization.</p>\n<p><a class=\"image\" href=\"/file/images/0/06/SMA_2020.02_data_domain_seg_lob.png\" title=\"/file/images/0/06/SMA_2020.02_data_domain_seg_lob.png\"> <img alt=\"SMA 2020.02 data domain seg lob.png\" data-file-height=\"651\" data-file-width=\"750\" height=\"651\" src=\"../../../images/SMA_2020.02_data_domain_seg_lob_eca86fba.png\" width=\"750\"/> </a></p>\n<p>In this use case:</p>\n<ul>\n<li>Two data domains are defined for the two departments: <b>IT</b>, and <b>HR</b>.</li>\n<li>Operational data (such as Request, Incident, and Change data) is strictly separated for the two departments.</li>\n<li>Most of the reference data (such as Person, Group, Record Category, and Location data) is public to all. That is, these records have a <b>Data domains</b> value of <b>Public</b>.</li>\n<li>IT agents are allowed to view IT data only (not HR data), and vice versa. That is, IT and HR agents have a <b>Primary domain</b> value of <b>IT</b> or <b>HR</b>, respectively.</li>\n<li>All agent users are visible to each other. That is, all agents have a <b>Data domains</b> value of <b>Public</b>.</li>\n<li>All operational data records are assigned to only one data domain: <b>IT</b> or <b>HR</b>.</li>\n</ul>\n<h2 id=\"Managed_Services_Provider_(MSP)_use_case\"><span class=\"mw-headline\" id=\"Managed_Services_Provider_.28MSP.29_use_case\">Managed Services Provider (MSP) use case</span></h2>\n<p>Normally, in an MSP environment, a number of tenants are deployed to provide services to different customers, which is recommended; however, you can also use data domain segmentation within one tenant to support multiple customers.</p>\n<p>The following diagram shows a sample MSP use case that uses two companies within one tenant (Company A and Company B).</p>\n<p><a class=\"image\" href=\"/file/images/1/1d/SMA_2020.02_data_domain_seg_msp.png\" title=\"/file/images/1/1d/SMA_2020.02_data_domain_seg_msp.png\"> <img alt=\"SMA 2020.02 data domain seg msp.png\" data-file-height=\"664\" data-file-width=\"778\" height=\"664\" src=\"../../../images/SMA_2020.02_data_domain_seg_msp_5fc073af.png\" width=\"778\"/> </a></p>\n<p>In this use case:</p>\n<ul>\n<li>Two data domains A and B are defined for Company A and Company B, respectively.</li>\n<li>Both operational data (such as Request, Incident, and Change data) and reference data (such as Person, Group, and Record Category data) are strictly separated for the two companies. That is, all of these records are assigned either domain A or domain B (the <b>Data domains</b> field).</li>\n<li>An agent of Company A or B is allowed to view only Company A's or Company B's data, and is visible only to other Company A or Company B agents and Services Provider (SP) agents (also referred to as \"MSP agents\"). That is, the <b>Primary domain</b> value for each Company A or Company B agent is <b>A</b> or <b>B</b>, respectively.</li>\n<li>SP agents are allowed to view all data of both companies and are also visible to all agents. To achieve this, you can create a group or role that can view all data domains and then assign the group or role to each SP agent, and set the <b>Data domains</b> field of each SP agent to <b>Public</b>.</li>\n<li>All records are assigned only to one data domain (<b>A</b> or <b>B</b>) , except that SP agents are assigned to the <b>Public</b> data domain.<br/>\n<b>Notes</b>:\n\t<ul>\n<li>If you assign one record to more than one data domain (for example, A and B), Company A agents can view the record and see Company B's agent names in the record; however, they can't drill down to the details of Company B agents.</li>\n<li>If you first assign domain A to one record and then change to domain B, some record link values in the record (for example, the Owner) aren't automatically updated from domain A to B. As a result, Company B agents see a value of <b>[deleted]</b> for these attributes in the record.</li>\n</ul>\n</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Examples\">Examples</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/dsusecaseexample1\" title=\"SMAX:25.1/dsUseCaseExample1\">Data domain segmentation example 1</a></li>\n<li><a href=\"/doc/423/26.1/dsusecaseexample2\" title=\"SMAX:25.1/dsUseCaseExample2\">Data domain segmentation example 2</a></li>\n<li><a href=\"/doc/423/26.1/dsusecaseexample3\" title=\"SMAX:25.1/dsUseCaseExample3\">Data domain segmentation example 3</a></li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/assigndomainprimary\" title=\"SMAX:25.1/AssignDomainPrimary\">Assign data domain permissions to a user, group or role</a></li>\n<li><a href=\"/doc/423/26.1/assigndomainrec\" title=\"SMAX:25.1/AssignDomainRec\">How to assign a record to a data domain</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}