{
  "title": "Data domain segmentation example 3",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p><br/>\nThis example uses the Request record type to demonstrate data domain segmentation for two companies (Company A and Company B) that you manage within one tenant.</p>\n<ol>\n<li>Log in to the tenant as the tenant admin.</li>\n<li>From the main menu, go to <b>Administration</b> &gt; <b>Configuration</b> &gt; <b>Lists</b>. Edit the <b>Data domain</b>s list to add the following two domains: <b>Company_A</b> and <b>Company_B</b>.</li>\n<li>Go to <b>Administration</b> &gt; <b>Configuration</b> &gt; <b>Studio</b>, do the following:\n\t<ul>\n<li>Open the <b>Person</b> record, and then add the <b>Primary domain</b> and <b>Data domains</b> fields to the Person forms (New and Full).</li>\n<li>Open the <b>Request</b> record, and then add the <b>Data domains</b> field to the <b>withoutResolution</b> form.</li>\n</ul>\n</li>\n<li>Go to <b>Administration</b> &gt; <b>Master data</b> &gt; <b>People</b>, click <b>ROLES</b>, and then create a new role named <b>SP_agent</b> with the following permissions:\n\t<ul>\n<li><b>General</b> &gt; <b>Log into the application</b></li>\n<li><b>Security</b> &gt;<b>View all data domains permission</b></li>\n<li><b>Record types</b> &gt; <b>Request</b> &gt; <b>View</b> and <b>Update</b></li>\n</ul>\n</li>\n<li>Log in to Suite Administration as suite-admin (https://&lt;External Access Host&gt;/bo), open the tenant record, and turn on the <b>Manage users in tenant</b> option. This option enables the tenant admin to create users directly from the agent interface.</li>\n<li>Go to <b>Administration</b> &gt; <b>Master data</b> &gt; <b>People</b>, and then click <b>New</b> to create five users of the DB authentication type with the following settings:\n\t<ul>\n<li>Sally (ESS user of Company A): Data domains=<b>Company_A</b>, Primary domain=<b>Company_A</b>, Roles=<b>Self-Service Portal User</b></li>\n<li>Danny (ESS user of Company B): Data domains=<b>Company_B</b>, Primary domain=<b>Company_B</b>, Roles=<b>Self-Service Portal User</b></li>\n<li>Tony (SP agent): Data domains=<b>Public</b>, Primary domain=(empty value), Roles=<b>Self-Service Portal User</b> and <b>SP_agent</b></li>\n<li>Jeffery (Company A agent): Data domains=<b>Company_A</b>, Primary domain=<b>Company_A</b>, Role=<b>Self-Service Portal User</b>, and <b>Request Approver</b></li>\n<li>Joanna (Company B agent): Data domains=<b>Company_B</b>, Primary domain=<b>Company_B</b>, Role=<b>Self-Service Portal User</b> and <b>Request Approver</b></li>\n</ul>\n\tMake sure that a mail server is already configured in <strong>Bo</strong> &gt; <strong>Configurations</strong> &gt; <strong>Email Service</strong>, then open each user record and click <strong>Reset password</strong> to activate the user accounts.</li>\n<li>Go to <b>Administration</b> &gt; <b>Master data</b> &gt; <b>Groups</b>, and then create a group named Group_A, set its <b>Primary domain</b> to <b>Company_A</b>, and then click <b>Add</b> in the <b>Group members</b> section to add user Sally to this group.</li>\n<li>Similarly, create another group named Group_B, set its <b>Primary domain</b> to <b>Company_B</b>, and then add Danny to this group.</li>\n<li>Go to <b>Plan</b> &gt; <b>Service Catalog</b> &gt; <b>Offerings</b>, open an offering (for example, the out-of-the-box offering named <b>Request PC Phone Service</b>), and then click <b>Default values</b> and select <b>Group_A</b> in the <b>Service Desk group</b> field, and go to the <b>Audience</b> section on the General tab to add <b>Group_A</b>. This offering is referred to as offering A in a later step, and will be available for Sally and not for Danny.</li>\n<li>Similarly, update another offering for Group_B. This offering is referred to as offering B in a later step, and will be available for Danny and not for Sally.</li>\n<li>Log in to Service Portal as Sally and then submit a request for offering A.</li>\n<li>Log in to Service Portal as Danny, and then submit a request for offering B.</li>\n<li>Log in to the agent interface as Jeffery, and check that you can see only the request that Sally submitted. Additionally, the <b>Data domains</b> field of the request is populated with a value of <b>Company_A</b>, which is the <b>Primary domain</b> of Group_A.</li>\n<li>Log in to the agent interface as Joanna, and check that you can see only the request that Danny submitted. Additionally, the <b>Data domains</b> field of the request is populated with a value of <b>Company_B</b>, which is <b>Primary domain</b> of Group_B.</li>\n<li>Log in to the agent interface as Tony, and check that you can see both of the requests that Sally and Danny submitted.</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}