{
  "title": "Service Management/SM Dual Mode",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><h2>Introduction</h2>\n<p>While Service Manager (SM) and OpenText Service Management (Service Management) are both end-to-end, stand-alone, solutions for IT and Extended Service Management, they can also be used together. Customers looking for a modern self-service portal while leveraging the SM request catalog can deploy the Service Management Service Portal with SM; this deployment combination is called “Mixed Mode” for short. Customers looking to transform the entire Service Request process, that is, the Self-service Portal, Service Catalog, End-user Knowledge Management, and Service Request functions, can deploy Service Management with SM for the remaining processes such as Incident, Problem, and Change; this deployment combination is called “Dual Mode” for short. Mixed and Dual Modes are considered by customers looking to improve the self-service experience, advance the entire service request process, revamp the service catalog, or transition to Service Management.</p>\n<p>SM unloads and accompanying documentation are provided for setting up SM and Service Management systems for use in Dual Mode. The information, as well as “recipes” for setting up catalog offerings for fulfillment in either Request or Incident Management in Service Center, may be found at the following link: <a href=\"https://marketplace.opentext.com/itom/content/dual-mode-recipe\" title=\"https://marketplace.opentext.com/itom/content/dual-mode-recipe\">https://marketplace.opentext.com/itom/content/dual-mode-recipe</a></p>\n<h2>What is Dual Mode?</h2>\n<p>Using Dual Mode, the entire Service Request Management process is run inside Service Management. This includes the Self-service Portal, Service Catalog, Knowledge Management, and Service Request functions. All configuration for these processes (specifically Service Catalog) is done within Service Management.</p>\n<p>The remaining processes are handled with SM. This includes Incident, Problem, and Change.</p>\n<p>When a Service Request Management process would create a related Incident, Problem, or Change (or any other process handled in SM), the information is passed from Service Management to SM using the Case Exchange capabilities shared by the two products. This exchange is bi-directional, so the necessary information (such as the status of the related process) is passed back to Service Management when needed.</p>\n<h2>Dual Mode vs. Mixed Mode</h2>\n<p>While both Mixed and Dual mode improve the self-service experience for the end-user, they have unique advantages depending on the overall goal.<br/>\nCustomers that are highly invested in SM and only want an improved Self-service Portal should focus on Mixed Mode. In mixed mode, all configuration is done within SM (including the Service Catalog) and the actual Service Request Management is performed in SM as well. </p>\n<p>If a customer is interested in moving to Service Management over time, Dual Mode is an attractive option. The Service Request Management processes are all within Service Management, taking advantage of the modern UI and containerized backend infrastructure. While the other processes exist in SM at the beginning, they can be moved one by one until all processes exist only in Service Management.</p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}