{
  "title": "Edit an incident record",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>You can edit an incident record to add information that will help the assigned person or group resolve the incident.</p>\n<p>You can edit multiple records simultaneously by selecting them in the grid and updating them in the Preview pane on the right. For more information, see <a href=\"/doc/423/26.1/editrecpreview#Mass\" title=\"SMAX:25.1/EditRecPreview\">Mass update</a>.</p>\n<ol>\n<li>\n<p>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Run &gt; Incident &gt; Incidents</b>. Service Management displays a list of all incidents.</p>\n</li>\n<li>\n<p>Select the incident record that you want to edit.</p>\n<p>To filter the record list, click the <b>Add filter</b>  <a class=\"image\" href=\"/file/images/c/cb/2018.08_Helpcenter/Resources/Images/Icons/FilterByIcon.png\" title=\"/file/images/c/cb/2018.08_Helpcenter/Resources/Images/Icons/FilterByIcon.png\"> <img alt=\"FilterByIcon.png\" data-file-height=\"18\" data-file-width=\"19\" height=\"18\" src=\"../../../images/FilterByIcon_8e3dccb1.png\" width=\"19\"/> </a> button. For more information, see <a href=\"/doc/423/26.1/filters\" title=\"SMAX:25.1/Filters\">Filters</a>.</p>\n</li>\n<li>\n<p>Click the record identifier in the <b>ID</b> column to display the selected record.</p>\n<ul>\n<li>\n<p>In the <span class=\"SAW_VariablesSidebar\">right pane</span>, the <b>Related Contracts</b> widget displays all of the contracts related to the record you are viewing.</p>\n<p>The icon in the left of the contract indicates the type of contract:</p>\n<div><a class=\"image\" href=\"/file/images/f/fa/2018.08_Helpcenter/Resources/Images/C_VM/contractIcons.png\" title=\"/file/images/f/fa/2018.08_Helpcenter/Resources/Images/C_VM/contractIcons.png\"> <img alt=\"contractIcons.png\" data-file-height=\"376\" data-file-width=\"586\" height=\"376\" src=\"../../../images/contractIcons_78310edb.png\" width=\"586\"/> </a></div>\n<ul>\n<li>Click the down arrow to expand the list of related contracts.</li>\n<li>Click a contract to see its full details.</li>\n</ul>\n</li>\n<li>\n<p>In the right pane, the the <strong>Experts</strong> widget displays the recommended users with relevant expertise skills.<br/>\n\t\tWhen you hover over an expert from the list, you can:</p>\n<ul>\n<li>View the details of the Person record</li>\n<li>Send email to the user</li>\n<li>Chat with the user </li>\n<li>Add the user as Expert assignee of this incident</li>\n<li>Add the user to Major incident team</li>\n<li>Call the user in Teams</li>\n</ul>\n</li>\n<li>\n<p>In the <span class=\"SAW_VariablesSidebar\">right pane</span>, the <b>News widget</b> displays current news alerts. Critical news alerts are always listed first, followed by important and normal news articles, listed from newest to oldest. Click the news article to view the full details.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-tip-icon\"></div>\n<div class=\"admonition-content admonition-tip-content\">\n<p>News articles are also displayed in the <b>News by importance</b> widget on the Dashboard.</p>\n</div>\n</div>\n</li>\n</ul>\n</li>\n<li>\n<p>By default, the incident record opens displaying the <b>General</b> tab selected. Click the tab you want to edit or view:</p>\n<ul>\n<li>\n<p>General</p>\n<p>Displays general information about the current record. For more information about the General tab, see the<em> Incident record tabs</em> section.</p>\n</li>\n<li>\n<p><span class=\"SAW_VariablesWorkflowCap\">Workflow</span></p>\n<p>Displays the <span class=\"SAW_VariablesWorkflow\">workflow</span> metaphase and phase for the current record. For more information about <span class=\"SAW_VariablesWorkflow\">workflow</span>, see <a href=\"/doc/423/26.1/imwflw\" title=\"SMAX:25.1/imWflw\">Incident workflow</a>.</p>\n</li>\n<li>\n<p>Task plan</p>\n<p>The Task plan tab is where you design, create, and edit tasks. The tabs that appear under task plan are <b>Investigate</b>, <b>Resolve</b>, and <b>Review</b>, with each matching a <span class=\"SAW_VariablesWorkflow\">workflow</span> phase which may require completion of a task. The parenthesized number on the tab is the number of tasks in each phase.</p>\n<p>For more information about tasks and planning, see <a href=\"/doc/423/26.1/taskplans\" title=\"SMAX:25.1/Taskplans\">Task plans</a>.</p>\n</li>\n<li>\n<p>Targets</p>\n<p>Displays Service Level Target details. For more information about Service Level Targets, see the <em>Targets tab</em> section.</p>\n</li>\n<li>\n<p>Involved CIs</p>\n<p>Displays associations with devices, infrastructure and peripheral assets, enterprise assets, licenses, and system elements that are related to the current record. For more information about Involved CIs, see the <em>Involved CIs tab</em> section.</p>\n</li>\n<li>\n<p>Related records</p>\n<p>Displays records which depend on the current record, or records which the current record depends on. For more information about related records, see the <em>Related records tab</em> section.</p>\n</li>\n<li>\n<p>Related knowledge</p>\n<p>Displays knowledge and news articles related to the current record. For more information, see the <em>Related knowledge tab</em> section.</p>\n</li>\n<li>\n<p>Discussions</p>\n<p>Displays any relevant conversations about the current record. For more information about discussions, see <a href=\"/doc/423/26.1/discussions\" title=\"SMAX:25.1/Discussions\">Discussions</a>.</p>\n</li>\n<li>\n<p>History</p>\n<p>Displays all changes and updates made to the record. To view changes or updates made to the record, click the <b>History</b> tab. For more information, see <a href=\"/doc/423/26.1/history\" title=\"SMAX:25.1/History\">History</a>.</p>\n</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>\n<p>Click the record title to edit it.</p>\n</li>\n<li>\n<p>To use a template, click <b>Apply template</b> on the toolbar.</p>\n</li>\n</ul>\n</div>\n</div>\n</li>\n<li>\n<p>Click  <a class=\"image\" href=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\" title=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\"> <img alt=\"Save\" data-file-height=\"21\" data-file-width=\"20\" height=\"21\" src=\"../../../images/SaveIcon_5eb13ed6.png\" width=\"20\"/> </a>  <b>Save</b> on the toolbar.</p>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Incident_record_tabs\">Incident record tabs</h2>\n<h3 class=\"mw-headline\" id=\"General_tab\">General tab</h3>\n<p>This tab includes the following sections:</p>\n<table>\n<tbody>\n<tr>\n<th>Section</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Incident details</td>\n<td>Contains basic information about the incident record. For more information about incident details, see the <em>Incident details </em>section.</td>\n</tr>\n<tr>\n<td>Classification</td>\n<td>Helps you put the incident into the correct workflow with assigned ownership. For more information about classification, see the <em>Classification </em>section.</td>\n</tr>\n<tr>\n<td>Assignment</td>\n<td>Provides information about incident ownership. For more information about ownership, see the <em>Assignment </em>section.</td>\n</tr>\n<tr>\n<td>External Assignment</td>\n<td>This section is only relevant when an external group is selected in the Assignment group field. The data in the section is populated by the external system.</td>\n</tr>\n<tr>\n<td>Major incident team</td>\n<td>\n<p>Lists the stakeholders when the incident requires immediate response by a large group. This team might include managers or technical experts from different business groups.</p>\n<p>How to add members to the Major incident team:</p>\n<ol>\n<li>Click <b>Add</b> or the grid icon <a class=\"image\" href=\"/file/images/7/7c/2018.08_Helpcenter/Resources/Images/Icons/EntityPickerIcon.png\" title=\"/file/images/7/7c/2018.08_Helpcenter/Resources/Images/Icons/EntityPickerIcon.png\"> <img alt=\"Grid icon\" data-file-height=\"16\" data-file-width=\"16\" height=\"16\" src=\"../../../images/EntityPickerIcon_40fcd801.png\" width=\"16\"/> </a> .</li>\n<li>Select one or more candidates to be members of the Major incident team. The added items appear in yellow.</li>\n<li>Click <b>Save</b>.</li>\n</ol>\n<p>How to delete members from the Major incident team:</p>\n<ol>\n<li>Select the team members.</li>\n<li>Click <b>Remove</b>. The selected items appear in strikethrough text.</li>\n<li>Click <b>Save</b>.</li>\n</ol>\n</td>\n</tr>\n<tr>\n<td>Resolution</td>\n<td>Describes the final disposition of the incident. For more information about resolution, see the <em>Resolution </em>section.</td>\n</tr>\n<tr>\n<td>Attachments</td>\n<td>\n<p>Click <b>Add attachment</b> if you want to attach a file to the record.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>The supported attachment file formats and the maximum file size of an attachment are defined in the tenant's <b>Application settings</b> tab in Suite Administration.</li>\n<li>If the Attachments field has been defined as encrypted for this record type and you are a member of an encryption domain, click <b>Add encrypted attachments</b> to attach an encrypted file to the record.</li>\n<li>Attachments aren't visible in the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span>.</li>\n</ul>\n</div>\n</div>\n</td>\n</tr>\n</tbody>\n</table>\n<ul>\n<li>\n<p><b>Incident details</b></p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Title</td>\n<td>\n<p>The title is a summary of the issue presented by the end user. If you omit a title, Service Management uses the beginning text from the Description field.</p>\n<p><b>Best Practice:</b> Choose a meaningful, descriptive, and relatively short title. Titles are often the only identification used in selection lists and in other areas to identify components. Service Management displays the title at the top of the form when you edit or display the complete record.</p>\n</td>\n</tr>\n<tr>\n<td>Description </td>\n<td>\n<p>The description captures the details of the incident. You can also capture information that might not fit well elsewhere. For example, if the location and telephone number are different from the contact details, you can record the correct information in this field.</p>\n<p>Service Management may automatically recognize CIs whose details are entered here. See <a href=\"/doc/423/26.1/autocirecog\" title=\"SMAX:25.1/AutoCiRecog\">CI Detection - Automatic recognition of CIs</a>.</p>\n</td>\n</tr>\n<tr>\n<td>Status</td>\n<td>\n<p>Service Management updates this field with a status value when you open, update, close, or escalate an incident. Valid status values are: <b>Ready</b>, <b>In progress</b>, <b>Pending</b>, <b>Suspended</b>, and <b>Complete</b>.</p>\n</td>\n</tr>\n<tr>\n<td>Expected resolution time</td>\n<td>\n<p>Expected resolution date and time.</p>\n<ul>\n<li>\n<p>Click the calendar icon to specify the date.</p>\n</li>\n<li>\n<p>Click the clock icon to specify the time.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Contact</td>\n<td>The person who should be contacted for follow up questions about the incident. Select a person from the drop-down list.</td>\n</tr>\n<tr>\n<td>Preferred contact method</td>\n<td>\n<p>The preferred method for communication with the contact. Select one of the following options:</p>\n<ul>\n<li>Email</li>\n<li>Phone</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Reported by</td>\n<td>\n<p>The name of the end user who reported the incident.</p>\n</td>\n</tr>\n<tr>\n<td>Next target time</td>\n<td>The calculated time before the next Service Level Target will expire. If the target expires, the status of the target is breached.</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p><b>Classification</b></p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Priority</td>\n<td>\n<p>Priority is a read-only value that Service Management chooses based on <b>Impact</b> and <b>Urgency</b> values. The following table describes the priority matrix.</p>\n<table>\n<tbody>\n<tr>\n<th></th>\n<th>Enterprise</th>\n<th>Site or department</th>\n<th>Multiple users</th>\n<th>Single user</th>\n</tr>\n<tr>\n<td>Total loss of service</td>\n<td>Critical</td>\n<td>High</td>\n<td>High</td>\n<td>Medium</td>\n</tr>\n<tr>\n<td>Severe disruption</td>\n<td>High</td>\n<td>High</td>\n<td>Medium</td>\n<td>Medium</td>\n</tr>\n<tr>\n<td>Slight disruption</td>\n<td>High</td>\n<td>Medium</td>\n<td>Medium</td>\n<td>Low</td>\n</tr>\n<tr>\n<td>No disruption</td>\n<td>Medium</td>\n<td>Medium</td>\n<td>Low</td>\n<td>Low</td>\n</tr>\n</tbody>\n</table>\n<p>This matrix can be adjusted through business rule configuration.</p>\n</td>\n</tr>\n<tr>\n<td>Service</td>\n<td>\n<p>Services are usually related to one of the following:</p>\n<ul>\n<li>\n<p><b>Infrastructure</b>. For example, database or network services.</p>\n</li>\n<li>\n<p><b>Business services</b>. For example, email or a web portal.</p>\n</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>At the top of the list of services Service Management displays smart suggestions, based on the text entered in the <b>Title</b> and the <b>Description</b> fields.</p>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>Impact</td>\n<td>\n<p>Impact describes the global effect on the user community. Consider whether the incident affects the entire enterprise, a business unit, or an individual. Valid values are:</p>\n<ul>\n<li><b>Enterprise</b></li>\n<li><b>Site or department</b></li>\n<li><b>Multiple users</b></li>\n<li><b>Single user</b></li>\n</ul>\n<p>The default selection is <b>Single user</b>.</p>\n<p><b>Example:</b> Choose Enterprise if the problem affects the entire organization or a critical business unit. Single user is the lowest impact.</p>\n</td>\n</tr>\n<tr>\n<td>Service component</td>\n<td>The service component related to the incident.</td>\n</tr>\n<tr>\n<td>Category</td>\n<td>\n<p>The category describes the type of incident. The default categories are based on best practice recommendations for service-related processes. They reflect how the incident is assigned and help to organize reporting metrics.</p>\n<p>At the top of the list of categories Service Management displays smart suggestions, based on the text entered in the <b>Title</b> and the <b>Description</b> fields.</p>\n</td>\n</tr>\n<tr>\n<td>Urgency</td>\n<td>\n<p>The urgency indicates how important the issue is for the service recipient. If there is an outage or a mission-critical outage, the priority might be Critical. Valid values are:</p>\n<ul>\n<li>\n<p>Total loss of service</p>\n</li>\n<li>\n<p>Severe disruption</p>\n</li>\n<li>\n<p>Slight disruption</p>\n</li>\n<li>\n<p>No disruption</p>\n</li>\n</ul>\n<p><b>Example:</b> Choose <b>Total loss of service</b> if there is an outage that directly affects the basic infrastructure, such as network services. Choose <b>Slight disruption</b> if the problem doesn't need immediate resolution. The end user can provide guidance for these settings because it's how they perceive the impact and urgency within their organization.</p>\n</td>\n</tr>\n<tr>\n<td>Incident model</td>\n<td>\n<p>An incident model is a repeatable way to resolve a particular type of incident. When you choose a model, the incident follows the predefined workflow phases that apply to the model.</p>\n<p>At the top of the list of models Service Management displays smart suggestions, based on the text entered in the <b>Title</b> and the <b>Description</b> fields.</p>\n</td>\n</tr>\n<tr>\n<td>Impact start</td>\n<td>The time when the impact to the service began (could be a partial or complete impact). Select a date and time.</td>\n</tr>\n<tr>\n<td>Impact end</td>\n<td>The time when the impact to the service ended (could be a partial or complete impact). Select a date and time.</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p><b>Assignment</b></p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Current assignment</td>\n<td>\n<p>An assignment group is a pool of resources with advanced skills to resolve the incident when the incident owner or the customer escalates the incident. The assignee becomes responsible for the incident resolution.</p>\n<p>Select a value from the drop-down list. The following values are available:</p>\n<ul>\n<li><b>Unassigned.</b> No group or person is assigned to the incident.</li>\n<li><b>Service desk.</b> The group selected in the <b>Service desk group</b> field is assigned to the incident. The person selected in the <b>Service desk owner</b> field becomes the incident assignee.</li>\n<li><b>Expert group.</b> The group selected in the <b>Expert group</b> field is assigned to the incident. The person selected in the <b>Expert assignee</b> field becomes the incident assignee.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Service desk group</td>\n<td>\n<p>A Service desk group is a pool of resources. The Incident Manager can choose a group to own the incident. One or more members of the group can work on the incident resolution.</p>\n<p>Select a group from the drop-down list. Only functional groups are available. This field is mandatory when <b>Service desk</b> is selected as the current assignment.</p>\n</td>\n</tr>\n<tr>\n<td>Owner</td>\n<td>\n<p>The incident owner is responsible for the incident until it's resolved.</p>\n<p>Select a person from the drop-down list or type a few characters to search for the required person.</p>\n</td>\n</tr>\n<tr>\n<td>Expert group</td>\n<td>Select a group from the drop-down list. Only functional groups are available. This field is mandatory when <b>Expert group</b> is selected as the current assignment.</td>\n</tr>\n<tr>\n<td>Expert assignee</td>\n<td>\n<p>Select a person from the drop-down list or type a few characters to search for the required person.</p>\n</td>\n</tr>\n<tr>\n<td>External reference number</td>\n<td>\n<p>This entry applies only when there is a third party involved and they have a separate tracking number.</p>\n<p><b>Example</b>: The outage resolution depends on a vendor repair of related equipment that's under warranty. In this case, you should type the vendor incident number.</p>\n</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p>Resolution</p>\n<p>Service Management uses the text that you provide in the <b>Title</b> and <b>Description</b> fields to launch a knowledge search as soon as you expand the <b>Resolution</b> section. Service Management searches for existing articles or other records that contain matching information. For example, if your description includes the words \"email server down\", Service Management searches for those words throughout the knowledge database. If a match occurs, the <b>Suggested solutions</b> link is displayed. Click the link to see the top three solution candidates. These matches can be any of the following record types:</p>\n<ul>\n<li>Articles</li>\n<li>User questions</li>\n<li>External knowledge</li>\n<li>Problems</li>\n<li>Changes</li>\n<li>Incidents</li>\n</ul>\n<p>If you want to link one of the suggested solutions to this record, hover your mouse over the end of the solution entry to display action buttons. The buttons and actions vary depending on the type of potential solution record.</p>\n<p>Click one of the buttons described in the following table.</p>\n<table>\n<tbody>\n<tr>\n<th>Link to record type</th>\n<th>Action</th>\n<th>Result</th>\n</tr>\n<tr>\n<td>\n<p>Change</p>\n<p>Incident</p>\n<p>Problem</p>\n<p>Request</p>\n</td>\n<td>\n<p>Link</p>\n</td>\n<td>\n<p>Updates the list of related records on the <b>Related records</b> tab in both the current incident and the linked change, incident, problem, or request record.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Incident</p>\n<p>Problem</p>\n</td>\n<td>\n<p>Copy + link</p>\n</td>\n<td>\n<ul>\n<li>\n<p>Copies the solution text from the referenced incident or problem into the <b>Solution</b> field of the current incident.</p>\n</li>\n<li>\n<p>Updates the list of related records on the <b>Related records</b> tab in both the current incident and the linked incident or problem record.</p>\n</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>If there is no prospective solution found, Service Management doesn't display this button.</p>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>Article</td>\n<td>\n<p>Copy link</p>\n</td>\n<td>\n<p>Copies a link to an article into the <b>Solution</b> field of the current incident.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>Only articles that are in the External phase of the workflow are eligible to be solution links.</p>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>Q and A</td>\n<td>\n<p>Copy link</p>\n</td>\n<td>\n<p>Copies a link to a question and answer into the <b>Solution</b> field.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p>If you want to search for other suggested solutions for the current incident, click <b>Find more solutions</b> at the bottom of the <b>Resolution</b> section.</p>\n<p>Service Management inserts a search form at the top of the page where you can type a search argument to produce a complete list of potential solution matches. You can use \"or,\" \"and,\" or a wild card character to enhance your search argument.</p>\n<p>All returned results appear in the left pane. If you select a record, the record details appear in the right pane. If you find a suitable match, do one of the following:</p>\n<ul>\n<li>\n<p>Click <b>Copy solution and link as related record</b> to copy information from an incident or problem into the <b>Solution</b> field of the current incident.</p>\n</li>\n<li>\n<p>Click <b>Copy link to resolution</b> to copy a link to an article or question and answer into the <b>Solution</b> field of the current incident.</p>\n</li>\n<li>\n<p>Click <b>Link as cause</b> to add information about a change to the <b>Related records</b> tab in the <b>Causes of the incident</b> section of the current incident.</p>\n</li>\n<li>\n<p>Click <b>Link as effect</b> to add information about a change to the <b>Related records</b> tab in the <b>Effects of the incident</b> section of the current incident.</p>\n</li>\n<li>\n<p>Click <b>Link as related</b> to add information about a request to the <b>Related records</b> tab in the <b>Causes of the incident</b> section of the current incident.</p>\n</li>\n</ul>\n<p>Complete the <b>Resolution</b> section with as much information as possible.</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Problem candidate</td>\n<td>A checked box specifies that the incident has a root cause, and that it can be resolved through Problem Management processes.</td>\n</tr>\n<tr>\n<td>Knowledge candidate</td>\n<td>A checked box specifies that the solution details can apply to future incidents.</td>\n</tr>\n<tr>\n<td>Solution</td>\n<td>\n<p>A detailed description of the resolution. If the solution is a knowledge or problem candidate, the solution description should be as specific as possible. If you linked an article, the link appears in this field.</p>\n<p>Service Management may automatically recognize CIs whose details are entered here. See <a href=\"/doc/423/26.1/autocirecog\" title=\"SMAX:25.1/AutoCiRecog\">CI Detection - Automatic recognition of CIs</a>.</p>\n</td>\n</tr>\n<tr>\n<td>Completion code</td>\n<td>\n<p>The completion code describes the reason that you can close the incident.</p>\n<p><b>Example</b>: In the case of immediate resolution, the completion code might be <b>Resolved with workaround</b>.</p>\n</td>\n</tr>\n<tr>\n<td>Closure category</td>\n<td>The categorization of the incident as determined after the incident has been resolved. Select a value from the drop-down list.</td>\n</tr>\n<tr>\n<td>Solved time</td>\n<td>\n<p>The time when the incident resolution was applied. There may be a delay between the actual resolution and its application. Select a date and time.</p>\n</td>\n</tr>\n<tr>\n<td>Suggested solutions</td>\n<td>Click <b>Suggested solutions</b> to have Service Management suggest solutions, based on the information provided for the incident. If none of these are relevant, you can click <b>Find more solutions</b> to look for other solutions in the database.</td>\n</tr>\n</tbody>\n</table>\n</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Targets_tab\">Targets tab</h3>\n<p>This tab includes the fields described in the following table.</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Next target time</td>\n<td>Displays the earliest breach time for a Service Level Target or Operational Level Target for this incident. The target can be an initial review or a resolution target or a Time in group Operational Level target. For more information, see <a href=\"/doc/423/26.1/sltstatus\" title=\"SMAX:25.1/SLTstatus\">Service Level Target status and history</a>.</td>\n</tr>\n<tr>\n<td>Overall status</td>\n<td>\n<p>Displays the status of the Service Level Target or Operational Level Target with the highest severity. The order of severity from highest to lowest is:</p>\n<ul>\n<li>Failed</li>\n<li>Breached</li>\n<li>Suspended</li>\n<li>Active</li>\n<li>Achieved</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Show SLT history</td>\n<td>\n<p>Click the <b>Show SLT history</b> button to open the SLT history dialog box, which displays all SLT operations recorded for all of the targets. For more information on the SLT history, see <a href=\"/doc/423/26.1/sltstatus#Service\" title=\"SMAX:25.1/SLTstatus\">Service Level Target history</a>.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>The table in the SLT history dialog box may aggregate operations that occurred within one minute into a single operation. Only the last operation of the aggregated operations appears in the list.</p>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>Service Level Targets</td>\n<td>\n<p>This shows all associated targets and their current status. You can edit the details of each target to refine its objectives.</p>\n<p>Service Management associates the initial review and resolution targets with incidents according to the agreements defined on the actual service related to the incident. If no specific agreement was defined for the service, the default agreement is used.</p>\n<p>Alternatively, you can define business rules to specify the active agreement. For more information, see <a href=\"/doc/423/26.1/offeringsla\" title=\"SMAX:25.1/OfferingSLA\">Relating Service Level Agreements to records</a>.</p>\n<p><b>Next SLA target time.</b> Displays the earliest breach time for the Service Level Target for this incident.</p>\n<p><b>Overall status.</b> Displays the status of the Service Level Target with the highest severity.</p>\n<p><b>Service level agreement.</b> Displays a link to the active agreement (if one exists).</p>\n</td>\n</tr>\n<tr>\n<td>Operational Level Targets</td>\n<td>\n<p>This section shows all associated Operational Level Targets and their current status. You can edit the details of each target to refine its objectives.</p>\n<p>Service Management associates Time in group targets with incidents according to the agreements defined on the actual service and the assignment group of the incident. If no specific agreement was defined for the service, the default agreement is used.</p>\n<p>Alternatively, you can define business rules to specify the active agreement. For more information, see <a href=\"/doc/423/26.1/offeringsla\" title=\"SMAX:25.1/OfferingSLA\">Relating Service Level Agreements to records</a>.</p>\n<p><b>Next OLA target time.</b> Displays the earliest breach time for the Operational Level Target for this incident.</p>\n<p><b>Overall status.</b> Displays the status of the Operational Level Target with the highest severity.</p>\n<p><b>Service level agreement.</b> Displays a link to the active agreement (if one exists).</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 class=\"mw-headline\" id=\"Involved_CIs_tab\">Involved CIs tab</h3>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\"> Data domain segmentation (except enterprise assets) also applies to involved CIs. That is, if the currently logged-in user doesn't have access to some involved CIs' data domains, these CI records are hidden from the user.  </div>\n</div>\n<p>In this tab you may add, change, or delete associations with business devices, infrastructure and peripheral assets, enterprise assets, licenses, and system elements that are related to the record. When you link a device, an infrastructure asset, an enterprise asset, a license, or a system element to a record, you create an internal relationship between them.</p>\n<p>In this tab you can also view a topology impact map for each device and system element you choose, and the affecting CIs and a topology impact map for each affected service.</p>\n<ul>\n<li>The <b>Involved devices</b> section enables you to link a device.</li>\n<li>The <b>Involved infrastructure &amp; peripherals</b> section enables you to link an infrastructure or peripherals.</li>\n<li>The <b>Involved enterprise assets</b> section enables you to link an enterprise asset.</li>\n<li>The <b>Involved licenses</b> section enables you to link a fixed asset license.</li>\n<li>The <b>Involved system elements</b> enables you to link a system element.</li>\n</ul>\n<p>How to add an involved device, an infrastructure &amp; peripheral asset, an enterprise asset, a license, or a system element</p>\n<ol>\n<li>Click <b>Add</b> or the grid icon <a class=\"image\" href=\"/file/images/7/7c/2018.08_Helpcenter/Resources/Images/Icons/EntityPickerIcon.png\" title=\"/file/images/7/7c/2018.08_Helpcenter/Resources/Images/Icons/EntityPickerIcon.png\"> <img alt=\"Grid icon\" data-file-height=\"16\" data-file-width=\"16\" height=\"16\" src=\"../../../images/EntityPickerIcon_40fcd801.png\" width=\"16\"/> </a> .<br/>\n<strong>Note:</strong> For <b>Involved devices </b>and <b>Involved system elements</b>, if Native SACM is not enabled, both the Add button and the  <a class=\"image\" href=\"/file/images/7/7c/2018.08_Helpcenter/Resources/Images/Icons/EntityPickerIcon.png\" title=\"/file/images/7/7c/2018.08_Helpcenter/Resources/Images/Icons/EntityPickerIcon.png\"> <img alt=\"Grid icon\" data-file-height=\"16\" data-file-width=\"16\" height=\"16\" src=\"../../../images/EntityPickerIcon_40fcd801.png\" width=\"16\"/> </a>  icon will show you a list of all available records. If Native SACM is enabled, clicking the Add button will show a list of records that can be related to the current record in the CI topology, while the <a class=\"image\" href=\"/file/images/7/7c/2018.08_Helpcenter/Resources/Images/Icons/EntityPickerIcon.png\" title=\"/file/images/7/7c/2018.08_Helpcenter/Resources/Images/Icons/EntityPickerIcon.png\"> <img alt=\"Grid icon\" data-file-height=\"16\" data-file-width=\"16\" height=\"16\" src=\"../../../images/EntityPickerIcon_40fcd801.png\" width=\"16\"/> </a>  icon still gives you all available CIs. </li>\n<li>Select the required records. The added items appear in yellow.</li>\n<li>Click <b>Save</b>.</li>\n</ol>\n<p>How to delete an involved device, an infrastructure &amp; peripheral asset, an enterprise asset, a license, or a system element</p>\n<ol>\n<li>Select the required records.</li>\n<li>Click <b>Remove</b>. The selected items appear in strikethrough text.</li>\n<li>Click <b>Save</b>.</li>\n</ol>\n<p>How to view an impact map for a device</p>\n<ol>\n<li>In the <b>Involved Devices</b> section, select the device.</li>\n<li>Click <b>Show Impact</b> <a class=\"image\" href=\"/file/images/1/1f/2018.08_Helpcenter/Resources/Images/Icons/Impact.png\" title=\"/file/images/1/1f/2018.08_Helpcenter/Resources/Images/Icons/Impact.png\"> <img alt=\"Impact\" data-file-height=\"16\" data-file-width=\"15\" height=\"16\" src=\"../../../images/Impact_6dd71d04.png\" width=\"15\"/> </a> . An impact map of the device is displayed.</li>\n</ol>\n<p>How to view an impact map for a system element</p>\n<ol>\n<li>In the <b>Involved System elements</b> section, select the system element.</li>\n<li>Click <b>Show Impact</b> <a class=\"image\" href=\"/file/images/1/1f/2018.08_Helpcenter/Resources/Images/Icons/Impact.png\" title=\"/file/images/1/1f/2018.08_Helpcenter/Resources/Images/Icons/Impact.png\"> <img alt=\"Impact\" data-file-height=\"16\" data-file-width=\"15\" height=\"16\" src=\"../../../images/Impact_6dd71d04.png\" width=\"15\"/> </a> . An impact map of the system element is displayed.</li>\n</ol>\n<p>You can zoom in and out of the impact map by using the mouse wheel button. If a text string is too long to be displayed, an ellipsis (…) appears. You can hover over the ellipsis to display the full text string.</p>\n<p>You can hover over the following icons in the impact map:</p>\n<ul>\n<li>Owner avatar <a class=\"image\" href=\"/file/images/f/f4/2018.08_Helpcenter/Resources/Images/Icons/AvatarIcon.png\" title=\"/file/images/f/f4/2018.08_Helpcenter/Resources/Images/Icons/AvatarIcon.png\"> <img alt=\"Avatar\" data-file-height=\"13\" data-file-width=\"13\" height=\"13\" src=\"../../../images/AvatarIcon_7f9d9338.png\" width=\"13\"/> </a> – a window is displayed with the owner’s details.</li>\n<li>Business criticality <a class=\"image\" href=\"/file/images/5/5e/2018.08_Helpcenter/Resources/Images/Icons/CriticalityIcon.png\" title=\"/file/images/5/5e/2018.08_Helpcenter/Resources/Images/Icons/CriticalityIcon.png\"> <img alt=\"Criticality\" data-file-height=\"12\" data-file-width=\"14\" height=\"12\" src=\"../../../images/CriticalityIcon_7480a41b.png\" width=\"14\"/> </a> – a tooltip is displayed with the criticality.</li>\n<li>Location <a class=\"image\" href=\"/file/images/8/88/2018.08_Helpcenter/Resources/Images/Icons/LocationIcon.png\" title=\"/file/images/8/88/2018.08_Helpcenter/Resources/Images/Icons/LocationIcon.png\"> <img alt=\"Location\" data-file-height=\"15\" data-file-width=\"13\" height=\"15\" src=\"../../../images/LocationIcon_73a46d8c.png\" width=\"13\"/> </a> – a tooltip is displayed with the name of the location.</li>\n</ul>\n<p>Depending on the size of the impact map and the browser window, Service Management may not display the subtype of a Device, Service or System Element. Hover over the subtype graphic to see a tooltip with this information.</p>\n<h3 class=\"mw-headline\" id=\"Related_records_tab\">Related records tab</h3>\n<p>The Related records tab enables you to review, create, and delete relationships among Service Management records. The number at the end of the tab label displays the number of related records for the current record. There are two types of related records:</p>\n<p>Other record types depend on the current record.</p>\n<p>Example: an employee requests a certain change to an email account. The request triggered an incident because there is an email server outage. You can't complete the change until the incident status is closed.</p>\n<p>The current record depends on other record types.</p>\n<p>Example: the incident to repair the email server outage generates a problem record because this is a recurring outage that requires investigation. The problem resolution requires finding the root cause for the outage. When the outage is resolved, the incident is resolved. When the incident is resolved, the change request can be resolved.</p>\n<p>Resolving a request for change, an incident, or a problem can also involve hardware or software acquisition, or even require a new service to be available. Service Management also enables you to link asset records to changes, incidents, or problems.</p>\n<p>To relate records</p>\n<ol>\n<li>\n<p>Click the <b>Related records</b> tab to display a list of related records that</p>\n<ul>\n<li>depend on the current record</li>\n<li>the current record depends on</li>\n</ul>\n</li>\n<li>\n<p>In each section, the default sort order is first by record type, then by phase. You can click a column heading to reverse the sort order in any column.</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>ID</td>\n<td>The identifier of the record. Click the <b>ID</b> value to link to the record.</td>\n</tr>\n<tr>\n<td><b>Title</b> or <b>Name</b></td>\n<td>A short description provided by the end user.</td>\n</tr>\n<tr>\n<td>Phase</td>\n<td>The current phase of the current record in the <span class=\"SAW_VariablesWorkflow\">workflow</span>.</td>\n</tr>\n<tr>\n<td>Priority</td>\n<td>The priority is a value based on urgency and business impact values.</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p>In the appropriate section, do one of the following:</p>\n<ul>\n<li>\n<p>Click <a class=\"image\" href=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\" title=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\"> <img alt=\"Add icon\" data-file-height=\"22\" data-file-width=\"24\" height=\"22\" src=\"../../../images/PlusIcon_8ed60e27.png\" width=\"24\"/> </a>  <b>Add</b> to create a relationship between the current record and another record.</p>\n<p>The <b>Add related record</b> dialog box opens, displaying a list of potential related records. If you select an individual record, Service Management displays the contents of that record in the <span class=\"SAW_VariablesSidebar\">right pane</span>.</p>\n<ul>\n<li>\n<p>To search for more records, use the <b>Search</b> box at the top of the dialog box.</p>\n</li>\n<li>\n<p>Find the record that you want to link, and click <b>OK</b> to create the relationship.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Click <a class=\"image\" href=\"/file/images/f/ff/2018.08_Helpcenter/Resources/Images/Icons/DeleteIcon.png\" title=\"/file/images/f/ff/2018.08_Helpcenter/Resources/Images/Icons/DeleteIcon.png\"> <img alt=\"Remove icon\" data-file-height=\"26\" data-file-width=\"26\" height=\"26\" src=\"../../../images/DeleteIcon_bcd25653.png\" width=\"26\"/> </a>  <b>Remove</b> to delete the relationship between the current record and the selected record. Click <b>OK</b> to confirm the action.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>This action removes the relationship between the two records only. It doesn't delete either record.</p>\n</div>\n</div>\n</li>\n</ul>\n</li>\n</ol>\n<h3 class=\"mw-headline\" id=\"Related_knowledge_tab\">Related knowledge tab</h3>\n<p>The <b>Related knowledge</b> tab is where related knowledge or news articles are displayed.</p>\n<table>\n<tbody>\n<tr>\n<th>Action</th>\n<th>Procedure</th>\n</tr>\n<tr>\n<td>Add a knowledge or news article</td>\n<td>\n<ol>\n<li>\n<p>Click  <a class=\"image\" href=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\" title=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\"> <img alt=\"PlusIcon.png\" data-file-height=\"22\" data-file-width=\"24\" height=\"22\" src=\"../../../images/PlusIcon_8ed60e27.png\" width=\"24\"/> </a>  <b>Add</b>. The <b>Add related record</b> dialog box opens.</p>\n</li>\n<li>\n<p>Select a knowledge or news article.</p>\n<p>You can filter the selection using the drop-down list and the filter button.</p>\n</li>\n<li>\n<p>Click  <a class=\"image\" href=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\" title=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\"> <img alt=\"PlusIcon.png\" data-file-height=\"22\" data-file-width=\"24\" height=\"22\" src=\"../../../images/PlusIcon_8ed60e27.png\" width=\"24\"/> </a>  <b>Add</b> in the right pane of the dialog box.</p>\n</li>\n<li>\n<p>Repeat the above 2 steps as required, and then click <b>OK</b>. The selected records are added to the <b>Related knowledge</b> tab.</p>\n</li>\n</ol>\n</td>\n</tr>\n<tr>\n<td>Remove a knowledge or news article</td>\n<td>\n<ol>\n<li>Select the knowledge article or news article you want to delete.</li>\n<li>Click <a class=\"image\" href=\"/file/images/f/ff/2018.08_Helpcenter/Resources/Images/Icons/DeleteIcon.png\" title=\"/file/images/f/ff/2018.08_Helpcenter/Resources/Images/Icons/DeleteIcon.png\"> <img alt=\"DeleteIcon.png\" data-file-height=\"26\" data-file-width=\"26\" height=\"26\" src=\"../../../images/DeleteIcon_bcd25653.png\" width=\"26\"/> </a>  <b>Remove</b>, and then <b>OK</b>.</li>\n</ol>\n</td>\n</tr>\n<tr>\n<td>View a knowledge or news article</td>\n<td>\n<ol>\n<li>Select the knowledge or news article you want to view.</li>\n<li>Click the record identifier in the <b>ID</b> column to display the selected record.</li>\n</ol>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"Editing_the_incident_form\">Editing the incident form</h2>\n<p>If you have the appropriate permissions, you can edit the incident form. For more information, see <a href=\"/doc/423/26.1/editform\" title=\"SMAX:25.1/EditForm\">How to edit a form</a> and <a href=\"/doc/423/26.1/genericrelationships\" title=\"SMAX:25.1/GenericRelationships\">Generic relationship fields</a>.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/createrecfmincident\" title=\"SMAX:25.1/CreateRecFmIncident\">How to create a record from an incident</a></li>\n<li><a href=\"/doc/423/26.1/addincident\" title=\"SMAX:25.1/AddIncident\">How to create an incident record</a></li>\n<li><a href=\"/doc/423/26.1/closeincident\" title=\"SMAX:25.1/CloseIncident\">How to close an incident record</a></li>\n<li><a href=\"/doc/423/26.1/deleteincident\" title=\"SMAX:25.1/DeleteIncident\">How to delete an incident record</a></li>\n<li><a href=\"/doc/423/26.1/escalateincident\" title=\"SMAX:25.1/EscalateIncident\">How to escalate an incident record</a></li>\n<li><a href=\"/doc/423/26.1/imrelaterec\" title=\"SMAX:25.1/imRelateRec\">How to relate incident records</a></li>\n<li><a href=\"/doc/423/26.1/imtasks\" title=\"SMAX:25.1/imTasks\">Incident Management procedures</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}