{
  "title": "Edit a Service Level Target definition record",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>A change in circumstances or a change to the Service Level Agreement record can require changes to the associated Service Level Target definition record. For example, you might change the work schedule that applies to the agreement. You can change a value in a Service Level Target definition, but make sure that you understand the impact of the changes.</div>\n<ul>\n<li>If you change or update a record, Service Management applies the changes correctly to any calculation in progress. For example, the priority in an incident is changed from Medium to Critical, Service Management adjusts the calculation in progress to apply this new value.</li>\n<li>If you change the actual service or offering assigned to a record, the Service Level Target definition might change or even become obsolete. If the Service Level Target definition changes, the Service Level Target calculation in progress is cleared, and any new or changed target definition calculations begin. In this case, the time already spent is included in the new target definition calculations.</li>\n<li>When a new chat request is submitted, the elapsed target duration is reset.</li>\n<li>When you make changes to a Service Level Target definition, the change requires an update to every record using that target definition. The changes will take effect automatically within 24 hours. Alternatively, you can click <b>Apply now</b> at the top of the Service Level Management page to begin updating the Service Level Target definitions immediately. The amount of time to complete the update depends on the number of affected records. If one of those records is open, click <b>Refresh</b> to see the updates. If you make additional changes to a Service Level Target definition after applying the changes manually, the <b>Apply now</b> button will reappear after a few minutes.</li>\n</ul>\n<p>You can edit multiple records simultaneously by selecting them in the grid and updating them in the Preview pane on the right. For more information, see <a href=\"/doc/423/26.1/editrecpreview#Mass\" title=\"SMAX:25.1/EditRecPreview\">Mass update</a>.</p>\n<p>To edit a Service Level Target definition record:</p>\n<ol>\n<li>\n<p>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Plan &gt; Service Level &gt; Service Level Target sets</b>.</p>\n</li>\n<li>\n<p>Select the record you want to edit.</p>\n<p>To filter the record list, click the <b>Add filter</b>  <a class=\"image\" href=\"/file/images/c/cb/2018.08_Helpcenter/Resources/Images/Icons/FilterByIcon.png\" title=\"/file/images/c/cb/2018.08_Helpcenter/Resources/Images/Icons/FilterByIcon.png\"> <img alt=\"FilterByIcon.png\" decoding=\"async\" height=\"18\" src=\"../../../images/FilterByIcon_8e3dccb1.png\" width=\"19\"/> </a> button. For more information, see <a href=\"/doc/423/26.1/filters\" title=\"SMAX:25.1/Filters\">Filters</a>.</p>\n</li>\n<li>\n<p>Click the record identifier in the <b>ID</b> column to display the selected record.</p>\n</li>\n<li>\n<p>In the Service Level Target definitions section, select an individual Service Level Target definition record and click <b>Details</b>. On the <strong>General</strong> tab:</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Name </td>\n<td>Type a word or phrase that's a unique identifier for this Service Level Target definition. It should be a value that makes it easy for the end user to understand the purpose of the Service Level Target definition. For example, Incident Initial Review Priority 1.</td>\n</tr>\n<tr>\n<td>Description </td>\n<td>Enter a description for the Service Level Target definition. The description might include some relevant information that helps another user understand the purpose of the Service Level Target definition.</td>\n</tr>\n<tr>\n<td>Target type</td>\n<td>Read only.</td>\n</tr>\n<tr>\n<td>Duration</td>\n<td>\n<div class=\"Admonition_Note\"><span class=\"autonumber\">Note</span> If the <b>Duration</b> field is blank, the target is inactive.</div>\n<p>This is the amount of elapsed time that's acceptable before the target (or deadline) is missed, expressed as <i>dd</i> <i>hh</i>:<i>mm</i>.</p>\n<p>The work schedule restricts the time of the target definition. The following are examples.</p>\n<p>• If the target definition duration is 3 days and the work schedule is 8:00 AM to 5:00 PM (9 hours per day), the target is only breached after 8 work days (72 hours).</p>\n<p>• If the work schedule is 24 x 7 and a new incident must be reviewed within 12 hours or 1 day of creation, specify 12:00 or 1 00:00 as the duration.</p>\n<p>• If the work schedule is other than 24 x 7 and the work must be completed outside of normal schedule hours, specify 0 00:00 as the duration.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> Service Management calculates a target date based on the duration and work schedule, and displays a target date as \"undefined\" if it’s more than 180 calendar days later. One day in the Duration field represents 24 business hours, so you can calculate the maximum allowed duration for a given work schedule as follows: (180 x &lt;business hours per day&gt; x &lt;working days per week&gt;)/(24 x 7). For example, if the work schedule is 9:00 AM to 5:00 PM (8 hours per day) and 5 days a week, the duration mustn’t exceed 42.86 days; if the work schedule is 24 x 7, the duration mustn’t exceed 180 days.</p>\n</div>\n<table>\n<tbody>\n<tr>\n<th>For this result</th>\n<th>Select this</th>\n<th>Comments</th>\n</tr>\n<tr>\n<td>\n<p>59 minutes</p>\n</td>\n<td>\n<p>00 00:59</p>\n</td>\n<td>\n<p>Do not exceed 00 00:59. Select 00 01:00 to represent 60 minutes.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>23 hours</p>\n</td>\n<td>\n<p>00 23:00</p>\n</td>\n<td>\n<p>Do not exceed 00 23:59. Select 01 00:00 to represent 1 day.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>10 days</p>\n</td>\n<td>\n<p>10 00:00</p>\n</td>\n<td>\n<p>Make sure that you separate the number of days from the <em>hh:mm</em> with a blank space.</p>\n</td>\n</tr>\n</tbody>\n</table>\n</td>\n</tr>\n<tr>\n<td>Priority</td>\n<td>Read only.</td>\n</tr>\n<tr>\n<td>Work schedule</td>\n<td>\n<p>The work schedule you want to apply to the definition record. For details, see the description of the Work schedule field in <a href=\"/doc/423/26.1/addsltset\">Create a Service Level Target set record</a>.</p>\n</td>\n</tr>\n<tr>\n<td>Time zone</td>\n<td>The time zone you want to apply to the Service Level Target definition. For details, see the description of the Time zone field in <a href=\"/doc/423/26.1/addsltset\">Create a Service Level Target set record</a>.</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>On the <strong>Rules</strong> tab, configure rules to execute SLT calculations for custom and out-of-the-box target types. Please note that if no Stop rule is defined for a target, the SLT calculation will be automatically stopped after a record is closed.</li>\n<li>Click <b>Save</b> on the toolbar.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/slmtasks\" title=\"SMAX:25.1/slmTasks\">Service Level Management procedures</a></li>\n<li><a href=\"/doc/423/26.1/addsltset\" title=\"SMAX:25.1/AddSLTset\">How to create a Service Level Target set record</a></li>\n<li><a href=\"/doc/423/26.1/editsltset\" title=\"SMAX:25.1/EditSLTset\">How to edit a Service Level Target set record</a></li>\n<li><a href=\"/doc/423/26.1/addsltdefn\" title=\"SMAX:25.1/AddSLTDefn\">How to add a Service Level Target definition record</a></li>\n<li><a href=\"/doc/423/26.1/deletesltdefn\" title=\"SMAX:25.1/DeleteSLTDefn\">How to delete a Service Level Target definition record</a></li>\n<li><a href=\"/doc/423/26.1/addsla\" title=\"SMAX:25.1/AddSLA\">How to create a Service Level Agreement record</a></li>\n<li><a href=\"/doc/423/26.1/editsla\" title=\"SMAX:25.1/EditSLA\">How to edit a Service Level Agreement record</a></li>\n<li><a href=\"/doc/423/26.1/deletesla\" title=\"SMAX:25.1/DeleteSLA\">How to delete a Service Level Agreement record</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}