{
  "title": "Edit a change record",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>You are able to edit multiple records simultaneously by selecting them in the grid and updating them in the Preview pane on the right. For more information, see <a href=\"/doc/423/26.1/editrecpreview#Mass\" title=\"SMAX:25.1/EditRecPreview\">Mass update</a>.</p>\n<ol>\n<li>\n<p>From the <span class=\"SAW_VariablesMain_menu\" style=\"font-weight: normal;\">main menu</span>, select <b>Build &gt; Change</b>. Service Management displays the available changes.</p>\n</li>\n<li>\n<p>Select the change record that you want to edit.</p>\n<p>To filter the record list, click the <b>Add filter</b>  <a class=\"image\" href=\"/file/images/c/cb/2018.08_Helpcenter/Resources/Images/Icons/FilterByIcon.png\" title=\"/file/images/c/cb/2018.08_Helpcenter/Resources/Images/Icons/FilterByIcon.png\"> <img alt=\"FilterByIcon.png\" data-file-height=\"18\" data-file-width=\"19\" height=\"18\" src=\"../../../images/FilterByIcon_8e3dccb1.png\" width=\"19\"/> </a> button. For more information, see <a href=\"/doc/423/26.1/filters\" title=\"SMAX:25.1/Filters\">Filters</a>.</p>\n</li>\n<li>\n<p>Click the record identifier in the <b>ID</b> column to display the selected record.</p>\n<ul>\n<li>\n<p>If the change is in breach of the scheduling standards, a warning icon is displayed at the top right of the form. You can click the icon to display information about the breach, and a link to the Change Calendar. For more information, see <a href=\"/doc/423/26.1/changescheduling\" title=\"SMAX:25.1/ChangeScheduling\">Scheduling changes</a>.</p>\n</li>\n<li>Click <b>View in calendar</b> to see the change record displayed in the Change Calendar.</li>\n<li>\n<p>In the right pane, there are <b>Change Analytics widgets</b> that display information about changes relevant to the change record you are viewing. Relevant means these changes:</p>\n<ul>\n<li>\n<p>Used the same change model and affected the same service as the current change record; and</p>\n</li>\n<li>\n<p>Were closed within the preceding six months.</p>\n</li>\n</ul>\n<p>The information displayed in the following widgets can help you improve the chance of the current change being successfully completed. The central idea is that by looking at past changes you can improve future performance.</p>\n<ul>\n<li>\n<p>Success analysis widget</p>\n<p>This displays, as a pie chart, the successful changes out of all the relevant changes.</p>\n<p>If you point to the chart, actual percentages are displayed.</p>\n<p>If you click on a portion of the pie chart, Service Management takes you to a filtered list of changes to match the portion you clicked on. For example, if you click on the successful portion, Service Management displays all the successful, closed changes that used the same model and affected the same service as the change record you are viewing.</p>\n</li>\n<li>\n<p>Risk statistics widget</p>\n<p>This displays, as a bar chart, the risk profile of all the relevant changes.</p>\n<p>If you point to the chart, actual percentages are displayed.</p>\n<p>If you click a bar in the chart, Service Management takes you to a filtered list of changes to match the bar you clicked on. For example, if you click on the High risk bar, Service Management displays all the high risk changes that used the same model and affected the same service as the change record you are viewing.</p>\n</li>\n<li>\n<p>Similar past changes widget</p>\n<p>This displays, in separate tabs, successful and failed relevant changes.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> You can use the information displayed in the <b>Similar past changes</b> widget to help you in various aspects of change management.</p>\n<p>For example:</p>\n<ul>\n<li>\n<p>You may be able to improve scheduling by referring to similar past changes and noting and investigating material differences between scheduled time and actual time.</p>\n</li>\n<li>\n<p>You may be able to improve success rate by referring to similar past changes and analyzing what factors contributed to a change succeeding or failing.</p>\n</li>\n</ul>\n</div>\n<table>\n<tbody>\n<tr>\n<th>UI</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Successful tab</td>\n<td>\n<p>Relevant change records are listed in this tab if they have either of the following completion codes:</p>\n<ul>\n<li>\n<p>Successful</p>\n</li>\n<li>\n<p>Successful with problems</p>\n</li>\n</ul>\n<p>The maximum number of changes displayed in this tab is three.</p>\n</td>\n</tr>\n<tr>\n<td>Failed tab</td>\n<td>\n<p>Relevant change update records are listed in this tab if they have either of the following completion codes:</p>\n<ul>\n<li>\n<p>Failed</p>\n</li>\n<li>\n<p>Rejected</p>\n</li>\n</ul>\n<p>The maximum number of changes displayed in this tab is three.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p>The summary information displayed for each change includes:</p>\n<ul>\n<li>\n<p>Owner's avatar</p>\n</li>\n<li>\n<p>Change record Id</p>\n</li>\n<li>\n<p>Title</p>\n</li>\n<li>\n<p>Actual duration*</p>\n</li>\n</ul>\n<p>If you point to the change summary, further details are displayed, including:</p>\n<ul>\n<li>\n<p>Title</p>\n</li>\n<li>\n<p>Description</p>\n</li>\n<li>\n<p>Review results</p>\n</li>\n<li>\n<p>Actual duration*</p>\n</li>\n<li>\n<p>Link to comments and number of comments**</p>\n</li>\n</ul>\n<div class=\"example\">\n<p><b>*</b>If there was a difference of more than 30% between the actual duration and the planned duration, an alert icon is displayed beside the actual duration. If you point to the icon, a pop-up message displays the scheduled duration.</p>\n<p><b>**</b> Depending on the available comments, you may see information that can help improve implementation of the current change.</p>\n</div>\n</li>\n</ul>\n</li>\n<li>\n<p>In the <span class=\"SAW_VariablesSidebar\">right pane</span>, the <b>Related Contracts</b> widget displays all of the contracts related to the record you are viewing.</p>\n<ul>\n<li>Click the down arrow to expand the list of related contracts.</li>\n<li>Click a contract to see its full details.</li>\n</ul>\n<p>The icon in the left of the contract indicates the type of contract:</p>\n<p><a class=\"image\" href=\"/file/images/f/fa/2018.08_Helpcenter/Resources/Images/C_VM/contractIcons.png\" title=\"/file/images/f/fa/2018.08_Helpcenter/Resources/Images/C_VM/contractIcons.png\"> <img alt=\"contractIcons.png\" data-file-height=\"376\" data-file-width=\"586\" height=\"376\" src=\"../../../images/contractIcons_78310edb.png\" width=\"586\"/> </a></p>\n</li>\n</ul>\n</li>\n<li>\n<p>By default, the change record is displayed with the <b>General</b> tab selected. Click the tab you want to edit or view:</p>\n<table>\n<tbody>\n<tr>\n<th>Tab</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>General</td>\n<td>Displays general information about the current record. For more information about the General tab, see the <em>General tab </em>section.</td>\n</tr>\n<tr>\n<td>Workflow</td>\n<td>Displays the <span class=\"SAW_VariablesWorkflow\">workflow</span> metaphase and phase for the current record. For more information about <span class=\"SAW_VariablesWorkflow\">workflow</span>, see <a href=\"/doc/423/26.1/changewflw\" title=\"SMAX:25.1/ChangeWflw\">Change workflow</a>.</td>\n</tr>\n<tr>\n<td>Schedule</td>\n<td>Displays a Change Calendar, scheduled and actual times for the current record. For more information about scheduling, see the <em>Schedule tab </em>section.</td>\n</tr>\n<tr>\n<td>Plan and execute</td>\n<td>Displays task and planning items for the current record. For more information about tasks and planning, see the <em>Plan and execute tab </em>section.</td>\n</tr>\n<tr>\n<td>Involved CIs</td>\n<td>Displays involved devices, system elements and affected services. For more information about Involved CIs, see the <em>Involved CIs tab </em>section.</td>\n</tr>\n<tr>\n<td>Related records</td>\n<td>Displays records which are causes of, or effects of, the current record. For more information about related records, see the <em>Related records tab </em>section.</td>\n</tr>\n<tr>\n<td>Approvals</td>\n<td>Displays approvals for the current record. For more information about approvals, see the <em>Approvals tab </em>section.</td>\n</tr>\n<tr>\n<td>Related knowledge</td>\n<td>Displays relevant articles and news items for the current record. For more information, see the <em>Related knowledge tab </em>section.</td>\n</tr>\n<tr>\n<td>Discussions</td>\n<td>Displays any relevant conversations about the current record. For more information about discussions, see <a href=\"/doc/423/26.1/discussions\" title=\"SMAX:25.1/Discussions\">Discussions</a>.</td>\n</tr>\n<tr>\n<td>History</td>\n<td>Displays changes to the selected record. For more information about history, see <a href=\"/doc/423/26.1/history\" title=\"SMAX:25.1/History\">History</a>.</td>\n</tr>\n</tbody>\n</table>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span>  </p>\n<ul>\n<li>\n<p>Click the record title to edit it.</p>\n</li>\n<li>\n<p>To use a template, click <b>Apply template</b> on the toolbar.</p>\n</li>\n<li>\n<p>You can make a copy of the change record by clicking the <strong>Duplicate </strong>button. Please note that custom fields can't be duplicated.</p>\n</li>\n</ul>\n</div>\n</li>\n<li>\n<p>Click  <a class=\"image\" href=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\" title=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\"> <img alt=\"Save\" data-file-height=\"21\" data-file-width=\"20\" height=\"21\" src=\"../../../images/SaveIcon_5eb13ed6.png\" width=\"20\"/> </a>  <b>Save</b> on the toolbar.</p>\n</li>\n</ol>\n<p>You can edit multiple records simultaneously by selecting them in the grid and updating them in the Preview pane on the right. For more information, see <a href=\"/doc/423/26.1/editrecpreview#Mass\" title=\"SMAX:25.1/EditRecPreview\">Mass update</a>.</p>\n<h2 class=\"mw-headline\" id=\"Change_record_tabs\">Change record tabs</h2>\n<h3 class=\"mw-headline\" id=\"General_tab\">General tab</h3>\n<p>The Change record's General tab has screen reader support. For more information, see <a href=\"/doc/423/26.1/accessibility#Screen_reader_support\" title=\"SMAX:25.1/ScreenReader\">Screen reader support</a>.</p>\n<p>This tab includes the following sections:</p>\n<table>\n<tbody>\n<tr>\n<th>Section</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Review</td>\n<td>\n<p>This part of the record is only visible after the change enters the <b>review</b> phase in the workflow. It includes the following fields:</p>\n<ul>\n<li><b>Review results</b>: the result of the review.</li>\n<li><b>Completion code</b>: a shorthand code for a description of the completion.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>General change details</td>\n<td>This section contains basic information about the change record. For more information about general change details, see the <em>General change details </em>section.</td>\n</tr>\n<tr>\n<td>Classification</td>\n<td>This section helps you put the change into the correct <span class=\"SAW_VariablesWorkflow\">workflow</span> with assigned ownership. For more information about classification, see the <em>Classification</em> section.</td>\n</tr>\n<tr>\n<td>External Assignment</td>\n<td>This section is only relevant when an external group is selected in the Owning group field. The data in the section is populated by the external system.</td>\n</tr>\n<tr>\n<td>User options</td>\n<td>\n<p>This section contains any user options. These are cloned from the change model for the record.</p>\n<p>For more information about user options, see <a href=\"/doc/423/26.1/addchangemodel#UserOptionsFull\" title=\"SMAX:25.1/AddChangeModel\">User options</a>.</p>\n</td>\n</tr>\n<tr>\n<td>Attachments</td>\n<td>\n<p>Click <a class=\"image\" href=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\" title=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\"> <img alt=\"PlusIcon.png\" data-file-height=\"22\" data-file-width=\"24\" height=\"22\" src=\"../../../images/PlusIcon_8ed60e27.png\" width=\"24\"/> </a> <b>Add attachment</b> if you want to attach a file to the record.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span></p>\n<ul>\n<li>The supported attachment file formats and the maximum file size of an attachment are defined in the tenant's <b>Application settings</b> tab in Suite Administration.</li>\n<li>If the Attachments field has been defined as encrypted for this record type and you are a member of an encryption domain, click <b>Add encrypted attachments</b> to attach an encrypted file to the record.</li>\n<li>Attachments aren't visible in the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span>.</li>\n</ul>\n</div>\n</td>\n</tr>\n</tbody>\n</table>\n<ul>\n<li>\n<p>General change details</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Title</td>\n<td>\n<p>The title is a summary of the change request.</p>\n<p><b>Best practice</b>: choose a meaningful, descriptive, and relatively short title. Titles are often the only identification used in selection lists and in other areas to identify components.</p>\n</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>\n<p>A description that captures the details of the change. Service Management may automatically recognize CIs whose details are entered here. See <a href=\"/doc/423/26.1/autocirecog\" title=\"SMAX:25.1/AutoCiRecog\">CI Detection - Automatic recognition of CIs</a>.</p>\n</td>\n</tr>\n<tr>\n<td>Reason for change</td>\n<td>\n<p>The reason for the change. Select the reason that most closely matches the purpose of the change request.</p>\n</td>\n</tr>\n<tr>\n<td>Latest execution time</td>\n<td>\n<p>The date and time by when the change will complete.</p>\n</td>\n</tr>\n<tr>\n<td>Justification</td>\n<td>\n<p>The justification for the change. What may happen if the change isn't implemented?</p>\n<p><b>Best practice</b>: be as specific as possible.</p>\n</td>\n</tr>\n<tr>\n<td>Reported by</td>\n<td>\n<p>The person requesting the change.</p>\n</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p>Classification</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Priority</td>\n<td>\n<p>The priority for implementing the change. This is a read-only, calculated field that Service Management chooses based on the <b>Impact</b> and <b>Urgency</b> values. The following table describes the default priority matrix.</p>\n<table>\n<tbody>\n<tr>\n<th></th>\n<th>Enterprise</th>\n<th>Site or department</th>\n<th>Multiple users</th>\n<th>Single user</th>\n</tr>\n<tr>\n<td>Total loss of service</td>\n<td>Critical</td>\n<td>High</td>\n<td>High</td>\n<td>Medium</td>\n</tr>\n<tr>\n<td>Severe disruption</td>\n<td>High</td>\n<td>High</td>\n<td>Medium</td>\n<td>Medium</td>\n</tr>\n<tr>\n<td>Slight disruption</td>\n<td>High</td>\n<td>Medium</td>\n<td>Medium</td>\n<td>Low</td>\n</tr>\n<tr>\n<td>No disruption</td>\n<td>Medium</td>\n<td>Medium</td>\n<td>Low</td>\n<td>Low</td>\n</tr>\n</tbody>\n</table>\n<p>This matrix can be adjusted through business rule configuration.</p>\n</td>\n</tr>\n<tr>\n<td>Owning group</td>\n<td>\n<p>The group responsible for dealing with the change.</p>\n</td>\n</tr>\n<tr>\n<td>Urgency</td>\n<td>The urgency value describes how important the issue is for the customer. Service Management uses this value to calculate the priority for the change implementation. Specify the urgency level according to your organization's definition.</td>\n</tr>\n<tr>\n<td>Owner</td>\n<td>\n<p>The person responsible for dealing with the change.</p>\n<p><b>Note</b>: The drop-down list displays only people who are members of the owning group.</p>\n</td>\n</tr>\n<tr>\n<td>Impact</td>\n<td>\n<p>The global effect on the user community. Consider whether the change affects the entire enterprise, a business unit, or an individual.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Risk</p>\n</td>\n<td>\n<p>The risk involved in making the change. Specify the risk level according to your organization's definition.</p>\n</td>\n</tr>\n<tr>\n<td>Release</td>\n<td>The release, if any, the change record is part of.</td>\n</tr>\n<tr>\n<td>Service</td>\n<td>\n<p>The service affected by the change.</p>\n<p>Services are usually related to one of the following:</p>\n<ul>\n<li>\n<p><b>Infrastructure</b>. For example, database or network services.</p>\n</li>\n<li>\n<p><b>Business services</b>. For example, email or a web portal.</p>\n</li>\n</ul>\n<p>The selected service affects the change model you can select. See the <em>Change model</em>.</p>\n</td>\n</tr>\n<tr>\n<td>Category</td>\n<td>\n<p>The category of the change. Service Management uses the category to classify change records.</p>\n<p>The selected category affects the change model you can select. See the <em>Change model</em>.</p>\n</td>\n</tr>\n<tr>\n<td>Service component</td>\n<td>The service component related to the change.</td>\n</tr>\n<tr>\n<td>Subtype</td>\n<td>\n<p>The subtype of the change. The following options are available:</p>\n<ul>\n<li>Minor</li>\n<li>Significant</li>\n<li>Major</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Change model</td>\n<td>\n<p>A collection of predefined values. Selecting the model automatically populates the relevant fields and creates the tasks necessary to complete the change.</p>\n<p>In the drop-down, change models are grouped as follows:</p>\n<ul>\n<li>\n<p>ALL MODELS</p>\n</li>\n<li>\n<p><b>MODELS BY SERVICE</b> – the change models relevant to the selected service, and those change models that aren't connected to a service</p>\n</li>\n<li>\n<p><b>MODELS BY CATEGORY</b> - the change models relevant to the selected category, and those change models that aren't connected to a category</p>\n</li>\n<li>\n<p><b>MODELS BY SERVICE AND CATEGORY</b> – all of the following change models:</p>\n<ul>\n<li>\n<p>Relevant to the selected service <b>and</b> the relevant category</p>\n</li>\n<li>\n<p>Not connected to a service, but relevant to the selected category</p>\n</li>\n<li>\n<p>Not connected to a category, but relevant to the selected service</p>\n</li>\n<li>\n<p>Not connected to a service, and not connected to a category</p>\n</li>\n</ul>\n</li>\n</ul>\n<p>The change models available for selection depend on the selected Service and Category.</p>\n<table>\n<tbody>\n<tr>\n<th>Service selected</th>\n<th>Category selected</th>\n<th>Change models displayed</th>\n</tr>\n<tr>\n<td>No</td>\n<td>No</td>\n<td>ALL MODELS</td>\n</tr>\n<tr>\n<td>Yes</td>\n<td>No</td>\n<td>MODELS BY SERVICE</td>\n</tr>\n<tr>\n<td>No</td>\n<td>Yes</td>\n<td>\n<p>ALL MODELS</p>\n<p>MODELS BY CATEGORY</p>\n</td>\n</tr>\n<tr>\n<td>Yes</td>\n<td>Yes</td>\n<td>\n<p>MODELS BY SERVICE AND CATEGORY</p>\n<p>MODELS BY SERVICE</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p>Change model notes</p>\n<ul>\n<li>\n<p>When you select a change model, the drop-down list also displays the model's process type: normal, standard, or emergency change.</p>\n</li>\n<li>\n<p>After you select a change model, you may overwrite any field values which the change model provided. If you do so, saving the record saves the overwritten field values, and not the values which the change model provided.</p>\n</li>\n<li>\n<p>Service Management allows you to select a new model for a change record after you have created the record. Take care because this major operation may change the workflow type and overwrite field values.</p>\n</li>\n<li>\n<p>If you try to save a change record with a new change model, Service Management displays a confirmation message.</p>\n<p>To undo the selection, click <b>Cancel</b> and refresh the page. Note that refreshing the page also affects all edits since you last saved your work. Otherwise, continue editing and saving the record.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Retroactive</td>\n<td>Indicates whether this is a retroactive change. Select it only for a <a href=\"/doc/423/26.1/retroactivechanges\" title=\"SMAX:25.1/RetroactiveChanges\">retroactive change</a>.</td>\n</tr>\n</tbody>\n</table>\n</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Schedule_tab\">Schedule tab</h3>\n<p>This tab includes the following sections:</p>\n<table>\n<tbody>\n<tr>\n<th>Section</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Change Calendar</td>\n<td>\n<p>Displays the change, when scheduled, and <span class=\"SAW_VariablesTimePeriod\">time period</span>s.</p>\n<p>The calendar can display dates up to one month backwards and six months forward from the current date. If scheduled, the change is shown by a colored graphical representation (\"representation\") that's displayed from its start to end time. Scheduled downtime is highlighted within the change representation.</p>\n<p>A key for the change representation and downtime and <span class=\"SAW_VariablesTimePeriod\">time period</span> is displayed at the bottom of the calendar.</p>\n<p>Change scheduling information</p>\n<p>If a change is:</p>\n<ul>\n<li>\n<p><b>Approved</b> and doesn't breach the change scheduling standards, an approved icon <a class=\"image\" href=\"/file/images/e/eb/2018.08_Helpcenter/Resources/Images/CM/approved18.png\" title=\"/file/images/e/eb/2018.08_Helpcenter/Resources/Images/CM/approved18.png\"> <img alt=\"Approved\" data-file-height=\"18\" data-file-width=\"17\" height=\"18\" src=\"../../../images/approved18_a8cda232.png\" width=\"17\"/> </a> is displayed.</p>\n</li>\n<li>\n<p><b>Approved</b>, but breaches the change scheduling standards, this icon is displayed: <a class=\"image\" href=\"/file/images/7/77/2018.08_Helpcenter/Resources/Images/CM/ApprovedBreach.png\" title=\"/file/images/7/77/2018.08_Helpcenter/Resources/Images/CM/ApprovedBreach.png\"> <img alt=\"Approved change breaches scheduling standards\" data-file-height=\"28\" data-file-width=\"32\" height=\"28\" src=\"../../../images/ApprovedBreach_47cc2ef9.png\" width=\"32\"/> </a> .</p>\n</li>\n<li>\n<p><b>Not approved</b>, and breaches the change scheduling standards, this icon is displayed: <a class=\"image\" href=\"/file/images/c/c8/2018.08_Helpcenter/Resources/Images/CM/lightning.png\" title=\"/file/images/c/c8/2018.08_Helpcenter/Resources/Images/CM/lightning.png\"> <img alt=\"Breach\" data-file-height=\"30\" data-file-width=\"28\" height=\"30\" src=\"../../../images/lightning_be93b958.png\" width=\"28\"/> </a> .</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span>  </p>\n<ul>\n<li>\n<p>If there is no active maintenance time period and no active blackout time period, Service Management disables the display of the breach icons.</p>\n</li>\n<li>\n<p>For more information about the change scheduling standards, see <a href=\"/doc/423/26.1/changescheduling\" title=\"SMAX:25.1/ChangeScheduling\">Scheduling changes</a>.</p>\n</li>\n</ul>\n</div>\n</li>\n</ul>\n<p>To schedule a change:</p>\n<ul>\n<li>If not already scheduled: click on the calendar. A popup is displayed for you to enter the change duration. After entering a value, click <b>Suggest next available window</b> to schedule the change for the next available maintenance window.</li>\n<li>If already scheduled, click the drop-down to the right of the change representation. A popup is displayed with available windows. Select a window to schedule the change.</li>\n<li>You can drag the change representation to a time in the calendar.</li>\n<li>To view information about a <span class=\"SAW_VariablesTimePeriod\">time period</span>, click it. The information is displayed in a popup window with a link to the <span class=\"SAW_VariablesTimePeriod\">time period</span> record.</li>\n<li>You can turn off the display of <span class=\"SAW_VariablesTimePeriod\">time period</span>s by clearing the appropriate check box in the footer.</li>\n</ul>\n<p>To use the calendar:</p>\n<ul>\n<li>\n<p>If the change has an owner, the avatar for that person is displayed to the left of the change representation.</p>\n<p>If you point to the avatar, a popup window is displayed with brief details of the owner, and icons allowing you to send the owner an email, or start a discussion with the owner. For more information, see <a href=\"/doc/423/26.1/discussions\" title=\"SMAX:25.1/Discussions\">Discussions</a>.</p>\n</li>\n<li>\n<p>You can use the <b>DAY</b>, <b>WEEK</b>, and <b>MONTH</b> buttons on the toolbar to change the calendar display format.</p>\n<p>If <b>View calendar by</b> is set to <b>DAY</b>, the change calendar displays units of one hour.</p>\n<p>If <b>View calendar by</b> is set to <b>WEEK</b> or <b>MONTH</b>, the change calendar displays units of one day.</p>\n</li>\n<li>\n<p>You can use the <b>NOW</b> button on the toolbar, to scroll to the current time. This assumes the current time is within the calendar time range.</p>\n</li>\n<li>\n<p>You can use the <b>GO TO...</b> button on the toolbar, to go to the date of your choice, or the date of the change.</p>\n</li>\n<li>\n<p>If the change is part of a release, a colored line displays in the calendar header to match the release schedule.</p>\n<p>You can point to the line to display information about the release in a popup window, including a link to the release record.</p>\n</li>\n<li>\n<p>You can use the scroll bar at the bottom of the calendar, to scroll through the calendar.</p>\n</li>\n<li>\n<p>To view information about a <span class=\"SAW_VariablesTimePeriod\">time period</span>, click it. The information is displayed in a popup window, including a link to the <span class=\"SAW_VariablesTimePeriod\">time period</span> record.</p>\n</li>\n<li>\n<p>You can turn off the display of <span class=\"SAW_VariablesTimePeriod\">time period</span>s by clearing the appropriate check box in the footer.</p>\n</li>\n</ul>\n<p>If there is a time period that applies to a service, and the current change doesn't affect the service, that time period doesn't display in the Change Calendar.</p>\n</td>\n</tr>\n<tr>\n<td>Scheduled times</td>\n<td>\n<p>Details of the scheduled times for the change:</p>\n<ul>\n<li>\n<p><b>Breach status</b>: a message about the change record and scheduling standards. For more information, see <a href=\"/doc/423/26.1/changescheduling\" title=\"SMAX:25.1/ChangeScheduling\">Scheduling changes</a>.</p>\n</li>\n<li>\n<p><b>Scheduled start</b>: the date and time when work on the change is scheduled to start. Click the calendar icon to select the date, and the clock icon to select the time.</p>\n</li>\n<li>\n<p><b>Scheduled end</b>: the date and time when work on the change is scheduled to end. Click the calendar icon to select the date, and the clock icon to select the time.</p>\n</li>\n<li>\n<p><b>Scheduled duration</b>: the scheduled duration for the change. Click the duration to display a widget for editing the value.</p>\n<p>Service Management automatically calculates the scheduled duration from the scheduled start and end, each time the record is saved. If you increase or decrease the scheduled duration, Service Management automatically adjusts the scheduled end, when the record is saved.</p>\n</li>\n<li>\n<p><b>Scheduled DT start</b>: the date and time when any required downtime is scheduled to start. Click the calendar icon to select the date, and the clock icon to select the time.</p>\n</li>\n<li>\n<p><b>Scheduled DT end</b>: the date and time when any required downtime is scheduled to end. Click the calendar icon to select the date, and the clock icon to select the time.</p>\n</li>\n<li>\n<p><b>Scheduled DT duration</b>: the scheduled downtime duration for the change. Click the duration to display a widget for editing the value.</p>\n<p>Service Management automatically calculates the scheduled downtime duration from the scheduled downtime start and end, each time the record is saved. If you increase or decrease the scheduled downtime duration, Service Management automatically adjusts the scheduled downtime end, when the record is saved.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Actual times</td>\n<td>\n<p>Details of the actual times for the change.</p>\n<ul>\n<li>\n<p><b>Actual start</b>: the date and time when work on the change started. Click the calendar icon to select the date, and the clock icon to select the time.</p>\n</li>\n<li>\n<p><b>Actual end</b>: the date and time when work on the change ended. Click the calendar icon to select the date, and the clock icon to select the time.</p>\n</li>\n<li>\n<p><b>Actual duration</b>: the actual duration for the change. Click the duration to display a widget for editing the value.</p>\n<p>Service Management automatically calculates the actual duration from the actual start and end, each time the record is saved. If you increase or decrease the actual duration, Service Management automatically adjusts the actual end, when the record is saved.</p>\n</li>\n<li>\n<p><b>Actual DT start</b>: the date and time when downtime started. Click the calendar icon to select the date, and the clock icon to select the time.</p>\n</li>\n<li>\n<p><b>Actual DT end</b>: the date and time when downtime ended. Click the calendar icon to select the date, and the clock icon to select the time.</p>\n</li>\n<li>\n<p><b>Actual DT duration</b>: the actual downtime duration for the change. Click the duration to display a widget for editing the value.</p>\n<p>Service Management automatically calculates the actual downtime duration from the actual downtime start and end, each time the record is saved. If you increase or decrease the actual downtime duration, Service Management automatically adjusts the actual end, when the record is saved.</p>\n</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<p><b>Duration widget</b></p>\n<p>If you have the appropriate permissions, you can configure the widget to display either of the following:</p>\n<ul>\n<li>Days, hours, and minutes</li>\n<li>Months, days, and hours</li>\n</ul>\n<p>The length of a month is hard-coded in the widget at 30 days.</p>\n<p>For more information, see \"Precision\" in <a href=\"/doc/423/26.1/editform#ef_EditFieldInForm\" title=\"SMAX:25.1/EditForm\">Edit a field</a>.</p>\n<h3 class=\"mw-headline\" id=\"Plan_and_execute_tab\">Plan and execute tab</h3>\n<p>This tab includes the following sections:</p>\n<table>\n<tbody>\n<tr>\n<th>Section</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Change plan</td>\n<td>\n<p>Details of the change plan. It includes the following fields:</p>\n<ul>\n<li><b>Build and test required</b>: marks the change as requiring a build and test. Ensure you clear this check box if a build and test isn't required.</li>\n<li><b>Implementation plan</b>: details of the implementation plan. Service Management may automatically recognize CIs whose details are entered here. See <a href=\"/doc/423/26.1/autocirecog\" title=\"SMAX:25.1/AutoCiRecog\">CI Detection - Automatic recognition of CIs</a>.</li>\n<li><b>Remediation plan</b>: details of the remediation plan.</li>\n<li><b>External reference</b>: the relevant external reference number, if available.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Task plan</td>\n<td>\n<p>This is where you design, create, and edit tasks. The tabs that appear under task plan depend on the type of change, with each tab matching a <span class=\"SAW_VariablesWorkflow\">workflow</span> phase which may require completion of a task. The parenthesized number on the tab is the number of tasks in each phase.</p>\n<p>If the change model used to create the change has a predefined task plan, the plan is cloned to the change. You can edit the task plan where necessary.</p>\n<p>Service Management sets the task plan to read-only, in each of the following cases:</p>\n<ul>\n<li>When the tasks for the current phase have been completed, and the change record enters a new phase.</li>\n<li>When a change record enters the Abandon phase.</li>\n</ul>\n<p>You can also generate task report in xlsx format.</p>\n<ol>\n<li>\n<p>From the main menu, select <b>Build &gt; Change</b>.</p>\n</li>\n<li>\n<p>Select the change records that you want to generate the task report. The report includes the tasks for the selected change records only.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> The maximum number of change records can be selected is 100 at one time.</p>\n</div>\n</li>\n<li>\n<p>Click <b>Generate Task Report</b> on the toolbar to download the tasks, the downloaded file includes current displayed fields in the list view of parent change records and specific fields of tasks. All tasks, regardless of their status, are included in the report.</p>\n</li>\n</ol>\n<p>For more information about the task plan, see <a href=\"/doc/423/26.1/taskplans\" title=\"SMAX:25.1/Taskplans\">Task plans</a>.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 class=\"mw-headline\" id=\"Involved_CIs_tab\">Involved CIs tab</h3>\n<div class=\"Admonition_Note\"><span class=\"autonumber\">Note:</span> Data domain segmentation also applies to involved CIs. That is, if the currently logged-in user doesn't have access to some involved CIs' data domains, these CI records are hidden from the user.  </div>\n<p>In this tab you may add, change, or delete associations with business devices, infrastructure and peripheral assets, licenses, and system elements that are related to the record. When you link a device, an infrastructure asset, a license, or a system element to a record, you create an internal relationship between them. This tab also displays relevant affected services.</p>\n<p>On this tab, you can also view a topology impact map for each device and system element you choose, and the affecting CIs and a topology impact map for each affected service. </p>\n<p>How to add an involved device, infrastructure and peripheral asset, license, or system element:</p>\n<ol>\n<li>Click <b>Add</b> or the grid icon <a class=\"image\" href=\"/file/images/7/7c/2018.08_Helpcenter/Resources/Images/Icons/EntityPickerIcon.png\" title=\"/file/images/7/7c/2018.08_Helpcenter/Resources/Images/Icons/EntityPickerIcon.png\"> <img alt=\"Grid icon\" data-file-height=\"16\" data-file-width=\"16\" height=\"16\" src=\"../../../images/EntityPickerIcon_40fcd801.png\" width=\"16\"/> </a> .<br/>\n<strong>Note:</strong> For <b>Involved devices </b>and <b>Involved system elements</b>, if Native SACM is not enabled, both the Add button and the  <a class=\"image\" href=\"/file/images/7/7c/2018.08_Helpcenter/Resources/Images/Icons/EntityPickerIcon.png\" title=\"/file/images/7/7c/2018.08_Helpcenter/Resources/Images/Icons/EntityPickerIcon.png\"> <img alt=\"Grid icon\" data-file-height=\"16\" data-file-width=\"16\" height=\"16\" src=\"../../../images/EntityPickerIcon_40fcd801.png\" width=\"16\"/> </a>  icon will show you a list of all available records. If Native SACM is enabled, clicking the Add button will show a list of records that can be related to the current record in the CI topology, while the <a class=\"image\" href=\"/file/images/7/7c/2018.08_Helpcenter/Resources/Images/Icons/EntityPickerIcon.png\" title=\"/file/images/7/7c/2018.08_Helpcenter/Resources/Images/Icons/EntityPickerIcon.png\"> <img alt=\"Grid icon\" data-file-height=\"16\" data-file-width=\"16\" height=\"16\" src=\"../../../images/EntityPickerIcon_40fcd801.png\" width=\"16\"/> </a>  icon still gives you all available CIs. </li>\n<li>Select the required records. The added items appear in yellow.</li>\n<li>Click <b>Save</b>.</li>\n</ol>\n<p>Affected services connected to the selected involved devices are shown in the Affected Services part of the tab.</p>\n<p>How to delete an involved device, infrastructure and peripheral asset, license, or system element:</p>\n<ol>\n<li>Select the required records.</li>\n<li>Click <b>Remove</b>. The selected items appear in strikethrough text.</li>\n<li>Click <b>Save</b>.</li>\n</ol>\n<p>How to view an impact map for a device:</p>\n<ol>\n<li>In the <b>Involved Devices</b> section, select the device.</li>\n<li>Click <b>Show Impact</b> <a class=\"image\" href=\"/file/images/1/1f/2018.08_Helpcenter/Resources/Images/Icons/Impact.png\" title=\"/file/images/1/1f/2018.08_Helpcenter/Resources/Images/Icons/Impact.png\"> <img alt=\"Impact\" data-file-height=\"16\" data-file-width=\"15\" height=\"16\" src=\"../../../images/Impact_6dd71d04.png\" width=\"15\"/> </a> . An impact map of the device is displayed.</li>\n</ol>\n<p>How to view an impact map for a system element:</p>\n<ol>\n<li>In the <b>Involved System elements</b> section, select the system element.</li>\n<li>Click <b>Show Impact</b> <a class=\"image\" href=\"/file/images/1/1f/2018.08_Helpcenter/Resources/Images/Icons/Impact.png\" title=\"/file/images/1/1f/2018.08_Helpcenter/Resources/Images/Icons/Impact.png\"> <img alt=\"Impact\" data-file-height=\"16\" data-file-width=\"15\" height=\"16\" src=\"../../../images/Impact_6dd71d04.png\" width=\"15\"/> </a> . An impact map of the system element is displayed.</li>\n</ol>\n<p>How to view the CIs affecting a service and an impact map:</p>\n<ol>\n<li>\n<p>In the <b>Affected Services</b> section, select the service.</p>\n</li>\n<li>\n<p>Click <b>View CIs affecting</b>. A list of CIs affecting the service is displayed.</p>\n</li>\n<li>\n<p>Select the CI whose impact map you want to view.</p>\n</li>\n<li>\n<p>Click <b>Show Impact</b> <a class=\"image\" href=\"/file/images/1/1f/2018.08_Helpcenter/Resources/Images/Icons/Impact.png\" title=\"/file/images/1/1f/2018.08_Helpcenter/Resources/Images/Icons/Impact.png\"> <img alt=\"Impact\" data-file-height=\"16\" data-file-width=\"15\" height=\"16\" src=\"../../../images/Impact_6dd71d04.png\" width=\"15\"/> </a> . An impact map of the CI is displayed.</p>\n<p>The impact map highlights the path (or paths, if there is more than one) from the chosen CI (the device or system element) to the service.</p>\n</li>\n</ol>\n<h4 class=\"mw-headline\" id=\"When_Native_SACM_is_disabled\">When Native SACM is disabled</h4>\n<p>The CI topology is defined and managed in SMA only, which is shown by the <b>Show Impact</b> widget.</p>\n<p>You can zoom in and out of the impact map by using the mouse wheel button. If a text string is too long to be displayed, an ellipsis (…) appears. You can hover over the ellipsis to display the full text string.</p>\n<p>You can hover over the following icons in the impact map:</p>\n<ul>\n<li>Owner avatar <a class=\"image\" href=\"/file/images/f/f4/2018.08_Helpcenter/Resources/Images/Icons/AvatarIcon.png\" title=\"/file/images/f/f4/2018.08_Helpcenter/Resources/Images/Icons/AvatarIcon.png\"> <img alt=\"Avatar\" data-file-height=\"13\" data-file-width=\"13\" height=\"13\" src=\"../../../images/AvatarIcon_7f9d9338.png\" width=\"13\"/> </a> – a window is displayed with the owner’s details.</li>\n<li>Business criticality <a class=\"image\" href=\"/file/images/5/5e/2018.08_Helpcenter/Resources/Images/Icons/CriticalityIcon.png\" title=\"/file/images/5/5e/2018.08_Helpcenter/Resources/Images/Icons/CriticalityIcon.png\"> <img alt=\"Criticality\" data-file-height=\"12\" data-file-width=\"14\" height=\"12\" src=\"../../../images/CriticalityIcon_7480a41b.png\" width=\"14\"/> </a> – a tooltip is displayed with the criticality.</li>\n<li>Location <a class=\"image\" href=\"/file/images/8/88/2018.08_Helpcenter/Resources/Images/Icons/LocationIcon.png\" title=\"/file/images/8/88/2018.08_Helpcenter/Resources/Images/Icons/LocationIcon.png\"> <img alt=\"Location\" data-file-height=\"15\" data-file-width=\"13\" height=\"15\" src=\"../../../images/LocationIcon_73a46d8c.png\" width=\"13\"/> </a> – a tooltip is displayed with the name of the location.</li>\n</ul>\n<p>Depending on the size of the impact map and the browser window, Service Management may not display the subtype of a Device, Service, or System Element. Hover over the subtype graphic to see a tooltip with this information.</p>\n<h4 class=\"mw-headline\" id=\"When_Native_SACM_is_enabled\">When Native SACM is enabled</h4>\n<p>The CI topology is mostly defined and managed in UCMDB and synchronized into SMA. The only way to create or delete a CI relationship is to run business rules in Studio. For details, see <a href=\"/doc/423/26.1/nativesacmstudio\" title=\"SMAX:25.1/NativeSACMStudio\">Configure Native SACM with Studio</a>.</p>\n<p>When you click the <b>Show Impact</b> button, the CI topology synchronized from UCMDB is displayed in a new <b>Show Impact</b> widget. For details, see <a href=\"/doc/423/26.1/nativesacmcirelation\" title=\"SMAX:25.1/NativeSACMCiRelation\">CI relationship federation</a>.<br/>\n<br/>\nIn the <strong>Affected services</strong> section, you can still select an affected service and click <strong>Affecting CIs </strong>to understand how the service is affected. After you click <strong>Affecting CIs</strong>, a topology map is presented instead of a list. In the topology map, you can select the involved devices and system elements, and then click <strong>Run Impact Analysis</strong> at the bottom of the toolbar, the impacted service will be highlighted.</p>\n<h3 class=\"mw-headline\" id=\"Related_records_tab\">Related records tab</h3>\n<p>The records displayed are those that are the <i>causes</i> of the current record, and those that are the <i>effects</i> of the current record.</p>\n<ol>\n<li>\n<p>In each section, the default sort order is first by record type, then by phase. You can click a column heading to reverse the sort order in any column.</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Id</td>\n<td>The identifier of the record. Click the <b>ID</b> value to link to the record.</td>\n</tr>\n<tr>\n<td>Title or Name</td>\n<td>A short description provided by the end user.</td>\n</tr>\n<tr>\n<td>Phase Id</td>\n<td>The current phase of the current record in the <span class=\"SAW_VariablesWorkflow\">workflow</span>.</td>\n</tr>\n<tr>\n<td>Priority</td>\n<td>The priority is a value based on urgency and business impact values.</td>\n</tr>\n<tr>\n<td>Active</td>\n<td>Indicates if the related record is active.</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p>In the appropriate section, do one of the following:</p>\n<ul>\n<li>\n<p>Click <a class=\"image\" href=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\" title=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\"> <img alt=\"Add\" data-file-height=\"22\" data-file-width=\"24\" height=\"22\" src=\"../../../images/PlusIcon_8ed60e27.png\" width=\"24\"/> </a>  <b>Add</b> to create a relationship between the current record and another record.</p>\n<p>The <b>Add related record</b> dialog appears. The dialog box displays a list of potential related records. If you select an individual record, Service Management displays the contents of that record in the <span class=\"SAW_VariablesSidebar\">right pane</span>.</p>\n<ul>\n<li>\n<p>If you want to search for more records, you can use the Search box at the top of the dialog box.</p>\n</li>\n<li>\n<p>Find each record that you want to link, and click <b>Add</b> to select it.</p>\n</li>\n<li>\n<p>When you have selected all the records that you want to link, click <b>OK</b>.</p>\n</li>\n<li>\n<p>Click  <a class=\"image\" href=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\" title=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\"> <img alt=\"Save\" data-file-height=\"21\" data-file-width=\"20\" height=\"21\" src=\"../../../images/SaveIcon_5eb13ed6.png\" width=\"20\"/> </a>  <b>Save</b> on the toolbar.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Click <a class=\"image\" href=\"/file/images/f/ff/2018.08_Helpcenter/Resources/Images/Icons/DeleteIcon.png\" title=\"/file/images/f/ff/2018.08_Helpcenter/Resources/Images/Icons/DeleteIcon.png\"> <img alt=\"Remove\" data-file-height=\"26\" data-file-width=\"26\" height=\"26\" src=\"../../../images/DeleteIcon_bcd25653.png\" width=\"26\"/> </a>  <b>Remove</b> to delete the relationship between the current record and the selected record.</p>\n<ul>\n<li>\n<p>Click <b>OK</b> to confirm the action.</p>\n</li>\n<li>\n<p>Click  <a class=\"image\" href=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\" title=\"/file/images/6/66/2018.08_Helpcenter/Resources/Images/Icons/SaveIcon.png\"> <img alt=\"Save\" data-file-height=\"21\" data-file-width=\"20\" height=\"21\" src=\"../../../images/SaveIcon_5eb13ed6.png\" width=\"20\"/> </a>  <b>Save</b> on the toolbar.</p>\n</li>\n</ul>\n<p>This action removes the relationship only. It doesn't delete either record.</p>\n</li>\n</ul>\n</li>\n</ol>\n<p>For more information about related records, see <a href=\"/doc/423/26.1/cmrelaterec\" title=\"SMAX:25.1/cmRelateRec\">How to relate change records</a>.</p>\n<h3 class=\"mw-headline\" id=\"Approvals_tab\">Approvals tab</h3>\n<p>The Approvals tab is where you design, create, and edit approvals. It's also where you give or refuse approvals. The tabs that appear depend on the type of change. The parenthesized number on the tab is the number of approvals in each phase.</p>\n<table>\n<tbody>\n<tr>\n<th>Change</th>\n<th>Approval tabs</th>\n</tr>\n<tr>\n<td>Emergency</td>\n<td>ECAB</td>\n</tr>\n<tr>\n<td>Normal</td>\n<td>\n<p>Approve plan</p>\n<p>Approve deployment</p>\n</td>\n</tr>\n<tr>\n<td>Standard</td>\n<td>None</td>\n</tr>\n</tbody>\n</table>\n<p>Approval plans are defined out-of-the-box for Normal and Emergency type changes. These plans are defined in the record definition of each of these types of changes. For more information, see <a href=\"/doc/423/26.1/approvaldefn\" title=\"SMAX:25.1/ApprovalDefn\">Approval definitions</a>.</p>\n<p>You can edit the approval plans of a normal or emergency change workflow in the <b>Approvals</b> tab.</p>\n<ol>\n<li>In the Change record, go to the <b>Approvals</b> tab.</li>\n<li>Select a phase to display its approval plan.</li>\n<li>Move the mouse over the <b>Start</b> node, and click the <b>Edit</b>   <a class=\"image\" href=\"/file/images/f/f0/2018.08_Helpcenter/Resources/Images/Icons/EditIcon.png\" title=\"/file/images/f/f0/2018.08_Helpcenter/Resources/Images/Icons/EditIcon.png\"> <img alt=\"EditIcon.png\" data-file-height=\"21\" data-file-width=\"24\" height=\"21\" src=\"../../../images/EditIcon_ad95cc14.png\" width=\"24\"/> </a>   button.</li>\n<li>\n<p>Select an element to add to the plan. The following elements are available:</p>\n<table>\n<tbody>\n<tr>\n<th>Step</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Approval</td>\n<td>Requires one or more users to grant an approval before the workflow can move on to the next phase.</td>\n</tr>\n<tr>\n<td>Decision</td>\n<td>A decision point that uses an Expression Language phrase to determine which path in the approval plan to follow.</td>\n</tr>\n<tr>\n<td>Join</td>\n<td>Joins two or more nodes in the approval plan. Both must be completed before moving on to the next node in the plan.</td>\n</tr>\n<tr>\n<td>Path to</td>\n<td>Creates a path between two nodes in the plan.</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p>Fill in the relevant information for the selected node.</p>\n<ul>\n<li>\n<p>Approval</p>\n<p>Requires one or more users to grant an approval before the workflow can move on to the next phase.</p>\n<p>Available for the approval phases only.</p>\n<table>\n<tbody>\n<tr>\n<td>Title</td>\n<td>A title for the approval.</td>\n</tr>\n<tr>\n<td>Strategy</td>\n<td>\n<p>The strategy to use to obtain the approval:</p>\n<ul>\n<li><b>All must approve.</b> Every assigned user must grant an approval.</li>\n<li><b>All must approve - immediate deny.</b> Every assigned user must grant an approval. If one user denies an approval, the approval is denied.</li>\n<li><b>Quorum.</b> The majority of responses determines whether the approval is granted or denied.</li>\n<li><b>One must approve.</b> Requires only one assigned user to grant an approval. The approval is granted regardless of the responses of the other users.</li>\n<li>\n<p><b>One must approve – immediate deny.</b> Requires only one assigned user to grant an approval. If one user denies an approval, the approval is denied. (The decision follows the first user who answers.)</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Add approver user</td>\n<td>Adds a <b>User</b> line to the list of approvers where you can specify a user who must grant the approval.</td>\n</tr>\n<tr>\n<td>Add approver group</td>\n<td>\n<p>Adds a <b>Group</b> line to the list of approvers where you can specify a group that must grant the approval.</p>\n<p>When a user in the group assigns the approval to himself, the approval is removed from the Approvals queues of the other members of the group.</p>\n</td>\n</tr>\n<tr>\n<td>Add approver expression</td>\n<td>\n<p>Adds an <b>Expression</b> line to the list of approvers where you can specify an Expression Language phrase to determine which users must grant an approval.</p>\n<p>You can also define a condition on which to base the resulting list of users. The condition is defined as an Expression Language phrase.</p>\n</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p>Decision</p>\n<p>A decision point that uses Expression Language phrases to determine which path in the task plan to follow:</p>\n<ol>\n<li>\n<p>Enter the details of the decision to be made.</p>\n</li>\n<li>\n<p>Enter an Expression Language phrase to define when the decision must be made.</p>\n</li>\n<li>\n<p>For decisions that require a <b>yes</b> or <b>no</b> answer, you can use the predefined <b>Yes/No</b> decision options.</p>\n<p>Alternatively, click <b>Advanced</b> to define other decision options. In this case, the list of options always includes an <b>otherwise</b> option in case none of the defined options are met.</p>\n</li>\n<li>\n<p>For each decision option, define the next step.</p>\n<p><a class=\"image\" href=\"/file/images/9/96/2018.08_Helpcenter/Resources/Images/taskplan_decision.png\" title=\"/file/images/9/96/2018.08_Helpcenter/Resources/Images/taskplan_decision.png\"> <img alt=\"taskplan decision.png\" data-file-height=\"463\" data-file-width=\"535\" height=\"463\" src=\"../../../images/taskplan_decision_8ae05cf1.png\" width=\"535\"/> </a></p>\n</li>\n</ol>\n</li>\n</ul>\n</li>\n<li>\n<p>To create a path from one node to another, click the <b>Edit</b>  <a class=\"image\" href=\"/file/images/f/f0/2018.08_Helpcenter/Resources/Images/Icons/EditIcon.png\" title=\"/file/images/f/f0/2018.08_Helpcenter/Resources/Images/Icons/EditIcon.png\"> <img alt=\"Image of the edit icon: a pencil\" data-file-height=\"21\" data-file-width=\"24\" height=\"21\" src=\"../../../images/EditIcon_ad95cc14.png\" width=\"24\"/> </a> button on the source node, select <b>Path to</b>, and click the destination node. A path is drawn from the source node to the destination node.</p>\n</li>\n<li>\n<p>To ensure that certain tasks are completed before moving on with another task, you can direct them through a <b>join</b> node. Each task node leading into the <b>join</b> node must be completed before the task node leading out of the join node can be instantiated.</p>\n<p><a class=\"image\" href=\"/file/images/3/32/2018.08_Helpcenter/Resources/Images/taskplan_join.png\" title=\"/file/images/3/32/2018.08_Helpcenter/Resources/Images/taskplan_join.png\"> <img alt=\"taskplan join.png\" data-file-height=\"346\" data-file-width=\"633\" height=\"346\" src=\"../../../images/taskplan_join_4e16275d.png\" width=\"633\"/> </a></p>\n<p>To join nodes:</p>\n<ol>\n<li>\n<p>Click the <b>Edit</b> <a class=\"image\" href=\"/file/images/f/f0/2018.08_Helpcenter/Resources/Images/Icons/EditIcon.png\" title=\"/file/images/f/f0/2018.08_Helpcenter/Resources/Images/Icons/EditIcon.png\"> <img alt=\"Image of the edit icon: a pencil\" data-file-height=\"21\" data-file-width=\"24\" height=\"21\" src=\"../../../images/EditIcon_ad95cc14.png\" width=\"24\"/> </a> button on one of the nodes, and select <b>Join</b>. A <b>join</b> node is added.</p>\n</li>\n<li>\n<p>Click the node that you want to join to the first node, and select <b>Path to</b>.</p>\n</li>\n<li>\n<p>Click the <b>join</b> node. Both nodes lead into the <b>join</b> node.</p>\n</li>\n<li>\n<p>Repeat to direct more nodes through the join node if desired.</p>\n</li>\n</ol>\n</li>\n<li>Continue to build the plan in the same way from one node to another.</li>\n<li>Save the plan.</li>\n</ol>\n<h3 class=\"mw-headline\" id=\"Related_knowledge_tab\">Related knowledge tab</h3>\n<p>The <b>Related knowledge</b> tab is where related knowledge or news articles are displayed.</p>\n<table>\n<tbody>\n<tr>\n<th>Action</th>\n<th>Procedure</th>\n</tr>\n<tr>\n<td>Add a knowledge or news article</td>\n<td>\n<ol>\n<li>\n<p>Click  <a class=\"image\" href=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\" title=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\"> <img alt=\"PlusIcon.png\" data-file-height=\"22\" data-file-width=\"24\" height=\"22\" src=\"../../../images/PlusIcon_8ed60e27.png\" width=\"24\"/> </a>  <b>Add</b>. The <b>Add related record</b> dialog box opens.</p>\n</li>\n<li>\n<p>Select a knowledge or news article.</p>\n<p>You can filter the selection using the drop-down list and the filter button.</p>\n</li>\n<li>\n<p>Click  <a class=\"image\" href=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\" title=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\"> <img alt=\"PlusIcon.png\" data-file-height=\"22\" data-file-width=\"24\" height=\"22\" src=\"../../../images/PlusIcon_8ed60e27.png\" width=\"24\"/> </a>  <b>Add</b> in the right pane of the dialog box.</p>\n</li>\n<li>\n<p>Repeat the above 2 steps as required, and then click <b>OK</b>. The selected records are added to the <b>Related knowledge</b> tab.</p>\n</li>\n</ol>\n</td>\n</tr>\n<tr>\n<td>Remove a knowledge or news article</td>\n<td>\n<ol>\n<li>Select the knowledge article or news article you want to delete.</li>\n<li>Click <a class=\"image\" href=\"/file/images/f/ff/2018.08_Helpcenter/Resources/Images/Icons/DeleteIcon.png\" title=\"/file/images/f/ff/2018.08_Helpcenter/Resources/Images/Icons/DeleteIcon.png\"> <img alt=\"DeleteIcon.png\" data-file-height=\"26\" data-file-width=\"26\" height=\"26\" src=\"../../../images/DeleteIcon_bcd25653.png\" width=\"26\"/> </a>  <b>Remove</b>, and then <b>OK</b>.</li>\n</ol>\n</td>\n</tr>\n<tr>\n<td>View a knowledge or news article</td>\n<td>\n<ol>\n<li>Select the knowledge or news article you want to view.</li>\n<li>Click the record identifier in the <b>ID</b> column to display the selected record.</li>\n</ol>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/cmrelaterec\" title=\"SMAX:25.1/cmRelateRec\">How to relate change records</a></li>\n<li><a href=\"/doc/423/26.1/addchange\" title=\"SMAX:25.1/AddChange\">How to create a change record</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}