{
  "title": "Before you begin",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\">\n<div class=\"transcontent stn-begin--intro\"> </div>\n<p>To orchestrate and manage resources efficiently, the suite uses Kubernetes as the platform to provide a reliable approach to scheduling resources and empower the application to be more fault-tolerant. Cloud-native Kubernetes platforms make the provisioning and management of Kubernetes much easier. With the cloud-native Kubernetes, the suite can serve customers in a secure, resilient, and simple way.</p>\n<p>On AWS, the cloud-native Kubernetes solution is Amazon Elastic Kubernetes Service (EKS).</p>\n<h2 class=\"mw-headline\" id=\"Reference_architecture\">Reference architecture</h2>\n<p>The following reference architecture can help you get an overview of the process of deploying the suite on EKS.<br/>\n<a class=\"image\" href=\"/file/images/2/24/SMA-X_on_AWS_2019.11-BYOK2-5.png\" title=\"/file/images/2/24/SMA-X_on_AWS_2019.11-BYOK2-5.png\"> <img alt=\"SMA-X on AWS 2019.11-BYOK2-5.png\" data-file-height=\"972\" data-file-width=\"921\" height=\"972\" src=\"../../../images/SMA-X_on_AWS_2019.11-BYOK2-5_f45e505e.png\" width=\"921\"/> </a></p>\n<h3 class=\"mw-headline\" id=\"Benefits_of_using_EKS\">Benefits of using EKS</h3>\n<p>EKS provides the following benefits:</p>\n<ul>\n<li>There are no more control plane nodes. The cluster has a guaranteed SLA provided by AWS at a lower cost.</li>\n<li>Auto Scaling Group is deployed by default, which increases the availability.</li>\n<li>Network Load Balancer (NLB) at the Kubernetes level has been removed to reduce cost.</li>\n<li>Managed worker nodes enable you to reduce the operational cost of cluster management.</li>\n<li>Automated deployment with sliced CloudFormation templates supports your existing AWS infrastructure.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Components\">Components</h3>\n<ul>\n<li><b>The suite</b>: the suite product shipped and running in the form of containers and managed by Kubernetes.</li>\n<li><b>Kubernetes</b>: open-source software that allows you to deploy and manage containerized applications at scale.</li>\n<li><b>Public subnet</b>: a public subnet is for external-facing resources such as load balancers, bastion nodes, and NAT gateway.</li>\n<li><b>Private subnet</b>: a private subnet is for internal-facing resources such as EKS worker nodes, databases, and storage.</li>\n<li><b>Bastion node</b>: a node that sits in a public subnet. It's used to connect to resources in a private subnet such as Kubernetes, databases, and storage to perform deployment, persistent volume setup, database setup, upgrade, troubleshooting, and other operational tasks.</li>\n<li><b>Elastic Kubernetes Service (EKS)</b>: a fully managed service provided by AWS. Once it's provisioned, the following services are ready to work as a Kubernetes platform for you:\n\t<ul>\n<li>Control Plane: manages when and where containers are started on your cluster and monitors their status.</li>\n<li>Worker Nodes (Group): nodes to run your containers. The worker nodes are deployed across multiple AWS availability zones for high availability and fault tolerance.</li>\n</ul>\n</li>\n<li><b>Elastic File Service (EFS)</b>: a managed NFS service that stores data used by the containerized applications in Kubernetes (such as search engine storage, attachments, certificates, and logs). The storage is called Persistent Volume (PV) in Kubernetes.</li>\n<li><strong>Relational Database Service</strong><b> (</b><b>RDS</b><b>)</b>: a database service that stores transactional data and metadata used by the containerized applications in Kubernetes.</li>\n<li><b>Elastic Container Registry (ECR)</b>: a managed Docker registry service that's secure, scalable, and reliable. The suite applications are shipped as container images, which are stored in an ECR.</li>\n<li><b>Load balancer</b>: used to route traffic from external applications to internal applications deployed on Kubernetes. Load balancers triggered from the Kubernetes service are able to discover the backend worker node change and always fit the latest status of the worker node pool.</li>\n<li><b>NAT gateway</b>: enables instances in a private subnet to connect to the Internet or other AWS services, but prevents the Internet from initiating a connection with those instances.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Inter-communication_between_components\">Inter-communication between components</h3>\n<ul>\n<li>The Kubernetes cluster, RDS, and EFS are kept in a private subnet, while other components such as load balancers and bastion nodes are in a public subnet. For reasons of separating the public and private subnets, refer to the \"Architecture design considerations\" section below.</li>\n<li>A load balancer works as the entrance of external traffic. It's usually bound with the site's URL, for example: <code>https://serviceportal.mycompany.com</code>. Once end users open the URL in their browsers or mobile apps, after DNS resolution, the load balancer routes traffic from external applications to the applications in a private subnet.</li>\n<li>DevOps engineers connect to the bastion nodes in a public subnet and then jump to the private network for cluster management. The bastion nodes in this scenario work as a Kubernetes client, database client, or EFS (NFS) client for operation purposes.</li>\n<li>The applications reside inside the Kubernetes cluster in the private subnet. It uses EFS as its Persistent Volume and RDS as its database, which are also in the private subnet.</li>\n<li>When the applications in the Kubernetes cluster need to connect to the Internet, for example, when you're downloading Docker images for upgrade or downloading a patch for an update, the traffic goes through the NAT gateway to prevent the Internet from initiating a connection with instances running those applications.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Architecture_design_considerations\">Architecture design considerations</h3>\n<h4 class=\"mw-headline\" id=\"Security\">Security</h4>\n<ul>\n<li>With separated public and private subnets, the network infrastructure can provide an additional layer of security, and independent routing tables configured for every private subnet to control the flow of traffic within and outside the Amazon Virtual Private Cloud (VPC).</li>\n<li>All OMT and suite components are located in the private subnet. NO direct Internet access is allowed.</li>\n<li>Employee Self-Service (ESS) users and IT agents can only connect to the specified ports (for example: 443) for business purposes. A typical traffic path is described as below:<br/>\n<b>End user/IT agent &lt;-&gt; Load balancer (public subnet) &lt;-&gt; EKS worker nodes (private subnet)</b></li>\n<li>DevOps engineers can connect to the bastion nodes in a public subnet and then jump to the private network for cluster management. Only a limited number of users can access the bastion nodes. A typical traffic path is as follows:<br/>\n<b>DevOps engineer &lt;-&gt; Bastion node (public subnet) &lt;-&gt; EKS cluster or EFS or RDS (private subnet)</b></li>\n</ul>\n<h4 class=\"mw-headline\" id=\"Availability\">Availability</h4>\n<ul>\n<li>The control plane nodes are managed by EKS with high availability and a guaranteed SLA.</li>\n<li>Amazon Elastic Load Balancers (ELBs) distribute the traffic across different worker nodes in different Availability Zones.</li>\n<li>Worker nodes are distributed across Availability Zones.</li>\n<li>Amazon Elastic File System (EFS) provides storage access across Availability Zones.</li>\n<li>Amazon Relational Database Service (RDS) can be easily configured for high availability across Availability Zones.</li>\n</ul>\n<h4 class=\"mw-headline\" id=\"Performance\">Performance</h4>\n<p>The architecture also takes into account the performance balanced against availability. The worker nodes are distributed across multiple Availability Zones instead of regions, which makes sure the network latency between different Availability Zones is less than 1 millisecond in most cases and guarantees minor performance penalty caused by latency.</p>\n<h4 lang=\"EN-GB\" xml:lang=\"EN-GB\">[Optional] Additional load balancer in front of the application</h4>\n<p lang=\"EN-GB\" xml:lang=\"EN-GB\">According to your organization's network/security requirements, you may need to set up an additional load balancer in front of the suite application.<br/>\nPlease enable websocket on the additional load balancer if you have installed one.</p>\n<div class=\"transcontent stn-end--reference_architecture\"> </div>\n<h2 class=\"mw-headline\" id=\"Personas\">Personas</h2>\n<p>Installing the suite on AWS with EKS includes sequential procedures and involves different roles in your organization. For example, IT administrators manage physical or virtual machines for production use, and the person to install the suite needs to request machines from an IT administrator, who will help prepare the requested machines. Typically the involved roles include:</p>\n<table>\n<tbody>\n<tr>\n<th>Role</th>\n<th>Responsibility</th>\n</tr>\n<tr>\n<td><b>Suite administrator</b></td>\n<td>The person with this role has to ensure the success of the entire installation including verification and post-installation tasks. This person must have a good understanding of the entire installation process, request support from other appropriate roles as needed, and complete the installation once the environment is ready for installation.</td>\n</tr>\n<tr>\n<td><b>Cloud administrator</b></td>\n<td>The person with this role manages resources on AWS. This person grants permissions and changes roles from the AWS Management Console.</td>\n</tr>\n<tr>\n<td><b>IT administrator</b></td>\n<td>The person with this role prepares physical or virtual machines as requested by the Suite Admin.</td>\n</tr>\n<tr>\n<td><b>Network administrator</b></td>\n<td>The person with this role manages network-related configuration for your organization. This person needs to perform network configuration tasks as requested by the Suite Admin.</td>\n</tr>\n<tr>\n<td><b>Storage administrator</b></td>\n<td>The person with this role plans and deploys all types of storage for your organization. This person needs to set up NFS required by the suite.</td>\n</tr>\n<tr>\n<td><b>Database administrator</b></td>\n<td>The person with this role prepares and configures databases for your organization. This person needs to manage databases as requested by the Suite Admin.</td>\n</tr>\n<tr>\n<td><b>Kubernetes Cluster administrator</b></td>\n<td>The person with this role manages Kubernetes for your organization. This person needs to create and manage the Kubernetes cluster as requested by the Suite Admin.</td>\n</tr>\n<tr>\n<td><b>Server administrator</b></td>\n<td>The person with this role performs server-related tasks for your organization. This person needs to build and configure the bastion node.</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"Deployment_procedures\">External references</h2>\n<ul>\n<li>AWS VPC architecture: <a class=\"external free\" href=\"https://docs.aws.amazon.com/quickstart/latest/vpc/architecture.html\" rel=\"nofollow\" target=\"1\" title=\"https://docs.aws.amazon.com/quickstart/latest/vpc/architecture.html\">https://docs.aws.amazon.com/quickstart/latest/vpc/architecture.html</a></li>\n<li>AWS Global Infrastructure: <a class=\"external free\" href=\"https://aws.amazon.com/about-aws/global-infrastructure/regions_az/\" rel=\"nofollow\" target=\"1\" title=\"https://aws.amazon.com/about-aws/global-infrastructure/regions_az/\">https://aws.amazon.com/about-aws/global-infrastructure/regions_az/</a></li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<p><a href=\"/doc/423/26.1/eksdeploymentfaq\" title=\"SMAX:25.1/EKSDeploymentFAQ\">EKS deployment FAQs</a></p>\n</div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}