{
  "title": "Download and upload container images",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>To install an application, you will need to download the required installation images. You need to:</p>\n<ul>\n<li>Generate an image download tool package</li>\n<li>Run the download script inside the tool package to download the required installation images.</li>\n<li>Upload the images to the image registry.</li>\n</ul>\n<h2 id=\"Generate_the_download_bundle\">Generate the download bundle</h2>\n<p>Use the steps below to generate download bundle.</p>\n<ol>\n<li>Log on to the bastion, and then navigate to the <code>$CDF_HOME/tools/generate-download</code> directory.</li>\n<li>Run the <code>generate_download_bundle.sh</code> command together with the options required by your deployment. For the full list of command options, run the command with the -h option.\n\t<pre>generate_download_bundle.sh -f &lt;image_set_file&gt; [ -d &lt;output_directory&gt;]</pre>\n<p>Where:</p>\n<ul>\n<li><code>&lt;<em>image_set_file</em>&gt;</code>: The absolute path to the image set file. To locate this file, untar the esm-1.0.0+2x.x-xxx.tar  and check the scripts folder. </li>\n<li><code>&lt;<em>output_directory</em>&gt;</code>: The directory where the script saves the offline-download.zip file. If you don't specify a value, the script saves the file to the default directory, which is the current working directory.</li>\n</ul>\n<p>Example command:</p>\n<ul>\n<li>For commercial deployment:\n\t\t<pre>generate_download_bundle.sh -f  &lt;ESM_Helm_Chart-2x.x.x&gt;/scripts/image_sets/_image-set.json -d /tmp</pre>\n</li>\n<li>For FIPS deployment:\n\t\t<pre>generate_download_bundle.sh -f  &lt;ESM_Helm_Chart-2x.x.x&gt;/scripts/image_sets/_fedramp-image-set.json -d /tmp</pre>\n</li>\n</ul>\n<p>You will see a similar message indicating that you have successfully generated the <code>offline-download.zip</code> file:</p>\n<pre>INFO offline-download.zip is generated under /tmp\nINFO For more details, please refer: /home/centos/cdf/log/generate_download_bundle/generate_download_bundle.20240129084204.log\n</pre>\n\tThe generated file contains the image download bundle. This bundle downloads the images required for installation.</li>\n</ol>\n<h2>Download the required installation images</h2>\n<ol>\n<li>Log on to the bastion node. If the bastion node can't access Docker Hub, transfer the  <code>offline-download.zip</code>  file to a Linux server that can access Docker Hub.</li>\n<li>Extract the .zip package to a directory. If you can't access Docker Hub directly, set up the HTTP/HTTPS proxy. For example, run the following commands to set the HTTP/HTTPS proxy. Replace the placeholders with your actual server and port.\n\t<pre>export http_proxy=\"&lt;http://PROXY_SERVER:PORT&gt;\"\nexport https_proxy=\"&lt;https://PROXY_SERVER:PORT&gt;\"</pre>\n</li>\n<li>Go to the directory where you extracted the <code>offline-download.zip</code> package.</li>\n<li>Run the following command:<br/>\n\t \n\t<pre>./downloadimages.sh [-r &lt;image repository URL&gt;] [-u &lt;username&gt;]  [-d &lt;image download directory&gt;] [-c on|off] [-o &lt;org name&gt;]</pre>\n<br/>\n\tWhere:\n\t<ul>\n<li>&lt;image repository URL&gt;: Specify the <code>-r</code> option if you want to download the images from a repository other than Docker Hub.</li>\n<li>Replace &lt;<i>username</i>&gt; with the Docker Hub username.</li>\n<li>If you don't specify the credentials here, you will be prompted to specify them when you run the command.</li>\n<li>&lt;image download directory&gt;: The directory where the container images will be downloaded. The default value is /var/opt/cdf/offline.</li>\n<li>The <code>-c</code> option is used to verify the digital signature of the images during the download. The default setting is off, which doesn't verify the signature.</li>\n<li><code>&lt;org name&gt;</code>: The organization in the image registry that contains the images for installation. By default, this is <code>hpeswitom.</code> This option is mandatory if you aren't using the default organization name.</li>\n</ul>\n</li>\n</ol>\n<p>To see the full list of options for the <code>downloadimages.sh</code> command, run the following command:<br/>\n<code>./downloadimages.sh –h</code><br/>\nThe command also has a <code>-p</code> option to provide your password. The <code>-p</code>  option doesn't support single quotes (that is, don't include single quotes in the password).</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p><br/>\nBy selecting the -p option, you are disabling or bypassing security features, thereby exposing the system to increased security risks. By using this option, you understand and agree to assume all associated risks and hold <code>OpenText </code>harmless for the same.</p>\n<code>OpenText </code>encourages you to use some other password options, which aren't provided by <code>OpenText</code>. By implementing the -p option, you may expose the system to increased security risks. You understand and agree to assume all associated risks and hold <code>OpenText </code>harmless for the same. It remains at all times your sole responsibility to assess its own regulatory and business requirements. <code>OpenText </code>doesn't represent or warrant that its products comply with any specific legal or regulatory standards applicable to you in conducting your business.</div>\n</div>\n<h2>Transfer the images</h2>\n<p>If you downloaded the images to a server other than the bastion node, transfer the images to a directory on the bastion node. By default, the images should be placed under the  <code>/var/opt/cdf/offline</code> directory.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>The images will be uploaded by the uploadimages.sh script later. The image upload requires up to 2 times of the image size space in the target image directory. For example, if you choose to use the default /var/opt/cdf/offline directory, ensure that you have 2 times of the OMT and suite image size space under /var/opt/cdf/offline directory of the bastion node. </p>\n</div>\n</div>\n<p><br/>\n </p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}