{
  "title": "Bastion node can't connect to the EKS cluster",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p><br/>\nThe bastion node can't connect to the EKS cluster. When you run the \"kubectl get svc\" command on the bastion node, you can't get the expected information.</p>\n<h2 class=\"mw-headline\" id=\"Issue_1\">Issue 1</h2>\n<p>You receive the error \"no such host.\" If you try to ping the host, you get \"Name or service not known.\" For example:</p>\n<pre>[root@ip-&lt;IP&gt; ~]# kubectl get svc\nUnable to connect to the server: dial tcp: lookup &lt;domain name&gt; on &lt;IP&gt;: [null no such host]\n[root@ip-10-208-184-191 ~]# &lt;IP&gt;^C\n[root@ip-10-208-184-191 ~]# ping &lt;domain name&gt;\nping: &lt;domain name&gt;: [null Name or service not known]\n</pre>\n<h2 class=\"mw-headline\" id=\"Cause\">Cause</h2>\n<p>The <b>DNS hostnames</b> option isn't enabled on theVPC.</p>\n<h2 class=\"mw-headline\" id=\"Solution\">Solution</h2>\n<p>Select your VPC, click <b>Edit DNS hostnames</b>, enable <b>DNS hostnames</b>.</p>\n<h2 class=\"mw-headline\" id=\"Issue_2\">Issue 2</h2>\n<p>When you run the “kubect” command, you don't get a response and eventually the command times out. For example:</p>\n<pre>[centos@ip-&lt;IP&gt; tmp]$ kubectl get nodes\nUnable to connect to the server: dial tcp &lt;IP&gt;: i/o timeout</pre>\n<h2 class=\"mw-headline\" id=\"Cause_2\">Cause</h2>\n<p>EKS ControlPane’s Security Group misses rules in “Inbound” to allow bastion access. Therefore, the bastion node can't access the EKS cluster.</p>\n<h2 class=\"mw-headline\" id=\"Solution_2\">Solution</h2>\n<p>Edit the security group to enable bastion (or its subnet) access.</p>\n<h2 class=\"mw-headline\" id=\"Issue_3\">Issue 3</h2>\n<p>When you run the “kubectl get svc ” command, you got <b>error: the server doesn't have a resource type \"svc\"</b>. For example:</p>\n<pre>[centos@ip-&lt;IP&gt; tmp]$ kubectl get svc\nerror: the server doesn't have a resource type \"svc\"</pre>\n<h2 class=\"mw-headline\" id=\"Cause_3\">Cause</h2>\n<p>IAM user have more than one Access key ID. So when you create EKS cluster and run command \"aws configure\" , you didn't use the same Access key ID</p>\n<h2 class=\"mw-headline\" id=\"Solution_3\">Solution</h2>\n<p>If you EKS cluster have already created, you just configure your aws credential (running \"aws configure\" ) same with kubernetes side. Then, clear your Access key ID, only keep one as Active. And if you want to grant additional AWS users or roles the ability to interact with your cluster, you can refer to the doc.</p>\n<p>https://docs.aws.amazon.com/eks/latest/userguide/add-user-role.html</p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}