{
  "title": "Studio business rules",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Business rules are the building blocks from which the business logic of a workflow is constructed. You can define business rules for records, processes, metaphases, phases, and transitions.</p>\n<p>The following categories of business rules are available:</p>\n<ul>\n<li><b><a href=\"/doc/423/26.1/dslactionrules\" title=\"SMAX:25.1/DSLActionRules\">Action rules.</a></b> Rules that initiate an action, such as modifying data or sending an email.</li>\n<li><b><a href=\"/doc/423/26.1/dslvalidationrules\" title=\"SMAX:25.1/DSLValidationRules\">Validation rules.</a></b> Rules that validate the data in a field.</li>\n<li><b><a href=\"/doc/423/26.1/renderingrules\" title=\"SMAX:25.1/RenderingRules\">Rendering rules.</a></b> Rules that govern the appearance of the user interface.</li>\n<li><b><a href=\"/doc/423/26.1/fieldselectionrulesexamples\" title=\"SMAX:25.1/FieldSelectionRulesExamples\">Field selection rules.</a></b> Rules that control the permitted data in the user interface.</li>\n</ul>\n<p>For each rule defined, there is also an <b>Include condition</b> option, which enables you to define a condition that must be satisfied for the rule to be run.</p>\n<p>Some out-of-the-box business rules are provided in the existing workflows, which you can edit. You can also define new business rules. For more information about adding a business rule, see <a href=\"/doc/423/26.1/addbizrule\" title=\"SMAX:25.1/AddBizRule\">How to add a business rule</a>.</p>\n<h2 class=\"mw-headline\" id=\"Defining_business_rules_in_a_workflow\">Defining business rules in a workflow</h2>\n<p>Business rules can be defined at each level of a workflow:</p>\n<ul>\n<li>The record type level</li>\n<li>The process level</li>\n<li>The metaphase level</li>\n<li>The phase level</li>\n</ul>\n<p><b>Record type.</b> Select the record type from the drop-down box at the top of the screen and select the <b>Processes and Rules</b> tab. In the left pane, select the record type name (the top level of the tree). The tab displays the business rules defined for this record type, across all of its processes. Record types are provided out-of-the-box and can't be customized.</p>\n<p><b>Process.</b> In the left pane, select a process (the second level of the tree). The <b>Properties</b> tab on the right displays the properties for the selected process and the <b>Rules</b> tab displays the business rules defined for the process, across all its metaphases. The processes are unique to the records and are consumed as workflows in the application.</p>\n<p><b>Metaphase.</b> The <b>Processes and Rules</b> tab displays a workflow map for the selected process, which contains a fixed number of metaphases. Click one of the metaphases (at the top of the map) to select it. Alternatively, in the left pane, select a metaphase (the third level of the tree). The <b>Properties</b> tab on the right displays the properties for the selected metaphase and the <b>Rules</b> tab displays the business rules defined for the metaphase, across all its phases. The metaphases can be customized.</p>\n<p><b>Phase.</b> The phases are represented by the rectangles in the workflow map. Select a phase and a popup menu appears which enables you to move or delete the phase, or to add a transition or another phase. Alternatively, in the left pane, select a phase (the fourth level of the tree). The <b>Properties</b> tab on the right displays the properties for the selected phase and the <b>Rules</b> tab displays the business rules defined for the phase. The phases can be customized.</p>\n<p>You can also define business rules for transitions:</p>\n<p><b>Transition.</b> The lines between the phases in the workflow map represent the transitions between the phases. Select a transition and a popup menu appears which enables you to move or delete the transition. Alternatively, in the left pane, select a phase (the bottom level of the tree). The <b>Properties</b> tab on the right displays the properties for the selected transition, and the <b>Rules</b> tab displays the business rules defined for the transition.</p>\n<h2 class=\"mw-headline\" id=\"Business_rule_properties\">Business rule properties</h2>\n<p>To view the properties of a business rule, click <a class=\"image\" href=\"/file/images/f/f0/2018.08_Helpcenter/Resources/Images/Icons/EditIcon.png\" title=\"/file/images/f/f0/2018.08_Helpcenter/Resources/Images/Icons/EditIcon.png\"> <img alt=\"EditIcon.png\" data-file-height=\"21\" data-file-width=\"24\" height=\"21\" src=\"../../../images/EditIcon_ad95cc14.png\" width=\"24\"/> </a> <b>Edit</b> and select <b>Rule properties</b>. The Rule properties dialog box opens, displaying the ID of the rule, the last time the rule was edited, and the name of the last user to edit the rule. For locked rules, click the lock icon <a class=\"image\" href=\"/file/images/e/e7/2018.08_Helpcenter/Resources/Images/Icons/PadlockIcon.png\" title=\"/file/images/e/e7/2018.08_Helpcenter/Resources/Images/Icons/PadlockIcon.png\"> <img alt=\"PadlockIcon.png\" data-file-height=\"13\" data-file-width=\"13\" height=\"13\" src=\"../../../images/PadlockIcon_42ddff3a.png\" width=\"13\"/> </a> and select <b>Rule properties</b> to view the rule ID.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>For rules last updated before March 2016, the specific date and time of the update isn't available.</li>\n<li>Rule IDs for out-of-the-box rules generally are descriptive of the rule, for example, <b>calculateResourceDemands</b>. User-defined rules are assigned random IDs.</li>\n</ul>\n</div>\n</div>\n<h2 class=\"mw-headline\" id=\"Business_rule_syntax\">Business rule syntax</h2>\n<p>Each business rule contains at least one parameter, which you set when selecting the rule template. The parameters in the selected rule template are links. When you click a parameter, an edit box opens.</p>\n<p>For some parameters, you select the required value from a drop-down list. For others, you can enter free text. There are a number of parameters for which there exist two possible methods for entering data: <b>Simple mode</b> and <b>Expression Language</b>. In Simple mode, you enter free text or select from a list, according to the data type. In Expression Language, you enter a phrase using the Expression Language. For more information about the Expression Language, see <a href=\"/doc/423/26.1/explang\" title=\"SMAX:25.1/ExpLang\">Expression Language</a>.</p>\n<p>Click the <b>Expression Language</b> <a class=\"image\" href=\"/file/images/thumb/f/f3/SMAiconfx.png/30px-SMAiconfx.png\" title=\"/file/images/thumb/f/f3/SMAiconfx.png/30px-SMAiconfx.png\"> <img alt=\"SMAiconfx.png\" data-file-height=\"75\" data-file-width=\"79\" height=\"28\" src=\"../../../images/30px-SMAiconfx_894ae630.png\" width=\"30\"/> </a> button to toggle between these options. When the button is selected (blue), the field is in Expression Language mode. When it's not selected (white), the field is in Simple mode. For a full list of Expression Language functions, see <a href=\"/doc/423/26.1/explangfunctions\" title=\"SMAX:25.1/ExpLangFunctions\">Expression Language functions and syntax</a>.</p>\n<p>For more information about setting rule parameters, see <a href=\"/doc/423/26.1/dslvalidationrules\" title=\"SMAX:25.1/DSLValidationRules\">Validation rule examples</a>, <a href=\"/doc/423/26.1/dslactionrules\" title=\"SMAX:25.1/DSLActionRules\">Action rule examples</a>, <a href=\"/doc/423/26.1/renderingrules\" title=\"SMAX:25.1/RenderingRules\">Rendering rule examples</a>, and <a href=\"/doc/423/26.1/fieldselectionrulesexamples\" title=\"SMAX:25.1/FieldSelectionRulesExamples\">Field selection rule examples</a>.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>If the Expression Language phrase references a field from the record, you must add a condition to the rule that validates that the field has been filled in. For example, if you reference the <b>AssignedGroup</b> field, you need to include this expression: <b>${entity.AssignedGroup != null}</b>.</li>\n<li>Encrypted fields can't be added to business rules.</li>\n<li>If you have defined rules of a type that has been deprecated, you can continue to edit the existing rules, but you can't define new rules of the deprecated type.</li>\n</ul>\n</div>\n</div>\n<h2 class=\"mw-headline\" id=\"Process_events\">Process events</h2>\n<p>Rules are defined to be run in connection with specific events. The event determines when the rule is run.</p>\n<p>In the Rules tab for workflows, processes, metaphases and phases, you can define rules in connection with the following process events:</p>\n<table>\n<tbody>\n<tr>\n<th>Process event</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Before change</td>\n<td>The rule is run before any user changes are applied. Used, for example, to set default values.</td>\n</tr>\n<tr>\n<td>After change</td>\n<td>The rule is run after the data is updated. Used, for example, to run validation rules.</td>\n</tr>\n<tr>\n<td>Rendering forms</td>\n<td>The rule is run when a form is opened.</td>\n</tr>\n<tr>\n<td>After applying changes</td>\n<td>\n<p>The rule is run after the change is committed. Used, for example, to run external operations such as sending notifications, updating related records, and so on.</p>\n<p>The key difference with the <b>After change</b> process event is the order in which the events are resolved. The order is <b>After change</b>, then changes are committed, then <b>After applying changes</b>.</p>\n<p>For more information, see the <em>Process events order </em>section.</p>\n</td>\n</tr>\n<tr>\n<td>Entering</td>\n<td>The rule is run when entering the selected phase.</td>\n</tr>\n<tr>\n<td>Leaving</td>\n<td>The rule is run when leaving the selected phase.</td>\n</tr>\n<tr>\n<td>Before deleting</td>\n<td>The rule is run before the record is deleted.</td>\n</tr>\n<tr>\n<td>Before removing relationship</td>\n<td>The rule is run before a relationship to another record is removed.</td>\n</tr>\n<tr>\n<td>Before adding relationship</td>\n<td>The rule is run before a relationship to another record is added.</td>\n</tr>\n<tr>\n<td>After adding relationship</td>\n<td>The rule is run after a relationship to another record is added.</td>\n</tr>\n<tr>\n<td>After removing relationship</td>\n<td>The rule is run after a relationship to another record is removed.</td>\n</tr>\n<tr>\n<td>Per schedule</td>\n<td>The rule is run according to the specified schedule.</td>\n</tr>\n<tr>\n<td>SLT Event</td>\n<td>\n<p>The rule is run when the Service Level target duration reaches the 0%, 15%, 35%, 50%, 75%, 90%, or 100% level of the target, as defined by the rule.</p>\n<p>This process event is relevant for incidents, requests and the customized record types created in Studio only. For information on defining business rules under the SLT Event process event, see <a href=\"/doc/423/26.1/addslteventrules\" title=\"SMAX:25.1/AddSLTEventRules\">How to add Service Level Target event business rules</a>.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p>Not all of the process events are relevant for each of the workflow levels. For example, <b>Entering</b> and <b>Leaving</b> are relevant for the phase, metaphase, and process levels, but not for the record type level.</p>\n<p>When defining a business rule on a transition, there is only one process event option: <b>During transition</b>. The rule is run when the transition occurs.</p>\n<p>For process events with existing business rules, the number of rules appears in red next to the event name. Click the process event to expand it and view the rules.</p>\n<p>System rules</p>\n<p>There are business rules that appear under the process events out-of-the-box. Some of these are <b>System rules</b> which are specific to each module, and aren't editable.</p>\n<h2 class=\"mw-headline\" id=\"Process_events_order\">Process events order</h2>\n<p>Several of the process events are related and occur in a specific sequence. The order of the process events can be significant when choosing the event with which to define a business rule.</p>\n<p>If a data update to the record occurs in conjunction with a phase change, the following occur in the indicated order:</p>\n<div><a class=\"image\" href=\"/file/images/7/76/2018.08_Helpcenter/Resources/Images/EM/emProcessEventOrderUpdatedb.png\" title=\"/file/images/7/76/2018.08_Helpcenter/Resources/Images/EM/emProcessEventOrderUpdatedb.png\"> <img alt=\"Order of process events\" data-file-height=\"149\" data-file-width=\"871\" height=\"149\" src=\"../../../images/emProcessEventOrderUpdatedb_76552267.png\" width=\"871\"/> </a></div>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>When transitioning from one phase to another, the phase change occurs before the transition. Thus, the business rules defined on a transition relate to the next phase (the <b>PhaseId</b> field of the record contains the value of the phase at the second end of the transition).</p>\n</div>\n</div>\n<p>The process events connected with relationships represent a separate flow. When adding a relationship, the order of events is:</p>\n<div><a class=\"image\" href=\"/file/images/2/21/2018.08_Helpcenter/Resources/Images/EM/emProcEvenOrdAddRelation.png\" title=\"/file/images/2/21/2018.08_Helpcenter/Resources/Images/EM/emProcEvenOrdAddRelation.png\"> <img alt=\"emProcEvenOrdAddRelation.png\" data-file-height=\"157\" data-file-width=\"485\" height=\"157\" src=\"../../../images/emProcEvenOrdAddRelation_2a9ab0e3.png\" width=\"485\"/> </a></div>\n<p>When removing a relationship, the order of events is:</p>\n<div><a class=\"image\" href=\"/file/images/4/45/2018.08_Helpcenter/Resources/Images/EM/emProcEvenOrdRemoveRelation.png\" title=\"/file/images/4/45/2018.08_Helpcenter/Resources/Images/EM/emProcEvenOrdRemoveRelation.png\"> <img alt=\"emProcEvenOrdRemoveRelation.png\" data-file-height=\"177\" data-file-width=\"479\" height=\"177\" src=\"../../../images/emProcEvenOrdRemoveRelation_83018b92.png\" width=\"479\"/> </a></div>\n<p>The <b>Before deleting</b>, <b>Rendering forms</b>, and <b>Per schedule</b> process events, don't occur as part of a flow.</p>\n<h2>Business rule execution order</h2>\n<p>Business rules are executed in a certain order. Before we introduce this order, we need to understand that all rules in an event are divided into three parts:</p>\n<ol>\n<li>The first batch of locked (read-only) OOTB rules</li>\n<li>Unlocked (editable OOTB or custom) rules</li>\n<li>The second batch of locked (read-only) OOTB rules</li>\n</ol>\n<p>In an event, the business rules are executed in the following order:</p>\n<ol>\n<li>The first batch of locked (read-only) OOTB rules in Phase</li>\n<li>The first batch of locked (read-only) OOTB rules in Metaphase</li>\n<li>The first batch of locked (read-only) OOTB rules in Process</li>\n<li>The first batch of locked (read-only) OOTB rules in Global</li>\n<li>On the <strong>Rules</strong> tab of specific records (Offering, Model, Target Set, etc.), rules in the <b>Add a rule run before (entity name) record rules</b> section</li>\n<li>Unlocked (editable OOTB or custom) rules in Phase</li>\n<li>Unlocked (editable OOTB or custom) rules in Metaphase</li>\n<li>Unlocked (editable OOTB or custom) rules in Process</li>\n<li>Unlocked (editable OOTB or custom) rules in Global</li>\n<li>On the <strong>Rules</strong> tab of specific records (Offering, Model, Target Set, etc.), rules in the <strong>Add a rule run after (entity name) record rules</strong> section</li>\n<li>The second batch of locked (read-only) OOTB rules in Phase</li>\n<li>The second batch of locked (read-only) OOTB rules in Metaphase</li>\n<li>The second batch of locked (read-only) OOTB rules in Process</li>\n<li>The second batch of locked (read-only) OOTB rules in Global</li>\n</ol>\n<div><a class=\"image\" href=\"/file/images/b/be/Business_rule_execution_order.png\" title=\"/file/images/b/be/Business_rule_execution_order.png\"> <img alt=\"Business_rule_execution_order.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/b/be/Business_rule_execution_order.png\" height=\"458\" hspace=\"0\" src=\"../../../images/Business_rule_execution_order_2f5fe15d.png\" style=\"width:800px;height:458px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<p><strong>Note</strong> If two business rules have dependencies, make sure that they are executed in the desired order.</p>\n<h3>Special rules</h3>\n<p>For performance optimization, the following rules are consistently executed during the \"After applying changes\" process event, regardless of where they are initially defined. Consequently, for any subsequent rules defined beneath them within the current event (such as the \"After change\" event), it is not feasible to anticipate or rely upon the outcomes of these rules (such as the \"Create record\" rule). Thus, it is advisable to refrain from crafting logic that depends on the outcome of these rules.</p>\n<ul>\n<li>Add roles</li>\n<li>Add comment</li>\n<li>Add comment on related record</li>\n<li>Create fulfillment request</li>\n<li>Create multiple records based on relationship</li>\n<li>Create record</li>\n<li>Create record and entity link</li>\n<li>Create record and relationship</li>\n<li>Create relationship</li>\n<li>Create relationship to detected entities</li>\n<li>Create relationship and rollback</li>\n<li>Delete all relationships of one type</li>\n<li>Delete associated target definitions</li>\n<li>Delete relationship</li>\n<li>Notify users in Self-Service Portal</li>\n<li>Send comment notification</li>\n<li>Send meeting invitation</li>\n<li>Send notification</li>\n<li>Send notification with cc and bcc recipients</li>\n<li>Send notification to all reviewers</li>\n<li>Send survey for optimization</li>\n<li>Set fields on related entities</li>\n<li>Set fields on related records</li>\n<li>Set fields on related tasks</li>\n<li>Survey notification</li>\n<li>Update entity analytics</li>\n<li>Update primary data domain of person or group</li>\n<li>Update SLTs based on the appropriate SLT type<br/>\n\t </li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/processes\" title=\"SMAX:25.1/Processes\">Processes and Rules</a></li>\n<li><a href=\"/doc/423/26.1/rulesdescriptionstags\" title=\"SMAX:25.1/RulesDescriptionsTags\">Business rule descriptions and tags</a></li>\n<li><a href=\"/doc/423/26.1/dslactionrules\" title=\"SMAX:25.1/DSLActionRules\">Action rule examples</a></li>\n<li><a href=\"/doc/423/26.1/dslvalidationrules\" title=\"SMAX:25.1/DSLValidationRules\">Validation rule examples</a></li>\n<li><a href=\"/doc/423/26.1/renderingrules\" title=\"SMAX:25.1/RenderingRules\">Rendering rule examples</a></li>\n<li><a href=\"/doc/423/26.1/fieldselectionrulesexamples\" title=\"SMAX:25.1/FieldSelectionRulesExamples\">Field selection rule examples</a></li>\n<li><a href=\"/doc/423/26.1/executerest\" title=\"SMAX:25.1/ExecuteREST\">REST Execution</a></li>\n<li><a href=\"/doc/423/26.1/wflwusecase\" title=\"SMAX:25.1/WflwUseCase\">Studio - use case</a></li>\n<li><a href=\"/doc/423/26.1/addbizrule\" title=\"SMAX:25.1/AddBizRule\">How to add a business rule</a></li>\n<li><a href=\"/doc/423/26.1/modifybizrule\" title=\"SMAX:25.1/ModifyBizRule\">How to edit, remove, or disable a business rule</a></li>\n<li><a href=\"/doc/423/26.1/enrichmentrules\" title=\"SMAX:25.1/EnrichmentRules\">Enrichment rules</a></li>\n<li><a href=\"/doc/423/26.1/processrulescompare\" title=\"SMAX:25.1/ProcessRulesCompare\">Configuration Comparison</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}