{
  "title": "Enable users to edit requests in the Service Portal",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>By default, users can't edit requests in the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span>. If you have the appropriate permissions, you can enable users to edit requests in the portal. The following is a use case demonstrating one advantage of such a capability.</p>\n<ol>\n<li>A user submits a request reporting an issue with mobile phone connectivity. The user adds details of the phone and its operating system.</li>\n<li>After submitting the request, the user discovers that the phone operating system has automatically been upgraded to the latest version. Therefore, the information in the submitted request is incorrect.</li>\n<li>The user logs in to the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span>, goes to the request tracking page, and corrects the information about the operating system.</li>\n<li>Assuming Service Management is configured appropriately, the request assignee then receives notification that the user has made a change to the request. The agent reviews the change and continues to work on it.</li>\n</ol>\n<p>Another use case might be where a user discovers that a previously submitted request is about an issue that affects many colleagues. The user therefore wants to edit the request by making it public for wider viewing.</p>\n<div class=\"Admonition_Caution\">\n<p><span class=\"autonumber\">Caution</span> You must carefully consider how you configure this feature. For example, allowing the <b>Requested for</b> user to edit the <b>Requested for</b> field might result in that user's requests becoming invisible to that user.</p>\n</div>\n<h2 class=\"mw-headline\" id=\"How_to_enable_users_to_edit_requests_in_the_Service_Portal\">How to enable users to edit requests in the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span></h2>\n<p>If you have the appropriate permissions, you can enable users to edit requests in the portal by doing the following:</p>\n<h3 class=\"mw-headline\" id=\"Enable_the_editable_request_form\">Enable the editable request form</h3>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Administration &gt; Configuration &gt; <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span> Settings &gt; Feature Settings</b>.</li>\n<li>In the <b>Use the custom request form</b> field, select <b>Customized form - with tracking and editing</b>.</li>\n<li>Click <b>Save</b>.</li>\n</ol>\n<h3 class=\"mw-headline\" id=\"Add_business_rule\">Add business rule</h3>\n<p>The following business rule allows you to specify:</p>\n<ul>\n<li>What fields are editable, and</li>\n<li>When (in which specified phase) they are editable</li>\n</ul>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> By default, the editing of all fields is disabled, even if you have enabled the new request tracking page and the editable request form. This is a safety measure, so that users can only edit specified fields at specified times in the workflow, according to how you configure the feature by using the following rule.</p>\n</div>\n<ol>\n<li>\n<p>From the <span class=\"SAW_VariablesMain_menu_Starter\">Main menu</span>, select <b>Administration &gt; Configuration &gt; Studio</b>.</p>\n</li>\n<li>\n<p>In the drop-down at the top of the page, select the <b>Request</b> record type.</p>\n</li>\n<li>\n<p>Select the <b>Processes and Rules</b> tab.</p>\n</li>\n<li>\n<p>In the left pane, select <b>Request</b> at the top of the tree.</p>\n</li>\n<li>\n<p>In the main panel, in the <b>Rendering forms</b> section:</p>\n<ol start=\"1\">\n<li>\n<p>Click <b>Add</b>.</p>\n</li>\n<li>\n<p>Click <b>“If…Then” rule</b>.</p>\n</li>\n<li>\n<p>Select the <b>Restrict/allow editing of fields</b> template, and click <b>OK</b>.</p>\n</li>\n</ol>\n</li>\n<li>\n<p>Click <b>expression</b> to edit the condition for the rule. Consider using the following conditions:</p>\n<ul>\n<li>\n<p><code>entity.Id !=null</code></p>\n<p>This makes the rule applicable for requests after they have been created (they have an ID), and so doesn't apply to requests at the time of creation.</p>\n</li>\n<li>\n<p><code>current_flow.IsPortalFlow</code></p>\n<p>This makes the rule applicable to the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span> only. It therefore has no effect on agents using the main Service Management environment.</p>\n</li>\n<li>\n<p><code>entity.PhaseId=='&lt;phase name&gt;'</code></p>\n<p>Adding this part to the rule makes it applicable to request records only in the specified phase. For example, <code>entity.PhaseId=='Fulfill'</code> makes the rule applicable to only the <b>Fulfill</b> phase, so users can edit request records in that phase.</p>\n<p>If you want users to edit request records in more than one phase, but not every phase, you must add a business rule for each phase in which you want users to be able to edit requests, or add the appropriate phases with an 'OR' operator to the condition. For example:</p>\n<p><code>entity.PhaseId=='Fulfill' || PhaseId=='Review'</code></p>\n<p>If you don't add a part like this to the expression, users can edit in all phases.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> You can view the relevant phase names by clicking <b>HR Support</b>, <b>IT Service</b>, or <b>IT Support</b> in the left pane below <b>Request</b> when in <a href=\"/doc/423/26.1/processrulescompare\" title=\"SMAX:25.1/ProcessRulesCompare\">Standard mode</a>.</p>\n</div>\n</li>\n<li>\n<p>The following example expression makes the rule applicable when request records are in the <b>Fulfill</b> phase, and for a user in the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span>.</p>\n<p><code>entity.Id !=null &amp;&amp; current_flow.IsPortalFlow &amp;&amp; entity.PhaseId=='Fulfill'</code></p>\n<p>For more information, see <a href=\"/doc/423/26.1/explang\" title=\"SMAX:25.1/ExpLang\">Expression Language</a>.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Click <b>Restrict</b> and select <b>Allow</b> from the drop-down. Then click <b>OK</b>.</p>\n</li>\n<li>\n<p>Click on <strong>all fields / specific fields(optional)</strong> to specify fields.</p>\n</li>\n<li>\n<p>Click <b>Specific fields</b>. This allows a user in the portal to edit only the specified fields of a request record.</p>\n<div class=\"Admonition_Caution\">\n<p><span class=\"autonumber\">Caution</span> Do not select <b>All fields</b>, as this enables editing of all fields on the request form, and this is unlikely to be desirable. For example, you don't want users to be able to edit the <b>Solution</b> field.</p>\n</div>\n<ol start=\"1\">\n<li>\n<p>Click <b>Add item</b>.</p>\n</li>\n<li>\n<p>Select the field you want from the drop-down.</p>\n</li>\n<li>Repeat steps <b>a</b> and <b>b</b> for each field you want to add.</li>\n</ol>\n</li>\n<li>\n<p>Save your changes.</p>\n</li>\n</ol>\n<div class=\"Admonition_Caution\">\n<p><span class=\"autonumber\">Caution</span> You must take care if you add several business rules using this template. The rules are implemented in the (top to bottom) order listed on the <b>Processes and Rules</b> page for the record type. For example, if you add a business rule that enables editing of a particular field in the <b>Close</b> phase, and then a business rule that restricts editing of fields in the <b>Close</b> phase, the restrict rule will supersede. To achieve the desired effect, the restrict rule should be before the enable rule</p>\n</div>\n<h2 class=\"mw-headline\" id=\"How_to_disable_this_feature\">How to disable this feature</h2>\n<p>If, after enabling this feature, you want to disable it, either:</p>\n<ul>\n<li>Go to <span class=\"SAW_VariablesMain_menu\">main menu</span> &gt; <b>Administration &gt; Configuration &gt; <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span> Settings &gt; Feature Settings &gt; Use the custom request form</b>, and select a form other than <b>Customized form - with tracking and editing</b>, or</li>\n<li>Disable the previously added business rules.</li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}