{
  "title": "Adopt data domain segmentation for Native SACM",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>In UCMDB, the UCMDB Multi-Tenant architecture is designed to provide a logical separation of the data model into tenants. With the data model and the class model stored in UCMDB, the UCMDB Multi-Tenant solution tags each CI and resource (TQL query, View) as being owned/used by certain tenants.</p>\n<p>The UCMDB Multi-Tenant architecture serves the same purpose as SMAX data domain segmentation. When Native SACM is enabled, SMAX data domains can be synchronized to UCMDB as UCMDB tenants, thus achieving data segmentation in both systems. </p>\n<div class=\"Admonition_Important\"><span class=\"autonumber\">Important:</span> UCMDB and SMAX both have the concept of \"tenant,\" but it's important not to mix up the concept of UCMDB tenants and SMAX tenants. For more information, see:\n\n<ul>\n<li>SMAX <a href=\"/doc/423/26.1/tenantmgmt\">Tenants</a></li>\n<li>SMAX <a href=\"/doc/423/26.1/sacmds\">Data domain segmentation for SACM</a></li>\n<li>UCMDB <a href=\"/doc/401/2023.05/mtmcarchitect\">Multi-Tenancy Architecture vs. Multi-Customer Architecture</a> (Classic UD/UCMDB) or <a href=\"/doc/403/25.4/mtmcarchitect\">Multi-Tenancy Architecture vs. Multi-Customer Architecture</a> (Containerized UD/UCMDB)</li>\n</ul>\n<p>In short, SMAX tenants correspond to UCMDB customers, while SMAX data domains correspond to UCMDB tenants. </p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<thead>\n<tr>\n<th scope=\"col\">SMAX concepts</th>\n<th scope=\"col\">Correlated UCMDB concepts</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>SMAX tenant</td>\n<td>UCMDB customer</td>\n</tr>\n<tr>\n<td>SMAX data domain</td>\n<td>UCMDB tenants</td>\n</tr>\n</tbody>\n</table>\n</div>\n<ul>\n</ul>\n<h2>Synchronization rules between SMAX data domains and UCMDB consumer tenants</h2>\n<p>While synchronizing SMAX data domains and UCMDB tenants, SMAX is used as the predominant source. Therefore, we recommend that you manage the data domains only in Service Management and synchronize your changes to UCMDB tenants. For details of the <strong>Data Domains</strong> list, see <a href=\"/doc/423/26.1/managedatadomains\">Manage the Data Domains list</a>.</p>\n<p>The synchronization comes with the following general rules:</p>\n<ul>\n<li>The synchronization only takes place when you click the <strong>Save</strong> button on the <strong>Data domains</strong> list page. For example, you create a new data domain in Service Management, when you click <strong>Save</strong>, a new tenant is created in UCMDB. Or, when you update the display name of an existing data domain in Service Management and click <strong>Save</strong>, the display name of the tenant will also be updated in UCMDB.</li>\n<li>Although unrecommended, if you have the display name of a tenant updated or create a new tenant in UCMDB, you can use the <strong>Sync</strong> button on the <strong>Data domains</strong> list page to synchronize the change to Service Management. When you click <strong>Sync</strong>, SMAX runs a consistency check and prompts that there are changes made in UCMDB and asks if you want to load them to Service Management. Click <strong>Yes</strong>, the changes will be shown on the <strong>Data domains</strong> list page and the <strong>Save</strong> button becomes clickable. Be aware that it's only a preview, only when you click the <strong>Save</strong> button, the changes are actually made in Service Management.</li>\n<li>The naming conventions of SMAX data domains and UCMDB tenants are different. The name of a SMAX data domain can only contain English letters and numbers and must start with an upper-case letter. That also means no spaces and special characters are allowed in a SMAX data domain name. However, special characters and spaces are allowed in a UCMDB tenant name. Therefore, when you create a UCMDB tenant (especially the UCMDB default tenant), it is important to make sure this UCMDB tenant follows the SMAX naming convention.</li>\n<li>SMAX doesn't allow you to delete data domains. If you accidentally have a tenant deleted in UCMDB, you can click the <strong>Sync</strong> button in Service Management, the consistency check will find out there is a tenant missing in UCMDB. A message will pop up and ask you if you want to synchronize the corresponding data domain to the UCMDB tenant. </li>\n<li>Data domains can be disabled in Service Management, while UCMDB consumer tenants can't. After you disable a data domain in Service Management, new records can no longer be created with this data domain, however, this data domain still takes effect for existing records, you will observe a strikethrough over the data domain value. As a UCMDB tenant can't be disabled, even if you disable the corresponding data domain in Service Management, you still can create new CIs with this tenant in UCMDB. The newly created CIs will still be synchronized to SMAX with the data domain that has been disabled. Likewise, you will see a strikethrough over the data domain value. </li>\n<li>SMAX allows up to 1,000 data domains, if you have more than 1,000 tenants in UCMDB and try to synchronize, an error message is displayed.  </li>\n<li>When working in a UCMDB multi-tenancy environment, it is often necessary to apply the same tenancy definitions to many CIs. A convenient way to do this is by using <b>Tenant Association rules</b>, which are a form of Enrichment rules. You define Tenant Association rules in the Enrichment Manager in the same way that you define Enrichment rules. For details, see <a href=\"/doc/401/2023.05/uptenantassocrul\">Tenant Association Rules</a> (Classic UD/UCMDB) or <a href=\"/doc/403/25.4/uptenantassocrul\">Tenant Association Rules</a> (Containerized UD/UCMDB).</li>\n</ul>\n<h2>Limitations</h2>\n<h3>On-the-fly data domain creation </h3>\n<p>SMAX doesn't support the on-the-fly creation of data domains. If you have a UCMDB tenant that has not been synchronized to a SMAX data domain, when a CI that belongs to this UCMDB tenant is created or discovered in UCMDB, neither this UCMDB tenant nor this CI will be synchronized to Service Management.</p>\n<p>To work around this, synchronize UCMDB tenants to SMAX data domains, and then use REST calls to re-migrate all UCMDB CIs.</p>\n<h3>Naming conventions of SMAX data domains and UCMDB tenants</h3>\n<p>Any UCMDB tenants that do not comply with the SMAX data domain naming convention ([A-Z][a-zA-Z0-9]*) will be rejected by Service Management,and all UCMDB CIs of these tenants will also be dropped by Service Management. For example, you have enabled multi-tenancy in a standalone UCMDB system, in which you have UCMDB tenant names with special characters or spaces. Then, you try to connect SMAX and UCMDB through Native SACM. In this scenario, these UCMDB tenants can't be synchronized.  </p>\n<p>To work around this, before starting the integration between SMAX and UCMDB, a UCMDB admin needs to define new UCMDB tenants (as replacements) that comply with the SMAX data domain name convention (for example, \"IT\" rather than \"it\"), adjust all UCMDB consumer tenant association rules to reset all these CIs' consumer tenants to new UCMDB tenants, and then synchronize them to Service Management.</p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}