{
  "title": "Enable Native SACM in Service Management",
  "content": "<div class=\"mw-parser-output\">\n<div></div>\n<h2>Sample data</h2>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>Sample data is for demo or testing purposes. </div></div></div>\n<p>To deploy sample data for an environment planned to run in the Native SACM mode, we recommend that you follow these steps:</p>\n<ol>\n<li>Deploy a new trial tenant in Suite Administration but DO NOT activate Native SACM yet.</li>\n<li>Once the tenant is active, deploy the Service Management sample data.</li>\n<li>Once the sample data is deployed, go back to the Suite Administration and activate Native SACM by following the steps in the relevant sections of this topic. During the activation of Native SACM, the sample data and service models are migrated to UCMDB.</li>\n</ol>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>If you activate Native SACM prior to deploying the sample data, the data will not be completely migrated to UCMDB. Especially, the relationships between CIs will be missing. Therefore, if you intend to use the sample data, make sure to follow the steps above.</div></div></div>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>Additional data can be directly loaded into UCMDB using the Package Manager or using the JMX console.</div></div></div>\n<h2>Prerequisites</h2>\n<p>Perform the following prerequisite steps.</p>\n<h3>Step 1. Double check Service Management devices with the OS type \"Unknown\"</h3>\n<p>An \"Unknown\" OS family in UCMDB may impact reconciliation and cause duplicated CIs. To avoid this, we strongly recommend that you update existing Service Management devices with the OS type \"Unknown\" to another specific value or leave the OS type blank. If you can accept this risk and need to have Service Management devices with the OS type \"Unknown\", you must manually add an \"Unknown\" value to OsFamily list attribute in UCMDB to avoid the migration error. </p>\n<p>If you have a custom <strong>OS type </strong>in Service Management, you must also create a corresponding <strong>OsFamily</strong> (list) value in UCMDB. For more information about the federation, see <a href=\"/doc/423/26.1/tsnativesacmostype\" title=\"Federation between SMA OS type and UCMDB OsFamily\">Federation between Service Management OS type and UCMDB OsFamily</a>.</p>\n<p>To add a custom value to the <strong>OsFamily </strong>value list in UCMDB, follow these steps:</p>\n<ol>\n<li>Go to <strong>CI Type Manager</strong> in UCMDB UI or UCMDB Local Client.</li>\n<li>Select <strong>System Types</strong> from the <strong>CI Types</strong> drop-down list.</li>\n<li>Search for and open <strong>OsFalimly</strong>.</li>\n<li>Add the corresponding value to the value list. For example, if you have a custom <strong>OS type</strong> value \"Macintosh_c\" in Service Management, you must create an <strong>OsFamily </strong>value \"Macintosh\" in UCMDB.</li>\n<li>Save the change.</li>\n</ol>\n<h3>Step 2. Double-check Service Management business rules are in place to initialize CI SubTypes according to CI types</h3>\n<p>If a tenant is newly deployed, a set of Set SubTypes business rules are available by default, no additional actions are required.</p>\n<p>If a tenant is upgraded from an earlier version, we strongly recommend that you adopt these new <a href=\"/doc/423/26.1/performpostupgradetaskstenantadmin#Perform_tasks_for_Native_SACM\" title=\"Set SubTypes\">Set SubTypes</a> rules for consistent and accurate Subtype initialization. Otherwise, the CIs' subtypes can't be properly initialized when they are being synchronized from UCMDB.</p>\n<h3>Step 3. Prepare a UCMDB login user who can access the UCMDB database</h3>\n<p>We recommend that you create a unique account with the SuperAdmin role in UCMDB for this integration such as <strong>smax_integration</strong> so that the updates made to CIs in UCMDB will be clearly indicated as being made by the suite. </p>\n<h4>If IdM is not used for user management</h4>\n<p>Create the user through the UCMDB local client. See <a href=\"/doc/401/2023.05/ugwkflw\" title=\"Users and groups workflow\">Users and groups workflow for details</a>. </p>\n<h4>If IdM is used for user management</h4>\n<p><span style='color: rgb(51, 51, 51); font-family: Roboto, \"Apple Color Emoji\", \"Segoe UI Emoji\", \"Segoe UI Symbol\";'>Create the user through IdM. To do this, you can create the UCMDB integration admin user in the suite IdM portal by following the instructions below.</span></p>\n<ol>\n<li>\n<p>Log in to the IdM Portal (<strong>https://<i>&lt;External_Access_Host&gt;</i>/idm-admin</strong>) with the <strong>suite-admin</strong> account.</p>\n<ul>\n<li>\n<p>For classic UD/UCMDB deployment, navigate to the <strong>SYSBO </strong>organization, and then click it.</p>\n</li>\n<li>\n<p>For containerized UD/UCMDB deployment, navigate to the IdM organization that correlates with the Service Management tenant and the UCMDB Consumer customer, and then click it. For example, the IdM organization can be <strong>654596672</strong>.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Go to <strong>Users</strong> in the navigation pane, click <a class=\"image\" href=\"\"> <img alt=\"cms-sl-idm-new.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/a/a0/cms-sl-idm-new.png\" height=\"15\" hspace=\"0\" src=\"../../../images/cms-sl-idm-new_b6e6c9ab.png\" style=\"width:16px;height:15px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"16\"/> </a> in the toolbar. The ADD USER page opens.</p>\n</li>\n<li>\n<p>Provide values as described below and click <b>SAVE</b>.</p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Field (*required)</th>\n<th scope=\"col\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Name *</td>\n<td>Name of the new user. To avoid confusion later, let's enter the user name as <b>smax-integration</b>. </td>\n</tr>\n<tr>\n<td>Display Name *</td>\n<td>Display name of the new user. Use <b>smax-integration</b> in this case.</td>\n</tr>\n<tr>\n<td>Password *</td>\n<td>Specifies a password for the UCMDB integration admin user.</td>\n</tr>\n<tr>\n<td>Type *</td>\n<td>Select <strong>SYSTEM</strong>.</td>\n</tr>\n<tr>\n<td>Password Policy</td>\n<td>Leave the field empty.</td>\n</tr>\n<tr>\n<td>Direct Roles</td>\n<td>Select <strong>SuperAdmin [SuperAdmin/CMDB]</strong> to assign the UCMDB SuperAdmin role to this admin user</td>\n</tr>\n<tr>\n<td>User Attributes</td>\n<td>Leave empty.</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>Click <strong>SAVE. </strong>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>When selecting type <strong>SYSTEM</strong>, if a user has not been assigned a password policy, a \"defaultFor=SYSTEM\" password policy will be applied upon clicking <strong>SAVE</strong>. </div></div></div>\n</li>\n</ol>\n<h2>Data precheck</h2>\n<p>This section summarizes the preparation steps to handle the potential CI data issues (e.g., data configuration and format) that might exist in both Service Management and UCMDB before Native SACM can be activated. <br/>\nWe recommend that you manually fix these potential data issues before starting the Native SACM migration for the first time in Suite Administration.</p>\n<h3>Manual Pre-check on CI data</h3>\n<h4>Step 1. Pre-check Service Management data domain and UCMDB tenant definition</h4>\n<p>Because the <strong>All Tenants</strong> tenant in UCMDB is equivalent to the default data domain <strong>Public </strong>in Service Management, you need to configure <strong>All Tenants</strong> as the default tenant in UCMDB to align the configurations on the two sides for Native SACM. There are three scenarios.</p>\n<h5>Scenario 1. Service Management has the \"Public\" domain only and UCMDB Multi-Tenancy has not been enabled</h5>\n<p>No action is needed if the Service Management version is 2021.05 or later. </p>\n<p>For earlier versions of Service Management, please contact support for a hotfix. </p>\n<h5>Scenario 2. Service Management has additional domains (e.g., IT, HR, Finance) and UCMDB Multi-Tenancy has not been enabled</h5>\n<p>If multiple data domains exist in Service Management , you must enable UCMDB Multi-Tenancy first. To do this, go to the UCMDB JMX Console, disable the CI owner tenant, and then call the <strong>enableTenant</strong> method with the <strong>tenantName</strong> parameter set to <strong>All Tenants</strong>.</p>\n<p>For reference, see <a href=\"/doc/423/26.1/enableucmdbmt\" title=\"(Optional) Enable UCMDB Multi-Tenancy\">(Optional) Enable UCMDB Multi-Tenancy</a>.</p>\n<h5>Scenario 3. Service Management has additional domains (e.g., IT, HR, Finance) and UCMDB Multi-Tenancy has been enabled</h5>\n<p>When Service Management has multiple data domains and UCMDB has multiple tenants configured, you must align the default UCMDB tenant setting with the Service Management <strong>Public</strong> domain. To do this, follow these steps:</p>\n<ol>\n<li>In the UCMDB JMX Console, call the <strong>setGlobalDefaultTenant</strong> method to change the system default tenant to <strong>All Tenants</strong>. Note that this name is fixed and unchangeable.<br/>\n\tThis action sets <strong>All Tenants</strong> as the default tenant at the system level and the change will take effect for newly created customers. You can view the global default tenant by invoking the <strong>getGlobalDefaultTenant</strong> JMX method.</li>\n<li>If one or more customers already exist, perform the following steps for each of them:\n\t<ol start=\"1\">\n<li>Call the <strong>setTenantAsDefault</strong> JMX method to change the default tenant to <strong>All Tenants</strong>.</li>\n<li>You can view the default tenant of a consumer customer by invoking the <strong>getDefaultTenant</strong> JMX method.</li>\n<li>Use an enrichment rule to move CIs from the original default tenant to <strong>All Tenants</strong> as needed.<br/>\n\t\tFor how to use enrichment rules to assign UCMDB tenants, see <a href=\"/doc/401/2023.05/uptenantassocrul\" title=\"Tenant association rules\">Tenant Association Rules</a> (Classic UD/UCMDB) or <a href=\"/doc/403/25.4/uptenantassocrul\" title=\"Tenant association rules\">Tenant Association Rules</a> (Containerized UD/UCMDB).</li>\n<li>If the <strong>System Default Tenant</strong> exists, move CIs owned by this tenant to other tenants, and then delete it.</li>\n</ol>\n</li>\n</ol>\n<p><strong>Note:</strong> For UCMDB customers, be aware that CIs assigned to <strong>All Tenants</strong> are accessible to all users.</p>\n<p>For more information about how to change the default tenant in UCMDB, see <a href=\"/doc/401/2023.05/changecmsdefaulttenant\" title=\"Change default tenant\">Change default tenant</a> (Classic UD/UCMDB) or <a href=\"/doc/403/25.4/changecmsdefaulttenant\" title=\"Change default tenant\">Change default tenant</a> (Containerized UD/UCMDB).</p>\n<h4>Step 2. Pre-check CI data information in Service Management and UCMDB</h4>\n<p>All of the following steps are strongly recommended <strong>before </strong>the data migration.</p>\n<h5>Step 2.1. Global ID check for UD/UCMDB CIs </h5>\n<p>The UCMDB Global ID serves as the key linkage field between Service Management and UCMDB, which means that all UCMDB CIs without a global ID will be ignored during the migration. Therefore, make sure all federated UCMDB CIs have a global ID so that they can be properly synchronized to Service Management. Federated UCMDB CIs include the following CI types (including all sub-CI types).</p>\n<ul>\n<li>Service</li>\n<li>Business Application</li>\n<li>Application Resource</li>\n<li>Application System</li>\n<li>Running Software</li>\n<li>Cloud Service</li>\n<li>Node</li>\n</ul>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div><br/>\nFor data push integrations of multiple UCMDB servers, for example, during SaaS onboarding process, you need to ensure that the CIs' global IDs will not be overwritten after the CIs are pushed from the source UCMDB server to the target UCMDB server. To do this, you can:\n<ol>\n<li class=\"Admonition_Note\">Access to the JMX console.</li>\n<li class=\"Admonition_Note\">Use the <code>getGlobalID</code> command in the UCMDB JMX Quick Search page.</li>\n<li class=\"Admonition_Note\">Make sure that the <code>getGlobalID</code> command returns \"All\" in the response.</li>\n<li class=\"Admonition_Note\">If the result is not \"All\", you need to do these steps:\n\t<ol>\n<li class=\"Admonition_Note\">Go to JMX console &gt; <strong>setAsGlobalIdGenerator</strong></li>\n<li class=\"Admonition_Note\">Fill in <strong>customerID</strong>; Leave <strong>dbTimeout</strong> as empty; Set <strong>overWriteE</strong><strong>xistingGlobalIDs</strong> as <strong>False</strong>.</li>\n<li class=\"Admonition_Note\">Click <b>Invoke</b>.</li>\n</ol>\n</li>\n</ol>\n</div></div></div>\n<h5>Step 2.2. List consistency check </h5>\n<p>You need to make sure all List values are aligned between Service Management and UCMDB. A typical out-of-the-box example is Service Management OsType and UCMDB OsFamily. For more information, refer to <a href=\"/doc/423/26.1/enablenativesacminsma#Prerequisites\" title=\"Step 1. Double check SMAX devices with 'Unknown' OS type\">Step 1. Double check Service Management devices with the OS type \"Unknown\"</a>.</p>\n<p>For the migration process, only the Service Management OsType and UCMDB OsFamily are required to be aligned. </p>\n<h5>Step 2.3. Complex type data format check </h5>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>All complex type data will be federated from UCMDB and are truly valid after Native SACM is enabled. Therefore, if you don't need to push Service Management local complex-type data into UCMDB, you can skip this precheck step and ignore all complex-type-related errors in the migration report.</div></div></div>\n<p>In Service Management, there are 6 complex-type fields for the Device record type, which are CPUs, DiskDevices, FileSystems, IpAddresses, NetworkCards, and RunningSoftwares. All sub-attributes of these fields are of the string type, which is not accepted by the corresponding UCMDB attribute definition. You need to go to <strong>Studio</strong> &gt; <strong>Device</strong>, detect unaligned data values, then correct them In Service Management prior to the migration. </p>\n<div><a class=\"image\" href=\"\"> <img alt=\"Native_Sacm_Saas_5.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/7/79/Native_Sacm_Saas_5.png\" height=\"338\" hspace=\"0\" src=\"../../../images/Native_Sacm_Saas_5_607be3e8.png\" style=\"width:480px;height:338px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"480\"/> </a></div>\n<p>The following table covers the sub-attributes of complex type fields, which need special attention. You can use this table to check Service Management local complex type values and make adjustments if any of them don't comply with UCMDB data requirements.</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<thead>\n<tr>\n<th scope=\"col\">SN</th>\n<th scope=\"col\">Complex Type Attributes</th>\n<th scope=\"col\">Data Format Required by UCMDB</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>1</td>\n<td>IP address type</td>\n<td>IpV4 or IpV6 only, as they are ENUM values in UCMDB.</td>\n</tr>\n<tr>\n<td>2</td>\n<td>IP address value</td>\n<td>Keep 4 segments (e.g. 192.168.56.33) for IpV4, and 8 segments for IpV6 (e.g., 2001:3CA1:010F:001A:121B:0000:0000:0010), otherwise they will not be accepted by UCMDB.</td>\n</tr>\n<tr>\n<td>3</td>\n<td>CPU ID</td>\n<td>String type<br/>\n<strong>Note:</strong> This field is mandatory.</td>\n</tr>\n<tr>\n<td>4</td>\n<td>CPU clock speed</td>\n<td>Integer only</td>\n</tr>\n<tr>\n<td>5</td>\n<td>Disk device size</td>\n<td>Integer only</td>\n</tr>\n<tr>\n<td>6</td>\n<td>File system size</td>\n<td>Double only</td>\n</tr>\n<tr>\n<td>7</td>\n<td>Network speed</td>\n<td>Integer only</td>\n</tr>\n<tr>\n<td>8</td>\n<td>Running software ports</td>\n<td>Integer only, single port only<br/>\n<strong>Note:</strong> Multiple ports are not supported by the migration.</td>\n</tr>\n</tbody>\n</table>\n<p><span style=\"color: rgb(0, 0, 0); font-family: Roboto, sans-serif;\">Step 2.4. Empty display label check for Service Management CIs</span></p>\n<p>Service Management allows for creating CIs via REST call or importing via .csv, so some Service Management local CIs may have empty display labels even though this field will always be set via UI. However, in many cases, an empty CI name is not supported by UCMDB, which is mapped by Service Management CI display label during migration. Therefore, you need to find every Service Management local CI with an empty display label and set a proper value, especially for Actual Service, Service Component, and System Element.</p>\n<p>For Device, UCMDB has reconciliation rules to uniquely identify one CI with different attributes, for example, BIOS UUID, BIOS Serial Number, or BIOS Asset Tag.</p>\n<p>In order for a successful migration, you need to make sure at least one of these key attributes In Service Management Device is not empty. For example:</p>\n<ul>\n<li>Hostname</li>\n<li>Serial number</li>\n<li>BIOS UUID</li>\n<li>BIOS serial number</li>\n<li>BIOS asset tag</li>\n<li>Net BIOS name</li>\n</ul>\n<p>Specifically, for the display label, you can use one Service Management business rule that figures out the display label. As shown in the example below, you can set the hostname or other attributes which will be copied as the display label.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"Native_Sacm_Saas_6.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/b/b0/Native_Sacm_Saas_6.png\" height=\"97\" hspace=\"0\" src=\"../../../images/Native_Sacm_Saas_6_07dcaa05.png\" style=\"width:624px;height:97px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"624\"/> </a></div>\n<h5>Step 2.5. Duplicate display labels check for Service Management CIs</h5>\n<p>Service Management locally allows duplicated display labels for all SACM records, the current logic during migration maps the Service Management CI display label to the UCMDB CI name for Device, Service Component, Actual Service, and the UCMDB CI discovered product name (for Service Management system element). However, UCMDB by default doesn't accept identical names among different CIs, therefore the duplicated CIs existing on the Service Management side will be rejected by UCMDB.</p>\n<p>In a real-world environment, duplicated CIs existing on the Service Management side are mostly caused by the old OPB-based integration and have been moved to <strong>End of Life</strong> or <strong>Final</strong> metaphase already. Hence, if these Service Management CIs are rejected by UCMDB, the migration mechanism will automatically re-push them to UCMDB with the <strong>discovery_state</strong> attribute set to <strong>Purgeable</strong>, this<strong> </strong>will bypass the UCMDB reconciliation and will be accepted by UCMDB. This solution reduces the orphan CIs left In Service Management, thus improving the CI consistency between Service Management and UCMDB.</p>\n<p>Note that for any existing CI in UCMDB before the migration, no <strong>Purgeable</strong> flag will be set during the migration. Instead, the flag will be set by UCMDB when these CIs have aged with the enhanced CI lifecycle after Native SACM is enabled.</p>\n<p>If the duplicated CIs exist on the Service Management side aren't at <strong>End of Life</strong> or <strong>Final</strong> metaphases, additional steps are still needed according to different record types.</p>\n<ul>\n<li>For Actual Services and Service Components, you need to update their display labels to different ones, or remove the duplicate CIs, or move them to the <strong>Final</strong> metaphase. In addition, you can refer to <a href=\"/doc/423/26.1/nsacmaviodduplicatedcis\" title=\"How to prevent duplicated CIs from being created in Service Management\">How to prevent duplicated CIs from being created In Service Management</a> to define validation business rules to avoid creating duplicated service/service component CIs in the future. If you want to keep the duplicated services and service components In Service Management, you need to perform the following steps to remove UCMDB identification rule before the migration:\n\n\t<ol>\n<li>Go to the UCMDB CI Type Manager.</li>\n<li>Select the <strong>BusinessService</strong> CI Type.</li>\n<li>In the <strong>Identification</strong> pane, set the identification method to <b>No identification</b>.</li>\n<li>Save the change.</li>\n<li>Repeat step 2 to step 4 for the <strong>InfrastructureService</strong> and <strong>BusinessApplication </strong>CI Type.</li>\n</ol>\n</li>\n<li>For System Elements, currently, only Service Management Running Software will be migrated to UCMDB, and duplicated discovered product names aren't allowed among multiple Running Software associated with one single node in UCMDB. Therefore, we recommend that you update their display labels to different ones, or remove the duplicated CIs, or move them to <strong>End of Life</strong> metaphase before the migration.</li>\n<li>For Devices, similarly, we recommend that you update their display labels to different ones, or remove the duplicated CIs, or move them to <strong>End of Life</strong> metaphase before the migration. In addition, you can refer to <a href=\"/doc/423/26.1/nsacmaviodduplicatedcis\" title=\"How to prevent duplicated CIs from being created in Service Management\">How to prevent duplicated CIs from being created In Service Management</a> to define validation business rules to avoid creating duplicated devices in the future.</li>\n</ul>\n<h5>Step 2.6. Review Service Management Business Rules</h5>\n<p>Some custom business rules may conflict with the CI notification of Native SACM, please review the following types of business rules and make adjustments as needed.</p>\n<ul>\n<li>\n<p>The business rule <strong>Define fields as mandatory</strong>. For example, if a customer defines any fields (either Service Management local or federation fields) as mandatory for Device through this rule, all UCMDB nodes can't be synchronized to Service Management (either creating or updating) if UCMDB can't populate the mandatory field values (e.g., Service Management local field \"Owner\" or federation field \"Serial number\"). To avoid this, please either <a href=\"/doc/423/26.1/nativesacmfunction#Use_the_NativeSACMCISync_field_for_restriction_business_rules\" title=\"add a condition with the NativeSACMCISync field\">add a condition with the NativeSACMCISync field</a> or make sure all mandatory fields are not empty for existing Service Management and UCMDB CIs before enabling Native SACM.</p>\n</li>\n<li>\n<p>The business rule <strong>Define fields as read-only</strong>. For example, if a customer defines any federation fields (e.g., \"Serial number\" or \"Subtype\") as read-only for Device through this rule, UCMDB nodes can be synchronized to Service Management. However, after Native SACM is enabled, any CI notifications including \"Serial number\" or \"Subtype\" will fail and cause CI inconsistency. To avoid this, please <a href=\"/doc/423/26.1/nativesacmfunction#Use_the_NativeSACMCISync_field_for_restriction_business_rules\" title=\"add a condition with the NativeSACMCISync field\">add a condition with the NativeSACMCISync field</a>.</p>\n</li>\n<li>\n<p>The business rule <strong>Restrict editing of fields</strong>. For example, if a customer restricts editing of any federation fields (e.g., \"Serial number\" or \"Subtype\") for Device through this rule, all UCMDB nodes can't be synchronized to Service Management (either creating or updating). To avoid this, please <a href=\"/doc/423/26.1/nativesacmfunction#Use_the_NativeSACMCISync_field_for_restriction_business_rules\" title=\"add a condition with the NativeSACMCISync field\">add a condition with the NativeSACMCISync field</a> or exclude all federation fields from the rules.</p>\n</li>\n</ul>\n<h4>Step 3. Configure Native SACM settings and trigger Migration in Suite Administration</h4>\n<p>By now you have fixed the known data issues and you can start to enable Native SACM in Suite Administration. </p>\n<h2>Check the status of the platform-offline-ng pod</h2>\n<p>For Native SACM to work, the itom-xruntime-platform-offline-ng pod must be up and running. Out of the box, this pod is started. If it's stopped in your environment, run the following command on a control plane node or the bastion node to start it: </p>\n<p><code>kubectl scale deployment itom-xruntime-platform-offline-ng -n $(kubectl get namespace |grep itsma | cut -f1 -d \" \") --replicas=1</code></p>\n<h2>Enable Native SACM in Suite Administration</h2>\n<p>After you have Service Management, UCMDB Server, and UCMDB Gateway/Containerized UD/UCMDB all set up, you can enable Native SACM by following these steps:</p>\n<ol>\n<li>Log in to the Suite Administration (https://&lt;hostname&gt;:443/bo) with your <i><b>suite-admin</b></i> credentials.</li>\n<li>Either deploy a new tenant or select an existing tenant.<br/>\n<b>Note:</b> If you deploy a new tenant, remember to update the Service Management settings in the UCMDB Gateway config file. Restart the Gateway service after you adjust the config file.</li>\n<li>In tenant settings, go to the <b>Application settings</b> tab.</li>\n<li>Change the <b>Native SACM enabled</b> setting to <b>Yes</b>.</li>\n<li>Configure the following Native SACM settings:\n\t<ul>\n<li><b>UCMDB gateway service</b>: The URL of the UCMDB Gateway server. Enter a URL in this format: <code>http(s)://&lt;FQDN&gt;:&lt;port&gt;/cms-gateway</code>. The <code>&lt;port&gt;</code> is mandatory. For example: <code>https://cmsdemo01.mycompany.net:3443/cms-gateway</code>\n<ul>\n<li>\n<div>For external UD/UCMDB (classic mode), see <a href=\"/doc/423/26.1/nativesacmucmdb\" title=\"Install UD/UCMDB for Native SACM\">Install UD/UCMDB for Native SACM</a> for the UCMDB gateway URL.</div>\n</li>\n<li>For containerized UD/UCMDB (multi-deployment mode), the UCMDB gateway service is set up within UCMDB, see <a href=\"/doc/423/26.1/installcmshelm\" title=\"(Optional) Install containerized UD/UCMDB (on-premises)\">(Optional) Install containerized UD/UCMDB (on-premises)</a> or <a href=\"/doc/423/26.1/installcmshelmeks\" title=\"(Optional) Install containerized UD/UCMDB (EKS)\">(Optional) Install containerized UD/UCMDB (EKS)</a> for the UCMDB gateway URL.</li>\n<li>If the UCMDB Gateway is installed in the same cluster as the containerized UD/UCMDB, use the port that UD/UCMDB is accessed by the Gateway.</li>\n<li>If the control plane and worker nodes have disabled access on the outbound port, make sure the outbound port access to the UCMDB Gateway public port (e.g., 3443 for Classic UCMDB Gateway) is enabled on the control plane and worker nodes. This needs to be done before you configure and test Native SACM connections.</li>\n</ul>\n</li>\n<li><b>UCMDB customer ID</b>: The customer ID of UCMDB.</li>\n<li><b>UCMDB username</b>: UCMDB login user who can access the UCMDB database. We recommend that you create a unique account with the Admin or SuperAdmin role in UCMDB for this integration such as <strong>smax_integration</strong> so that the updates made to CIs in UCMDB will be clearly indicated as being made by the suite. </li>\n<li><b>UCMDB password</b>: Password for the UCMDB login user. <b>Note</b>: The combination of the UCMDB Gateway URL and the UCMDB customer ID must be unique in a suite environment and can only be used for one tenant.</li>\n</ul>\n</li>\n<li>Click <b>TEST CONNECTION</b> to verify if your Native SACM settings are correct. Make changes accordingly based on the test results.</li>\n<li>Click <b>SAVE</b>.</li>\n</ol>\n<p><b>Note:</b> The current push adapter in UCMDB is no longer supported when Native SACM is active in a Service Management tenant.</p>\n<p>After you configure Native SACM and click <b>SAVE</b>, an automatic precheck mechanism is triggered to examine the data consistency between Service Management and UCMDB. </p>\n<p>It is expected that there is a data mismatch of CIs between Service Management and UCMDB. You will get the following popup window.</p>\n<h2>Data migration</h2>\n<div><a class=\"image\" href=\"\"> <img alt=\"pn_image_5ecb56a8053be0.82756362.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/f/f1/pn_image_5ecb56a8053be0.82756362.png\" height=\"333\" hspace=\"0\" src=\"../../../images/pn_image_5ecb56a8053be0.82756362_45111773.png\" style=\"width:697px;height:333px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"697\"/> </a></div>\n<p>The popup window indicates that Service Management has detected CIs that are different between Service Management and UCMDB, so a data migration is needed. Since you have already fixed the known data issues In Service Management and UCMDB, you can go ahead to click <strong>MIGRATE</strong> to start the migration. If all issues are resolved the migration will succeed and Native SACM will be automatically enabled and set to active. </p>\n<p>After you click the <strong>MIGRATE</strong> button in the pop-up window shown above, the following data is synchronized between Service Management and UCMDB.</p>\n<h3>Device, Service Component, and Actual Service records</h3>\n<p>For each Device, Service Component, and Actual Service record, a corresponding CI is created in UCMDB.</p>\n<h3>System elements</h3>\n<p>For each system element linked to a Device record, a corresponding CI and a composition CI relationship are created in UCMDB. System elements with the following subtypes are created in UCMDB.</p>\n<ul>\n<li>Running Software</li>\n<li>Web Server</li>\n<li>Database</li>\n<li>Application Server</li>\n</ul>\n<h3>CI relationships</h3>\n<p>For CI relationships created and managed in Service Management, UCMDB APIs are called to create corresponding CI relationships in UCMDB. </p>\n<h3>Complex attributes</h3>\n<p>Complex attributes of Device records (IpAddress, File System, Disk Device, Network Card, CPU, and Running Software) are also synchronized to UCMDB, including proper CI relationships. In the other direction, all Native-SACM-federated CIs will also be synchronized from UCMDB to Service Management. For details, see <a href=\"/doc/423/26.1/nativesacmfunction#Federated_CI_types\" title=\"Federated CI types\">Federated CI types</a>.</p>\n<p><strong>Note</strong> When CIs are synchronized from UCMDB to Service Management:</p>\n<ul>\n<li>CIs with valid sd_type or empty sd_type<strong> </strong>get synchronized to Service Management.</li>\n<li>CIs with <strong>not-applicable</strong> or invalid sd_type values are not synchronized. </li>\n</ul>\n<p>In case the migration identifies errors, the errors will be tracked in the migration report. You can download and review the report and fix the issues according to your actual business needs. You are recommended but not forced to fix all the issues. For example, if some Service Management local CI relationships fail to be migrated, and if you believe UD can discover those CI relationships in a more accurate manner and this error can be accepted anyway, it is okay for you to leave it as is.</p>\n<p>Do not click the <strong>Enable</strong> button until all issues are resolved or you can accept all remaining issues, as you CANNOT start the migration again and the data will not be in a synchronized state.</p>\n<h3>Migration status</h3>\n<p>After the migration starts, the <strong>MIGRATION STATUS</strong> button becomes available and you can click it to check the progress of the migration.</p>\n<p>The <strong>Migration Status</strong> window indicates whether the migration is <b>In Progress </b>or <strong>Done</strong>. </p>\n<p>While the migration is ongoing, the numbers of migrated/failed Actual Service, Service Components, System Elements, Devices, and relations (complex attributes of Device records and many-to-many associations among CIs) are displayed. The numbers are refreshed every 30 seconds. </p>\n<p>Due to a known issue, if the migration of complex attributes or many-to-many associations has failed, it cannot be fixed later.</p>\n<p>After the migration completes, the status changes to <strong>Done</strong>. The migration result is summarized in the same format as above. </p>\n<h3>Migration report</h3>\n<p>After the migration starts, the <strong>MIGRATION REPORT</strong> button becomes available in the <strong>Migration Status</strong> window and you can click it to download a .json file that contains the following details: </p>\n<ul>\n<li>Migration status: For the four federated SACM record types, the numbers of completed CIs, failed CIs, and total CIs are available.</li>\n<li>Exceptions and errors occurred during the migration.   </li>\n</ul>\n<h3>Migration limitations</h3>\n<p>There are some migration limitations because UCMDB has different CI and CI relationship characters with Service Management. </p>\n<h4>Limitation 1. Standalone system element is not supported for the migration</h4>\n<p>UCMDB does not allow standalone \"Running Software\" to which Service Management System Element is mapped, so all standalone Service Management system element CIs will not be migrated.</p>\n<h4>Limitation 2. System elements of limited OOB subtypes are supported by the migration</h4>\n<p>Service Management system elements have 13 OOB subtypes as shown in the following screenshot, and only system elements of 4 of them (Running Software, Web Server, Database, and Application Server) are allowed to be migrated to UCMDB CIs of the same CI Type names if each system element is already linked to one existing device.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"Native_Sacm_Saas_8.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/7/73/Native_Sacm_Saas_8.png\" height=\"375\" hspace=\"0\" src=\"../../../images/Native_Sacm_Saas_8_dca92d84.png\" style=\"width:169px;height:375px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"169\"/> </a></div>\n<p>System elements of all other 9 out-of-the-box subtypes are not supported by the migration, due to the following reasons. </p>\n<ul>\n<li>Mapped peer UCMDB CI Type is abstract (e.g., Application System, Application Resource, AWS Resource, and WebService Resource), which cannot be instantiated in UCMDB.</li>\n<li>CI types not supported by Native SACM (e.g., CI collection) and no suitable CI types to map (e.g., Virtualization and Other).</li>\n<li>Not business applicable (e.g., Database Resource and Cloud Service).   </li>\n</ul>\n<p>System elements with customized or empty subtypes will not be migrated either, due to the following reasons.</p>\n<ul>\n<li>The UCMDB CI type mapped with Service Management subtype does not follow a certain pattern, it is hard to guarantee the migration of system elements of customized subtypes will succeed. Currently, it is not supported.</li>\n<li>The base CI Type mapped to System Element is \"Infrastructure Element,\" which is abstract and cannot be instantiated in UCMDB.  </li>\n</ul>\n<h4>Limitation 3: Devices of the subtype \"Cluster resource group\" cannot be migrated to UCMDB CIs of CI type \"ClusterResourceGroup\"</h4>\n<p paraeid=\"{f0f57844-5939-4f0c-84ae-47608577c24e}{124}\" paraid=\"545700187\">UCMDB does not support a standalone \"ClusterResourceGroup,\" which has to be linked with at least one cluster CI. Hence, devices of the subtype \"Cluster resource group\" In Service Management will not be migrated into UCMDB CIs of CI type \"ClusterResourceGroup\" because Service Management does not support the migration of any cluster CIs in System Elements. To work around it, you may change the device subtype \"ClusterResourceGroup\" to \"Other\" in order to migrate it to UCMDB.</p>\n<h2 paraeid=\"{f0f57844-5939-4f0c-84ae-47608577c24e}{124}\" paraid=\"545700187\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/nativesacm\" title=\"Native SACM\">Native SACM</a></li>\n<li><a href=\"/doc/423/26.1/enabledsnativesacm\" title=\"Adopt data domain segmentation for Native SACM\">Adopt data domain segmentation for Native SACM</a></li>\n</ul>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}