{
  "title": "Enable self-service password reset for DB users",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>As the suite admin, you can enable the self-service password reset feature for a tenant. Once this feature is enabled, a <strong>Forgot your password?</strong> link is available on the Service Portal and agent portal login pages, and users of the DB type can click this link to reset their password on their own. </p>\n<div class=\"Admonition_Note\"><span class=\"autonumber\">Note</span>\n<ul>\n<li class=\"Admonition_Note\">This feature is only for users of the DB type. </li>\n<li class=\"Admonition_Note\">This feature doesn't unlock or activate users. A locked or inactive user is still locked or inactive after a password reset. </li>\n</ul>\n</div>\n<p>To enable this feature for a tenant, perform the following steps as the suite admin:</p>\n<ol>\n<li>In Suite Administration, open the tenant record, and click the <strong>IdM settings </strong>tab to open the IdM Admin Portal.</li>\n<li>Click <strong>Customization</strong> on the left pane, and select the <strong>FORGOTTEN PASSWORDS</strong> tab.</li>\n<li>Select the <strong>Enable Forget Password</strong> checkbox.</li>\n<li>Configure an SMTP mail server for sending password reset emails to users. \n\t<ol start=\"1\">\n<li>Complete the following fields:\n\t\t<ul>\n<li><strong>Email Address From</strong>: enter an email address, which will be displayed as the sender in the password reset email sent to users.</li>\n<li><strong>Email Hostname</strong> and <strong>Email Port</strong>: Enter your SMTP mail server's hostname and port number. </li>\n<li><strong>Email Password</strong> and <strong>Email Authentication User</strong>: if you're using authenticated SMTP to send emails, enter the password and user name of your authentication user account. If your mail server doesn't require authentication, leave these fields blank. </li>\n</ul>\n</li>\n<li>If your mail server requires a proxy, select the <strong>Enable Email Proxy</strong> checkbox, and then enter the proxy server and port in the <strong>Email Host Proxy</strong> and <strong>Email Proxy Port</strong> fields. If your mail server doesn't require a proxy, skip this step.</li>\n<li>If your SMTP mail server supports StartTLS  and Userset, select the <strong>Enable startTLS</strong> and <strong>Enable Userset</strong> checkboxes.</li>\n</ol>\n</li>\n<li>Configure the password reset email settings:\n\t<ol start=\"1\">\n<li>In the <strong>Forgotten Password Email Body</strong> field, the email body contains two parameters: \n\t\t<ul>\n<li> {{CODE}}: This parameter defines the verification code sent with each email. It's not customizable. </li>\n<li>{{VALIDITY}}: This parameter defines the validity period of the verification code sent with each email. By default, it's 5 minutes. If you want to change from the default value, go to <strong>Global setting</strong>s &gt; <strong>System Settings </strong>&gt;<strong> Others </strong>and change the <strong>Validity of code in password reset email</strong> value.</li>\n</ul>\n</li>\n<li>  In the <strong>Forgotten Password Email Subject</strong> field, enter a subject. For example: <strong>Reset your Service Management Automation password</strong>.</li>\n</ol>\n</li>\n<li>Click <strong>Save</strong>.</li>\n</ol>\n<p>Now, you can verify the configuration. For more information, see <a href=\"/doc/423/26.1/selfservicepasswordreset4dbusers\">Self-service password reset for DB users</a>.</p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}