{
  "title": "Encryption domains",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Service Management supports the ability to encrypt specific record type fields via the creation of encryption domains. This enables you to restrict access to sensitive information to selected users.</p>\n<p>You can assign groups to an encryption domain; the members of each assigned group will have access to the fields encrypted in that domain. For each user who accesses the encrypted fields, a passcode and a verification code are required.</p>\n<p>You can create multiple encryption domains. Each one operates independently. For example, you may want to encrypt sensitive data for changes using Encryption domain 1 and employee data using Encryption domain 2. Each encryption domain requires a separate verification code. (One passcode is valid for all encryption domains.)</p>\n<p>After you encrypt a field of a record type, you can add it to a form. The data in the field will be visible only to members of the encryption domain who have been verified. It's also possible to encrypt attachments to records.</p>\n<p>Encrypted fields can't be added to business rules and should not be selected in reports. Global search doesn't support encrypted fields and you can't filter or sort record type data by encrypted fields.</p>\n<p>Encryption domains aren't supported in the Dev2Prod functionality. Any encryption domains defined in your development environment must be manually redefined in your production environment.</p>\n<p>For information on the available APIs related to encryption domains, see <a href=\"/doc/423/26.1/encryptiondomainapi\" title=\"SMAX:25.1/EncryptionDomainAPI\">Encryption domain API</a>.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span>  </p>\n<ul>\n<li>Encryption domains aren't related to data domains.</li>\n<li>Encryption domain administrator permission is required to create or update encryption domains.</li>\n</ul>\n</div>\n<h2 class=\"mw-headline\" id=\"How_to_create_an_encryption_domain\">How to create an encryption domain</h2>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Administration &gt; Master Data &gt; People &gt; Encryption domains</b>.</li>\n<li>Click <a class=\"image\" href=\"/file/images/c/cc/2018.08_Helpcenter/Resources/Images/Icons/NewIcon.png\" title=\"/file/images/c/cc/2018.08_Helpcenter/Resources/Images/Icons/NewIcon.png\"> <img alt=\"NewIcon.png\" data-file-height=\"18\" data-file-width=\"17\" height=\"18\" src=\"../../../images/NewIcon_7074e789.png\" width=\"17\"/> </a> <b>New</b>.</li>\n<li>\n<p>If you have previously defined a passcode, enter it and click <b>Get access</b>.</p>\n<p>If you haven't yet defined a passcode, enter a passcode 10 to 20 characters long containing at least one upper case character, at least one lower case character, and at least one number. Retype the passcode and click <b>Create passcode</b>.</p>\n</li>\n<li>\n<p>In the <b>Create encryption domain</b> dialog box, enter a name and display label for the encryption domain, and click <b>Create</b>.</p>\n<div class=\"Admonition_Important\">\n<p><span class=\"autonumber\">Important</span> When you define a new encryption domain, Service Management generates four encryption keys for backup purposes. Copy these keys and save them in a secure location. In the event of an emergency where the encryption domain becomes inaccessible, contact Support and provide the backup keys to gain access to the encryption domain. The support team has no access to the generated keys.</p>\n</div>\n</li>\n<li>\n<p>You are set as the <b>Default owner</b> of the encryption domain. After creating the domain, you can select a different default owner from the drop-down list. The default owner must be verified for the encryption domain.</p>\n</li>\n<li>\n<p>Select a <b>Backup owner</b> for the encryption domain from the drop-down list.</p>\n<p>Only the default owner and backup owner have permission to create verification codes for other users for this encryption domain.</p>\n</li>\n<li>\n<p>In the <b>Members list</b> section, click <b>Add</b> and select a group from the drop-down list. You can add multiple groups.</p>\n<p>The members of the selected groups will have access to the fields encrypted via this domain.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> Encryption is supported for groups of up to 250 members only.</p>\n</div>\n</li>\n<li>\n<p>To access fields encrypted via this domain, the members need a verification code. To create verification codes for the encryption domain members, do one of the following:</p>\n<ul>\n<li>Click <a class=\"image\" href=\"/file/images/a/a8/2018.08_Helpcenter/Resources/Images/Icons/VerificationCode2.png\" title=\"/file/images/a/a8/2018.08_Helpcenter/Resources/Images/Icons/VerificationCode2.png\"> <img alt=\"VerificationCode2.png\" data-file-height=\"25\" data-file-width=\"23\" height=\"25\" src=\"../../../images/VerificationCode2_e2e19089.png\" width=\"23\"/> </a> <b>Create verification code for all domain members</b> on the toolbar. This generates a single verification code for all members of the encryption domain.</li>\n<li>Click <a class=\"image\" href=\"/file/images/9/97/2018.08_Helpcenter/Resources/Images/Icons/CreateVerificationCode.png\" title=\"/file/images/9/97/2018.08_Helpcenter/Resources/Images/Icons/CreateVerificationCode.png\"> <img alt=\"CreateVerificationCode.png\" data-file-height=\"34\" data-file-width=\"38\" height=\"34\" src=\"../../../images/CreateVerificationCode_1be4c043.png\" width=\"38\"/> </a> <b>Create verification code</b> next to the name of a group member. This generates a verification code for this user only.</li>\n</ul>\n<p>In either case, pass the verification code to the relevant user(s) securely.</p>\n<div class=\"Admonition_Caution\">\n<p><span class=\"autonumber\">Caution</span> Do not send a verification code by email.</p>\n</div>\n</li>\n<li>\n<p>Click <b>Save</b> to save the encryption domain.</p>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"How_to_update_an_encryption_domain\">How to update an encryption domain</h2>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Administration &gt; Master Data &gt; People &gt; Encryption domains</b>.</li>\n<li>Select the encryption domain you want to update, and make the required changes.</li>\n<li>Click <b>Save</b> to save the encryption domain.</li>\n</ol>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> If you removed groups from the encryption domain, the members of those groups can no longer access the fields encrypted using this domain.</p>\n</div>\n<h2 id=\"How_to_disable/enable_an_encryption_domain\"><span class=\"mw-headline\" id=\"How_to_disable.2Fenable_an_encryption_domain\">How to disable/enable an encryption domain</span></h2>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Administration &gt; Master Data &gt; People &gt; Encryption domains</b>.</li>\n<li>Select the encryption domain you want to disable and click <b>Disable</b> on the toolbar.</li>\n<li>Click <b>Save</b>. The encryption domain is now disabled and can't be used to encrypt new fields. The fields already encrypted using this encryption domain are still encrypted and can be decrypted by members of the encryption domain.</li>\n<li>To re-enable the encryption domain, click <b>Enable</b> on the toolbar and click <b>Save</b>.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"How_to_encrypt_a_field\">How to encrypt a field</h2>\n<ol>\n<li>\n<p>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Administration &gt; Configuration &gt; Studio &gt; Fields</b>. Select the required record type.</p>\n</li>\n<li>\n<p>Create a new custom field of type MEDIUM_TEXT, LARGE_TEXT, or RICH_TEXT.</p>\n</li>\n<li>Select the <b>Encrypted</b> check box. The <b>Encryption domain</b> property appears.</li>\n<li>Select the encryption domain from the drop-down list.</li>\n<li>\n<p>(Optional) Click <b>Set advanced options</b> to open the encryption definition dialog box for the field. The default encryption domain you selected is displayed. Proceed as follows:</p>\n<ol>\n<li>Click <b>Add condition</b> to add a condition row.</li>\n<li>\n<p>In the <b>Condition</b> box, enter an Expression Language phrase defining the required condition. For more information about the Expression Language, see <a href=\"/doc/423/26.1/explang\" title=\"SMAX:25.1/ExpLang\">Expression Language</a>.</p>\n</li>\n<li>In the <b>Encryption domain</b> box, select the alternate encryption domain to be used when the condition is satisfied. If you select <b>Not encrypted</b>, the field will remain unencrypted when the condition is satisfied.</li>\n<li>Optionally, click <b>Add condition</b> again to add another condition row. There is no limit to the number of conditions you can define for a field encryption.</li>\n<li>\n<p>Click <b>OK</b>. All the encryption domains used in the definition appear in the <b>Encryption domains</b> field.</p>\n</li>\n</ol>\n</li>\n<li>\n<p>Click <b>Save</b> to save the field.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> The maximum length of encrypted fields is lower than the limit for unencrypted fields of the same type.</p>\n</div>\n</li>\n<li>\n<p>You can add the encrypted field to a form. When a user accesses a record of that type, the data in the field is hidden and the <a class=\"image\" href=\"/file/images/e/e8/2018.08_Helpcenter/Resources/Images/Icons/KeyIcon.png\" title=\"/file/images/e/e8/2018.08_Helpcenter/Resources/Images/Icons/KeyIcon.png\"> <img alt=\"KeyIcon.png\" data-file-height=\"24\" data-file-width=\"16\" height=\"24\" src=\"../../../images/KeyIcon_1b05df3b.png\" width=\"16\"/> </a> icon appears in its place. For information on adding a field to a form, see <a href=\"/doc/423/26.1/editform\" title=\"SMAX:25.1/EditForm\">How to edit a form</a>.</p>\n</li>\n</ol>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span>  </p>\n<ul>\n<li>Encryption domains aren't supported for template fields (for instance, Change templates or Incident templates).</li>\n<li>The Default values tab of a model (for instance, Change models or Incident models) can't contain encrypted fields. It's possible to add fields that are defined as conditionally encrypted (using the Advanced options), but the fields will be unencrypted in the model.</li>\n<li>Encryption domains aren't supported for <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span> users. Encrypted fields should not be added to forms that are available in the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span>.</li>\n<li>After you encrypt a field, explicit value(s) assigned to the field earlier can still be viewed in the field history. The value(s) after the field encryption will stay encrypted in the history. </li>\n</ul>\n</div>\n<h2 class=\"mw-headline\" id=\"How_to_encrypt_attachments\">How to encrypt attachments</h2>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Administration &gt; Configuration &gt; Studio &gt; Fields</b>. Select the required record type.</li>\n<li>Select the out-of-the-box Attachments field.</li>\n<li>Select the <b>Encrypted</b> check box. The <b>Encryption domain</b> property appears.</li>\n<li>Select the encryption domain from the drop-down list.</li>\n<li>Optionally, set the advanced options for the encryption, as you would for other encrypted fields.</li>\n<li>Click <b>Save</b> to save the field.</li>\n<li>When a user accesses a record of that type, a new button, <b>Add encrypted attachments</b>, appears next to the <b>Add attachments</b> button in the Attachments section of the records. The user can add both encrypted and unencrypted attachments.</li>\n</ol>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span>  </p>\n<ul>\n<li>It's possible to configure Service Management to display only the <b>Add encrypted attachments</b> button for record types for which encrypted attachments are defined. The user will not be able to add unencrypted attachments for these record types. To enable this feature, see <a href=\"/doc/423/26.1/appsettings#Encrypt_all_attachments\">Encrypt all attachments</a>.</li>\n<li>In the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span>, the <b>Add encrypted attachments</b> button is never displayed. Encrypted attachments added to a record in Service Management aren't accessible in the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span>.</li>\n</ul>\n</div>\n<h2 class=\"mw-headline\" id=\"How_to_view_and_edit_encrypted_data\">How to view and edit encrypted data</h2>\n<ol>\n<li>\n<p>If you expect to work with encrypted data, it's recommended to enter your credentials after you log in.</p>\n<ol>\n<li>Click your login name to open the Profile page.</li>\n<li>Click the <b>Security Settings</b> link to open a dialog box and enter your passcode.</li>\n<li>\n<p>All of your encryption domains are displayed. You can enter a verification code for each one.</p>\n</li>\n</ol>\n<p>Once you are verified for an encryption domain, all fields associated with that domain will appear decrypted. A <a class=\"image\" href=\"/file/images/d/df/2018.08_Helpcenter/Resources/Images/Icons/KeyIcon2.png\" title=\"/file/images/d/df/2018.08_Helpcenter/Resources/Images/Icons/KeyIcon2.png\"> <img alt=\"KeyIcon2.png\" data-file-height=\"22\" data-file-width=\"22\" height=\"22\" src=\"../../../images/KeyIcon2_b7dc9795.png\" width=\"22\"/> </a> icon appears next to each decrypted field.</p>\n<p>The system retains your passcode for a period of one hour while there is user activity. If you continue working beyond that period, or if there is no user activity for 10 minutes, you are prompted to re-enter your passcode. You only need to enter your verification code once per domain.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> If you enter an incorrect passcode 3 times, the passcode is locked for 15 minutes. After the next incorrect attempt, it's locked for 30 minutes, then for one hour, and so on.</p>\n</div>\n</li>\n<li>\n<p>If you did not enter your credentials at login, when you attempt to access record data, the data of an encrypted field is hidden and the <a class=\"image\" href=\"/file/images/e/e8/2018.08_Helpcenter/Resources/Images/Icons/KeyIcon.png\" title=\"/file/images/e/e8/2018.08_Helpcenter/Resources/Images/Icons/KeyIcon.png\"> <img alt=\"KeyIcon.png\" data-file-height=\"24\" data-file-width=\"16\" height=\"24\" src=\"../../../images/KeyIcon_1b05df3b.png\" width=\"16\"/> </a> icon appears in its place on the record page. When you click the icon, a dialog box pops up and prompts you to enter your credentials. Enter your passcode and verification code.</p>\n<p>If you aren't a member of this encryption domain, the field data is hidden and the <a class=\"image\" href=\"/file/images/9/97/2018.08_Helpcenter/Resources/Images/Icons/KeyIcon3.png\" title=\"/file/images/9/97/2018.08_Helpcenter/Resources/Images/Icons/KeyIcon3.png\"> <img alt=\"KeyIcon3.png\" data-file-height=\"24\" data-file-width=\"21\" height=\"24\" src=\"../../../images/KeyIcon3_7be0b140.png\" width=\"21\"/> </a> icon appears in its place. This indicates that you can't access the field data.</p>\n</li>\n<li>If you forgot your passcode, click the <b>Forgot your passcode?</b> link to open a dialog box where you can create a new passcode.</li>\n<li>You will be prompted to create a new passcode before the old one expires. If your passcode expires, you must create a new one and re-verify all of your encryption domains.</li>\n<li>If you don't have a verification code for this encryption domain, click the <b>Ask for verification code</b> link. A message appears stating that a verification code request was sent to the encryption domain owner. The domain owner or backup owner will pass you the code securely.</li>\n<li>If you want to change your passcode, click the <b>Security Settings</b> link on the Profile page and click the <b>Change passcode</b> link.</li>\n<li>\n<p>If an administrator made changes to an encryption domain before you saved changes to a record, you will be prompted to re-enter your credentials if you are still a member of the encryption domain. If you were removed from the domain, you will be unable to save your changes.</p>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/userscontacts\" title=\"SMAX:25.1/UsersContacts\">Users and contacts</a></li>\n<li><a href=\"/doc/423/26.1/pplroles\" title=\"SMAX:25.1/pplRoles\">Roles</a></li>\n<li><a href=\"/doc/423/26.1/groups\" title=\"SMAX:25.1/Groups\">Groups</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}