{
  "title": "Run REST calls through OPB",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>You can run REST calls to remote products via the <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> Agent by using the Execute REST business rule. You can use this business rule in a workflow, or in task and approval plans. The rule enables you to define tasks that run REST calls automatically to external servers, and return the results. The results are stored in the output field defined in the business rule.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> It's only possible to run REST calls to external servers that support Basic Authentication.</p>\n</div>\n<h2 class=\"mw-headline\" id=\"On-Premises_Bridge_Agent_pre-configuration\"><span class=\"SAW_Variablesopb\">On-Premises Bridge</span> Agent pre-configuration</h2>\n<p>To use the Execute REST Business Rule, the <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> Agent needs to be installed on a customer machine, and be configured to work.</p>\n<p>Perform the following prerequisites:</p>\n<ul>\n<li>Configure the <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> Agent with a default endpoint. For more information, see <a href=\"/doc/423/26.1/opbinstall\" title=\"SMAX:25.1/OpbInstall\">How to use On-Premises Bridge agents on Windows</a> or <a href=\"/doc/423/26.1/opbinstalllinux\" title=\"SMAX:25.1/OpbInstallLinux\">How to use On-Premises Bridge agents on Linux</a>.</li>\n<li>Configure credentials using the Credentials Manager of the <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> Agent. These credentials are used for authentication in the remote server.</li>\n<li>Configure endpoints. An endpoint is defined with the remote service location: <b>&lt;Protocol&gt;://&lt;Host&gt;:&lt;Port&gt;/&lt;Service&gt;</b>. The endpoint uses the default credentials ID that was configured in the previous step for server authentication. For more information, see <a href=\"/doc/423/26.1/opbuseendpoints\" title=\"SMAX:25.1/OpbUseEndpoints\">How to use endpoints</a>.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Execute_REST_business_rule_configuration\">Execute REST business rule configuration</h2>\n<p>After the <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> Agent is configured with endpoints and credentials, it's possible to configure and run the Execute REST business rule.</p>\n<p>The Execute REST business rule accepts the following parameters:</p>\n<table>\n<tbody>\n<tr>\n<th>Parameter</th>\n<th>Value</th>\n</tr>\n<tr>\n<td>OPB Agent ID</td>\n<td>Select an agent ID from the drop-down list. There is one agent for each network domain. Every agent has a default agent ID, but you can override it and use another pre-defined agent ID.</td>\n</tr>\n<tr>\n<td>OPB Endpoint ID</td>\n<td>Select an endpoint from the drop-down list. Every agent has a default endpoint, but you can override it and use another endpoint of that agent. For example, <a class=\"external free\" href=\"http://www.google.com/mail\" rel=\"nofollow\" target=\"1\">http://www.google.com/mail</a> is the default endpoint for an agent, but the administrator can configure additional endpoints for the user to select, such as <a class=\"external free\" href=\"http://www.google.com/search\" rel=\"nofollow\" target=\"1\">http://www.google.com/search</a>.</td>\n</tr>\n<tr>\n<td>Credentials ID</td>\n<td>Select the credentials from the drop-down list by their ID. Every endpoint has a default credentials ID, but you can override it and use another credentials ID of that endpoint. For example, the default credentials are <b>user1/pass1</b> with an ID of <b>123</b>, but the user wants to use the credentials <b>tester1/tester1</b> with the ID of <b>456</b> instead.</td>\n</tr>\n<tr>\n<td>Uri Suffix</td>\n<td>\n<p>Select one of the following options:</p>\n<ul>\n<li><b>Simple Mode.</b> Enter the required value manually.</li>\n<li><b>Expression Language.</b> Enter an Expression Language phrase that returns the required value.</li>\n</ul>\n<p>The prefix of the URL is taken from the endpoint. This parameter is the suffix of the URL. The concatenated expression forms the URL of the REST call. This parameter must be HTTP encoded.</p>\n</td>\n</tr>\n<tr>\n<td>Web Method</td>\n<td>Select a method from the drop-down list (POST/PUT/GET/DELETE).</td>\n</tr>\n<tr>\n<td>Body</td>\n<td>\n<p>Select one of the following options:</p>\n<ul>\n<li><b>Simple Mode.</b> Enter the required data manually.</li>\n<li><b>Expression Language.</b> Enter an Expression Language phrase that returns the required data.</li>\n</ul>\n<p>This is the body that will be used in the REST call request to the remote server. The Body parameter is only relevant if POST or PUT is selected as the web method.</p>\n</td>\n</tr>\n<tr>\n<td>Headers</td>\n<td>\n<p>A dialog box opens with two boxes. For the Header key, enter data as free text. For the Header value, select one of the following options:</p>\n<ul>\n<li><b>Simple Mode.</b> Enter the required data manually.</li>\n<li><b>Expression Language.</b> Enter an Expression Language phrase that returns the required data.</li>\n</ul>\n<p>Click <b>Add item</b> to add an additional row with boxes for another header.</p>\n<p>The REST call request headers provide additional information for the REST call, such as the file type to be returned.</p>\n</td>\n</tr>\n<tr>\n<td>Output field name</td>\n<td>\n<p>Enter a field of the current record. Select one of the following options:</p>\n<ul>\n<li><b>Simple Mode.</b> Enter the required field manually.</li>\n<li><b>Expression Language.</b> Enter an Expression Language phrase that returns the required field.</li>\n</ul>\n<p>This parameter defines the field where the returned results are stored. For more information on the available output field types, see the next section. </p>\n<div class=\"Admonition_Important\"><span class=\"autonumber\">Important</span> The system uses the SMAX user that you specify during the OPB Agent installation to update the output field, and this user may need the <strong>Log into the application</strong> role permission to update the output field depending on the current record type. If you specify an integration user during the OPB Agent installation and assign the <strong>OPB Remote Agent</strong> role to this user, we recommend that you additionally assign the <strong>Log into the application</strong> permission to this role so that the integration user is always authorized to update the output field. </div>\n</td>\n</tr>\n<tr>\n<td>Task Prefix</td>\n<td>Enter the prefix text in the box manually. This parameter enables you to set values to be used in the result fields defined inside a complex type output field. It's not relevant for textual type output fields. </td>\n</tr>\n</tbody>\n</table>\n<p>Click the <b>Expression Language</b> <a class=\"image\" href=\"/file/images/thumb/f/f3/SMAiconfx.png/30px-SMAiconfx.png\" title=\"/file/images/thumb/f/f3/SMAiconfx.png/30px-SMAiconfx.png\"> <img alt=\"SMAiconfx.png\" data-file-height=\"75\" data-file-width=\"79\" height=\"28\" src=\"../../../images/30px-SMAiconfx_894ae630.png\" width=\"30\"/> </a> button to toggle between these options. When the button is selected (blue), the field is in Expression Language mode. When it's not selected (white), the field is in Simple mode. For a full list of Expression Language functions, see <a href=\"/doc/423/26.1/explangfunctions\" title=\"SMAX:25.1/ExpLangFunctions\">Expression Language functions and syntax</a>.</p>\n<h2 class=\"mw-headline\" id=\"Output_field_types\">Output field types</h2>\n<p>When selecting the output field, you should select a field of the type that matches the type of results to be returned by the REST call. The field types are defined for each field in the Fields tab.</p>\n<p>You can define the output field for the business rule execution with the following types:</p>\n<table>\n<tbody>\n<tr>\n<th>Field type</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Textual field</td>\n<td>\n<p>A textual field is defined according to size. The following options are available:</p>\n<ul>\n<li>SMALL_TEXT</li>\n<li>MEDIUM_TEXT</li>\n<li>LARGE_TEXT</li>\n<li>RICH_TEXT</li>\n</ul>\n<p>If the defined field size is large enough to contain the full response string, it's stored in the field as is. If the field size is smaller than the response value, the response value is truncated to the size of the field.</p>\n</td>\n</tr>\n<tr>\n<td>User options</td>\n<td>\n<p>A user-defined field. You can define the following system fields within the user option to use in the business rule:</p>\n<ul>\n<li><b>RawOutput_c.</b> A third party response of type string which contains the full JSON response. Example: <b>{\"ExecutionId\" : \"123\", \"URL\" : \"http/:&lt;servername&gt;.port/...\"}</b>.</li>\n<li><b>HttpStatusCode_c.</b> A third party HTTP status response of type integer. Example: <b>400</b>.</li>\n</ul>\n<p>To parse the RawOutput_c string, you can define the following custom fields, based on the above example, to use in the business rule (all of type string):</p>\n<ul>\n<li><b>ExecutionId_c.</b> Parses the execution Id from the raw output string. Example: <b>123</b>.</li>\n<li><b>URL_c.</b> Parses the URL from the raw output string. Example: <b>http:/&lt;servername&gt;.port/...</b></li>\n</ul>\n<p>The following is an example of how to access values nested in multiple levels, for example, the value for <strong>account</strong> (in CheckOut) or <strong>id</strong> (under CheckOut.Request). This example indicates how you should define the user option to automatically grab the values off from the RawOut_c result:</p>\n<pre><code>{\n  \"vrm\": \"4.0.0-1\",\n  \"status\": 200,\n  \"message\": \"OK\",\n  \"svc\": \"smisc\",\n  \"CheckOut\": {\n    \"account\": \"CN=ABCXX Svc,OU=Service Accounts,OU=Active Example Objects,DC=DEMO,DC=local\",\n    \"passwd\": \"qwjWMOEx1spW\",\n    \"Request\": {\n      \"id\": \"aa4fb18a-756c-11eb-87c6-a77512145432\"\n    }\n  }\n}</code></pre>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span>  </p>\n<ul>\n<li>Only string result fields are supported in the complex type field (with the exception of the <b>HttpStatusCode</b> field).</li>\n<li>The custom field name must be identical to the corresponding parameter in the raw output string (the comparison is case insensitive).</li>\n<li>Don't define multiple custom fields with names that differ only by case.</li>\n<li>Parameters in the raw output string that contain delimiters aren't supported (For example, <b>vm.name</b>.)</li>\n</ul>\n</div>\n</td>\n</tr>\n</tbody>\n</table>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span>  </p>\n<ul>\n<li>If the response value isn't a JSON file, it's stored in the <b>RawOutput</b> field if it exists.</li>\n<li>If the output field doesn't exist, a log message is added and no result is returned.</li>\n</ul>\n</div>\n<h2 class=\"mw-headline\" id=\"Task_Prefix_field\">Task Prefix field</h2>\n<p>You can set the <b>TaskPrefix</b> value in the business rule, to be used in the result fields defined inside the complex type field. This value isn't relevant for a textual type output field.</p>\n<p>If the <b>TaskPrefix</b> is defined, it's added to the complex type field names as follows: fullName = taskPrefix+fieldname. The result values are then matched to a field named <b>fullName</b>. Similarly, when accessing a value from internal properties of the complex type field, this is done from the property named <b>fullName</b>.</p>\n<p>This enables you to run multiple tasks with this business rule concurrently without overriding the other results, since the results are saved in different results fields inside the same complex type output field, according to the <b>TaskPrefix</b> value.</p>\n<p>Using the example from above, for taskPrefix=<b>Task1</b>, the field in the complex type should be <b>Task1Comments0ContentSubmitterUserId</b>, in order to get the value of <b>Comments0ContentSubmitterUserId</b> after the execution of a task with the prefix <b>Task1</b>.</p>\n<p>For multiple tasks, each task should have its own <b>TaskPrefix</b> value and result fields names (such as <b>Task2</b> and <b>Task2Comments0ContentSubmitterUserId</b>).</p>\n<h2 class=\"mw-headline\" id=\"Example_of_a_business_rule\">Example of a business rule</h2>\n<p>You can use the Execute REST business rule to post issues (defects) via the JIRA service.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> This example is for illustration purposes only and is subject to changes in the JIRA API.</p>\n</div>\n<p>Follow these steps:</p>\n<ol>\n<li>\n<p>Create a demo JIRA account (go to <a class=\"external free\" href=\"https://www.atlassian.com/software/jira\" rel=\"nofollow\" target=\"1\">https://www.atlassian.com/software/jira</a>). Define the JIRA server URL: https://&lt;demo&gt;.atlassian.net.</p>\n</li>\n<li>\n<p>In Integration Management, download and install the <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> agent and configure the agent to work with Service Management. Create credentials for the connection.</p>\n<p>On the Endpoints tab, define the endpoint and configure it as described in <a href=\"/doc/423/26.1/opbuseendpoints\" title=\"SMAX:25.1/OpbUseEndpoints\">How to use endpoints</a>. Select <b>REST Executor 1.0</b> as the endpoint type.</p>\n</li>\n<li>\n<p>In Service Management, define the following user options for an offering:</p>\n<ul>\n<li>\n<p><b>RawOutput.</b> A string that contains the full JSON response. Required: <b>false</b>, Visibility: <b>Agent</b></p>\n</li>\n<li><b>HttpStatusCode.</b> An HTTP status response of type integer. Required: <b>false</b>, Visibility: <b>Agent</b></li>\n<li><b>Summary.</b> A summary of the issue. Required: <b>true</b>, Visibility: <b>User</b></li>\n<li>\n<p><b>Description.</b> A description of the issue. Required: <b>true</b>, Visibility: <b>User</b></p>\n</li>\n<li>\n<p><b>Issuetype.</b> The category of the issue. Required: <b>false</b>, Visibility: <b>Agent</b></p>\n</li>\n</ul>\n</li>\n<li>\n<p>Define an automatic task for the offering, as described in <a href=\"/doc/423/26.1/taskplans\" title=\"SMAX:25.1/Taskplans\">Task plans</a>.</p>\n</li>\n<li>Select the <b>Execute REST</b> business rule.</li>\n<li>\n<p>For the OPB Agent ID, OPB Endpoint ID and Credentials ID parameters, select the agent, endpoint, and credentials defined in step 2.</p>\n</li>\n<li>For the URI Suffix parameter, enter <b>/rest/api/2/issue</b>. For more information, consult the JIRA API documentation.</li>\n<li>For the Web Method parameter, select <b>POST</b>.</li>\n<li>\n<p>For the Body parameter, you can either select Simple mode and enter a static JSON body, or select Expression Language mode and enter a dynamic JSON body.</p>\n<p>Static body example:</p>\n<pre>    {\n\"fields\": {\n\"project\":\n{ \n\"key\": \"YOURDEFECTS\"\n},\n\"summary\": \"OPB REST Test 1 \",\n\"description\": \" OPB REST Test 1 - description\",\n\"issuetype\": {\n\"name\": \"Bug\"\n}\n}\n}</pre>\n<p>Dynamic body example:</p>\n<pre>${concat('{\"fields\": {\"project\": {\"key\": \"SAWDEFECTS\"},\"summary\":\"',     \nentity.UserOptions.Summary_c,'\", \"description\": \"',\nentity.UserOptions.Description_c,'\",\"issuetype\": {\"name\": \"Bug\"}}}')}\n</pre>\n<p>For more information, consult the JIRA API documentation.</p>\n</li>\n<li>\n<p>For the Headers parameter, enter:</p>\n<pre>Headers:\n\"Accept\", \"application/json\", \n\"Content-Type\", \"application/json\"</pre>\n</li>\n<li>For the Output field name parameter, select <b>User Options</b>.</li>\n<li>Save the offering.</li>\n<li>In Service Request Management, create a request based on the offering and run the automatic task.</li>\n<li>\n<p>Review the task output and check the user options fields.</p>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/processes\" title=\"SMAX:25.1/Processes\">Processes and Rules</a></li>\n<li><a href=\"/doc/423/26.1/embizrules\" title=\"SMAX:25.1/emBizRules\">Studio business rules</a></li>\n<li><a href=\"/doc/423/26.1/rulesdescriptionstags\" title=\"SMAX:25.1/RulesDescriptionsTags\">Business rule descriptions and tags</a></li>\n<li><a href=\"/doc/423/26.1/dslactionrules\" title=\"SMAX:25.1/DSLActionRules\">Action rule examples</a></li>\n<li><a href=\"/doc/423/26.1/dslvalidationrules\" title=\"SMAX:25.1/DSLValidationRules\">Validation rule examples</a></li>\n<li><a href=\"/doc/423/26.1/renderingrules\" title=\"SMAX:25.1/RenderingRules\">Rendering rule examples</a></li>\n<li><a href=\"/doc/423/26.1/fieldselectionrulesexamples\" title=\"SMAX:25.1/FieldSelectionRulesExamples\">Field selection rule examples</a></li>\n<li><a href=\"/doc/423/26.1/wflwusecase\" title=\"SMAX:25.1/WflwUseCase\">Studio - use case</a></li>\n<li><a href=\"/doc/423/26.1/addbizrule\" title=\"SMAX:25.1/AddBizRule\">How to add a business rule</a></li>\n<li><a href=\"/doc/423/26.1/modifybizrule\" title=\"SMAX:25.1/ModifyBizRule\">How to edit, remove, or disable a business rule</a></li>\n<li><a href=\"/doc/423/26.1/enrichmentrules\" title=\"SMAX:25.1/EnrichmentRules\">Enrichment rules</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}