{
  "title": "Export data",
  "content": "<div class=\"mw-parser-output\">\n<div></div>\n<p>You can export data from the List view of records:</p>\n<ol>\n<li>Go to the List view of the record type.</li>\n<li>Click <b>More</b> in the <a href=\"/doc/423/25.1/userinterface#list-view-toolbar\" title=\"SMAX:25.1/UserInterface\">List view toolbar</a>.</li>\n<li>Select either:\n\t<ul>\n<li><b>Export to CSV</b>. The downloaded file contains raw data. This option exports the Name value for each <strong>ENUM</strong>/<strong>ENUM SET</strong> field and the raw numeric date/time value for each Date/Time field.<br/>\n<b>Note</b>: CSV is primarily intended for integrations or for importing into another reporting solution.</li>\n<li><b>Export to XLSX</b>. The downloaded file is localized according to the user's language setting in Service Management. This option exports the Display Name value for each <strong>ENUM</strong>/<strong>ENUM</strong> <strong>SET </strong>field and formatted date/time value for each Date/Time field.<br/>\n<b>Note</b>: XLSX is intended for direct consumption in Excel. The export process adds extra columns for entity link fields to uniquely identify them. For example, when a column links to a Location entity, the export includes one column for the display name and another for the display label. </li>\n</ul>\n</li>\n</ol>\n<h3 class=\"mw-headline\" id=\"Export_of_rich_text_columns\">Export of rich text columns</h3>\n<p>In the agent interface, you can export up to 1,000 records with 3 or less Rich Text fields at one time. If the current view contains more than 1,000 records or more than 3 Rich Text fields, a warning is displayed. If you choose to ignore the warning and continue, only the first 1000 records or the first 3 Rich Text fields are exported.<br/>\n<b>Note</b>: This feature isn't supported in the self-service portal.<br/>\n<b>Warning</b>: Exporting records with rich text can be a high resource consuming operation in terms of CPU, memory and network utilization. It's recommended that users perform this operation sparingly. When multiple users are trying to export records at the same time from grid views and their total export data volume exceeds 10MB, the system is likely to become overloaded and experience unexpected problems.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/importdata\" title=\"SMAX:25.1/ImportData\">Import data</a></li>\n<li><a href=\"/doc/423/26.1/records\" title=\"SMAX:25.1/Records\">Studio</a></li>\n</ul>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}