{
  "title": "Export knowledge articles from Service Manager",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>You can export knowledge articles from Service Manager and package them to prepare for importing the articles into Service Management.</p>\n<p>The exported articles may contain:</p>\n<ul>\n<li>embedded images</li>\n<li>links between articles</li>\n<li>attachments</li>\n</ul>\n<p>To export articles from Service Manager:</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> Download the <b>Service Manager – Service Anywhere Knowledge Document Migration tool User Guide</b> and the required UNL file from <a class=\"external free\" href=\"https://marketplace.opentext.com/itom/content/service-manager-service-anywhere-knowledge-document-migration-tool\" rel=\"nofollow\" target=\"1\">https://marketplace.opentext.com/itom/content/service-manager-service-anywhere-knowledge-document-migration-tool</a>. The <b>Service Manager – Service Anywhere Knowledge Document Migration tool User Guide</b> contains detailed instructions about exporting knowledge articles from Service Manager.</p>\n</div>\n<ol>\n<li>In Service Manager, from the drop-down list next to the command line box, select the <b>db</b> script library.</li>\n<li>From the drop-down list at the end of the menu bar, select the <b>SM 9.3x.cp.KmMig-SMtoSAW.unl</b> script.</li>\n<li>\n<p>Click <b>Load FG</b> to load the script.</p>\n</li>\n<li>From the drop-down list at the top of the screen, select the <b>sl</b> script library.</li>\n<li>In the Name field, enter <b>KMDocument</b>.</li>\n<li>From the displayed list, select <b>KMDocumentExport</b>.</li>\n<li>\n<p>Locate the line that contains the export path for the articles. By default, the path is commented out:</p>\n<pre>//doExport( path );</pre>\n</li>\n<li>\n<p>Uncomment the line and change the path to the location where you want to export the articles. For example:</p>\n<pre>doExport(\"C:\\\\ExportDocument\");</pre>\n</li>\n<li>Click <b>OK</b> to save the updated script.</li>\n<li>\n<p>Click <b>Execute</b> to run the script.</p>\n<p>Service Manager exports all existing articles into the folder that you specified. That folder contains:</p>\n<ul>\n<li>an <b>articles</b> folder (containing each exported article as a separate HTML file).</li>\n<li>a <b>resources</b> folder (containing associated files, such as embedded images and attachments).</li>\n<li>a <b>metadata.xml</b> file (containing information about each knowledge article, including the name, the last time the file was updated, and the attachments that are associated with each article).</li>\n</ul>\n</li>\n<li>Create a ZIP file that contains these three items.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/importarticles\" title=\"SMAX:25.1/ImportArticles\">How to import knowledge article packages</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}