{
  "title": "External systems",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div></div>\n<p>Service Management provides a case exchange framework to exchange data between Service Management and other products. The case exchange framework enables you to define an external system with which information will be exchanged.</p>\n<p>The following integrations are supported:</p>\n<ul>\n<li><b>Service Manager (SM).</b> The SM integration uses the Active/Passive case exchange protocol. In this protocol, all actions are initiated in the external system and no configuration of REST operations is required in Service Management. The <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> isn't involved in the integration; only the Case exchange API is required. For more information, see <a href=\"/doc/423/26.1/integratesm\" title=\"SMAX:25.1/IntegrateSM\">External systems - Service Manager integration</a>.</li>\n<li><b>Operations Manager i (OMi).</b> The OMi integration uses the Active/Active case exchange protocol. In this protocol, actions are initiated from both sides and REST operations are configured in Service Management. The <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> is used in the integration and REST server functionality is required on the external system. For more information, see <a href=\"/doc/423/26.1/intgomi\" title=\"SMAX:25.1/IntgOMi\">Integrate with Operations Manager i</a>.</li>\n<li><b>Case exchange integration for changes.</b> The Case exchange integration for change records uses the Active/Passive case exchange protocol. In this protocol, all actions are initiated in the external system and no configuration of REST operations is required in Service Management. The <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> isn't involved in the integration; only the Case exchange API is required. For more information, see <a href=\"/doc/423/26.1/changecasexchange\" title=\"SMAX:25.1/ChangeCaseXchange\">Case Exchange integration for changes</a>.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<p><a href=\"/doc/423/26.1/integrationmgmt\" title=\"SMAX:25.1/IntegrationMgmt\">Integration Management</a></p>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}