{
  "title": "Extract and modify output values",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>You can extract and modify parts of an output, using python.</p>\n<p>For example, if you only want the maximum, minimum, and average round-trip times for a ping operation to a server, you can isolate and extract all three pieces of information from the operation’s raw output.</p>\n<p>Another example is to extract the HTTP code from an HTTP response.</p>\n<h2 id=\"Extract_and_modify_the_output_value\">Extract and modify the output value</h2>\n<ol>\n<li>In the <b>Step Properties</b> pane, under <b>Outputs</b>, or in the <b>Flow Properties</b> pane, under <b>Outputs</b>, select the output and click the Edit button.</li>\n<li>\n<p>In the Expression Editor, enter the python expression to manipulate the output value.</p>\n<p>For example: To convert the output to lowercase, you just need to copy the following expression in the OO Workflow Designer UI:</p>\n<p><code>output1.lower()</code></p>\n<p>if the original expression was:</p>\n<code>pub1: ${output1.lower()}</code></li>\n<li>Click <b>Save</b>.</li>\n</ol>\n<h2 id=\"Examples_of_using_Python_to_manipulate_outputs\">Examples of using Python to manipulate outputs</h2>\n<ul>\n<li>\n<p><b>Diff Case</b></p>\n<p><b>Diff Case</b> changes all the characters in the string either to upper case or to lower case.</p>\n<p><b>Example</b>:</p>\n<pre># to change to lowercase</pre>\n<pre>output1.lower()</pre>\n<pre># to change to uppercase</pre>\n<pre>output1.upper()</pre>\n</li>\n<li>\n<p><b>Extract Number</b></p>\n<p><b>Extract Number</b> extracts the first number found in the result. It treats an unbroken series of integers as a single number.</p>\n<p><b>Example</b>:</p>\n<p>To extract the number “123” from the strings “123Test” or “Test123”:</p>\n<pre># extract first number\n# requires another step\n- extract_first_number:\ndo:\nstrings.match_regex:\n- regex: '\\d+'\n- text: ${var_name}\npublish:\n- first_number: ${match_text}\nnavigate:\n- MATCH: MATCH\n- NO_MATCH: NO_MATCH</pre>\n</li>\n<li>\n<p><b>Format</b></p>\n<p><b>Format</b> attaches text to a result or output or replaces the original content of the result or output with the text that you specify.</p>\n<ul>\n<li>\n<p>To attach the text to the front of the existing text, use <b>prepend</b>.</p>\n<p><b>Example</b>:</p>\n<pre># prepend\n'xyz' + output1</pre>\n</li>\n<li>\n<p>To add the text to the back of the existing text, use <b>append</b>.</p>\n<p><b>Example</b>:</p>\n<pre># append\noutput1 + 'xyz'</pre>\n</li>\n<li>\n<p>To replace the output with the text, use <b>replace</b>.</p>\n<p><b>Example</b>:</p>\n<pre># replace\noutput1.replace('old', 'new')</pre>\n</li>\n</ul>\n</li>\n<li>\n<p><b>Line Count</b></p>\n<p><b>Line Count</b> outputs the total number of lines of the result.</p>\n<p><b>Example</b>:</p>\n<pre># string line count\nlen(output1.split('\\n'))</pre>\n</li>\n<li>\n<p>Loop</p>\n<p><b>Loop</b> is synchronous. It will act like ordinary loop in other languages (such as java). It runs over a collection of items and executes the step mentioned inside (operation or flow).</p>\n<ul>\n<li>\n<p><b>For</b></p>\n<p>The variable name that is assigned the current value from the collection that is defined in the <b>In</b> section. This variable is available in the current running of the inner step as flow variable. In case of iterating map there will be two variable names, for the key and value. This variable is required.</p>\n<p>Supported characters: A to Z, a to z, 0 to 9, _ variable name starting with letter or underscore.</p>\n<p><b>Example</b>:</p>\n<pre>for: \"value in '1','2','3'\"</pre>\n<p>or</p>\n<pre>for: \"value in '1,2,3'\"</pre>\n<p>to actually enter a constant in the expression editor</p>\n<pre>for: 'k,v in {\"key1\":\"val1\",\"key2\":\"val2\"}'</pre>\n</li>\n<li>\n<p><b>In</b></p>\n<p>The collection to be iterated on. You can use any python expression that results in a list or map. The <b>In</b> section contains dropdowns that contain SP and flow variables. Click the Edit button to open the expression dialog where you can insert any string. This variable is required.</p>\n<p><b>Example</b>:</p>\n<ul>\n<li>Array: <code>['1','2','3','4']</code> or <code>['a','b','c','d']</code></li>\n<li>Python expression: <code>map(str,range(1,5))</code> to return a string collection.</li>\n<li>Map: <code>{\"key1\":\"value1\",\"key2\":\"value2\"}</code></li>\n<li>Comma delimited strings: which would be split automatically into a list: <code>\"1,2,3\"</code></li>\n<li>Flow variable: select it from the drop down (all step published outputs and flow inputs).</li>\n<li>System property: select it from the drop down.</li>\n</ul>\n</li>\n<li>\n<p><b>Break</b></p>\n<p>A loop exits when either the collection being looped has been exhausted or the operation or subflow called returns one of the results mentioned in the <b>break</b> section. The <b>break</b> section is a property of a loop, which is mapped to a list of results on which to break out of the loop. The list of results is a subset of the results of the inner step.</p>\n<p>When the operation or subflow of the iterative task returns a result in the break list, the iteration halts and the iterative task navigation logic is run.</p>\n<p>If there is no break section in the YAML, by default FAILURE breaks the loop. In Java-based operations and in Python, FAILURE result is added by default to the Break list. You can delete FAILURE.</p>\n</li>\n<li>\n<p><b>Publish</b></p>\n<p>The publish output is set like a regular step (In the step properties). At runtime, it will contain the value from the last iteration of the loop (make sure the 'publish' key is inside the loop).</p>\n<p>You can also aggregate outputs from a loop. To do so, put a python expression that will aggregate the outputs.</p>\n<p><b>Example</b>:</p>\n<p>The sum is calculated in each iteration and at the end provides the sum of all iterations.</p>\n<pre>- aggregate:\nloop:  \nfor: \"value in '1','2','3'\"\ndo:\nsquare:\n- to_square: ${value}\n- sum\npublish:\n- sum: ${sum + squared}</pre>\n</li>\n<li>\n<p><b>Navigate</b></p>\n<p>The navigation logic runs when the last iteration of the step is completed or after exiting the iteration due to a break. The navigation runs according to the last iteration of the loop.</p>\n<p>For keys, the supported characters: A to Z, a to z, 0 to 9.</p>\n<p>For values, restricted to step/result names.</p>\n<p><b>Example</b>:</p>\n<pre>- custom3:\nloop:\nfor: \"value in '1','2','3','4','5'\"</pre>\n<pre>do:\ncustom3:\n- text: ${value}                                                   \ndo:\nbreak:\n- CUSTOM\npublish:\n- CUSTOM: aggregate\n- SUCCESS: skip_this</pre>\n<p>You can also use: <code>for: \"value in '1,2,3,4,5'\"</code></p>\n</li>\n</ul>\n</li>\n<li>\n<p><b>Parallel Loop</b></p>\n<p>A Parallel loop runs over a collection in an asynchronous way, meaning that each execution of the step is run simultaneously and in a different context. A new branch is created for each value in a list and the branches run in parallel. The various branches running the flow will run in parallel and the rest of the flow will continue only after all the branches have completed.</p>\n<ul>\n<li>\n<p><b>For</b></p>\n<p>The variable name that is assigned the current value from the collection that is defined in the <b>In</b> section. This variable is available in the current running of the inner step as flow variable. In case of iterating map there will be two variable names, for the key and value. This variable is required.</p>\n<p>Supported characters: A to Z, a to z, 0 to 9, _ variable name starting with letter or underscore.</p>\n<p><b>Example</b>:</p>\n<pre>for: \"value in '1','2','3'\"</pre>\n<p>or</p>\n<pre>for: \"value in '1,2,3'\"</pre>\n<p>to actually entering a constant in the expression editor.</p>\n<pre>for: 'k,v in {\"key1\":\"val1\",\"key2\":\"val2\"}'</pre>\n</li>\n<li>\n<p><b>In</b></p>\n<p>The collection to be iterated on. You can use any Python expression that results in a list or map. The <b>In</b> section contains drop downs that contain SP and flow variables. Click the Edit button to open the expression dialog where you can insert any string. This variable is required.</p>\n<p><b>Example</b>:</p>\n<ul>\n<li>Array: <code>['1','2','3','4']</code> or <code>['a','b','c','d']</code></li>\n<li>Python expression: <code>map(str,range(1,5))</code></li>\n<li>Map: <code>{\"key1\":\"value1\",\"key2\":\"value2\"}</code></li>\n<li>Comma delimited strings: which would be split automatically into a list: <code>\"1,2,3\"</code></li>\n<li>Flow variable: select it from the drop down (all step published outputs and flow inputs).</li>\n<li>System property: select it from the drop down.</li>\n</ul>\n</li>\n<li>\n<p><b>Publish</b></p>\n<p>The publish mechanism defines the step aggregation logic, generally making use of the <b>branches_context</b> construct.</p>\n<p>The branches context is a list that includes all the contexts of all the iterations. It is set according to the order of execution, meaning that the execution that finishes first gets the first place in the list and so on.</p>\n<p>After all branches of a Parallel Loop have completed, the execution of the flow continues with the publish section. The expression of each output pair is evaluated and published to the flow scope.</p>\n<p>In Parallel Loops, the publish keyword is at the loop level in the YAML and not as in a Loop where it is inside the loop, in line with the <b>do</b> keyword.</p>\n<p>In a Parallel Loop, there is no publish section inside the inner step. Instead, it publishes all the outputs of the inner step by default to the <b>branches_context</b>, allowing for aggregation.</p>\n<p>The aggregation syntax should be a python expression.</p>\n<p><b>Example</b>:</p>\n<ul>\n<li>\n<p>Retrieves the name variable from the first branch to finish:</p>\n<pre>- publish:\n- first_name: '${str(branches_context[0][\"name\"])}'</pre>\n</li>\n<li>\n<p>Publishes an aggregate output (it iterates over the :', which contains a list of all the iterations of the Parallel Loop, and takes the value of 'name' from each branch):</p>\n<pre>- publish:\n- name_list: '${str([str(x[\"name\"]) \nfor x in branches_context])}'</pre>\n</li>\n<li>\n<p>Creates a list of branch results (as branches of a Parallel Loop complete, branch results get placed into the branches_context list under the branch_result key):</p>\n<pre>- publish:\n- result_status_list: '${str([str(x[\"branch_result\"]) \nfor x in branches_context])}'</pre>\n</li>\n</ul>\n</li>\n<li>\n<p><b>Navigate</b></p>\n<p>The navigation logic runs after the last branch has completed. If any of the branches return a result of FAILURE, the flow will follow the navigation path of FAILURE. Otherwise, the flow will follow the SUCCESS navigation path. Any other result beside SUCCESS and FAILURE will be evaluated as SUCCESS.</p>\n<p>For keys, the supported characters: A to Z, a to z, 0 to 9.</p>\n<p>For values, restricted to step/result names.</p>\n<p>Note</p>\n<ul>\n<li>\n<p>If the inner step does not contain a FAILURE result, the navigation (ports) do not contain a FAILURE port, but only a SUCCESS port.</p>\n</li>\n<li>If a step has a custom result, after setting it in a parallel loop, the ports change to be SUCCESS and FAILURE. After removing the step from the parallel loop, the original ports of the step is returned.</li>\n</ul>\n<p><b>Example</b>:</p>\n<pre>- print_values: \nparallel_loop:\n        for: value in values\n        do:\n           print_branch:\n- ID: ${value}                                                     do:\npublish:\n        - name_list: '${str([str(x[\"name\"]) \nfor x in branches_context])}'\nnavigate:\n        - SUCCESS: print_list\n        - FAILURE: FAILURE</pre>\n</li>\n</ul>\n</li>\n<li>\n<p><b>Regular Expression</b></p>\n<p><b>Regular Expression</b> filters the raw results using a regular expression (regex).</p>\n<p><b>Example</b>:</p>\n<pre># regular expression\n# as above, requires another step\nbase.string.match_regex:\n- regex: '&lt;expression&gt;'\n- text: ${output1}</pre>\n</li>\n<li>\n<p><b>Replace</b></p>\n<p><b>Replace</b> replaces the first or last instance or all instances of one string with another string.</p>\n<ul>\n<li>\n<p>Use <b>First</b>, <b>All</b>, or <b>Last,</b> to define which instances of the target string to replace.</p>\n<p><b>Example</b>:</p>\n<pre># replace first\noutput1.replace('old', 'new', 1)</pre>\n</li>\n<li>To make the search not case-sensitive, use <b>Ignore case</b>.</li>\n</ul>\n<p><b>Example</b>:</p>\n<pre>'abcabdAb'.lower().replace('ab'.lower(), 'XX')</pre>\n</li>\n<li>\n<p><b>Round Number</b></p>\n<p><b>Round Number</b> rounds numbers up or down.</p>\n<ul>\n<li>\n<p>Use <b>Number of Decimal Places</b> to define the number of decimal places the number should be rounded to.</p>\n<p><b>Example</b>:</p>\n<pre># round\n# note: float function call is not always needed\n# note: python rounding of floats sometime returns \n# unexpected results\n# see https://docs.python.org/2/library/functions#round\nround(float(output1), &lt;number_of_decimal_places&gt;)</pre>\n</li>\n<li>\n<p><b>Round</b> rounds the number up if the last significant digit is 5 or more, and down otherwise</p>\n</li>\n</ul>\n<p><b>Example</b>:</p>\n<pre>round(2.734) -&gt; 2.73 </pre>\n<pre>round(2.734, 2) -&gt; 2.73</pre>\n</li>\n<li>\n<p><b>Select Range</b></p>\n<p><b>Select Range</b> defines a string that you want to extract from the input data. The two criteria for defining the string are its length in characters and the position of its first character from the start of the input data.</p>\n<ul>\n<li>Use <b>Start</b> to specify the zero-based start position of the string.</li>\n<li>\n<p>Keep in mind that a new line may count as one or two characters, depending on the operating system from which you obtain the data you’re filtering.</p>\n</li>\n</ul>\n<p><b>Example</b>:</p>\n<pre># select range</pre>\n<pre># note: &lt;end&gt; is not included in the selection</pre>\n<pre>output1[&lt;start&gt;:&lt;end&gt;]</pre>\n</li>\n<li>\n<p><b>Sorted</b></p>\n<p><b>Sorted</b> orders the lines of input data by the first character in each line.</p>\n<ul>\n<li>To specify the direction of the sort, use <b>Ascending</b>.</li>\n<li>\n<p>To order the data by ASCII order, use <b>Treat as Numbers</b>.</p>\n<p>Note that ascending ASCII order is roughly as follows, for English characters:</p>\n<ul>\n<li>White space</li>\n<li>Symbols</li>\n<li>Numbers</li>\n<li>Alphabetic characters</li>\n</ul>\n</li>\n</ul>\n<p><b>Example</b>:</p>\n<pre># sort lines\n# note: returns a list, can be joined to a single string using join function\nsorted(output1.split('\\n'))</pre>\n</li>\n<li>\n<p><b>Strip</b></p>\n<p><b>Strip</b> strips characters from the beginning or end of the raw results.</p>\n<ul>\n<li>Use <b>Strip Method</b> to specify how you want the filter to strip the raw results:</li>\n<li>\n<ul>\n<li><b>All Characters Up To</b> the string.</li>\n<li><b>All Characters Up To And Including</b> the string.</li>\n<li><b>All Characters After</b> the string.</li>\n<li><b>All Characters After And Including</b> the string .</li>\n</ul>\n</li>\n<li>Use <b>Characters to Strip</b> to specify the string to find.</li>\n</ul>\n<p><b>Example</b>:</p>\n<pre># strip other characters\n# note: can also be used with lstrip and rstrip\noutput1.strip(&lt;characters_to_strp&gt;)</pre>\n</li>\n<li>\n<p><b>Strip Whitespace</b></p>\n<p><b>Strip Whitespace</b> removes all the whitespace characters from the front and the end of the raw results.</p>\n<p><b>Example</b>:</p>\n<pre># strip whitespace from both sides\noutput1.strip()\n# strip whitespace from left side\noutput1.lstrip()\n# strip whitespace from right side\noutput1.rstrip()</pre>\n</li>\n<li>\n<p><b>Table</b></p>\n<p><b>Table</b> does not convert the raw results into a table, but enables you to manipulate the raw results as if they were a table, including sorting columns and selecting columns, rows, and blocks.</p>\n<ul>\n<li>Use <b>Column Delimiter</b> to specify the character that will serve to divide the data into columns in a meaningful way.</li>\n<li>\n<p>Use <b>Row Delimiter</b> to specify the character that will serve to divide the data into rows in a meaningful way.</p>\n<p>Note<br/>\n\t\tTwo or more consecutive whitespaces count as a single whitespace, so a column may be occupied by data that you expected to find in a column to the right. For example, this behavior will appear if you apply this filter to the output of a “dir” command-line command with whitespace specified as the column delimiter.</p>\n</li>\n<li>Use <b>First Row is Header</b> to treat the members of the first row as column headers, .</li>\n<li>Use <b>Strip First Row of Result</b> to remove the first row.</li>\n<li>\n<p>Use <b>Sort On Column</b> to sort on a column, by specifying the (1-based) column number.</p>\n<p>Tip<br/>\n\t\tThe value <b>-1</b> means do not sort on any column.</p>\n</li>\n<li>Use <b>Ascending</b> to specify the ascending order. By default, the sort order is descending.</li>\n<li>To select the row that you want the filter to extract, specify the row number with <b>Select Row</b> (<b>-1</b> selects all the rows) and specify the number of columns in that row that you want extracted using <b>Select Width</b> (<b>-1</b> selects all the remaining columns to the right of the column specified by <b>Select Col</b>).</li>\n<li>To select the column that you want the filter to extract, specify the column number with <b>Select Col</b> (<b>-1</b> selects all the columns) and specify the number of rows in that column that you want extracted using <b>Select Height</b> (<b>-1</b> selects all the remaining columns to the right of the column specified by <b>Select Row</b>)</li>\n</ul>\n<p><b>Example</b>:</p>\n<p>To extract the first 5 rows of the 2<sup>nd</sup> through 4<sup>th</sup> columns, you would specify the following:</p>\n<pre>Select Row= 0\nSelect Height= 5\nSelect Col= 2\nSelect Width= 3</pre>\n<p>In these settings, the first two settings define the selected rows, and the last two settings define the selected rows.</p>\n</li>\n<li>\n<p><b>XML</b></p>\n<p><b>XML</b> enables you to parse XML within a step, the XML being obtained from the step’s input or output. The <b>XML Get Attribute</b> filter extracts the value for each of one or more instances of the attribute that you specify. You can control which instance of the attribute the filter is applied to by specifying an element path to the attribute.</p>\n<p>You can obtain the value for a single instance of the attribute or for multiple instances, returned in a table. In such a table, the columns are comma-delimited and the rows are new line-delimited.</p>\n<ul>\n<li>Using <b>Element Path</b>, specify the path of the element that contains the attribute whose value you want to extract. Use forward slashes to separate the parts of the path to the element.</li>\n<li>\n<p>To control which instance of the element the filter gets the attribute’s value from, add a specification such as [2] or [3]. The numbering of elements is 1-based (starts with [1]). Thus to specify the second instance of an element, you would use [2].</p>\n</li>\n<li>To search child elements of the element you’ve specified, use <b>Include sub-elements</b>.</li>\n<li>Using <b>Attribute Name</b>, specify the name of the attribute whose value you want.</li>\n<li>\n<p>For <b>Result</b>, use one of the following:</p>\n<ul>\n<li>To restrict the result extracted to the value of a single instance of an attribute, use <b>Single Match</b>.</li>\n<li>To extract the value of all the instances of the attribute you have named, use <b>As Table</b>.</li>\n</ul>\n</li>\n</ul>\n<p><b>Example</b>:</p>\n<pre># xml\n# requires another step\nbase.xml.xpath_query:\n- xml_document: ${output1}\n- xpath_query: &lt;query&gt;\n- query_type: &lt;node|value|nodelist&gt;</pre>\n</li>\n<li>\n<p><b>XML Get Element</b></p>\n<p><b>XML Get Element</b> enables you to extract an element in its entirety (including child elements, values, and attributes) by describing it in any of the following ways:</p>\n<ul>\n<li>\n<p>Use <b>Element Path</b> to specify an absolute path to the element.</p>\n<ul>\n<li><b>../</b> specifies the parent of the last-named element.</li>\n<li><b>./</b> specifies the last-named element.</li>\n</ul>\n<p>You can specify a particular instance of any element in the path with an integer inside square brackets.</p>\n<p><b>Example</b>:</p>\n<p><code>/tickets/ticket/details/comment</code> specifies all the comments in the details for all the tickets.</p>\n<p><code>/tickets/ticket/details/comment[2]</code> specifies the second comment for each ticket.</p>\n<p><code>/tickets/ticket[2]/details/comment</code> specifies all the comments for the second ticket.</p>\n</li>\n<li>\n<p>Use <b>Child Named</b> to specify the name of an element that is a child of the element (or elements) that you want to extract. If the child element has a value, you can narrow the results by specifying that value using <b>Value</b>.</p>\n<ul>\n<li><b>Child Named</b> works for only one level of child elements. The filter only returns the direct parent of the child element that you specify.</li>\n<li><b>Value</b> is intended for brief values. The value that you type there must be an exact match of the value of the child element of the element that you want to extract.</li>\n</ul>\n</li>\n<li>\n<p>Using <b>Attribute Named</b>, specify the name of an attribute that is unique to the element you want to extract. To further narrow the results, you can give a value of the attribute for <b>Value</b>.</p>\n</li>\n</ul>\n<p><b>Example</b>:</p>\n<pre># xml\n# requires another step\nbase.xml.xpath_query:\n- xml_document: ${output1}\n- xpath_query: &lt;query&gt;\n- query_type: &lt;node|nodelist&gt;</pre>\n</li>\n<li>\n<p><b>XML Get Element Value</b></p>\n<p><b>XML Get Element Value</b> enables you to get the value of a specific element.</p>\n<p>Use <b>Element Path</b> to specify the path to the element whose value you're interested in.</p>\n<p>As with the other filters, if there are multiple instances of an element, the filter returns the first one, unless you specify a different instance.</p>\n<p><b>Example</b>:</p>\n<pre># xml\n# requires another step\nbase.xml.xpath_query:\n- xml_document: ${output1}\n- xpath_query: &lt;query&gt;\n- query_type: &lt;node|value|nodelist&gt;</pre>\n</li>\n<li>\n<p><b>XPath Query</b></p>\n<p><b>XPath Query</b> enables you to extract data from the result with queries that use the standard XPath syntax, which you define for <b>XPath Query</b> .</p>\n<ul>\n<li>The path that precedes the square brackets identifies the scope of the query with which you are narrowing the results.</li>\n<li>Square brackets contain the filtering portion of the query. There can be more than one set of filters in a query.</li>\n</ul>\n<p><b>Example</b>:</p>\n<pre># xml\n# requires another step\nbase.xml.xpath_query:\n- xml_document: ${output1}\n- xpath_query: &lt;query&gt;\n- query_type: &lt;node|value|nodelist&gt;</pre>\n</li>\n</ul>\n<h2 id=\"Related_topics\">Related topics</h2>\n<ul>\n<li>To add decisions to a flow, see <a href=\"/doc/423/26.1/designeradddecisionflow\" title=\"SMAX:25.1/DesignerAddDecisionFlow\">Add decisions to a flow</a>.</li>\n<li>To change the start step, see <a href=\"/doc/423/26.1/startstep\" title=\"SMAX:25.1/StartStep\">Change the start step</a>.</li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}