{
  "title": "Failed to import tenant because of mismatching crawling upgrade versions",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>When you export a source tenant and then import the data into a target tenant, the import fails with the following error: </p>\n<pre><code>The data upgrade versions of the source and target tenants do not match [source tenant= ${tenantDataUpgradeVersion}, target tenant= ${targetTenantDataUpdateVersion}]. </code></pre>\n<p>Where: ${tenantDataUpgradeVersion} and ${targetTenantDataUpdateVersion}] are the crawling upgrade versions of the source tenant and target tenant, respectively. </p>\n<h2>Root cause</h2>\n<p>The tenant export and import feature works only when the source and target tenants have the same version, including the same crawling upgrade version. If their crawling upgrade versions don't match, the tenant import fails. A typical scenario is that before having performed the required crawling upgrade for the source tenant, you export the source tenant and attempt to import the data to a new tenant. In this scenario, the target tenant has a newer crawling upgrade version than the source tenant and the tenant import therefore fails. </p>\n<h2>Solution</h2>\n<ol>\n<li>Log in to Suite Administration as suite-admin. </li>\n<li>Check the crawling upgrade versions of the source and target tenants. To do this, go to <strong>Configurations</strong> &gt; <strong>Crawling upgrade</strong>. This tab displays the crawling upgrade status for all tenants. The<strong> Data upgrade version</strong> field indicates the crawling upgrade version for each tenant. </li>\n<li>Perform the required crawling upgrade for both the source and target tenants. For details about how to perform a crawling upgrade, see <a href=\"/doc/423/26.1/saconfig#Crawling_upgrade_tab_(SMAX_tenants_only)\">Crawling upgrade</a>. In the example scenario described in the root cause section, you need to perform the required crawling upgrade only for the source tenant.</li>\n<li>Retry the tenant export and import. </li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}