{
  "title": "Delete a field",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>You can't delete out-of-the-box fields from a record type. To delete a custom field from a record type, follow these steps:</p>\n<ol>\n<li>\n<p>From the main menu, select <b>Administration &gt; Configuration &gt; Studio &gt; Fields</b>.</p>\n</li>\n<li>\n<p>Select the record type in the drop-down list at the top of the page.</p>\n</li>\n<li>\n<p>Select the field you want to delete.</p>\n</li>\n<li>\n<p>Click <strong>Delete field</strong> and then confirm the deletion. </p>\n</li>\n</ol>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-important-icon\"></div>\n<div class=\"admonition-content admonition-important-content\">If a custom field is being referenced by a form, workflow, or SLT settings, you must remove the field from the form, workflow, or SLT settings tab before you can delete the field from the record type.\n<ul>\n<li>Processes and Rules: The system validates only the processes and rules of the current record type. If you delete a field that is used by a different record type, there is no warning message.</li>\n<li>Forms: The system validates the forms of the current record type, and also validates the forms of the linked record type if the field is of the Entity_Link type.</li>\n</ul>\n<p>If the validation fails, an error message occurs, showing the names of the forms that are referencing the field and the record type of the processes and rules that are referencing the field. To locate the rules that are referencing the field, go to the <strong>Processes and Rules</strong> tab of the record type, and search for the field in the text search box at the upper right corner of the screen. Note that the field isn't searchable if being referenced in a transition condition and you can only manually check for transition conditions referencing the field. For more information, see <a href=\"/doc/423/26.1/rulesdescriptionstags\" title=\"Business rule descriptions and tags\">Business rule descriptions and tags</a>.</p>\n</div>\n</div>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}