{
  "title": "Field selection rule examples",
  "content": "<div class=\"mw-parser-output\">\n<p>The following examples demonstrate how to formulate rules for each of the field selection rule templates: </p>\n<h2 class=\"mw-headline\" id=\"Define_suggested_values_based_on_filter\">Define suggested values based on routing definition</h2>\n<ol>\n<li>For the <b>field</b> parameter, select a field from the drop-down list.</li>\n<li>For the <b>title</b> parameter, enter the name of the subsection in the drop-down list to be displayed in the user interface.</li>\n<li>For the <b>name</b> parameter, select the routing definition name from the drop-down list.</li>\n<li>For the <b>parameters</b> parameter, there is one parameter for each lane of the routing definition. For each parameter, enter an Expression Language phrase that returns the required value. For a full list of Expression Language functions, see <a href=\"/doc/423/26.1/explangfunctions\" title=\"Expression Language functions and syntax\">Expression Language functions and syntax</a>.</li>\n<li>When the rule runs, it defines the values available to be selected for the selected group field. The values are determined based on the path defined in the selected routing definition.</li>\n</ol>\n<p>For an example of the business rule, see <a href=\"/doc/423/26.1/routingdefovw#RoutingDefUseCaseDefineSuggestions\" title=\"SMAX:Main/RoutingDefOvw\">Routing definition use case - defining suggested values</a>.</p>\n<h2 class=\"mw-headline\" id=\"Define_suggested_values_by_a_list_to_list_mapping\">Define suggested values by a list to list mapping</h2>\n<ol>\n<li>\n<p>For the <b>field1</b> parameter, select a field from the drop-down list.</p>\n</li>\n<li>\n<p>For the <b>field2</b> parameter, select a field from the drop-down list.</p>\n</li>\n<li>\n<p>For the <b>mapping definition</b> parameter, select a value from the list on the left, and then click the box on the right to open a list of secondary values. Select the required secondary values for the selected primary value. You can select multiple secondary values.</p>\n<p>Select another primary value on the left and select the required secondary values for that value.</p>\n</li>\n<li>\n<p>For the <b>default values</b> parameter, click the box to open a list of values. These represent the secondary values for the remaining primary values. Select the required values from the list. This parameter is optional.</p>\n</li>\n<li>\n<p>When the rule runs, it defines the values available to be selected for each field1 option from among the field2 values, according to the specified mapping. For the field1 options that were not specified in the mapping, the field2 values selected in the default values parameter are available. If no value is selected for the default values parameter, the field options not selected in the mapping have no available values.</p>\n</li>\n</ol>\n<p>Example:</p>\n<ol>\n<li>Select <b>Business criticality </b>as field1 and <b>Environment </b>as field2.</li>\n<li>The dialog box for the mapping definition displays a list of environment options on the left side (Production, Test, Staging, etc.). Select <b>Production</b> and then click on the right side of the dialog box.</li>\n<li>A list of business criticality values is displayed. Select <b>Medium</b>, <b>High</b>, and <b>Very high</b>.</li>\n<li>Next select <b>Test</b> on the left side and then click on the right side and select <b>Low</b>, <b>Medium</b>, and <b>High</b>. Click <b>OK</b>.</li>\n<li>For the default values parameter, click in the box to display a list of business criticality values. Select <b>Very low</b>, <b>Low</b>, and <b>Medium</b>. Click <b>OK</b>.</li>\n</ol>\n<p>The rule defines the following options for the user:</p>\n<ul>\n<li>When <b>Production</b> is selected as the environment, the business criticality drop-down list displays <b>Medium</b>, <b>High</b>, and <b>Very high</b> as the available values.</li>\n<li>When <b>Test</b> is selected as the environment, the business criticality drop-down list displays <b>Low</b>, <b>Medium</b>, and <b>High</b> as the available values.</li>\n<li>When any other environment is selected, the business criticality drop-down list displays <b>Very low</b>, <b>Low</b>, and <b>Medium</b> as the available values.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Define_suggested_values_based_on_filter\">Define suggested values for entity link based on filter</h2>\n<ol>\n<li>\n<p>For the first <b>field</b> parameter, select a field from the drop-down list.</p>\n</li>\n<li>\n<p>For the <b>title</b> parameter, enter the title to be displayed in the user interface.</p>\n</li>\n<li>\n<p>For the <b>all records</b> parameter, you define filters to control the type of data accepted in the selected field. Click the <b>Add Item </b>button, which displays two boxes. In the first box, select a field from the drop-down list.</p>\n</li>\n<li>\n<p>(Optional) To further narrow the filter to a property of the selected field, click <strong>+Related</strong>, and then select a property from the drop-down list.</p>\n</li>\n<li>\n<p>In the second box, select <b>IN</b> or <b>NOT IN</b> from the drop-down list. A third box appears.</p>\n</li>\n<li>\n<p>Enter an Expression Language phrase that returns the data accepted in the selected field. For a full list of Expression Language functions, see <a href=\"/doc/423/26.1/explangfunctions\" title=\"Expression Language functions and syntax\">Expression Language functions and syntax</a>.</p>\n</li>\n<li>\n<p>(Optional) Click <b>Add Item</b> again to add another row and define another filter.<br/>\n<strong>Note: </strong>Apart from <strong>IN </strong>and <strong>NOT IN</strong> operators, if the field in the first or second box is of <strong>Small text</strong>, <strong>Medium text</strong>, <strong>Email</strong>, or <strong>URL</strong> type, operators such as <strong>CONTAINS</strong>, <strong>DOES NOT CONTAIN</strong>, <strong>STARTS WITH</strong>, and <strong>ENDS WITH</strong> may be available. These operators are applicable for user option strings when the business rule is defined for <strong>Offering </strong>or <strong>Model</strong>. For details, see <em>Text fields</em> in <a href=\"/doc/423/26.1/filters#Filter_by_field_value\" title=\"Filter by field value\">Filter by field value</a>.</p>\n</li>\n<li>\n<p>For the second <strong>field</strong> parameter, select a field from the drop-down list.<br/>\n\tThe second <strong>field</strong> parameter is available when Native SACM is enabled and when the first <strong>field</strong> is an entity_link type linked to Device, Actual Service, Service Component, or System Element.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<p>The <strong>first</strong> field (entity link) provides all candidate (either upstream or downstream) CIs that are associated with the starting CI chosen in the <strong>second</strong> field.</p>\n<p>The second field can only be the entity_link of Device, Service Component, System Element, or Actual Service, no matter what entity link type is selected for the first field.</p>\n<p>Different SACM record types have different layers in the SACM model. In general, Actual Service is higher than Service Component, Service Component is higher than System Element, and System Element is higher than Device.</p>\n<p>If the record type of the second field is higher than the record type of the first field, for example, the first field is the entity link of Device and the second field is the entity link of Actual Service, then the downstream CI filter will be adopted, only downstream Devices associated with the specified Actual Service will be filtered out according to the business rule.</p>\n<p>If the record type of the second field is lower than the record type of the first field, for example, the first field is the entity link of Actual Service and the second field is the entity link of Device, then the upstream CI filter will be adopted, only upstream Actual Services associated with the specified device will be filtered out according to the business rule.</p>\n<p>If the record type of the second field is at the same level as the record type of the first field, for example, both the first and second fields are the entity links of Actual Service, then both the upstream and downstream CI filters will be adopted, both upstream and downstream Actual Services associated with the specified Actual Service will be filtered out according to the business rule. Note that this behavior is different from previous versions in which only downstream Actual Services can be filtered out.</p>\n<p>It can also be used in the user option entity links in rendering rules for the following:</p>\n<ul>\n<li><strong>Model</strong> for <strong>Change</strong>/<strong>Release</strong>/<strong>Incident</strong></li>\n<li><strong>Offering</strong> for <strong>Request</strong></li>\n</ul>\n</div></div></div>\n</li>\n<li>\n<p>When the rule runs, it defines the type of data accepted in the selected field according to the specified filters.</p>\n</li>\n</ol>\n<p>Example 1: In the rule <b>IncidentAssigneeFilter</b> in Incident Management, the field <b>AssignedPerson</b> is defined to accept the title set <b>Group Members</b> and to accept data types according to the following filter set: for the first value, select <b>PersonToGroup.Id</b>. For the second value, select <b>IN</b>. For the third value, enter the following Expression Language phrase: <b>${entity.AssignedGroup.Id}</b>.</p>\n<p>Example 2: In the following rule:</p>\n<pre>If ${current_user.IsPermitted('LoginMaas()') &amp;&amp; tenant_settings.ENABLE_CMSX == 'true'}\n\nDefine suggested values for Device with header SERVICE ASSOCIATED DEVICES with filter PhaseId NOT IN ${​union('pCanceled','pEnded')}​ with association to Service</pre>\n<p>If the current user has permission to log into the application and Native SACM is enabled, the devices in the <strong>SERVICE ASSOCIATED DEVICES</strong> section are the downstream devices that are associated with the service according to the Native SACM topology and are not in the Canceled or Ended phase.</p>\n<p>Example 3:</p>\n<pre>If ${current_user.IsPermitted('LoginMaas()') &amp;&amp; tenant_settings.ENABLE_CMSX == 'true'}\n\nDefine suggested values for Service with header Device Impacted Services with filter PhaseId NOT IN ${'pRetired'}​ with association to Device</pre>\n<p>If the current user has permission to log into the application and Native SACM is enabled, the actual services in the <strong>DEVICE IMPACTED SERVICES</strong> section are the upstream services that are associated with the device according to the Native SACM topology and are not in the Retired phase.</p>\n<p>Example 4:</p>\n<pre>If ${current_user.IsPermitted('LoginMaas()') &amp;&amp; tenant_settings.ENABLE_CMSX == 'true'}\n\nDefine suggested values for LinkedDevices with header Device linked Devices with filter PhaseId NOT IN ${​union('pCanceled','pEnded')}​ with association to Device</pre>\n<p>If the current user has permission to log into the application and Native SACM is enabled, the devices in the <strong>DEVICE LINKED DEVICES</strong> section are the both upstream and downstream devices that are associated with the device according to the Native SACM topology and are not in the Canceled or Ended phase.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<ul>\n<li>Assume that a direct association is level 1, an association that is established through one intermediate node is level 2, this type of association can reach as deep as 5 levels by default. It can be customized via the \"Max steps,\" which pops up after you click on the relationship \"Virtual_input_to_related\" in the TQL \"SMAX_Filter_Topology.\" You can find this option by navigating via Root/SMAXTopology in the <strong>Resources</strong> tab of the Modeling studio in the UCMDB local client.</li>\n<li>You can define more than one field selection rule for the same field. If you do this, the system displays one section (under the header specified in the rule) for each rule, and in each section, displays a list of records based on the filter specified in the rule.</li>\n<li>At least one of the fields selected for the filter must be a field with the <strong>Enable search</strong> option enabled.</li>\n</ul>\n</div></div></div>\n<h2><span>Define suggested values for relationship based on filter</span></h2>\n<p>Use this rule to make the system display a section in the list or form for the specified Many2Many field. The section contains a subset of records as defined by the filter. The specified title will be used as the section header.</p>\n<ol>\n<li>\n<p>For the <b>relationship type</b> parameter, select a Many2Many field from the drop-down list.</p>\n</li>\n<li>\n<p>For the <b>title</b> parameter, enter the title to be displayed in the user interface.</p>\n</li>\n<li>\n<p>For the <b>all records</b> parameter, you define filters to control the type of data accepted in the selected field. Click the <b>Add Item </b>button, which displays two boxes. In the first box, select a field from the drop-down list.</p>\n</li>\n<li>\n<p>(Optional) To further narrow the filter to a property of the selected field, click <strong>+Related</strong>, and then select a property from the drop-down list.</p>\n</li>\n<li>\n<p>In the second box, select <b>IN</b> or <b>NOT IN</b> from the drop-down list. A third box appears.</p>\n</li>\n<li>\n<p>Enter an Expression Language phrase that returns the data accepted in the selected field. For a full list of Expression Language functions, see <a href=\"/doc/423/26.1/explangfunctions\" title=\"Expression Language functions and syntax\">Expression Language functions and syntax</a>.</p>\n</li>\n<li>\n<p>(Optional) Click <b>Add Item</b> again to add another row and define another filter.</p>\n<strong>Note: </strong>Apart from <strong>IN </strong>and <strong>NOT IN</strong> operators, if the field in the first or second box is of <strong>Small text</strong>, <strong>Medium text</strong>, <strong>Email</strong>, or <strong>URL</strong> type, operators such as <strong>CONTAINS</strong>, <strong>DOES NOT CONTAIN</strong>, <strong>STARTS WITH</strong>, and <strong>ENDS WITH</strong> may be available. These operators are applicable for user option strings when the business rule is defined for <strong>Offering </strong>or <strong>Model</strong>. For details, see <em>Text fields</em> in <a href=\"/doc/423/26.1/filters#Filter_by_field_value\" title=\"Filter by field value\">Filter by field value</a>.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Display_users_with_their_current_work_status\">Display users with their current work status</h2>\n<ol>\n<li>\n<p>For the <b>users</b> parameter, select one of the following options:</p>\n<ul>\n<li>\n<p><b>Simple Mode.</b> Enter the required text in the text box.</p>\n</li>\n<li>\n<p><b>Expression Language.</b> Enter an Expression Language phrase that returns the required text.</p>\n</li>\n</ul>\n<p>Click the <b>Expression Language</b> <a class=\"image\" href=\"\"> <img alt=\"SMAiconfx.png\" data-file-height=\"75\" data-file-width=\"79\" height=\"28\" src=\"../../../images/30px-SMAiconfx_894ae630.png\" width=\"30\"/> </a> button to toggle between these options. When the button is selected (blue), the field is in Expression Language mode. When it's not selected (white), the field is in Simple mode. For a full list of Expression Language functions, see <a href=\"/doc/423/26.1/explangfunctions\" title=\"Expression Language functions and syntax\">Expression Language functions and syntax</a>.</p>\n</li>\n<li>\n<p>For the <b>field</b> parameter, select a field from the drop-down list.</p>\n</li>\n<li>\n<p>For the <b>title</b> parameter, enter the name of the subsection in the drop-down list to be displayed in the user interface.</p>\n</li>\n<li>\n<p>When the rule runs, it displays the selected users under the specified heading.</p>\n</li>\n</ol>\n<p>Example:</p>\n<p>The following rule is in Request management:</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"On-call schedule rule in request management\" data-file-height=\"123\" data-file-width=\"863\" height=\"123\" src=\"../../../images/ocs-rule_5eacd8ec.png\" width=\"863\"/> </a></div>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<ul>\n<li>All of the rules can be formulated with the <b>\"If...Then\"</b> option, which includes an <b>expression</b> parameter for the condition. Make sure to enter an Expression Language phrase that returns a Boolean value.</li>\n<li>Field selection rules are only available for the <b>Rendering forms</b> process event.</li>\n<li>To display users but not contacts in a drop-down list, you can define the field selection business rule in the workflow according to the following filter set:\n\t<ul>\n<li>For the first value, select <b>isMaasUser</b>.</li>\n<li>For the second value, select <b>IN</b>.</li>\n<li>For the third value, enter the following Expression Language phrase: <b>${true}</b>.</li>\n</ul>\n</li>\n</ul>\n</div></div></div>\n<h2 id=\"External_data_action\" tabindex=\"-1\">External data action</h2>\n<p>This rule is only used to define value dependency between user options in which the values come from DND as an aggregation provider. The system automatically creates this rule when there is a value dependency between user options in an aggregated offering.<br/>\n<br/>\n<strong>Note</strong>: Do not use this field selection rule if you aren't using DND.</p>\n<p>Example:<br/>\n<br/>\n<a class=\"image\" href=\"\"> <img alt=\"pn_image_5eeaf0decdce19.80141045.jpeg\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/pn_images/pn_image_5eeaf0decdce19.80141045.jpeg\" height=\"243\" hspace=\"0\" src=\"../../../images/pn_image_5eeaf0decdce19.80141045_76a9e37d.jpeg\" style=\"width: 800px; height: 243px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<h2>Get suggested experts</h2>\n<ol>\n<li>For the <strong>expert field</strong> parameter, select a field from the drop-down list.</li>\n<li>For the <strong>title</strong> parameter, enter the title to be displayed in the user interface.</li>\n<li>For the <strong>content fields</strong> parameter, click the <strong>Add Item</strong> button and select a field from the drop-down list. You can click <strong>Add Item</strong> again to add more fields.</li>\n</ol>\n<p>Example:</p>\n<p>The following rule is in Request management:</p>\n<h2 class=\"mw-headline\"><a class=\"image\" href=\"\"> <img alt=\"Experts.jpg\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/0/07/Experts.jpg\" height=\"78\" hspace=\"0\" src=\"../../../images/Experts_d82a5d5b.jpeg\" style=\"width:800px;height:78px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></h2>\n<div>\n<ul>\n</ul>\n</div>\n<h2 class=\"mw-headline\"><br/>\nRelated topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/processes\" title=\"SMAX:Main/Processes\">Processes and Rules</a></li>\n<li><a href=\"/doc/423/26.1/embizrules\" title=\"SMAX:Main/emBizRules\">Studio business rules</a></li>\n<li><a href=\"/doc/423/26.1/rulesdescriptionstags\" title=\"SMAX:Main/RulesDescriptionsTags\">Business rule descriptions and tags</a></li>\n<li><a href=\"/doc/423/26.1/dslactionrules\" title=\"SMAX:Main/DSLActionRules\">Action rule examples</a></li>\n<li><a href=\"/doc/423/26.1/dslvalidationrules\" title=\"SMAX:Main/DSLValidationRules\">Validation rule examples</a></li>\n<li><a href=\"/doc/423/26.1/renderingrules\" title=\"SMAX:Main/RenderingRules\">Rendering rule examples</a></li>\n<li><a href=\"/doc/423/26.1/executerest\" title=\"SMAX:Main/ExecuteREST\">REST Execution</a></li>\n<li><a href=\"/doc/423/26.1/wflwusecase\" title=\"SMAX:Main/WflwUseCase\">Studio - use case</a></li>\n<li><a href=\"/doc/423/26.1/addbizrule\" title=\"SMAX:Main/AddBizRule\">How to add a business rule</a></li>\n<li><a href=\"/doc/423/26.1/modifybizrule\" title=\"SMAX:Main/ModifyBizRule\">How to edit, remove, or disable a business rule</a></li>\n<li><a href=\"/doc/423/26.1/enrichmentrules\" title=\"SMAX:Main/EnrichmentRules\">Enrichment rules</a></li>\n</ul>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}