{
  "title": "Fulfill a purchase order created on a request for an vendor catalog item",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div id=\"tag-premium\"></div>\n<p>This section provides an example end-to-end workflow to help you understand the process to fulfill a purchase order created on a request, starting from vendor catalog creation, through purchase request, to purchase order and purchase order line creation and fulfillment including asset receiving.</p>\n<ol>\n<li>\n<p>Vendor Catalog Administrator creates a vendor catalog titled <b>HP Laptop</b> for vendor <b>Hewlett Packard</b>. For more information about creating a vendor catalog, see <a href=\"/doc/423/26.1/managevendorcatalog\" title=\"SMAX:25.1/ManageVendorCatalog\">Create and manage vendor catalogs</a>.</p>\n</li>\n<li>\n<p>Vendor Catalog Administrator adds a vendor catalog item <b>HP EliteBook 850</b> to <b>HP Laptop</b>. For more information about creating a vendor catalog item, see <a href=\"/doc/423/26.1/managevendorcatalogitems\" title=\"SMAX:25.1/ManageVendorCatalogItems\">Create and manage vendor catalog items</a>.</p>\n</li>\n<li>\n<p>Vendor Catalog Administrator publishes the item as an offering with the display label \"<b>Request HP EliteBook 850</b>\". For more information about publishing a vendor catalog as offering, see <a href=\"/doc/423/26.1/publishvendorcatalog\" title=\"SMAX:25.1/PublishVendorCatalog\">Publish a vendor catalog item as offering</a>.</p>\n</li>\n<li>\n<p>Vendor Catalog Administrator sets for this offering \"<b>Request HP EliteBook 850</b>\" an automated fulfill task by applying the \"Create purchase order\" business rule. Procurement Manager sets the delivery location to <b>Sunnyvale</b> and delivery stock to <b>Pheonix A</b>. For more information about applying the \"Create purchase order\" business rule, see<a href=\"/doc/423/26.1/pobizrules\" title=\"SMAX:25.1/poBizRules\">\"Create purchase order\" business rule</a>.</p>\n</li>\n<li>\n<p>An end user <b>Amy Lopez</b> requests this offering from <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span>. Service Management then automatically creates a request with a unique ID, which by default is unassigned to any owner.</p>\n</li>\n<li>\n<p>Procurement Manager opens the request generated in step 5 and set <b>Current Assignment</b> from <b>unassigned</b> to <b>Service Desk</b> for automatic approval.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> Automatic approval is supported only when Current Assignment is set to <b>Service Desk</b> or <b>Expert Group</b>.</p>\n</div>\n</li>\n<li>\n<p>Service Management then automatically creates a purchase order titled \"<b>Request HP EliteBook 850</b>\", with a purchase order line \"<b>Request HP EliteBook 850</b>\".</p>\n</li>\n<li>\n<p>Upon financial and administrative approval, Procurement Manager issues the purchase order titled \"<b>Request HP EliteBook 850</b>\" to <b>Hewlett Packard</b>. For more information about issuing a purchase order, see <a href=\"/doc/423/26.1/managepurchaseorder#Issue\" title=\"SMAX:25.1/ManagePurchaseOrder\">Issue a purchase order</a>.</p>\n</li>\n<li>\n<p><b>Hewlett Packard</b> delivers the HP EliteBook 850 to stock Pheonix A, Sunnyvale.</p>\n</li>\n<li>\n<p>Procurement Manager creates a receiving slip and adds a receiving line for the received HP EliteBook 850. Service Management automatically creates an asset record with a unique ID for the received HP EliteBook 850. For more information about creating a receiving slip, see <a href=\"/doc/423/26.1/managereceivingslip\" title=\"SMAX:25.1/ManageReceivingSlip\">Create and manage receiving slips</a>.</p>\n</li>\n<li>\n<p>The purchase order titled \"<b>Request HP EliteBook 850</b>\" is then fulfilled.</p>\n</li>\n</ol>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}