{
  "title": "Before you begin",
  "content": "<div class=\"mw-parser-output\"><br/>\n<section begin=\"intro\"></section>  \n\n<p>To orchestrate and manage resources efficiently, the suite uses Kubernetes as the platform to provide a reliable approach to scheduling resources and empower the application to be more fault-tolerant. Cloud-native Kubernetes platforms make the provisioning and management of Kubernetes much easier. With the cloud-native Kubernetes, the suite can serve customers in a secure, resilient, and simple way.</p>\n<p>On GCP, the cloud native Kubernetes solution is Google Kubernetes Engine (GKE).</p>\n<h2 class=\"mw-headline\" id=\"Reference_architecture\">Reference architecture</h2>\n<p>The following reference architecture can help you get an overview of the process of deploying the suite on GCP.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"GCP Deployment Architecture\" height=\"667\" src=\"../../../images/GCP_DeploymentArchitecture_v25.1_c504ae8e.png\" width=\"1337\"/> </a></p>\n<h3 class=\"mw-headline\" id=\"Benefits_of_using_GKE\">Benefits of using GKE</h3>\n<p>GKE provides the following benefits:</p>\n<ul>\n<li>There are no more control plane nodes. The cluster has a guaranteed SLA provided by GCP at a lower cost.</li>\n<li>A Worker Node Group is deployed by default, which increases the availability.</li>\n<li>Managed worker nodes enable you to reduce the operational cost of cluster management.</li>\n<li>Cloud-native services are leveraged as much as possible to ease the management experience and reduce the operational cost:\n\t<ul>\n<li>Artifact Registry is used as the container image storage.</li>\n<li>Google Filestore and Persistent Disk are used as persistent storage for the suite product.</li>\n<li>Google CloudSQL is used as a database service for the suite product.</li>\n</ul>\n</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Components\">Components</h3>\n<p>The suite deployment on the GCP includes the following components. </p>\n<ul>\n<li><b>Suite</b>: the suite product such as, Service Management, Cloud Management, and Asset Management, shipped and running in the form of containers and managed by Kubernetes.</li>\n<li><b>Kubernetes</b>: open-source software that allows you to deploy and manage containerized applications at scale.</li>\n<li><b>Public subnet</b>: a public subnet is for external-facing resources such as load balancers, bastion node, and Cloud NAT.</li>\n<li><b>Private subnet</b>: a private subnet is for internal-facing resources such as GKE worker nodes, databases, and NFS storage.</li>\n<li><b>Bastion node</b>: a node that in a public subnet. It is used to connect to resources in a private subnet such as Kubernetes, database, and storage to perform tasks such as deployment, persistent volume setup, database setup, upgrade, and troubleshooting.</li>\n<li><b>Google Kubernetes Engine (GKE)</b>: a fully managed service provided by GCP. Once provisioned, the service is ready to work as a Kubernetes platform for you.</li>\n<li><b>Filestore</b>: a managed NFS service that stores data such as search engine storage, attachments, certificates, and logs used by the containerized applications in Kubernetes. The storage is called Persistent Volume (PV) in Kubernetes.</li>\n<li><strong>Persistent Disk</strong>: a high-performance and highly durable block storage for search engines and RabbitMQ.</li>\n<li><b>CloudSQL</b>: the database service that stores transactional data and metadata used by containerized applications in Kubernetes.</li>\n<li><b>Google Artifact Registry </b>: a managed artifact registry service that is secure, scalable, and reliable. The suite applications are shipped as container images, which are stored in it.</li>\n<li><b>Load Balancer</b>: used to route traffic from external applications to internal applications deployed on Kubernetes. Load balancers triggered from the Kubernetes service are able to discover the backend worker node change and always fit into the latest status of the worker node pool.</li>\n<li><b>Cloud NAT</b>: enables instances in a private subnet to connect to the Internet or other GCP services, but prevents the Internet from initiating a connection with those instances.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Inter-communication_between_components\">Inter-communication between components</h3>\n<ul>\n<li>The Kubernetes cluster, CloudSQL, and FileStore are kept in a private subnet, while other components such as load balancers and bastion node are in a public subnet. For reasons of separating the public and private subnets, see the \"Architecture design considerations\" section below.</li>\n<li>The load balancer works as the entrance of the external traffic. It's usually bound with the site's SMA URL (for example: <code>https://serviceportal.microfocus.com</code>). Once end users open the URL in their browsers or mobile apps, after DNS resolution, the load balancer routes traffic from external applications to the applications in the private subnet.</li>\n<li>DevOps engineers connect to the bastion node in the public subnet and then jump to the private network for cluster management. The bastion node in this scenario works as a Kubernetes client, database client, or NFS client for operation purposes.</li>\n<li>The applications reside inside the Kubernetes cluster in the private subnet. It uses FileStore as its Persistent Volume and CloudSQL as its database, which are also in the private subnet.</li>\n<li>When the applications in the Kubernetes cluster need to connect to the Internet, for example, when you're downloading Docker images for upgrade or downloading a patch, the traffic goes through Cloud NAT to prevent the Internet from initiating a connection with the instances running those applications.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Architecture_design_considerations\">Architecture design considerations</h3>\n<h4 class=\"mw-headline\" id=\"Security\">Security</h4>\n<ul>\n<li>With separated public and private subnets, the network infrastructure is able to provide:\n\t<ul>\n<li>An additional layer of security.</li>\n<li>Independent routing tables configured for every private subnet to control the flow of traffic within and outside the Virtual Private Cloud (VPC).</li>\n</ul>\n</li>\n<li>All OMT and suite components are located in the private subnet. NO direct Internet access is allowed.</li>\n<li>Employee Self-Service (ESS) users and IT agents can only connect to specified ports (for example: 443) for business purposes. A typical traffic path is:<br/>\n<b>End user/IT agent &lt;-&gt; Load balancer (public subnet) &lt;-&gt; GKE worker nodes (private subnet)</b></li>\n<li>DevOps engineers can connect to the bastion node in a public subnet and then jump to the private network for cluster management. Only a limited number of users can access the bastion node. A typical traffic path is:<br/>\n<span id=\"cke_bm_18055S\" style=\"display: none;\"> </span><strong>DevOps engineer &lt;-&gt; Bastion node (public subnet) &lt;-&gt; GKE cluster or FileStore or CloudSQL (private subnet).</strong><span id=\"cke_bm_18055E\" style=\"display: none;\"> </span></li>\n</ul>\n<h4 class=\"mw-headline\" id=\"Availability\">Availability</h4>\n<ul>\n<li>The control plane nodes are managed by GKE with high availability and a guaranteed SLA.</li>\n<li>The load balancer distributes the traffic across worker nodes in different Availability Zones.</li>\n<li>Worker nodes are distributed across Availability Zones.</li>\n<li>NFS (FileStore) provides storage access across Availability Zones.</li>\n<li>Database (CloudSQL) can be easily configured for high availability across Availability Zones.</li>\n</ul>\n<h4 class=\"mw-headline\" id=\"Performance\">Performance</h4>\n<p>The architecture also takes into account the performance balanced against availability. The worker nodes are distributed across multiple Availability Zones instead of regions, which ensures the network latency between different Availability Zones is less than 1 millisecond in most cases and guarantees the minor performance penalty caused by latency.</p>\n<h4 lang=\"EN-GB\" xml:lang=\"EN-GB\">[Optional] Additional load balancer in front of SMAX</h4>\n<p lang=\"EN-GB\" xml:lang=\"EN-GB\">According to your organization's network/security requirements, you may need to setup an additional load balancer in front of Service Management.<br/>\nPlease enable websocket on the additional load balancer if you have installed one.</p>\n<h2 class=\"mw-headline\" id=\"Personas\">Personas</h2>\n<p>The installation process in a production environment involves different roles in your organization. For example, IT administrators manage physical or virtual machines for production use, and the person to install the suite needs to request machines from an IT administrator, who will help prepare the requested machines. Typically the involved roles include:</p>\n<table>\n<tbody>\n<tr>\n<th>Role</th>\n<th>Responsibility</th>\n</tr>\n<tr>\n<td><b>Suite administrator</b></td>\n<td>The person in this role has to ensure the success of the entire installation including verification and post-installation tasks. This person must have a good understanding of the entire installation process, request support from other appropriate roles as needed, and complete the installation once the environment is ready for installation.</td>\n</tr>\n<tr>\n<td><b>Cloud administrator</b></td>\n<td>The person in this role manages resources on GCP. This person grants permissions and changes roles from GCP Console.</td>\n</tr>\n<tr>\n<td><b>IT administrator</b></td>\n<td>The person in this role prepares physical or virtual machines as requested by the Suite Admin.</td>\n</tr>\n<tr>\n<td><b>Network administrator</b></td>\n<td>The person in this role manages network-related configuration for your organization. This person needs to perform network configuration tasks as requested by the Suite Admin.</td>\n</tr>\n<tr>\n<td><b>Storage administrator</b></td>\n<td>The person in this role plans and deploys all types of storage for your organization. This person needs to set up Filestore required by the suite.</td>\n</tr>\n<tr>\n<td><b>Database administrator</b></td>\n<td>The person in this role prepares and configures databases for your organization. This person needs to manage databases as requested by the Suite Admin.</td>\n</tr>\n<tr>\n<td><b>Kubernetes Cluster administrator</b></td>\n<td>The person in this role manages Kubernetes for your organization. This person needs to create and manage Kubernetes cluster as requested by the Suite Admin.</td>\n</tr>\n<tr>\n<td><b>Server administrator</b></td>\n<td>The person in this role performs server-related tasks for your organization. This person needs to build and configure the bastion node.</td>\n</tr>\n<tr>\n<td><b>Directory Services administrator</b></td>\n<td>The person in this role manages directory services for your organization. This person needs to import IDM metadata.</td>\n</tr>\n<tr>\n<td><b>Security administrator</b></td>\n<td>The person in this role manages security-related tasks for your organization. This person needs to prepare certificates and key pairs.</td>\n</tr>\n</tbody>\n</table>\n<section end=\"personas\"></section>  \n\n<h2 class=\"mw-headline\" id=\"Deployment_procedures\">External references</h2>\n<ul>\n<li><a class=\"external text\" href=\"https://kubernetes.io/docs/concepts/overview/what-is-kubernetes/\" rel=\"nofollow\" target=\"1\" title=\"What's Kubernetes?\">What's Kubernetes?</a></li>\n<li><a class=\"external text\" href=\"https://cloud.google.com/kubernetes-engine/docs/concepts/kubernetes-engine-overview\" rel=\"nofollow\" target=\"1\" title=\"What's GKE?\">What's GKE?</a></li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<p><a href=\"/doc/423/26.1/gcpdeploymentfaq\" title=\"SMAX:Main/GCPDeploymentFAQ\">GCP deployment FAQs</a></p>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}