{
  "title": "Select the deployment configuration",
  "content": "<div class=\"mw-parser-output\">\n<div></div>\n<h2 class=\"mw-headline\" id=\"Log_in_to_the_installation_portal\">Log in to the installation portal</h2>\n<ol>\n<li>Copy the installation portal URL to a supported browser. The URL uses the following format: <code>https://&lt;external_access_host&gt;:3000</code>.</li>\n<li>Log in to the installation portal with the administrator credentials that you created in the bootstrap installation:\n\t<ul>\n<li>Username: <code>admin</code></li>\n<li>Password: the password you set up when running the bootstrap installation command</li>\n</ul>\n</li>\n<li>Click <b>LOGIN</b>.</li>\n</ol>\n<p>If you exit the installation portal at any point, the installation process pauses. The next time you log in to the portal, the installation process resumes from the point where you stopped earlier.</p>\n<h2 class=\"mw-headline\" id=\"Select_the_deployment_configuration\">Select the deployment configuration</h2>\n<p>In the installation portal, configure the deployment.</p>\n<ol>\n<li>Select the suite metadata package on your local machine, and then click <b>UPLOAD</b>.</li>\n<li>Choose the <strong>24.3</strong> version, and then click <b>NEXT</b>.</li>\n<li>On the <b>End User License Agreement</b> page, accept the license agreements and data policy.</li>\n<li>Click <b>Next</b>. The <b>Capabilities</b> page opens.\n\t<table>\n<tbody>\n<tr>\n<th>Option</th>\n<th>Description</th>\n<th>Notes</th>\n</tr>\n<tr>\n<td><b>Service Management Automation (SMA)</b></td>\n<td>Services of the SMA suite.</td>\n<td>Mandatory for all customers</td>\n</tr>\n<tr>\n<td><b>Service Manager Portal Service (SMPS)</b></td>\n<td>Services required to integrate an external Service Manager system with SMA Service Portal.</td>\n<td>\n<ul>\n<li>Mandatory for SMA-SM customers</li>\n<li>Optional for SMAX customers who want to additionally deploy one or more Service Manager tenants in their environment</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td><b>Software Asset Management (SAM)</b></td>\n<td>With the hardware and software data discovered by UD and license data retrieved from SMAX, the new SAM capability enables you to calculate and analyze license compliance for the software applications that you are using in your organization. This will reduce the risk of non-compliance and improve visibility into your financial and operational decisions.</td>\n<td colspan=\"1\">Mandatory only for AMX customers</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>The <b>Database</b> page opens. Select one of the following options to configure a database for the OMT IdM. Make sure the database is empty before you begin the installation.\n\t<ul>\n<li><b>Out-of-the-box PostgreSQL:</b> Select this option if you want to configure an embedded database.</li>\n<li><b>PostgreSQL:</b> Select this option if you want to connect to an <a href=\"/doc/423/26.1/gcpdatabase#Set_up_a_PostgreSQL_database_for_CDF_IdM%C2%A0on_the_instance\" title=\"external PostgreSQL database for the OMT IdM\">external PostgreSQL database for the OMT IdM</a>. Provide the following details:\n\t\t<div class=\"admonition\"><div class=\"admonition-icon admonition-important-icon\"></div><div class=\"admonition-content admonition-important-content\"><div><strong>Limitation:</strong>  OMT doesn't support SSL connections to the native Google PostgreSQL database in deployments on GKE. The native Google PostgreSQL server certificate doesn't include the required IP/FQDN for SSL connections to the native Google PostgreSQL database. Therefore, the connection (with sslmode=verify-full) can't be validated and the installation fails. To make OMT connect to the native Google PostgreSQL database with ssl mode after installation, see the solution <a href=\"https://cloud.google.com/sql/docs/postgres/configure-ssl-instance\" title=\"here\">here</a>.</div></div></div>\n<ol start=\"1\">\n<li>Enter the <code>private IP address</code> of the created PostgreSQL instance as <b>Database Host</b> and <code>5432</code> as <b>Port</b>.</li>\n<li>Enter a database name, for example <code>cdfidmdb</code> and <code>the admin user name and password</code> you specified when creating PostgreSQL instance as <b>User</b> and <b>Password</b>.</li>\n<li>Then, select the <b>If no database is found, create a database automatically</b> option. The installer will automatically create an empty database based on the database information you provide.</li>\n</ol>\n</li>\n</ul>\n</li>\n<li>Click <strong>Next</strong>. The <strong>Deployment Size</strong> page opens.</li>\n<li>On the <b>Deployment Size</b> page, select a deployment size (Small, Medium, or Large).</li>\n<li>Click <b>Next</b>. The <b>Connection</b> page opens.</li>\n<li>Enter the external access hostname that you specified to bind with the load balancer's IP (see <a href=\"/doc/423/26.1/gcpsetip\" title=\"SMAX:25.1/GCPSetIP\">Set up IP and external access hostname</a>) and port 443 (which is used to access the suite user interface).</li>\n<li>To use custom certificates, select <b>Use custom certificates</b>. You get extra options to choose the certificate format. When using custom certificates, you must import the Certification Authority(CA) certificates into the browser from where you will log in to the management portal.</li>\n<li>Choose a certificate format.\n\t<ul>\n<li>If you choose the <b>PKCS#1 or PKCS#8</b> option:\n\t\t<ol start=\"1\">\n<li>Select a <b>CA certificate</b> for a root certificate.</li>\n<li>Select a <b>Server certificate</b>.\n\t\t\t<p>The supported certificate formats include: .crt, .cer, and .pem files.</p>\n</li>\n<li>Select a key file. The supported private key formats include <code>PKCS1</code> and <code>PKCS8</code>.</li>\n<li>Enter the private key password for the encrypted private key file.\n\t\t\t<ul>\n<li>The root certificate must be trusted and from the parent domain.</li>\n<li>The server certificate, a certificate chain, must contain the origin server certificate (server.crt) and all intermediate certificates. The root certificate/CA is optional for the server certificate.</li>\n<li>The server certificate must be in the following sequence: the original server certificate, the intermediate certificated, and the root certificate. Merge all the certificates into a certificate chain.</li>\n</ul>\n</li>\n</ol>\n</li>\n<li>If you choose the <b>PKCS#12</b> option:\n\t\t<ol start=\"1\">\n<li>Choose a CA .crt file for CA certificate.</li>\n<li>Select a .pfx file for the PKCS#12 file.</li>\n<li>Enter the PKCS#12 file password.</li>\n<li>Enter the private key password.</li>\n</ol>\n</li>\n</ul>\n\tYou can also update the certificates in the management portal after the installation.</li>\n<li>Click <b>Next</b>. The <b>File Storage Page</b> opens.</li>\n<li>On the <b>File Storage</b> page, a list of NFS volumes required for the OMT and suite installation appears. Before you proceed, make sure the required NFS shares for OMT and the suite are already configured and the exported NFS folders are empty.\n\t<p>To configure the file storage, perform the following steps:</p>\n<ol start=\"1\">\n<li>Configure the first volume:\n\t\t<ol start=\"1\">\n<li>Choose <code>Managed NFS</code> as <strong>File System Type</strong>.</li>\n<li>Enter the Filestore IP address. You can find your Filestore IP by navigating to the GCP console &gt; Filestore list page &gt; IP address of your Filestore.</li>\n<li>Enter the Exported Paths of NFS volumes using the<code>/&lt;Fileshare name&gt;/&lt;base directory&gt;/&lt;volume label on the web UI&gt;</code> format. You can find your &lt;Fileshare name&gt; by navigating to the GCP console &gt; <b>Filestore</b> list page &gt; <b>Fileshare name</b> of your Filestore. For example, if you provide the &lt;base directory&gt; as <code>/var/vols/itom/itsma/</code> and the current volume's display label shows <code>db-backup-vol</code>, the exported path should be <code>/&lt;Fileshare name&gt;/var/vols/itom/itsma/db-backup-vol</code>.</li>\n</ol>\n</li>\n<li>Although you can repeat the steps above to manually configure the rest of the NFS volumes, we recommend using the <b>Auto-fill</b> button if all of the NFS volumes that you have exported meet the following conditions:\n\t\t<ul>\n<li>are on the same NFS server</li>\n<li>are located in the same parent folder (&lt;base directory&gt;)</li>\n<li>follow the same exported path naming rule: &lt;base directory&gt;/&lt;volume label on the web UI&gt;</li>\n</ul>\n\t\tOnce you have turned on the <b>Auto-fill</b> button, the installer automatically configures the remaining NFS volumes for you as follows:\n\n\t\t<ul>\n<li><b>File System Type</b>: same as the file system type that you provided for the first volume.</li>\n<li><b>File Server</b>: same as the Filestore IP address that you provided for the first volume.</li>\n<li><b>Exported Path</b>: <code>/&lt;Fileshare name&gt;/&lt;base directory&gt;/&lt;volume label on the web UI&gt;</code>. You can find your &lt;Fileshare name&gt; by navigating to the GCP console &gt; <b>Filestore</b> list page &gt; <b>Fileshare name</b> of your Filestore. For example, if you provide the &lt;base directory&gt; as <code>/var/vols/itom/itsma/</code> and the current volume's display label shows <code>db-backup-vol</code>, the installer automatically populates the exported path field with <code>/&lt;Fileshare name&gt;/var/vols/itom/itsma/db-backup-vol</code>.</li>\n</ul>\n</li>\n<li>Click <b>Next</b>. The system validates the volume configurations and then proceeds to the next screen if the validation succeeds. If the validation fails, you need to reconfigure the volumes and then click <b>Next</b> again. Note that the validation process may take a few minutes.</li>\n</ol>\n</li>\n<li>A warning appears. Click <b>Yes</b> to continue the deployment.\n\t<p>After you click <b>Yes</b>, you can't go back to the Select phase.</p>\n</li>\n</ol>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}