{
  "title": "Generic relationship fields",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>\n<p class=\"mw-empty-elt\"></p>\n</div>\n<p>Service Management includes the following out-of-the-box generic relationship fields to support specific customer needs:</p>\n<h2 class=\"mw-headline\" id=\"IncidentToCompany\">IncidentToCompany</h2>\n<p>You can use this to create relationships between incidents and vendors. However, Service Management best practice for assigning an <b>incident</b> to a <b>vendor</b> (company), is to associate the incident with a group - such as an expert group, or a service desk group - that represents the vendor. An OLA Service Agreement measures the time an incident is in a group, if the incident is assigned to such a group. Therefore, if instead the incident is assigned to a vendor (company), service agreements are unable to measure the service level performance of the vendor.</p>\n<h2 class=\"mw-headline\" id=\"RequestToCompany\">RequestToCompany</h2>\n<p>You can use this to create relationships between requests and vendors. However, Service Management best practice for assigning a <b>request</b> to a <b>vendor</b> (company), is to associate the request with a group - such as an expert group, or a service desk group - that represents the vendor. An OLA Service Agreement measures the time a request is in a group, if the request is assigned to such a group. Therefore, if instead the request is assigned to a vendor (company), service agreements are unable to measure the service level performance of the vendor.</p>\n<h2 class=\"mw-headline\" id=\"DeviceToCompany\">DeviceToCompany</h2>\n<p>You can use this to create relationships between devices and vendors. Here are two best practice examples that bad usage of this generic relationship may violate:</p>\n<ul>\n<li>Associate a <b>device</b> with a maintenance <b>contract</b>, and then to associate the maintenance contract with the <b>vendor</b> (company).</li>\n<li>Associate a <b>device</b> with a <b>brand</b>. (There is a relationship - <b>Owner</b> - which creates a connection between the brand and the vendor.)</li>\n</ul>\n<p>Therefore, the following examples are <b>not</b> best practices, and are <b>not</b> recommended:</p>\n<ul>\n<li>Associate a <b>device</b> with the <b>vendor</b> who is responsible for the maintenance of the device.</li>\n<li>Associate a <b>device</b> with its <b>manufacturer</b>.</li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<div class=\"Admonition_Important\">\n<p><span class=\"autonumber\">Important</span> You should only use these relationships after ensuring that you fully understand the consequences of their use. For example, in some cases, use may breach Service Management best practices, and adversely affect functionality and future upgrades.</p>\n</div>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/editform\" title=\"SMAX:25.1/EditForm\">How to edit a form</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}