{
  "title": "Get started with Aviator",
  "content": "<div class=\"mw-parser-output\"><p>Aviator is a virtual assistant built upon a private Large Language Model (LLM). It seamlessly integrates advanced language models to ease natural and effective conversations, while adhering to stringent privacy and data security requirements essential for businesses, government agencies, and organizations.</p>\n<p>Aviator excels at facilitating domain-specific conversations by leveraging real-time enterprise data and documents. With adaptive chunking, Aviator processes only the relevant information. This makes it a valuable tool for IT, HR, sales, and support desk teams, streamlining processes and providing highly relevant virtual agent services. </p>\n<p>You can use Aviator in <a href=\"/doc/423/26.1/useaviatorinserviceportal\" title=\"Use Aviator\">Service Portal</a>, <a href=\"/doc/423/26.1/useaviatoragentinterface\" title=\"Use Aviator\">Agent Interface</a>, <a href=\"/doc/206/smax/releasenotes\" title=\"Release notes\">Mobile app</a>, and <a href=\"/doc/423/26.1/integrateteamsbot\" title=\"Teams bot integration\">Microsoft Teams bot</a>.</p>\n<h2>Aviator in Service Portal</h2>\n<p>Aviator in Service Portal offers these features:</p>\n<ul>\n<li><strong>Knowledge base integration</strong>: Enables Q&amp;A interactions based on your knowledge base.</li>\n<li><strong>Reference articles and news</strong>: Provides support for referencing articles, news, offerings, and remote articles with Access Control Lists (ACL).</li>\n<li><strong>Intent and offering suggestions</strong>: Offers assistance in suggesting intents and relevant offerings.</li>\n<li><strong>Request/incident handling:</strong> Provides suggested solutions and summarize the current request/incident.</li>\n<li><strong>Self-managed conversations:</strong> Allows you to chat across multiple topics/conversations by switching between the self-managed conversations.</li>\n<li><strong>Feedback management</strong>: Allows you to collect, report, and export user feedback.</li>\n<li><strong>Toxicity prevention</strong>: Implements safeguards to prevent toxic or inappropriate content.</li>\n<li><strong>Mode switching</strong>: Gives the option to switch between Classic and Aviator modes after activation.</li>\n<li><strong>Open topic toggle</strong>: Incorporates a toggle to allow or disallow open-topic conversations.</li>\n<li><strong>Configurable disclaimer message</strong>: Allows you to customize and configure the disclaimer message according to your needs.</li>\n</ul>\n<p>The following content sources equip Aviator in Service Portal with essential context to quickly resolve issues across a diverse array of data sources.</p>\n<ul>\n<li>Knowledge articles</li>\n<li>News</li>\n<li>Catalog offerings</li>\n<li>Virtual agent intents defined by the VA Admin</li>\n<li>External articles indexed by using <a href=\"/doc/423/26.1/indexknowledgefromidol\" title=\"Index external knowledge using IDOL connectors\">IDOL connectors</a>.</li>\n<li>Record types available in Service Portal</li>\n</ul>\n<h2>Aviator in Agent Interface</h2>\n<p>Aviator in Agent Interface is an assistant panel designed to boost agents' efficiency and productivity while enhancing the overall user experience. Much like Aviator in Service Portal, Aviator in Agent Interface can answer common questions with human-like responses based on your knowledge base.</p>\n<p>You can use Aviator in Agent Interface for the following use cases.</p>\n<h3 id=\"Record_management\">Record management</h3>\n<p>Service Management provides robust record management capabilities, which are further enhanced by incorporating Aviator.</p>\n<ul>\n<li>While analyzing a record (with all OOB and custom application record types which can be searched out by IDOL, such as incident, request, change, problem, … and those record types defined in custom applications), the agent can request Aviator to provide a summary based on title, description, updates, and comments.</li>\n<li>While analyzing an incident or request, the agent can ask Aviator for suggested solutions and pose follow-up questions.</li>\n<li>Aviator can automatically analyze the sentiment expressed by end users in Requests. If the sentiment is negative, a business rule assigns the Request to your chosen Service Desk group, ensuring that such Requests are responded to quickly.</li>\n<li>When a Request is escalated due to negative sentiment, the agent can request Aviator to generate and send an email (based on the negative portion of the request) to the requester that addresses their expressed concerns and provides assurance that the issue is being looked into. </li>\n<li>When an Incident is selected as a knowledge candidate, Aviator can automatically generate a draft knowledge article based on information in the Incident. </li>\n<li>While analyzing an Incident, the agent can request Aviator to propose a solution based on information in the Incident. This solution is saved in the Solution field of the Incident.</li>\n</ul>\n<h3>Change management</h3>\n<p>When evaluating a Change, the agent can request Aviator to generate a risk assessment and risk score for the Change. </p>\n<h3>Event management</h3>\n<p>When analyzing an event in AI Operations Management, Aviator displays technical information to aid in diagnosing or resolving the issue. Users can then ask follow-up questions for better event management.</p>\n<p>For more information, see <a href=\"/doc/116/saas/getstartedaviator\" title=\"Operations Bridge documentation\">AI Operations Management documentation</a>.</p>\n<h2>Comprehensive guide to Aviator</h2>\n<p>With the ITOM Aviator license, you can add the Aviator capability for your tenant as the suite admin.</p>\n<p>This table provides a comprehensive overview, covering everything from initial setup to troubleshooting. Use it to navigate easily between different topics related to Aviator.</p>\n<table cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<thead>\n<tr>\n<th scope=\"col\">Section</th>\n<th scope=\"col\">Task</th>\n<th scope=\"col\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Get started</td>\n<td><a href=\"/doc/423/26.1/aviatoroverview\" title=\"Aviator overview\">Aviator overview</a></td>\n<td>Check the Aviator support matrix and the architecture diagram to understand how Aviator functions.</td>\n</tr>\n<tr>\n<td>Install</td>\n<td><a href=\"/doc/423/26.1/addaviator\" title=\"Add the Aviator capability for your tenant\">Add the Aviator capability for your tenant</a></td>\n<td>The suite admin adds the Aviator capability to the required tenant.</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"5\">Administer</td>\n<td><a href=\"/doc/423/26.1/enableaviator\" title=\"Enable Aviator\">Enable Aviator</a></td>\n<td>The tenant admin enables the Aviator capability on the tenant and assigns user access permissions. </td>\n</tr>\n<tr>\n<td>\n<ul>\n<li><a href=\"/doc/423/26.1/adminaviator#Configure_Aviator_business_rule\" title=\"Configure Aviator\">Configure Aviator</a></li>\n<li><a href=\"/doc/423/26.1/aiconfig\" title=\"Configurations\">Configurations</a></li>\n</ul>\n</td>\n<td>The tenant admin customizes the settings to use the Aviator capability more effectively. For example, the tenant admin can configure the Aviator business rule for various use cases, including risk assessment, sentiment analysis, and knowledge creation. </td>\n</tr>\n<tr>\n<td><a href=\"/doc/423/26.1/aisreindex\" title=\"Perform a full reindex for Aviator\">Perform a full reindex for Aviator</a></td>\n<td>To ensure up-to-date and accurate search data when using Aviator, the tenant admin can choose to perform a full reindex for intents, offerings, and articles.</td>\n</tr>\n<tr>\n<td><a href=\"/doc/423/26.1/indexknowledgefromidol\" title=\"Index external knowledge using IDOL connectors\">Index external knowledge using IDOL connectors</a></td>\n<td>The tenant admin can use IDOL connectors to index knowledge articles from various external sources (such as SharePoint and Confluence) to Aviator. This allows Aviator to generate more accurate and relevant answers based on these external sources.</td>\n</tr>\n<tr>\n<td><a href=\"/doc/423/26.1/136-aviatormodels\" title=\"Aviator models\">Aviator models</a></td>\n<td>With permission to access the Aviator Model record type, you can customize various parameters of Aviator models and utilize these models to help Aviator fulfill specific business requirements such as summarizing tickets and suggesting solutions.</td>\n</tr>\n<tr>\n<td colspan=\"1\" rowspan=\"3\">Use</td>\n<td><a href=\"/doc/423/26.1/useaviatorinserviceportal\" title=\"Use Aviator\">Use Aviator in Service Portal</a></td>\n<td>Users chat with Aviator to get the answers needed.</td>\n</tr>\n<tr>\n<td><a href=\"/doc/423/26.1/useaviatoragentinterface\" title=\"Use Aviator in the Agent interface\">Use Aviator in Agent Interface</a></td>\n<td>Agent users chat with Aviator to get the answers needed, analyze the sentiment of Requests and escalate them if required, automatically generate emails and Knowledge articles, and perform risk assessment of Changes.</td>\n</tr>\n<tr>\n<td>\n<div><a href=\"/doc/423/26.1/supportmatrixonprem#Language_support\" title=\"Language support\">Language support</a></div>\n</td>\n<td>Besides English, Aviator supports many other languages. Check the <em>Language support</em> section for more information about Aviator's multilingual support and limitations.</td>\n</tr>\n<tr>\n<td>Troubleshoot</td>\n<td><a href=\"/doc/423/26.1/troubleshootaviator\" title=\"Troubleshoot Aviator\">Troubleshoot Aviator</a></td>\n<td>This section addresses and provides solutions for potential issues you may encounter with the Aviator capability.</td>\n</tr>\n</tbody>\n</table>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}