{
  "title": "Search",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>You can search in Service Management.</p>\n<h2 class=\"mw-headline\" id=\"Searching_lists\">Searching lists</h2>\n<p>To find a particular value in a list field, you can enter the beginning of any word in the value you are looking for. All values that have words beginning with the string that you enter are displayed.</p>\n<p>For example, when editing a service request, to find a particular user in the <b>Requested by</b> field, enter <b>John</b> in the field. All values where the first name, last name, or name values start with <b>John</b> are displayed. For example:</p>\n<ul>\n<li>David John Smith</li>\n<li>Smith, John</li>\n<li>Peters, John</li>\n<li>Johnson, Andrew</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>For most lists, you can search only by the beginning of the string. For those lists, <b>bel</b> displays <b>Bella</b>, but not <b>Isabella</b>.</p>\n<p>However, for the following list fields, you can search for a string that begins any word in the list entry. Words can be separated by - (dash), _ (underscore), or / (slash):</p>\n<ul>\n<li>Person</li>\n<li>Group</li>\n<li>Location</li>\n<li>Category</li>\n<li>Offering</li>\n</ul>\n<p>For example, <b>dav</b> displays <b>William David Smith</b>.</p>\n</div>\n</div>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\"> If the search string contains one of the following special characters, a prefix <strong>\\</strong> must be added so that the search can return the expected result. \n\n<ul>\n<li>*</li>\n<li>?</li>\n<li>+</li>\n<li>$</li>\n<li>(</li>\n<li>)</li>\n<li>[</li>\n<li>]</li>\n<li>|</li>\n<li>^</li>\n<li>.</li>\n<li>\\</li>\n</ul>\n<p>For example, if there is an available value <strong>Assistance (SC1) Application</strong> of the list, entering the search string <strong>Assistance (SC1)</strong> will not show you this value. Instead, you need to enter <strong>Assistance \\(SC1\\)</strong> to receive the expected result.</p>\n</div>\n</div>\n<h2 class=\"mw-headline\" id=\"Global_search\">Global search</h2>\n<p>Service Management uses an IDOL (Intelligent Data Operating Layer) based search. IDOL indexes new information at regular intervals to ensure that new searches return up-to-date results.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>It may take up to five minutes for newly added items to appear in the search results.</p>\n</div>\n</div>\n<p>The global search covers all of Service Management. The search automatically searches all the record type fields that are indexed by IDOL and are configured to be searchable.</p>\n<ul>\n<li>\n<p>For article and offering records, the search also searches the comments entered in the <b>Discussions</b> tab.</p>\n</li>\n<li>\n<p>Location information is also searched (relevant for device records and location-based Live Support calls).</p>\n</li>\n<li>\n<p>By default, the global search excludes request and incident records to which <b>all</b> of the following apply:</p>\n<ul>\n<li>\n<p>Record was closed at least six months previously.</p>\n</li>\n<li>\n<p>Record isn't marked as a knowledge candidate.</p>\n</li>\n</ul>\n<p>You can include these records in a search by selecting the <b>Include older records</b> option. Once selected, the option remains enabled until you close the search in the module you are working in. The <b>Include older records</b> option is also displayed in the <span class=\"SAW_VariablesSACM\">Service Asset and Configuration Management</span> search, and all related record searches.</p>\n</li>\n</ul>\n<p>To search:</p>\n<ol>\n<li>\n<p>Click the <b>Search</b>  <a class=\"image\" href=\"/file/images/4/48/2018.08_Helpcenter/Resources/Images/Icons/SearchIcon.png\" title=\"/file/images/4/48/2018.08_Helpcenter/Resources/Images/Icons/SearchIcon.png\"> <img alt=\"Search icon\" decoding=\"async\" height=\"13\" src=\"../../../images/SearchIcon_1b94f74f.png\" width=\"13\"/> </a> button on the main <span class=\"SAW_VariablesToolbar\">toolbar</span>.</p>\n</li>\n<li>\n<p>In the search box, type the word or words you are looking for.</p>\n<p>A search string must contain a minimum of two characters. If you include a wildcard, the search string must contain at least three characters.</p>\n</li>\n<li>\n<p>Click <b>Search</b>. The search displays a maximum of 30 results at a time.</p>\n<p>Click a search result to display a preview of the content in the <span class=\"SAW_VariablesSidebar\">right pane</span>. Click the <b>View details</b> link to open the record.</p>\n</li>\n</ol>\n<p>You can add Boolean operators to narrow your search results.</p>\n<table>\n<tbody>\n<tr>\n<th>Task</th>\n<th>Boolean operator</th>\n<th>Example</th>\n</tr>\n<tr>\n<td>\n<p>Search for a phrase. You can specify that the search results contain a specific phrase. The search engine ignores certain commonly used words.</p>\n<p><b>Example:</b> a, an, the, of, to, be, you, your, when, however, for, that, can (and more).</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-tip-icon\"></div>\n<div class=\"admonition-content admonition-tip-content\">\n<p class=\"mw-empty-elt\"></p>\n<ul>\n<li>\n<p>If your search results aren't successful, delete less important words.</p>\n</li>\n<li>\n<p>To search for multiple strings, separate the individual strings with plus symbols or spaces, and put quotation marks around each string.</p>\n<p><b>Example</b>: \"Change Coordinator\", \"Role\", or \"Workflow\"</p>\n</li>\n</ul>\n</div>\n</div>\n</td>\n<td>\" \" (Double quotation marks)</td>\n<td>\"Change Coordinator\"</td>\n</tr>\n<tr>\n<td>Search for a string that contains one (or any) of the words in the search string.</td>\n<td>\n<p>OR</p>\n<p>+</p>\n</td>\n<td>\n<p>cat OR dog OR mouse</p>\n<p>cat + dog + mouse</p>\n</td>\n</tr>\n<tr>\n<td>Search for two or more specific strings.</td>\n<td>AND</td>\n<td>cat AND dog</td>\n</tr>\n<tr>\n<td>Search for all topics that don't contain a specific word or phrase.</td>\n<td>NOT</td>\n<td>NOT cat</td>\n</tr>\n<tr>\n<td>Search for all topics that contain one string and don't contain another.</td>\n<td>\n<p>EOR</p>\n<p>XOR</p>\n</td>\n<td>\n<p>cat EOR mouse</p>\n<p>cat XOR mouse</p>\n</td>\n</tr>\n<tr>\n<td>Search for a match of any number of characters.</td>\n<td>*</td>\n<td>ca*</td>\n</tr>\n<tr>\n<td>Combine search tasks.</td>\n<td>( ) parentheses</td>\n<td>cat AND (dog OR mouse)</td>\n</tr>\n</tbody>\n</table>\n<p>For keyboard shortcuts, see <a href=\"/doc/423/26.1/accessibility#Keyboard_navigation\" title=\"SMAX:25.1/KeyboardShortcuts\">Keyboard navigation</a>.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>\n<p>If you search for one or more words, <b>or</b> is inferred. For example, if you type \"mail server\" the search looks for \"mail server\" or \"mail\" or \"server\".</p>\n</li>\n<li>\n<p>Service Management sorts search results by relevancy and displays a result type summary. You can filter the search results if you click the type.</p>\n<p><b>Example</b>: If a search produced a summary of:  <i>All (6) Change (2) Service component (2) Problem (2)</i>, click \"Problem\" to display only results of that type.</p>\n</li>\n<li>\n<p>New records/updates to records are available in the search a few minutes after adding/updating the records.</p>\n</li>\n<li>\n<p>So far as <a href=\"/doc/423/26.1/discussions\" title=\"SMAX:25.1/Discussions\">Discussions</a> are concerned, only public comments are included in the search.</p>\n</li>\n<li>Data in encrypted fields isn't included in the search.</li>\n<li>For SACM, when a username changes, it becomes unsearchable in global search.</li>\n</ul>\n</div>\n</div>\n<h2 class=\"mw-headline\" id=\"Enhanced_search_suggestions\">Enhanced search suggestions</h2>\n<p>This feature promotes certain search results, giving them prominence over others. It does this, based on certain factors, so as to help the user more quickly find the best result.</p>\n<p>There are the following types of enhanced search suggestions:</p>\n<h3 class=\"mw-headline\" id=\"Context_based_enhanced_search_suggestions\">Context based enhanced search suggestions</h3>\n<p>This type of suggestion uses the content of the current record, and the context of other records as reflected in their service, category, or included device.</p>\n<p>The order of display of the search results takes into account, and gives certain precedence to records:</p>\n<ul>\n<li>Containing words in their title or description that are similar to those of the current record, and</li>\n<li>Sharing the same service, category, or related configuration item (CI) as the current record.</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>Context based enhanced search suggestions aren't a part of the <span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span>.</p>\n</div>\n</div>\n<p>Context based enhanced search suggestions affect the records that display in the following cases:</p>\n<table>\n<tbody>\n<tr>\n<th>User viewing</th>\n<th>Enhanced search suggestion availability</th>\n</tr>\n<tr>\n<td>Change record</td>\n<td>In the <b>Related records</b> tab, when you click to add a record (either for Causes of the change, or Effects of the change).</td>\n</tr>\n<tr>\n<td>Incident record</td>\n<td>\n<p>In the <b>Resolution</b> section of the <b>General</b> tab, when you click <b>Suggested solutions</b> or <b>Find more solutions</b>.</p>\n<p>In the <b>Related records</b> tab, when you click to add a record (either for Depends on this incident, or This incident depends on).</p>\n</td>\n</tr>\n<tr>\n<td>Request record</td>\n<td>\n<p>In the <b>Resolution</b> section of the <b>General</b> tab, when you click <b>Suggested solutions</b> or <b>Find more solutions</b>.</p>\n<p>In the <b>Related records</b> tab, when you click to add a record (either for Depends on this request, or This request depends on).</p>\n</td>\n</tr>\n<tr>\n<td>Request record in Live Support</td>\n<td>All searches in the <b>Suggestions Bar</b>.</td>\n</tr>\n</tbody>\n</table>\n<h3 class=\"mw-headline\" id=\"History_based_enhanced_search_suggestions\">History based enhanced search suggestions</h3>\n<p>This type of suggestion benefits from the ability of the search to dynamically learn from historical usage in similar records. It uses the content of the current record, and the content of certain other record types, as detailed below.</p>\n<p>For example, when searching for an offering, history based enhanced search suggestions look at request records, because requests are the record type connected with offerings for the purposes of this functionality. (For details, see the table below.)</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>This feature depends on the accuracy of the underlying records, and in particular good practice when it comes to the classification and selection of records using the right models, offerings, services, and categories.</p>\n<p>For example, if a user creates a request using the correctly matching offering, that should improve the quality of the history based enhanced search suggestions for offerings. Similarly, if a user creates a request without the correctly matching offering, that doesn't improve the accuracy.</p>\n</div>\n</div>\n<p>History based enhanced search suggestions affect the records that display as summarized in the following table:</p>\n<table>\n<tbody>\n<tr>\n<th>Record searched for</th>\n<th>Record types examined</th>\n</tr>\n<tr>\n<td>Offering</td>\n<td>Request</td>\n</tr>\n<tr>\n<td>Change model</td>\n<td>Change</td>\n</tr>\n<tr>\n<td>Release model</td>\n<td>Release</td>\n</tr>\n<tr>\n<td>Incident model</td>\n<td>Incident</td>\n</tr>\n<tr>\n<td>Actual service</td>\n<td>\n<p>Request</p>\n<p>Incident</p>\n<p>Change</p>\n</td>\n</tr>\n<tr>\n<td>Category</td>\n<td>\n<p>Request</p>\n<p>Incident</p>\n<p>Change</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p>Here is an example of how the enhanced search suggestions feature works:</p>\n<h3 class=\"mw-headline\" id=\"Enhanced_search_suggestions_example\">Enhanced search suggestions example</h3>\n<p>For example, when a Service Management user clicks the drop-down for <b>offering</b>, context and history based enhanced search suggestion does all of the following:</p>\n<ul>\n<li>Looks at offering records for offerings with similar title and description as the title and description of the new request, and suggests these if the textual match is highly ranked.</li>\n<li>Looks at request records with text (in their title and description) that's similar to the text in the current record being worked on.</li>\n<li>If any of the fields of the new request are already selected (for example, the actual service or category), the feature favors requests with similar values for service or category (provided the title and description match the new request text).</li>\n<li>Selects those offerings that are best matched, either by their own characteristics, or by similar request records.</li>\n<li>Promotes the display of these offerings to the top of the list of offerings otherwise available for selection.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/listviewcolumns\" title=\"SMAX:25.1/ListViewColumns\">List view columns</a></li>\n<li><a href=\"/doc/423/26.1/filters\" title=\"SMAX:25.1/Filters\">Filters</a></li>\n<li><a href=\"/doc/423/26.1/views\" title=\"SMAX:25.1/Views\">Views</a></li>\n<li><a href=\"/doc/423/26.1/discussions\" title=\"SMAX:25.1/Discussions\">Discussions</a></li>\n<li><a href=\"/doc/423/26.1/taskplans\" title=\"SMAX:25.1/Taskplans\">Task plans</a></li>\n<li><a href=\"/doc/423/26.1/editrecpreview\" title=\"SMAX:25.1/EditRecPreview\">How to edit records using the Preview pane</a></li>\n<li><a href=\"/doc/423/26.1/history\" title=\"SMAX:25.1/History\">History</a></li>\n<li><a href=\"/doc/423/26.1/dateandtime\" title=\"SMAX:25.1/DateAndTime\">Date and time</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}