{
  "title": "Manage IDOL knowledge indexing",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>This page describes the general setup, administration, and best practices for IDOL knowledge indexing. For how to set up IDOL indexing for a particular type of knowledge source, see the page for the corresponding IDOL connector listed in the <em>Related topics</em> section.</p>\n<h2>Recommended hardware specifications for IDOL connectors</h2>\n<p>OpenText recommends the following minimum hardware specifications for servers running IDOL components.</p>\n<ul>\n<li>a dedicated SCSI disk</li>\n<li>4 GB RAM</li>\n<li>100 GB Disk</li>\n<li>a minimum of 2 dedicated CPU - Intel Xeon or AMD Opteron or above</li>\n</ul>\n<p>For details, see <a href=\"https://www.microfocus.com/documentation/idol/IDOL_24_1/IDOLServer_24.1_Documentation/Guides/html/gettingstarted/Content/Install_Run_IDOL/Install/System_Requirements.htm\" title=\"System Requirements\">IDOL connector system requirements</a>.</p>\n<h2>Setting up IDOL knowledge indexing</h2>\n<p> The following describes the high-level setup procedure for the IDOL indexing solution:</p>\n<ol>\n<li>Set up CFS.</li>\n<li>Set up IDOL connectors.</li>\n<li>Set up the required components in Service Management (an OPB Agent and a Knowledge Indexing endpoint).</li>\n</ol>\n<h3 id=\"SharedCompo\">Setting up the shared components</h3>\n<p>The sections below describe the knowledge indexing setup procedure for the shared components (CFS, IDOL, the OPB Agent, and a Knowledge Indexing endpoint). Complete the procedure only when you set up the first IDOL connector on the knowledge indexing server.</p>\n<h4>Set up CFS</h4>\n<p>Perform the following steps to set up CFS:</p>\n<ol>\n<li>\n<p>Download the following packages from the <a href=\"https://marketplace.opentext.com/itom/content/idol-connectors-for-service-management\" title=\"ITOM Marketplace\">ITOM Marketplace</a> to the knowledge indexing server.</p>\n<ul>\n<li>\n<p>CFS</p>\n</li>\n<li>\n<p>IDOL connector OEM license</p>\n</li>\n<li>\n<p>IDOL connector lua scripts</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Extract the packages to the respective folders.</p>\n</li>\n<li>Copy the following files to the CFS folder.\n\t<ul>\n<li>\n<p><code>licensekey.dat</code> and <code>versionkey.dat</code> (in the <i>IDOL </i><em>connector </em><em>OEM license </em>folder)</p>\n</li>\n<li><code>addDoc.lua</code>, <code>deleteDoc.lua</code>, and <code>util.lua</code> (in the <i>IDOL </i><em>connector lua scripts </em>folder)</li>\n</ul>\n</li>\n<li>\n<p>Open <code>config.ini</code> in the CFS folder with a text editor, and then replace the value of the <strong>Folder</strong> parameter with the path to a folder on the knowledge indexing server. Replace all instances of the value in all the sections.</p>\n<p>CFS will output intermediate files to this folder, and OPB will read and process these files. Therefore, this folder must be accessible to both the CFS and OPB Agent services. The folder name can only contain letters, digits, underscores(_), and hyphens(-). The folder is referred to as the <strong>indexing shared folder</strong> in later steps.</p>\n<p>You need to enter the path to the same folder when configuring the knowledge indexing endpoint in Service Management.</p>\n</li>\n</ol>\n<h4>Install the OPB Agent and configure an agent</h4>\n<p>Download and install an OPB Agent on the knowledge indexing server, and configure an agent in Service Management. For more information, see <a href=\"/doc/423/26.1/opbinstall\" title=\"SMAX:25.1/OpbInstall\">How to use On-Premises Bridge agents on Windows</a> or <a href=\"/doc/423/26.1/opbinstalllinux\" title=\"SMAX:25.1/OpbInstallLinux\">How to use On-Premises Bridge agents on Linux</a>.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>Don't start the OPB Agent service at this point.</p>\n</div>\n</div>\n<h4><span style=\"color: rgb(0, 0, 0); font-family: Roboto, sans-serif;\">Create and configure an endpoint</span></h4>\n<p>Create and configure an endpoint for IDOL knowledge indexing in Service Management. </p>\n<ol start=\"1\">\n<li>\n<p>Log in to the agent interface as the tenant admin.</p>\n</li>\n<li>\n<p>Navigate to <strong>Administration </strong>&gt; <strong>Utilities </strong>&gt; <strong>Integration </strong>&gt; <strong>Endpoints</strong>.</p>\n</li>\n<li>\n<p>Create an endpoint that uses the <strong>Knowledge Indexing</strong> endpoint type.</p>\n</li>\n<li>\n<p>Select the endpoint that you created, and click <strong>Configure</strong>.</p>\n</li>\n<li>\n<p>In the <strong>Indexing shared folder </strong>field, enter the path to the indexing shared folder that you configured in <code>config.ini</code> (located in the CFS folder).</p>\n</li>\n</ol>\n<ul>\n</ul>\n<h2>Administering IDOL knowledge indexing</h2>\n<p>This section contains some general IDOL indexing administration and configuration information.</p>\n<h3>Trigger IDOL knowledge indexing</h3>\n<p>To trigger knowledge indexing by a particular IDOL connector, start these services (in this sequence).</p>\n<ul>\n<li>CFS</li>\n<li>The IDOL connector</li>\n<li>OPB</li>\n</ul>\n<p>Start all these services only when you are satisfied with your IDOL connector configuration. Otherwise, follow the instructions in the next section to validate your configuration first.</p>\n<h3>Validate your connector configuration</h3>\n<p>When you are still experimenting with the various configuration parameters supported by a connector, it is advised to perform \"local\" indexing to validate your configuration first and not persist the knowledge to the Service Management database yet. Otherwise, if you persist knowledge to the database and then find out that not all documents you indexed are what you want, you need to figure out ways to remove the unwanted documents from the database, which is usually time-consuming.</p>\n<p>The benefit of \"local\" indexing is that it's very fast to start over and you don't need to spend much time to revert the changes.</p>\n<p>To perform \"local\" indexing, just start the services for CFS and the connector, and don't start the OPB Agent service. If you are not satisfied with the indexing results, update the configuration parameters, delete the local database file (<code>connector_&lt;task name&gt;_datastore.db</code> in the connector folder), and then restart the services for CFS and the connector. This starts a new IDOL indexing process against the configured repositories based on the new configuration. Repeat the above process until you are satisfied with the results.</p>\n<p>To validate your configuration, check the following files:</p>\n<ul>\n<li>\n<p>The <code>synchorize.log</code> file (in the <strong>logs</strong> subfolder of the connector folder): This file records the URLs of pages or documents crawled by the connector.</p>\n</li>\n<li>\n<p>The intermediate files generated by CFS (in the <strong>system\\completed</strong> subfolder of the indexing shared folder): The files contain the content of each page or document crawled by the connector.</p>\n</li>\n</ul>\n<h3>Verify IDOL knowledge indexing</h3>\n<p>After starting the IDOL indexing services, do the following to verify that IDOL knowledge indexing works:</p>\n<ol>\n<li>Open the <code>synchronize.log</code> file in the <strong>logs</strong> folder of the IDOL connector folder. Make sure that a message that resembles the following is found: <code>Finished SYNCHRONIZE for task 'MYTASK'</code> and there are no errors in the log file.</li>\n<li>Go to the indexing shared folder and verify that two folders named <strong>system</strong> and <strong>logs</strong> are created. Typically these folders are created a few minutes after the CFS service is started. </li>\n<li>Normally OPB processes intermediate files output by CFS every 30 minutes. To immediately trigger OPB to start indexing, open the following URL in the browser: <strong>https://&lt;External Access Host&gt;/rest/ess/tests/syncNow</strong>. Here, &lt;External Access Host&gt; is the FQDN of your Service Management system.</li>\n<li>\n<p>Log in to the Service Management agent interface, and wait until the knowledge indexing endpoint screen indicates that the IndexingSyncTask task is completed with a <strong>Success</strong> status.</p>\n</li>\n<li>Wait for up to one hour, and then in the global search box at the top of the screen, enter a keyword that exists in one of the articles of the knowledge repository, select <strong>External knowledge</strong> in the search filter box, and then perform a search. The article should appear in the search results.</li>\n<li>Click <strong>View </strong>to directly open the document in the source system.</li>\n</ol>\n<h3 id=\"reindex\">Make configuration changes take effect</h3>\n<p>To make configuration changes take effect, restart the services for the components used in this solution: CFS, the IDOL connector, and OPB. Note that certain configuration changes require additional steps. See the next section for more information.</p>\n<h3>Re-index knowledge articles</h3>\n<p>For certain configuration changes (such as changing the value for <code>KMSourceDisplayName</code> or <code>ExposeToEntitlementID</code> in <code>config.ini</code> or changing the <code>Url</code> or <code>SitemapUrl</code> value in <code>webconnector.cfg</code>) to take effect,</p>\n<p>To re-index knowledge articles, perform the following steps:</p>\n<ol>\n<li>Stop the services for CFS and the IDOL connector.</li>\n<li>Delete the following files:\n\t<ul>\n<li>The <code>connector_&lt;task name&gt;_datastore.db</code> file in the connector folder</li>\n<li>The content in the <strong>actions</strong> subfolder of the connector folder</li>\n<li>The content in the <strong>actions</strong> subfolder of the CFS folder</li>\n</ul>\n</li>\n<li>Start the services for CFS and the IDOL connector.</li>\n</ol>\n<p><span style=\"color: rgb(0, 0, 0); font-family: Roboto, sans-serif; font-size: 20px;\">Configure the connector to index multiple repositories</span></p>\n<p>By default, the connector configuration file contains one TaskName section (usually called MyTask0) with the parameters for indexing documents from one repository. To configure a connector to index knowledge from multiple repositories, add more TaskName sections and use the <strong>N</strong> and <strong>Number</strong> parameters in the <strong>FetchTasks</strong> section. These parameters (<strong>N</strong>, <strong>Number</strong>) work the same way for all IDOL connectors.</p>\n<p>The example below describes how to index knowledge from two repositories.</p>\n<p>The procedure assumes that you have already completed the configuration of the first repository according to the corresponding documentation. The <strong>FetchTasks</strong> section and the TaskName section (by default called <strong>MyTask0</strong>) contain the following lines at this time:</p>\n<pre><code>[FetchTasks]\nNumber=1\n0=MyTask0\n[MyTask0]\n...\n&lt;parameters for indexing the first repository&gt;\n...\n</code></pre>\n<p>To index the second repository, first make the following changes in the <strong>FetchTasks</strong> section:</p>\n<ul>\n<li>Increase the value of the <strong>Number</strong> parameter to 2 (because we want to index two repositories).</li>\n<li>Add another N (<strong>1</strong>) parameter and set its value to the name of the new TaskName section that we will add for the second repository. Example: <code>1=MyTask1</code>.</li>\n</ul>\n<p>Then add a new TaskName section (by copying the existing <strong>MyTask0</strong> section), rename it to <strong>MyTask1 </strong>(the value of the <strong>1</strong> parameter above), and then make the following updates in the <strong>MyTask1</strong> section:</p>\n<ul>\n<li>Locate the parameters that correspond to the address and credentials of the repository, and then update their values to those of the second repository.</li>\n<li>Change the value of <b>KMSourceIdentityName</b> to a name that identifies the second repository.</li>\n<li>Update other parameter values as required.</li>\n</ul>\n<p> The <strong>FetchTasks</strong> section and the TaskName sections in the connector configuration file now look like this:</p>\n<pre><code>[FetchTasks]\nNumber=2\n0=MyTask0\n1=MyTask1\n\n[MyTask0]\n...\n&lt;parameters for indexing the first repository&gt;\n...\n\n[MyTask1]\n...\n&lt;parameters for indexing the second repository&gt;\n...</code></pre>\n<p>Last, update <code>config.ini</code> in the CFS folder as follows.</p>\n<ul>\n<li>Add another section by copying the existing <strong>[section_n]</strong> section for the connector's first repository. Then change <strong>n</strong> in <strong>[section_n] </strong>to the next section number in the sequence.</li>\n<li>Modify the value of the following parameters in the new section:\n\t<ul>\n<li><strong>KMSourceIdentityName</strong>:<strong> </strong>Enter the same value configured for the second repository in the connector configuration file.</li>\n<li><strong>KMSourceDisplayName</strong>: Enter a name that enables end users to identify knowledge from the second repository in the search results.</li>\n<li><strong>ExposeToEntitlementID </strong>and other parameters: Update them as required.</li>\n</ul>\n</li>\n</ul>\n<p>Restart the IDOL indexing services (the IDOL connector, CFS, and OPB). This will trigger the connector to start indexing knowledge from all the configured repositories.</p>\n<h3 id=\"AccessControl\">Control access to external knowledge for portal users</h3>\n<p>You can control access to external knowledge for Service Portal users. You can prevent all portal users from viewing the content from a particular repository, or restrict content from the respository to specific users, for example, users who are in specific locations, belong to specific groups, or have specific roles.</p>\n<p>To do this, open <code>config.ini</code> (located in the CFS folder) with a text editor, and then configure the following parameters in the section for the corresponding repository:</p>\n<ul>\n<li><strong>ExposeInPortal</strong>: When set to <em>true</em> (default value), both portal users and agent users can take advantage of external knowledge when using the global search or virtual agent. When set to <em>false</em>, only agent users can view or use external knowledge in the global search and virtual agent.</li>\n<li><strong>ExposeToEntitlementID</strong>: Enter comma-separated IDs for entitlement rules you configured in Service Management. You can use the entitlement rule's access control feature to restrict the content to the appropriate portal users.</li>\n</ul>\n<h3>Upgrade IDOL connectors</h3>\n<p>When we release a new version of IDOL connectors on the ITOM Marketplace, you can upgrade the IDOL connectors as follows:</p>\n<ul>\n<li>\n<p>Download and set up the connectors according to the latest documentation.</p>\n</li>\n<li>\n<p>For each connector, copy the <code>connector_&lt;task name&gt;_datastore.db</code> file from the connector folder for the old version to the folder for the new version. The file keeps track of the documents already crawled by the old connector version. Copy these files so that the new connector version won't crawl the same documents one more time. Note that if you set up multiple repositories for the connector, you will have one such file for each repository and you need to copy all of them.</p>\n</li>\n<li>\n<p>Uninstall the old version of the connectors.</p>\n</li>\n</ul>\n<h2>IDOL knowledge indexing best practices</h2>\n<ul>\n<li>Install IDOL connectors and CFS as services. For details, see the <a href=\"https://www.microfocus.com/documentation/idol/IDOL_24_1/IDOLServer_24.1_Documentation/Guides/html/gettingstarted/Content/Shared_Admin/Installation/_ADM_Install_WindowsServices.htm\" title=\"IDOL documentation\">IDOL documentation</a> (for Windows) or <a href=\"https://www.microfocus.com/documentation/idol/IDOL_24_1/IDOLServer_24.1_Documentation/Guides/html/gettingstarted/Content/Shared_Admin/Installation/_ADM_Install_LinuxStartup.htm\" title=\"IDOL documentation\">IDOL documentation</a> (for Linux).</li>\n<li>Encrypt sensitive data that you enter into a configuration file. For details, see the <a href=\"https://www.microfocus.com/documentation/idol/IDOL_24_1/IDOLServer_24.1_Documentation/Guides/html/gettingstarted/Content/Shared_Admin/_ADM_Encrypt_Passwords.htm\" title=\"IDOL documentation\">IDOL documentation</a>.</li>\n<li>Fine-tune your connector configuration until the IDOL indexing process can retrieve the exact knowledge articles that you need. Only after this, index the knowledge to the Service Management database by starting the OPB Agent service. Otherwise, removing unwanted knowledge from Service Management can be time-consuming. Use the process mentioned in the <em>Validate your connector configuration</em> section when you fine-tune the configuration.</li>\n<li>IDOL indexing should be an ongoing process. You should configure the IDOL connectors to run regularly (which is the default behavior). This ensures that the changes that occur in the source system are synced to Service Management.</li>\n</ul>\n<h2>Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/indexknowledgefromidol\" title=\"Index external knowledge using IDOL connectors\">Index external knowledge using IDOL connectors</a></li>\n<li><a href=\"/doc/423/26.1/indexwebpages\" title=\"Index knowledge from web pages\">Index knowledge articles from web pages</a></li>\n<li><a href=\"/doc/423/26.1/indexknowledgeonpremsharepoint\" title=\"Index knowledge articles from SharePoint\">Index knowledge articles from SharePoint</a></li>\n<li><a href=\"/doc/423/26.1/indexcloudconfluence\" title=\"Index knowledge from cloud-hosted Confluence\">Index knowledge articles from Confluence</a></li>\n<li><a href=\"/doc/423/26.1/indexxecm\" title=\"Index knowledge from Extended ECM (xECM)\">Index knowledge articles from Extended ECM</a></li>\n<li><a href=\"/doc/423/26.1/indexcorecontent\" title=\"Index knowledge from OpenText Core Content\">Index knowledge articles from Core Content</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}