{
  "title": "Impact of data domain segmentation",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Data domain assignment impacts the following functionalities.</p>\n<h2 id='\"Disappearing\"_records'><span class=\"mw-headline\" id=\".22Disappearing.22_records\">\"Disappearing\" records</span></h2>\n<p>When you create or edit records, you might make a change that results in an update to the data domain assignment and removes your authorization to view the records (for example, changing the owner of a record assigns the owner's data domains to the record, or changing the location assigns a different group due to a business rule running in the background). This can occur when you are updating or creating records.</p>\n<h3 class=\"mw-headline\" id=\"Updating_records\">Updating records</h3>\n<p>If you are updating a single record and you change a field that affects the data domain assignment, the Health Indicator (the light bulb icon  <a class=\"image\" href=\"/file/images/4/48/2018.08_Helpcenter/Resources/Images/Icons/HealthIconNum.png\" title=\"/file/images/4/48/2018.08_Helpcenter/Resources/Images/Icons/HealthIconNum.png\"> <img alt=\"HealthIconNum.png\" data-file-height=\"15\" data-file-width=\"15\" height=\"15\" src=\"../../../images/HealthIconNum_8491b5e3.png\" width=\"15\"/> </a> ) displays a number (or increments an existing number), indicating that there is a new message–in this case, an information message. This occurs in both the record page itself and in the Preview pane. The relevant message for this action indicates that saving the record will remove your authorization to view that changed record.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> Messages in the Health Indicator appear in the order of severity--first error, then warning, and then information messages.</p>\n</div>\n<p>If you are updating multiple records in the Preview pane, Service Management doesn't display any information message before you save, and only informs you after you have saved the records that you have made a change that removes your authorization to view one or more of those changed records.</p>\n<p>In both cases, saving the records causes the record list to be refreshed, and removes the unauthorized records from the current view.</p>\n<h3 class=\"mw-headline\" id=\"Creating_records\">Creating records</h3>\n<p>If you create a new record and assign a data domain to it which you don't have the authorization to view, you receive the information message, but when you save it, the record doesn't appear in the list of records that you are permitted to view.</p>\n<h2 class=\"mw-headline\" id=\"Search\">Search</h2>\n<p>The ability to view search results is limited by the data domains assigned to the records.</p>\n<h2 class=\"mw-headline\" id=\"History\">History</h2>\n<p>Since a record's history is part of each record, the ability to view that history is limited by the data domains assigned to the record.</p>\n<h2 class=\"mw-headline\" id=\"Comments\">Comments</h2>\n<p>Since comments are part of each record, the ability to view comments is limited by the data domains assigned to the record.</p>\n<h2>Entity Link fields and MANY2MANY fields</h2>\n<p>When drilling down to an Entity Link or MANY2MANY field in a record, in the dropdown list or popup list, agent users can view only values that they have access to according to their data domain permission.</p>\n<p>If the user's data domain permission doesn't allow access to the current Entity Link value or a MANY2MANY field value, the following behavior applies:</p>\n<ul>\n<li>The entity link field displays a value of \"deleted\" to the user</li>\n<li>The MANY2MANY record is hidden from the user</li>\n</ul>\n<p>Example:</p>\n<ol>\n<li>Assign Request X to the HR and IT data domains (Data domains=HR, IT).</li>\n<li>Assign Group A to the HR data domain (Data domains=HR), and Group B to the IT data domain (Data domains=IT).</li>\n<li>Assign Device A to the HR data domain (Data domains=HR), and Device B to the IT data domain (Data domains=IT).</li>\n<li>Grant agent user A only the permission for the HR data domain (by setting the Primary data domain or role permission), and agent user B only the permission for the IT data domain. </li>\n<li>Open Request X as agent user A, and then do the following:\n\t<ol start=\"1\">\n<li>Click the <strong>Service Desk group</strong> field. The field's dropdown list should display Group A, but not Group B. Select Group A from the list. </li>\n<li>Click the <strong>Involved CIs</strong> tab, and then click <strong>Add</strong>. The popup list should display Device A, but not Device B. Select Device A from the list. </li>\n<li>Save the request. You should be able to save the request successfully.</li>\n</ol>\n</li>\n<li>Log in as agent user B, and open request X. You should be able to see the following:\n\t<ul>\n<li>The <strong>Service Desk group</strong> field displays <strong>deleted</strong>.</li>\n<li>The <strong>Involved CIs</strong> tab doesn't show Device A. </li>\n</ul>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Knowledge_and_news_articles\">Knowledge and news articles</h2>\n<p>New knowledge or news articles (either manually created or as the result of creating an article from another record) automatically have the Public data domain assigned to them.</p>\n<p>Agents can't move articles that have data domain assignments to the <b>External</b> phase, nor can agents assign data domains to articles that are currently in the <b>External</b> phase.</p>\n<h2 class=\"mw-headline\" id=\"Tasks_and_task_plans\">Tasks and task plans</h2>\n<p>The visibility of task nodes in a task plan is limited to the data domains assigned to those tasks. For example, an organization can use data domain segmentation to separate access to different types of employee records. Users in data domain X, dealing with employee absences and vacations, would not have access to the task and task plans of data domain Y, dealing with payroll.</p>\n<p>The automatic tasks in a task plan obtain their running scope permissions from the administrator who designed the task plan, not the person who is currently assigned to a particular ticket.</p>\n<p>When viewing a task plan from the parent record's page, if a user isn't permitted to perform a certain task, only the task's progress can be viewed, and it will not be possible for that user to click on the record to view its page, or to see other details about the task.</p>\n<p>A user who has permission to view the parent record can also view the task plan summary, as well as everything related to planning or the status of the parent record. However, this user may not have permission to view the details of all tasks.</p>\n<p>When viewing the task queue, the parent record of a task is hidden from a user if the user doesn't have permission to view that parent record.</p>\n<p>You can use a processing rule in notifications to hide the record name from users who don't have permission to see records of that type. For more information, see <a href=\"/doc/423/26.1/processingrulesinnotifs#hide-record-name-rule\" title=\"SMAX:25.1/ProcessingRulesInNotifs\">Hide record name rule</a>.</p>\n<h2 class=\"mw-headline\" id=\"Approvals\">Approvals</h2>\n<p>An approval task obtains its data domain in a similar way to other tasks.</p>\n<ul>\n<li>If a task is <b>assigned</b> to a person, that person can view the approval even if they aren't authorized to view other records in that data domain.</li>\n<li>If a task is <b>delegated</b> to a person, that person can only view the approval if they are authorized in that data domain.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Reports\">Reports</h2>\n<p>For operational reports, the data reflected in the report depends on the data domains assigned to the user viewing the report. Two users with different assigned data domains who are viewing the same operational report will see reports based on different data.</p>\n<p>For analytic and survey reports, the report is based on data from the data domains assigned to the user who created the report. A user assigned the same data domains or more can view the report. A user assigned fewer data domains than the one who created the report isn't able to view the report (it appears in the Report list but can't be accessed).</p>\n<p>If you select <b>Duplicate</b> to create a duplicate of the analytic or survey report, the new report is visible and it's based on data from the data domains assigned to you.</p>\n<div class=\"example\">\n<p>Example: User A is assigned the HR data domain only and User B is assigned the IT data domain only. User A creates an analytic report based on Request record data consisting of a set of records:</p>\n<ul>\n<li>Request 1 is assigned to the HR data domain</li>\n<li>Request 2 is assigned to the HR and IT data domains</li>\n<li>Request 3 is assigned to the HR data domain</li>\n</ul>\n<p>User A's report includes all 3 records. User B can't view this report because he lacks the HR data domain assignment. However, if User B duplicates the report, he will create a new report with Request 2 only, which has the IT data domain assignment.</p>\n</div>\n<h2 class=\"mw-headline\" id=\"Service_Portal\"><span class=\"SAW_VariablesSelf-Service_Portal\">Service Portal</span></h2>\n<p>The visibility of data displayed on a customized tab is limited by the data domains assigned to the record, while the visibility of Offerings and Articles is limited by entitlement rules.</p>\n<h2 class=\"mw-headline\" id=\"Hot_Topic_Analytics\">Hot Topic Analytics</h2>\n<p>The ability to view Hot topic analytics is limited by the data domains assigned to the record.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/assigndomainprimary\" title=\"SMAX:25.1/AssignDomainPrimary\">Assign data domain permissions to a user, group or role</a></li>\n<li><a href=\"/doc/423/26.1/assigndomainrec\" title=\"SMAX:25.1/AssignDomainRec\">How to assign a record to a data domain</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}