{
  "title": "Incident Flows",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>\n<div class=\"Admonition_Tip\"><span class=\"autonumber\">Incident Flows</span>\n<div>\n<div> \n<p>Now that we have set up a good portion of what we need for incident management, we can look at the incident workflow. Along the way, we will investigate the similarities and differences between incident and request management and how they work together.</p>\n \n\n<div>\n<div><a class=\"image\" href=\"/file/images/2/27/IncidentDataModel.gif\" title=\"/file/images/2/27/IncidentDataModel.gif\"> <img alt=\"IncidentDataModel.gif\" border=\"0\" file=\"/mediawiki/images/2/27/IncidentDataModel.gif\" height=\"800\" hspace=\"0\" src=\"../../../images/IncidentDataModel_975832e2.gif\" style=\"width: 611.011px; height: 800px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"611.011011011011\"/> </a></div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<div>\n<div></div>\n</div>\n<h2>Request and Incident… Better Together</h2>\n<p>You’ve probably noticed that there is quite a bit of similarity between the Request and Incident processes. The real difference between the two is that Request handles requests and issues coming from the consumers of our Services while Incident handles issues on the provider side. I’ve come up with two tenants for our Service Desk to help define what each of these processes is used for:</p>\n<ul>\n<li>Service Request management encompasses the consumer-facing processes that make up the expected, day to day activities involved in providing a service to an individual or group.</li>\n<li>Incident Management encompasses the processes used by the service provider to track and resolve any issue that impacts the ability of a user to consume the service.</li>\n</ul>\n<p>It may have crossed your mind that there will be some situations where we actually need both of these processes. Let’s take a look at an example of this in detail.</p>\n<p>For our example, let’s say one of our End Users has called in because they can’t access the company’s HR web page. When they call in, one of our Agents creates a support request. The goal of that request is to allow the End User to access the web page – or to allow the End User to consume the Service.</p>\n<p>After the Agent works with the End User for a bit over the phone, they determine that there is some type of failure in one of the DNS servers that's causing the issue. Now there is a known issue that's impacting our ability to provide a Service, so they need to also create an Incident. In some cases the Request and Incident might be assigned to the same Agent, but in others there might be one Agent working with the End User (in the Request) and another more technical one working on the server in question (in the Incident).</p>\n<p>Luckily, Service Management makes it easy to link the original Request to the Incident, allowing information to be passed back and forth between the two records. In fact, the Agent working on the Request simply needs to check a box that states that the Service is impacted in some way and Service Management will automatically create a new Incident and link it with the Request. Additionally, new Requests may be related to the same Incident when they come in. When creating the new Request, the Incident will show up in the Agent’s interface as a possibly related Incident in order to make the relation easier to find – and then the Agent can relate the two together with a single click.</p>\n<p>When an Incident is resolved (we’ll look more at the actual workflow in just a minute), the pertinent information is copied to all related Requests. The Requests will automatically move to the Accept phase, which if you remember will send the End User an email to let them know the issue has been resolved. In this way, a single person resolving the Incident can also resolve multiple Requests at the same time – without having to do anything additional!</p>\n<p>For those time when the same Agent is responsible for both the consumer and provider side of the issue, Service Management also allows them to do all of the work on the Request if they desire. If the Request is closed successfully, the Incident will automatically be resolved as well. This works great for our Service Desk Agents that are more technical and work on the actual issues as well as helping the End Users.</p>\n<p>If you are still a little confused by the difference between the two processes, check out this <a href=\"/doc/423/26.1/requestvsincident\" target=\"1\">document</a> which explains it in more detail.</p>\n<h2 id=\"Incident_Workflow\">Incident Workflow</h2>\n<p>Overall, the Incident workflow is very similar to the request workflow. However, the end goals of the two processes are different. While request deals with ensuring that the end user’s issue has been resolved, the incident aims to eliminate any disruption or degradation in the service that the IT department is providing.</p>\n<p><a class=\"image\" href=\"/file/images/9/9c/8.1-IncidentWorkflow.png\" title=\"/file/images/9/9c/8.1-IncidentWorkflow.png\"> <img alt=\"8.1-IncidentWorkflow.png\" border=\"0\" file=\"/mediawiki/images/9/9c/8.1-IncidentWorkflow.png\" height=\"220\" hspace=\"0\" src=\"../../../images/8.1-IncidentWorkflow_8ff73e86.png\" style=\"width: 800px; height: 220px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<h3>Classification</h3>\n<p>Unlike request, there are two phases of the ‘Classification’ step rather than one. The first is the ‘Log’ phase, where the initial information such as the title and description of the issue and what service is being affected. After this information is saved the Incident moves to the ‘Classify’ phase.</p>\n<p>The only additional information required in the ‘Classify’ phase is a category (remember those?). Once the agent enters the category, the Incident will move on to the ‘Resolution’ step. It's important to have the categorization information as the combination of category and service will most likely give us an idea of how this incident should be assigned.</p>\n<p>Once we’ve entered the category (along with all the required fields) the incident moves on to the ‘Resolution’ step.</p>\n<h3>Resolution</h3>\n<p>The ‘Resolution’ step consists of two phases, the ‘Initial Support’ phase and the ‘Escalate’ phase. During the resolution step, the service desk agents work to resolve any disruption that the Incident has caused. They may pass the incident along to one or more expert groups if necessary. These groups aren't part of the day to day operations of the service desk but are Subject Matter Experts (SMEs) that may be necessary to help with specific systems or applications that support our services.</p>\n<p>If it becomes necessary to raise the visibility of the Incident within the organization, the agent can move it into the ‘Escalate’ phase. The primary goal is still to resolve any disruption, but the ‘Escalate’ phase marks the incident as needing more visibility and sends notifications to more personnel.</p>\n<p>Once the source of the service disruption is found and removed the agent can fill in a resolution for the incident, which moves it into the ‘Validation’ step. Remember that to resolve the incident we don’t necessarily have to fix the root cause of the problem, we only need to make sure that service has been restored to the consumers. This may involve providing a workaround to the issue rather than a complete solution.</p>\n<h3>Validation</h3>\n<p>The ‘Validation’ step includes a single phase, ‘Review’. This phase allows the service desk agent (or other designated person) to review the solution used to resolve the incident. If the solution is incorrect (if further testing showed the issue was ongoing for example), the agent may return the Incident to the Initial support phase for further troubleshooting.</p>\n<p>If the solution is correct, the agent needs to add a completion code to the incident before closing it and completing the process. The completion code states how the issue was resolved. It might have been resolved successfully with a fix, or perhaps a workaround was given to the end users. The completion code is very important for many post-incident reports and processes such as problem management, and our agents need to make sure they take the time to fill it in correctly.</p>\n<p>Feel free to take a minute and look at the <a href=\"/doc/423/26.1/imwflw\">incident workflow</a> in the online documentation if you would like.</p>\n<h2>Incident Task Plans</h2>\n<p>I mentioned before when talking about incident models we can assign tasks as part of the incident process. An agent can create tasks for any of the active phases (except for the 'Log' phase). All the tasks created for a specific phase must be completed before the incident can leave that phase. The collection of tasks within an incident (or any type of record) is called a Task Plan.</p>\n<p>These tasks become useful when we use them to assign work related to resolving the incident, such as assigning someone to do some detailed review of the logs during the 'Validation' step.</p>\n<p>You can find more information on <a href=\"/doc/423/26.1/taskplans\">incident task plans</a> (and task plans in general) in the online documentation.</p>\n<h2>Service Level Targets</h2>\n<p>Just like requests (again), incidents may have service level targets defined. While we will get into the whole service level management process in detail later, I did just want to mention one thing. While these targets measure the same things in request and incident, the actual targets can be different between the two processes.</p>\n<h2>Request/Incident Workflow</h2>\n<p>You’ve probably realized that there are going to be times where the same issue is going to result in both the Request and Incident processes being used. For example, if there is a hardware failure that results in the company Email being unreachable we will have:</p>\n<ul>\n<li>One Incident against the Email service that's related to the hardware that's having the failure</li>\n<li>Possibly multiple Requests against the Email service from any End User that's unable to get to their Email</li>\n</ul>\n<p>Luckily, Service Management has built-in interaction between Request and Incident that will reduce the work that our Agents need to do in order to properly run both processes.</p>\n<p>If for some reason our monitoring software did not capture the Incident automatically and we first received a call from an End User about the issue, of course the Agent who received that call will open a Request to restore the Service for the caller. Once they have determined that the actual Service isn't operational and they don't see any active Incidents against the Service, they know they need to create an Incident as well. Using Service Management, all they will need to do is check the “Service Impacted” flag on the Request and Service Management will automatically create the related Incident (and create the link between the Request and the Incident).</p>\n<p>Again in this example, we would probably end up with quite a few Requests that are linked to the Incident, as more and more people end up missing their email. Once our technicians fix the actual issue (or come up with a workaround… again, the point is to restore the ability to provide the Service) the Incident can be resolved. At this point Service Management will automatically resolve all of the related Requests, copying over the resolution. This gives the End Users the ability to accept the resolution and close their Request – with no need for our Service Desk Agents to get involved!</p>\n<p>If for some reason the resolution of the Incident did not restore the Service for any of the callers, then their Request will become active again (and the Service Desk Agent responsible for that Request will be notified). See how the Request and Incident process are still separate, even though they are linked? The Incident is responsible for restoring the ability to provide the Service, and the Request is responsible for ensuring that the customer can again consume the Service.</p>\n<p>Oh, and I know that some of our Service Desk Agents pull double duty as technicians as well, helping to fix various software or hardware problems that occur – thus working on the Incident process as well. To make their job easier, if the Request was originally marked with a “Service Impact” flag the Agent can actually close the Incident from the Request process. If the linked Request is resolved and accepted with one of the following Completion codes:</p>\n<ul>\n<li>Resolved with workaround</li>\n<li>Unable to reproduce</li>\n<li>Abandoned by user</li>\n<li>Incident resolved</li>\n</ul>\n<p>The linked Incident will be updated with the Solution and corresponding Completion code, resolving the Incident. Since the Incident can also turn around and resolve any additional (still active) Requests when it's resolved, our one Service Desk Agent can resolve all of the linked Requests as well as the Incident directly from their own Request!</p>\n<p>Ok, I hope that gave you a good overview of the Incident process, as well as how it interacts with our other main support process – Request. Unfortunately, there seems to be a pretty serious Incident going on right now… I can see my boss kicking one of our database servers. I’ll give you a chance to review what we’ve documented so far while I go and take care of whatever he broke this time. I’ll be back in a bit to talk about some supporting process for both Request and Incident Management.</p>\n<!-- NewPP limit reportCached time: 20200216151005Cache expiry: 86400Dynamic content: falseCPU time usage: 0.024 secondsReal time usage: 0.097 secondsPreprocessor visited node count: 18/1000000Preprocessor generated node count: 46/1000000Post‐expand include size: 13025/2097152 bytesTemplate argument size: 0/2097152 bytesHighest expansion depth: 2/40Expensive parser function count: 0/100Unstrip recursion depth: 0/20Unstrip post‐expand size: 0/5000000 bytes--><!--Transclusion expansion time report (%,ms,calls,template)100.00%    0.000      1 -total-->\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}