{
  "title": "Incident Management",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>\n<div>\n<div class=\"Admonition_Tip\"><span class=\"autonumber\">Incident Management</span>\n<div>\n<div>\n<p><br/>\nAn Incident encompasses any disruption or degradation of a service, whether the service is internal or external. Issues with redundant hardware (or software) are also handled as an incident, even if the degradation isn't apparent to an end user.</p>\n<p>The goal of the incident management process is to resolve the disruption or degradation as quickly as possible. This may often involve enacting a workaround (such as rebooting a server or restarting a specific service) rather than a permanent fix.</p>\n<p>When a similar issue occurs multiple times, each instance should be tracked as a separate Incident. This allows other processes (such as problem management), as well as reporting, to discover trends that will help to find the root cause of the recurring incidents.</p>\n \n\n<div>\n<div><a class=\"image\" href=\"/file/images/2/27/IncidentDataModel.gif\" title=\"/file/images/2/27/IncidentDataModel.gif\"> <img alt=\"IncidentDataModel.gif\" border=\"0\" file=\"/mediawiki/images/2/27/IncidentDataModel.gif\" height=\"800\" hspace=\"0\" src=\"../../../images/IncidentDataModel_975832e2.gif\" style=\"width: 611.011px; height: 800px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"611.011011011011\"/> </a></div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<h2>Setting up Incident Management</h2>\n<p>Previously we set up our request management process to handle everything coming from the consumers of our services. Now we’ll set up the processes we use to support how we provide those services to our end users.</p>\n<p>The first of the “back-office” processes we’ll set up is the incident process. Incident management is triggered when there is an outage or degradation detected in one of our services. We may detect the outage or degradation by monitoring software, it may be found by one of our technicians, or it could even be reported by an end user through a support request. When incidents happen, our IT managers get very grumpy, so we need to set up our process to handle them as quickly as possible.</p>\n<p>In terms of setting up incident management, you’ll be happy to hear we’ve already done most of the setup already. Incident uses the same record categories we created for request, and the same knowledge database we pre-populated with our existing articles. We can set up some new surveys for incidents just like we did for request as well.</p>\n<p>We should set up a few views and reports that are very similar to the ones we created for request. For the reports on the dashboard let’s add:</p>\n<ul>\n<li>My incidents by priority</li>\n<li>Incidents by group</li>\n<li>Incidents by service</li>\n<li>Incident Volume in the Past Month</li>\n</ul>\n<p>Then we can add a few views for our specific service desks to help them out. I’ll set one up to show all the critical incidents, then we can work with the Incident managers to create exactly what they need.</p>\n<h2>Incident Models</h2>\n<p>Another tool we have for incident management is the concept of incident models. Similar to the offerings we have in request management, incident models contain the information to guide our agents through the process of solving common types of Incidents. This information could include:</p>\n<ul>\n<li>Default values for any field (“A production database incident always has an impact of ‘Enterprise’”)</li>\n<li>A list of tasks necessary to resolve the incident</li>\n<li>Unique information needed for this type of incident defined as user options (“for major incidents, the agent needs to enter a conference line number”)</li>\n<li>Any business rules specific to this type of incident (from sending extra notifications to bringing in information from an external system)</li>\n</ul>\n<p>As we run into common or similar incidents, our incident managers can create these Models to improve our responsiveness going forward. For now, we can just create a ‘major incident’ model that when selected will:</p>\n<ul>\n<li>Set the impact and urgency of the incident to the highest levels</li>\n<li>Create tasks for the owner of the affected service to start a conference line and send notifications to our critical response team</li>\n<li>Trigger an extra review by our problem management team after the incident is resolved</li>\n</ul>\n<p><br/>\nAll of the details around <a href=\"./itom/SMAX:25.1/IncidentModels\">incident models</a> can be found online as well.</p>\n<!-- NewPP limit reportCached time: 20200216150654Cache expiry: 86400Dynamic content: falseCPU time usage: 0.016 secondsReal time usage: 0.071 secondsPreprocessor visited node count: 12/1000000Preprocessor generated node count: 34/1000000Post‐expand include size: 4013/2097152 bytesTemplate argument size: 0/2097152 bytesHighest expansion depth: 2/40Expensive parser function count: 0/100Unstrip recursion depth: 0/20Unstrip post‐expand size: 0/5000000 bytes--><!--Transclusion expansion time report (%,ms,calls,template)100.00%    0.000      1 -total--></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}