{
  "title": "Index external knowledge using IDOL connectors",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>You can use OpenText™ IDOL, a market-leading knowledge discovery and analytics platform, to index knowledge articles from various external sources to Service Management. Examples for external knowledge sources include a website, a SharePoint site, or an OpenText™ Extended ECM repository.</p>\n<p>The indexed knowledge articles can then be used by Service Portal users and Agent Interface users in the following ways:</p>\n<ul>\n<li>When users perform global search, the system includes the external knowledge articles (identified by the \"External Article\" or \"External Knowledge\"  badge) in the search results. The search results contain a brief summary of the knowledge article. The users can click a button next to the search result to open the article in its source system.</li>\n<li>When users interact with the Aviator or the virtual agent, the system uses the external knowledge articles (as well as other data stored in Service Management) to answer the user's questions or provide suggestions. Depending on the version of the virtual agent, the system displays external articles (identified by the \"External Article\" badge) as suggestions or references in the answer. The users can click the link to open the article in its source system.</li>\n</ul>\n<h2>Required components</h2>\n<p>To index knowledge articles using IDOL, the following components are required:</p>\n<ul>\n<li>\n<p><strong>IDOL connectors</strong>: Gather data from different sources for indexing into IDOL. Each connector indexes knowledge from one type of knowledge repository. For example, the SharePoint Remote Connector retrieves and indexes knowledge from SharePoint. You can use multiple IDOL connectors in the same environment.</p>\n<p>Currently, Service Management supports these IDOL connectors: SharePoint Remote Connector, Confluence REST Connector, Web Connector, OpenText Connector (for Extended ECM), Core Content Connector.</p>\n</li>\n<li>\n<p><b>IDOL Connector Framework Server (CFS)</b>: Aggregates data retrieved from various IDOL connectors and generates intermediate files (to a shared folder) by executing lua scripts that we provide.</p>\n</li>\n<li>\n<p><b>On Premise Bridge (OPB) Agent</b>: Processes the intermediate files output by CFS, and then indexes the external knowledge to the Service Management search database and Aviator.</p>\n</li>\n</ul>\n<p>These components should be installed on the same server. Note that all IDOL connectors share the same CFS and the OPB Agent instance.</p>\n<p>The following diagram depicts the system architecture of the IDOL indexing system.</p>\n<div><a class=\"image\" href=\"/file/images/a/a9/IDOLArchitectureD5.png\" title=\"/file/images/a/a9/IDOLArchitectureD5.png\"> <img alt=\"Architecture Diagram\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/a/a9/IDOLArchitectureD5.png\" height=\"377\" hspace=\"0\" src=\"../../../images/IDOLArchitectureD5_35dac057.png\" style=\"width:800px;height:377px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<p>We provide the required files for the IDOL components on the <a href=\"https://marketplace.opentext.com/itom/content/idol-connectors-for-service-management\" title=\"ITOM Marketplace\">ITOM Marketplace</a>, including the portable version of supported IDOL connectors and CFS, license files, and lua scripts. OpenText recommends that you use the same version of IDOL components in the same environment.</p>\n<h2>Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/idolindexingsetup\" title=\"Manage IDOL knowledge indexing\">Manage IDOL knowledge indexing</a></li>\n<li><a href=\"/doc/423/26.1/indexwebpages\" title=\"Index knowledge from web pages\">Index knowledge articles from web pages</a></li>\n<li><a href=\"/doc/423/26.1/indexknowledgeonpremsharepoint\" title=\"Index knowledge articles from SharePoint\">Index knowledge articles from SharePoint</a></li>\n<li><a href=\"/doc/423/26.1/indexcloudconfluence\" title=\"Index knowledge from cloud-hosted Confluence\">Index knowledge articles from Confluence</a></li>\n<li><a href=\"/doc/423/26.1/indexxecm\" title=\"Index knowledge from Extended ECM (xECM)\">Index knowledge articles from Extended ECM</a></li>\n<li><a href=\"/doc/423/26.1/indexcorecontent\" title=\"Index knowledge from OpenText Core Content\">Index knowledge articles from Core Content</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}