{
  "title": "Secure installation guidelines",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><h2 id=\"Supported_operating_systems\">Supported operating systems</h2>\n<p>For the types and versions of supported operating systems, see the <i>\"System requirements\"</i> section of OO Workflow Designer Install section.</p>\n<h2 id=\"Operating_system_hardening_recommendations\">Operating system hardening recommendations</h2>\n<p>Contact your operating system vendor for recommended best practices for hardening your operating system. For example:</p>\n<ul>\n<li>Patches should be installed</li>\n<li>Unnecessary services/software should be removed or disabled</li>\n<li>Minimal permissions should be assigned to users</li>\n<li>Auditing should be enabled</li>\n<li>Recommended: Put up a firewall to protect against DDoS.</li>\n</ul>\n<h2 id=\"Tomcat_hardening\">Tomcat hardening</h2>\n<p>When you install OO Workflow Designer, Tomcat is partially hardened by default. If you want extra hardening, see the recommendations in the Hardening chapter.</p>\n<h2 id=\"Installation_permissions\">Installation permissions</h2>\n<p>The following permissions are required to install and run OO Workflow Designer:</p>\n<p class=\"mw-empty-elt\"></p>\n<table>\n<tbody>\n<tr>\n<td>Installing OO Workflow Designer</td>\n<td>\n<p>Windows/Linux: Any standard user who is able to run a Java process, and who has permission to create folders and services</p>\n</td>\n</tr>\n<tr>\n<td>Running OO Workflow Designer</td>\n<td>\n<ul>\n<li>Windows: The Windows service runs as the system user or a specific user (the user must have access to the OO Workflow Designer installation directory)</li>\n<li>Linux: Any standard user who is able to run a Java process</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<p><b>Note:</b> See also the recommendations in the CIS Apache Tomcat documentation.</p>\n<h2 id=\"Security_protection_in_OO_Workflow_Designer\">Security protection in OO Workflow Designer</h2>\n<p>The following security features have been designed to protect the security of your OO Workflow Designer installation.</p>\n<h3 id=\"CSRF_protection\">CSRF protection</h3>\n<p>OO Workflow Designer is protected against CSRF (Cross-Site Request Forgery). A CSRF attack is when a malicious web site, email, blog, instant message, or program causes a user’s web browser to perform an unwanted action on a trusted site for which the user is currently authenticated. The impact of a successful cross-site request forgery attack is limited to the capabilities exposed by the vulnerable application. For more information about CSRF, see <a href=\"https://www.owasp.org/index.php/Cross-Site_Request_Forgery_(CSRF)\" rel=\"nofollow\" target=\"1\">https://www.owasp.org/index.php/Cross-Site_Request_Forgery_(CSRF) </a>.</p>\n<h3 id=\"XSS_protection\">XSS protection</h3>\n<p>OO Workflow Designer is protected against XSS (Cross-Site Scripting). An XSS attack is when an attacker injects malicious code, generally in the form of a browser side script, to a different end user. An XSS vulnerability may be used by attackers to bypass access controls such as the same-origin policy. For more information about XSS, see <a href=\"https://www.owasp.org/index.php/Cross-site_Scripting_(XSS)\" rel=\"nofollow\" target=\"1\">https://www.owasp.org/index.php/Cross-site_Scripting_(XSS)</a>.</p>\n<h3 id=\"Clickjacking_protection\">Clickjacking protection</h3>\n<p>OO Workflow Designer is protected against clickjacking. Clickjacking is when an attacker manipulates a website user's activity by concealing hyperlinks beneath legitimate clickable content. Thus, the attacker is \"hijacking\" clicks meant for one page and routing them to another page. For more information about clickjacking, see <a href=\"https://www.owasp.org/index.php/Clickjacking\" rel=\"nofollow\" target=\"1\">https://www.owasp.org/index.php/Clickjacking</a>.</p>\n<h2 id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/securityconceptsdesigner\" title=\"SMAX:25.1/SecurityConceptsDesigner\">Security concepts</a></li>\n<li><a href=\"/doc/423/26.1/securedepldesigner\" title=\"SMAX:25.1/SecureDeplDesigner\">Secure implementation and deployment</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}