{
  "title": "Download Audit images (OpenShift)",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>To install an application, you will need to download the required installation images. To do that, you need to:</p>\n<ul>\n<li>Generate an image download tool package</li>\n<li>Run the download script inside the tool package to download the required installation images.</li>\n</ul>\n<h2>Generate the download bundle</h2>\n<p>The <strong>generate_download_bundle.sh</strong> compares the images listed in the <strong>image-set.json</strong> file with the images that already exist in the specified image organization of the specified registry. It will only download the missing images.</p>\n<ol>\n<li>Log on to the bastion node.</li>\n<li>To change the directory, run the following command: \n\t<pre>cd  ${CDF_HOME}/tools/generate-download</pre>\n</li>\n<li>Run the command together with the options required by your deployment. For example, run the following command (running this command may take several minutes):\n\t<pre>./generate_download_bundle.sh --chart &lt;audit helm chart file&gt; -o &lt;org name&gt; [-d &lt;destination dir&gt;]</pre>\n<br/>\n\tWhere,<br/>\n<em>&lt;audit helm chart file&gt;</em>: The absolute path to the downloaded Audit helm chart package.<br/>\n<em>&lt;org name&gt;</em>: The organization in the image registry that contains the images for installation. By default, it's <strong>hpeswitom</strong>.<br/>\n<em>&lt;destination dir&gt;</em>: The directory where the output .zip file gets created. The default location is the current directory.</li>\n</ol>\n<p>The <strong>generate_download_bundle.sh</strong> compares the images needed by the suite with the images that already exist in the cluster and generates a .zip file, <strong>offline-download.zip</strong>. This file enables you to download the required images from Docker Hub.<br/>\nFor example:</p>\n<pre>./generate_download_bundle.sh --chart Audit_Helm_Chart-2x.x/audit-helm-charts/charts/audit-1.2.0+2x.x.x-xx.tgz -o hpeswitom -d /tmp</pre>\n<p><br/>\nYou can find the <strong>offline-download.zip</strong> under the current working directory unless you specify the \"<code>-d</code>\" option. You receive the following messages indicating that you have successfully generated the <strong>offline-download.zip</strong> file:</p>\n<pre>[INFO] 2020-07-31 17:58:46 : ** Generating the offline image download bundle ...\n[INFO] 2020-07-31 17:58:50 : Completed generation of offline-download.zip in /tmp\n</pre>\n<h2>Download the required installation images</h2>\n<ol>\n<li>Log on to the bastion node. If the bastion node can't access Docker Hub, transfer the  <strong>offline-download.zip</strong>  file to a Linux server that can access Docker Hub.</li>\n<li>Extract the .zip package to a directory. If you can't access Docker Hub directly, set up the HTTP/HTTPS proxy. For example, run the following commands to set the HTTP/HTTPS proxy. Replace the placeholders with your actual server and port. <br/>\n<code>export http_proxy=\"&lt;http://PROXY_SERVER:PORT&gt;\"<br/>\n\texport https_proxy=\"&lt;https://PROXY_SERVER:PORT&gt;\"</code></li>\n<li>Go to the directory where you extracted the <strong>offline-download.zip</strong> package.</li>\n<li>Run the following command:<br/>\n\t \n\t<pre>./downloadimages.sh [-r &lt;image repository URL&gt;] [-u &lt;username&gt;]  [-d &lt;image download directory&gt;] [-c on|off] [-o &lt;org name&gt;]</pre>\n<br/>\n\tWhere:<br/>\n<em>&lt;image repository URL&gt;</em>: Specify the <code>-r</code> option if you want to download the images from a repository other than Docker Hub.<br/>\n\tReplace <em>&lt;username&gt;</em> with the Docker Hub username. If you don't specify the credentials here, when prompted you can specify them while running the command.<br/>\n<em>&lt;image download directory&gt;</em>: The directory where the container images get downloaded. The default value is <code>/var/opt/cdf/offline</code>.<br/>\n\tThe <code>-c</code> option helps to verify the digital signature of the images during the download. The default setting is off, which doesn't verify the signature.<br/>\n<em>&lt;org name&gt;</em>: The organization in the image registry that contains the images for installation. By default, this is <code>hpeswitom.</code> This option is mandatory if you aren't using the default organization name.</li>\n<li>To see the full list of options for the <strong>downloadimages.sh</strong> command, run the following command:\n\t<pre><code>./downloadimages.sh –h</code></pre>\n<p>The command also has a <code>-p</code> option to give your password. The <code>-p</code>  option doesn't support single quotes (i.e, don't include single quotes in the password).</p>\n</li>\n</ol>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span><br/>\nBy selecting the -p option, you are disabling or bypassing security features, thereby exposing the system to increased security risks. By using this option, you understand and agree to assume all associated risks and hold <code>OpenText</code> harmless for the same.</p>\n<p><code>OpenText</code> encourages you to use some other password options, which aren't provided by <code>OpenText</code>. By implementing the -p option, you may expose the system to increased security risks. You understand and agree to assume all associated risks and hold <code>OpenText</code> harmless for the same. It remains at all times your sole responsibility to assess its own regulatory and business requirements. <code>OpenText</code> doesn't represent or warrant that its products comply with any specific legal or regulatory standards applicable to you in conducting your business.</p>\n</div>\n<h2>Transfer the images to the bastion node</h2>\n<p>If you downloaded the images to a server other than the bastion node, transfer the images to a directory on the bastion node. As default, place the images under the  <code>/var/opt/cdf/offline</code> directory.</p>\n<div class=\"Admonition_Note\"><span class=\"autonumber\"><b>Note</b>:</span><br/>\n<strong>uploadimages.sh</strong> script will upload the images later. The image upload requires up to 2 times of the image size space in the target image directory. For example, if you choose to use the default <code>/var/opt/cdf/offline</code> directory, ensure that you have 2 times of the OPTIC Management Toolkit (OMT) and suite image size space under <code>/var/opt/cdf/offline</code> directory of the bastion node</div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}