{
  "title": "Set up integration with on-premises products for license compliance calculation",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>This page provides information about using integration to perform license compliance calculation for on-premises products in SAM:</p>\n<ul>\n<li>The overall configuration process</li>\n<li>Guidelines for configuring integration scenarios</li>\n</ul>\n<h2>Importing data via integration</h2>\n<p>To manage license compliance for certain on-premises products, you can import license consumption data via integrations with the products. </p>\n<p>If the product provides a \"Get license usage data\" API that can return effective license points and license consumption data, you can use the API and the Local System action <strong>Create license consumption</strong> action to import the data into SAM. SAM will then generate a compliance report based on the imported data.</p>\n<h2 id=\"SaaSConfig\">Configuration process</h2>\n<p>To set up the product for license compliance calculation via integrations, perform the following steps.</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<thead>\n<tr>\n<th scope=\"col\">\n<p>Step</p>\n</th>\n<th scope=\"col\">\n<p>Where</p>\n</th>\n<th scope=\"col\">Description</th>\n</tr>\n<tr>\n<td>\n<p>Prepare for  integration</p>\n</td>\n<td>\n<p>N/A</p>\n</td>\n<td>\n<p>As the first step in the integration process, learn the integration details, such as the authentication details, by reading the product vendor's documentation. Perform the required prerequisite steps in the target system.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p id=\"Prepare_an_integration_user\">Prepare an integration user</p>\n</td>\n<td>Suite Administration</td>\n<td>Create a dedicated integration user for the integration.\n\t\t\t<p>See the <em>Prepare an integration user</em> section below.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Configure integration scenarios</p>\n</td>\n<td>\n<p>Integration Studio</p>\n</td>\n<td>\n<p>Configure an endpoint, an integration, and an integration scenario for importing license consumption-related data. See <a href=\"/doc/423/26.1/xieconfiguration\" title=\"Use the Integration Studio\">Use the engine</a> for the general procedure.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">To use the Integration Studio, including creating or configuring Integration Studio-related endpoints, integrations, and scenarios, you must have the <strong>Integration Administrator</strong> role.</div>\n</div>\n<p>Note that you can trigger the SAM-related integration scenario only through the <strong>Calculate</strong> or <strong>Scheduler</strong> button on the Products page, because only through these methods, SAM can pass the required context data to the SAM-related integration scenarios. You should <em>not</em> trigger the scenarios at this time.</p>\n<ul>\n</ul>\n<p>Refer to the <em>Integration scenario configuration guidelines</em> section below for guidelines.</p>\n</td>\n</tr>\n<tr>\n<td>Create products, license metrics, licenses</td>\n<td>SAM</td>\n<td>\n<p>Create and configure product records. <span style=\"background-color: transparent;\">See</span><a href=\"/doc/423/26.1/samproducts#Add_delete_product\" style=\"background-color: transparent;\" title=\"Add/delete a product\"> Add/delete a product</a><span style=\"background-color: transparent;\">. During the configuration, select the integration and scenario configured in the previous step in the respective fields on the </span><b>Compliance calculation </b><span style=\"background-color: transparent;\"><strong>settings</strong> tab.</span></p>\n<p>Specify the license metric code in the \"Create license consumption data\" rule's <em>License metric code</em> parameter in the integration scenario. If the license metric for the product doesn't exist for the vendor, create it first by following <a href=\"/doc/423/26.1/createlicensetype\" title=\"Create a license metric record\">Create a license metric record</a>.</p>\n</td>\n</tr>\n<tr>\n<td>Verify the product integration </td>\n<td>SAM</td>\n<td>\n<p>On the Products page, select the product, and then click the<strong> Calculate</strong> button to trigger the configured integration scenario. SAM will perform compliance calculations after the integration scenario is executed.</p>\n<p>Verify that the integration scenario and subsequent calculations are successfully completed by doing the following:</p>\n<ul>\n<li>\n<p>Check the execution history for the integration scenario and make sure all scenario rules are successfully executed.</p>\n</li>\n<li>\n<p>Make sure the <strong>Calculation status</strong> column on the Products page has the value <em>Successful</em>.</p>\n</li>\n<li>\n<p>Click the notification icon in the upper-right corner to check the messages. Make sure the integration-related tasks for the product have a success message.</p>\n</li>\n<li>\n<p>Check the respective page (see the <em>Scenario to configure for each product</em> section below) to see if the data has been imported.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Verify the details of the license models</td>\n<td>SAM</td>\n<td>\n<p>Check the license models associated with the product versions; if the license models don't have the license metric and product versions assigned by the integration, manually assign them.</p>\n</td>\n</tr>\n<tr>\n<td>Schedule periodic triggering of integration scenarios</td>\n<td>SAM</td>\n<td>\n<p>On the Products page, select the product, and then click the<strong> Scheduler</strong> button to schedule the triggering of the configured integration scenario and subsequent calculations.</p>\n<p>See <a href=\"/doc/423/26.1/samproducts#scheduler\" title=\"Configure a scheduler for the product\">Configure a scheduler for the product</a>.</p>\n</td>\n</tr>\n</thead>\n</table>\n<h3>Prepare an integration user</h3>\n<p><span id=\"cke_bm_20010C\" style=\"display: none;\"> </span></p>\n<p>Perform the following steps to prepare an integration user:</p>\n<ol>\n<li>\n<p>Create an integration user. See <a href=\"/doc/423/26.1/createuser\" title=\"How to create a user\">How to create an integration user</a>.</p>\n</li>\n<li>\n<p>Log in to Agent Interface as the tenant admin.</p>\n</li>\n<li>\n<p>Navigate to<strong> Administration </strong>&gt; <strong>Master Data </strong>&gt; <strong>People</strong>, locate the integration user, and then assign the <strong>Software Manager</strong> role to the user.</p>\n</li>\n</ol>\n<p><span id=\"cke_bm_20155C\" style=\"display: none;\"> </span></p>\n<h2 id=\"ScnGuideline\">Integration scenario configuration guidelines</h2>\n<p>A product integration scenario consists of the following rules:</p>\n<ol>\n<li>\n<p>A <a href=\"/doc/423/26.1/samxieactions#GetContext\" title=\"Integration Studio scenario rules for SAM\">Get context information rule</a> that defines an object (named as <em>Context</em> in this documentation) to hold the context data passed from SAM.</p>\n</li>\n<li>\n<p>A set of <i>data</i><em> import </em>rules to retrieve data from the product and create records in SAM by using the retrieved data. These rules implement the main logic of the scenario.</p>\n<p>The <em>Scenario to configure for each product</em> section below provides more details about the <i>data </i><em>import </em>rules that you need to configure.</p>\n</li>\n<li>\n<p>An <a href=\"/doc/423/26.1/samxieactions#UpdateStatus\" title=\"Integration Studio scenario rules for SAM\">Update job status rule</a> to inform SAM users of the integration status. The rule writes notification messages that SAM users can see.</p>\n</li>\n</ol>\n<p>To make the system write correct notification messages, use the Integration Studio's Try-Catch rule blocks, and add the following rules in the blocks:</p>\n<ul>\n<li>In the <strong>Try</strong> block, add the <em>data import</em> rules followed by the <em>Update job status</em> rule. Since the <em>Update job status</em> rule is run only when all the <em>data import </em>rules are successfully completed, use this rule to write a success notification message for SAM. The rule's <em>Job status</em> parameter should have the value <code>'COMPLETED_SUCCESS'</code> and the <em>Result </em>parameter should have a string value that indicates successful execution (such as <code>'Successful'</code>).</li>\n<li>In the <strong>Catch</strong> block,  add only an <em>Update job status</em> rule. Since the rule is run only when some of the <em>Import data from product</em> rules in the Try block fail, use this rule to write an error message for SAM. The rule's <em>Job status</em> parameter should have the value <code>'FAILED'</code>, and the <em>Result</em> parameter should have a string value that indicates execution failure (such as <code>'The integration failed'</code>). </li>\n</ul>\n<h3>Scenario to configure for each product</h3>\n<p>Configure one \"import license consumption\" scenario for each product. Note that the scenarios have the common structure outlined above. This section will focus only on the <em>data import </em>rules.</p>\n<p><strong>Import license consumption</strong></p>\n<p>This scenario imports license consumption data from the integrated product.</p>\n<p>The scenario contains the following data import rules:</p>\n<ol>\n<li>A rule that calls the \"Get license consumption data\" API from the integrated product to retrieve license consumption data. If there's an existing Integration Studio action for doing this, use that action. Otherwise, use a Generic connector action, typically the <i>Send a GET request (JSON)</i> action.</li>\n<li>A <a href=\"/doc/423/26.1/samxieactions#CreateConsumption\" title=\"SAM / On-premises - Create license consumption\">SAM / On-premises - Create license consumption</a> rule, which creates license consumption data in SAM.<br/>\n\tIf you have managed <a href=\"/doc/423/26.1/samconfigurations#Organization_compliance_scopes\" title=\"Organization compliance scopes\">Organization compliance scopes</a>, then when you import license consumption data from the integrated product, you may configure the <strong>Organization compliance scope</strong> parameter and import data for each scope in scenario.</li>\n</ol>\n<p>The outcome of this scenario is the generation of compliance data for the product versions. You can check the compliance data on the Compliance page (<strong>General</strong> tab) for the product.</p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}