{
  "title": "Integrate with Extended ECM",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>OpenText Extended ECM (xECM) is an enterprise content management solution that securely governs the information lifecycle. The Service Management and xECM integration enables you to embed an xECM widget in Service Management so that users can leverage the industry-leading content management capabilities powered by xECM. </p>\n<h2>Overview</h2>\n<p>With this integration, Service Management users can launch an embedded xECM widget by clicking the <strong>Related documents</strong> tab in a record. This offers the following benefits:</p>\n<ul>\n<li><strong>Enterprise document management: </strong>The embedded widget centralizes document storage and access. It ensures that all documents, regardless of their source, are stored securely in one location for easy retrieval and management. </li>\n<li><strong>Workflow automation: </strong>The embedded widget automates, manages, and tracks document-centric processes. It streamlines tasks, routes documents, assigns responsibilities, ensures compliance, and enhances collaboration for efficient business operations. </li>\n<li><strong>Version control: </strong>The embedded widget tracks the version history and ensures that everyone accesses and works on the latest document versions, minimizing confusion. </li>\n<li><strong>Secure external sharing: </strong>This capability enables controlled and audited sharing of documents with external partners, clients, or vendors. This ensures that sensitive data remains protected. </li>\n</ul>\n<h2>Set up the integration</h2>\n<p>To set up the xECM integration, complete the following tasks.</p>\n<h3>Prerequisites</h3>\n<p>Before you begin, make sure you have purchased xECM X2 (or above) plans.</p>\n<h3>Configure Single Sign-On (SSO)</h3>\n<p>To enable the user to access xECM documents in Service Management without the need to log in to xECM each time, you need to configure Single-Sign-On (SSO) in Azure Active Directory (AD).</p>\n<p>Make sure you configure SSO and user synchronization for both Service Management and xECM by following the instructions in:</p>\n<ul>\n<li>For Azure AD-based SSO configurations for Service Management, see <a href=\"/doc/423/24.4/configureauthenticationinidm\" title=\"Configure authentication services (LDAP, SAML, OAuth)\">Configure authentication services (LDAP, SAML, OAuth) for on-premises tenants</a> or <a href=\"/doc/205/saas/configuresaml\" title=\"Configure SAML authentication for SaaS tenants\">Configure SAML authentication for SaaS tenants</a>.</li>\n<li>For user and group synchronization steps, see <a href=\"/doc/423/26.1/integrateazuread\" title=\"Integration Studio—Microsoft Azure Active Directory (AD) integration\">Integration Studio—Microsoft Azure Active Directory (AD) integration</a>.</li>\n<li><a href=\"https://support.opentext.com/kb_view.do?sysparm_article=KB0657287\" title=\"xECM SSO configuration\">xECM SSO configurations</a></li>\n<li><a href=\"https://support.opentext.com/kb_view.do?sysparm_article=KB0654297\" title=\"xECM provisioning configuration\">xECM provisioning configurations</a></li>\n</ul>\n<p>When configuring SSO, be aware of the following:</p>\n<ul>\n<li>For SSO to work, assign the same set of users to the enterprise applications you added in Azure AD for xECM and Service Management.</li>\n<li>Use the same Directory Services Azure enterprise application for xECM SSO and provisioning configuration.</li>\n<li>Take note of the name of the auth handler you configured in OpenText Directory Services (OTDS) as part of the xECM SSO configuration. It's required when enabling xECM in Service Management.</li>\n<li>Configure the following in OTDS for the user partition that you created during the provisioning configuration:\n\t<ul>\n<li>Assign X2 or above license to the partition (<strong>Partition</strong> &gt; <strong>Actions</strong> &gt; <strong>Allocate to License</strong>).</li>\n<li>Assign the <strong>Access to cs</strong> access role to the partition (<strong>Access role</strong> &gt; <strong>Actions</strong> &gt; <strong>View Access Role Details</strong>).</li>\n</ul>\n</li>\n</ul>\n<h3>Configure Service Management</h3>\n<p>After configuring SSO, you need to enable xECM in Service Management.</p>\n<h4>Enable the xECM widget</h4>\n<p>To enable the xECM widget for desired Service Management record types, follow these steps:</p>\n<ol>\n<li>Log in to Agent Interface as the integration administrator.</li>\n<li>Go to <strong>Administration</strong> &gt; <strong>Utilities</strong> &gt; <strong>Integration</strong> &gt; <strong>Integration Configuration</strong>.</li>\n<li>In the left-side pane, select <strong>Extended ECM</strong>.</li>\n<li>In the <strong>Widget URL</strong> field, replace <code>&lt;Content Server URL&gt;</code> and <code>&lt;auth handler&gt;</code> with their actual values.</li>\n<li>Select <strong>Active</strong> to enable the integration.</li>\n<li>Click <strong>Save</strong>.</li>\n<li>Click <strong>Add </strong>to open the <strong>Add configuration for record type</strong> dialog.</li>\n<li>Select the record type to display the xECM widget and save the setting. The system displays the xECM configuration page for the record type.</li>\n<li>Select <strong>Active</strong> to enable the integration for the specified record type.</li>\n<li>(Optional) To display a default workspace when the user opens the <strong>Related documents</strong> tab of a record, enter the ID of the default workspace in <strong>Default workspace Id</strong>. If you don't specify this field, users will need to enter the desired workspace ID in <strong>Workspace Id</strong> on the <strong>Related documents</strong> tab.</li>\n<li>Repeat steps 7 through 10 for other record types you want to enable the widget.</li>\n</ol>\n<h4>Display xECM in Service Management</h4>\n<p>To display the xECM widget in Service Management, you must configure settings in Service Management and xECM (including OTDS and Content Server).</p>\n<p><strong>Configure Service Management</strong></p>\n<ol>\n<li>Navigate to <strong>Administration</strong> &gt; <strong>Configuration</strong> &gt; <b>Application Settings</b>.</li>\n<li>Locate the <strong>Content security policy</strong> option and click <strong>Configure</strong>.</li>\n<li>Click <strong>Add item</strong>, and then select <strong>Frame-src</strong>.</li>\n<li>In the <strong>Frame-src</strong> field, add <code>&lt;OTDS host&gt; &lt;Content Server host&gt; *.microsoftonline.com mailto:</code>.</li>\n<li>Click <strong>Add item</strong>, and then select <strong>Frame-ancestors</strong>.</li>\n<li>in the <strong>Frame-ancestors</strong> field, add <code>&lt;OTDS host&gt; &lt;Content Server host&gt; *.microsoftonline.com</code>.</li>\n<li>Click <strong>OK</strong>.</li>\n<li>Click <strong>Save</strong>.</li>\n</ol>\n<p><strong>Configure OTDS</strong></p>\n<ol>\n<li>From the menu bar of the OTDS web administration UI, click <strong>Trusted Sites</strong>.</li>\n<li>On the <strong>Trusted Sites</strong> page, from the button bar, click <strong>Add</strong>.</li>\n<li>In the <strong>Addresses that Directory Services can trust</strong> box, enter this URL: <code>https://&lt;Service Management FQDN&gt;</code>.</li>\n</ol>\n<p>For details, click <strong>Help</strong> on the <strong>Trusted Sites</strong> page to view the related documentation in the <em>OpenText Directory Services: Installation and Administration Guide</em>.</p>\n<p><strong>Configure Content Server</strong></p>\n<ol>\n<li>Log in to Content Server as a user with sufficient privileges (such as the Web Admin usage privilege).</li>\n<li>From the menu, select <strong>Admin &gt; Content Server Administration</strong>.</li>\n<li>Search for and open the <strong>Security Parameters</strong> page.</li>\n<li>In the <strong>Trusted Relationships</strong> section, add the Fully Qualified Domain Name (FQDN) of Service Management for the <strong>Referring Websites</strong> and <strong>Cross-Domain</strong> fields.</li>\n<li>Click <strong>Save Changes</strong>.</li>\n</ol>\n<p>For details, click <strong>Help</strong> on the <strong>Trusted Relationships</strong> page to view the related documentation in the <em>System Administration Guide: OpenText Content Server</em>.</p>\n<ol>\n</ol>\n<h2><span style=\"font-size: clamp(1.59375rem, 18.7895px + 1.39803vw, 2.125rem);\">Use and manage the integration</span></h2>\n<p>Follow these instructions to use and manage the integration. </p>\n<h3>Access the xECM widget</h3>\n<p>To access the xECM widget for a record type, navigate to the record type in Service Management, open a record, and then click the <strong>Related documents</strong> tab.</p>\n<p>If no default workspace has been configured for the record type, enter the node ID of the workspace or folder you want to access and click <strong>OK</strong>.</p>\n<p>You can click <strong>Change workspace</strong> to switch to another workspace or folder.</p>\n<h3>Control the display of the xECM widget</h3>\n<p>To temporarily disable the xECM widget for all record types, go to <strong>Administration</strong> &gt; <strong>Utilities</strong> &gt; <strong>Integration</strong> &gt; <strong>Integration Configuration</strong>, click <strong>Extended ECM</strong> in the left pane, clear the <strong>Active</strong> checkbox, and then click <strong>Save</strong>.</p>\n<p>To temporarily disable the xECM widget for certain record types, go to <strong>Administration &gt; Utilities &gt; Integration &gt; Integration Configuration</strong>, click the record type under <strong>Extended ECM</strong>, clear the <strong>Active</strong> checkbox, and then click <strong>Save</strong>. Alternatively, you can click the <strong>Remove</strong> button on the Extended ECM configuration page for a particular record type to disable the xECM widget display.</p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}