{
  "title": "Integrate with Service Manager",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>Service Management provides a case exchange framework to exchange data between Service Management and Service Manager. The case exchange framework enables you to define an external system with which information will be exchanged. The external system has the ability to create and update records in Service Management as well as to relate those records to records in the external system.</div>\n<h2>Use cases</h2>\n<p>The integration with Service Manager is designed to support use cases involving a Line of Business IT organization that's supported by a Central IT organization. It also supports use-cases involving Central IT and other IT suppliers.</p>\n<p>The integration enables you to exchange incidents and requests between Service Management and Service Manager. Incident or request records created in Service Management can be assigned to a group that has been registered to a Service Manager system. This sends the record to Service Manager for investigation and resolution. Additional information that's added to the record, including comments and attachments, is also exchanged with Service Manager. Updates done in Service Manager, including activities and attachments, are sent to Service Management. It's also possible to create an incident or request in Service Manager and exchange it with Service Management. In this case as well, updates on either side are exchanged with the other system.</p>\n<p>The exchanged record includes only the data necessary to create the incident or request in the Service Manager system. The workflow phases and statuses of the record in the two systems are independent of each other. Instead, the integration uses the concept of Operations. Operations are additional (bi-directional) information provided on the update of a record. They tell the receiving system what needs to be done with the record, and the system can determine which workflow steps or data modifications need to be implemented.</p>\n<p>Defining possible operations for the actual exchange reduces the need to perform complex workflow mapping between the two systems. The operations are interpreted by the receiving system and may be mapped to their existing workflow and business rules without affecting the sending system. </p>\n<h2>Set up the integration</h2>\n<p>For support matrix information of this integration, visit the <a href=\"/supportmatrix/integrations/100/345\">integration portal</a>. </p>\n<h3>Implement the case exchange framework</h3>\n<p>For details, see <a href=\"/doc/423/26.1/externalintegration\">External systems</a> and <a href=\"/doc/423/26.1/workwithexternalsys\" title=\"SMAX:25.1/WorkWithExternalSys\">Working with external systems</a>. </p>\n<h3>Configure the integration</h3>\n<p>The configuration of the Service Manager integration is done mainly in Service Manager. For more information on the Service Manager integration with Service Management, refer to the Service Manager documentation.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/incidentcasexchange\" title=\"SMAX:25.1/IncidentCaseXchange\">Case Exchange integration for incidents</a></li>\n<li><a href=\"/doc/423/26.1/requestcasexchange\" title=\"SMAX:25.1/RequestCaseXchange\">Case Exchange integration for requests</a></li>\n<li><a href=\"/doc/423/26.1/changecasexchange\">Case Exchange integration for changes</a></li>\n<li><a href=\"/doc/423/26.1/caseexchangeapi\" title=\"SMAX:25.1/CaseExchange\">Case Exchange REST API</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}