{
  "title": "Integrate with Operations Bridge Manager (OBM)",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Operations Bridge Manager (OBM) automatically discovers and monitors the IT infrastructure of an enterprise by collecting topology and event data. You can use event data to resolve infrastructure or service issues. The CI topology helps check the health and performance of the IT infrastructure. The Operations Bridge Manager framework provides you with a single pane of glass to detect, correlate, solve, and prevent problems occurring in networks, systems, and applications. OBM and Service Management can be integrated to share important information between users working in Enterprise Service Management as well as users working in Service Assurance. The integrated solution offers three major use cases.</p>\n<h2>Closed Loop Incident Process (CLIP)</h2>\n<p>This use case enables you to forward events from OBM to OpenText Service Management to create and update incidents and synchronize incident changes back from Service Management to OBM events. With this integration, engineers working on incidents or events are automatically informed about ongoing activities in both systems. This enables users to efficiently troubleshoot events and incidents to resolve them as fast as possible.</p>\n<div><a class=\"image\" href=\"/file/images/a/aa/CLIPExample12.png\" title=\"/file/images/a/aa/CLIPExample12.png\"> <img alt=\"CLIPExample12\" border=\"1\" file=\"https://staging.docs.microfocus.com/mediawiki/images/a/aa/CLIPExample12.png\" height=\"332\" hspace=\"0\" src=\"../../../images/CLIPExample12_a9914d50.png\" style=\"width: 800px; height: 332px; margin: 0px; border: 1px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h2>Embedded Event Browser</h2>\n<p>In comparison to the CLIP use case, this use case enables incident analysts to see a lot of additional related information to troubleshoot incidents. Incident analysts often struggle with finding meaningful information to analyze incidents raised by end users. To help incident analysts find relevant information to troubleshoot incidents faster, we embedded the CI Topology and OBM Event Browser into the Incident form. <br/>\nWith real-time access to data from OBM, incident analysts can immediately see events for the Service or CIs the incident is created for. With this information, the analyst can identify potential root causes of incidents much quicker, and can also collaborate with other teams easier since real-time event data can be seen by all team members working on the incident.</p>\n<h2><a class=\"image\" href=\"/file/images/a/aa/OBM_EmbeddedEventBrowser.PNG\" title=\"/file/images/a/aa/OBM_EmbeddedEventBrowser.PNG\"> <img alt=\"OBM_EmbeddedEventBrowser\" border=\"1\" file=\"https://staging.docs.microfocus.com/mediawiki/images/a/aa/OBM_EmbeddedEventBrowser.PNG\" height=\"452\" hspace=\"0\" src=\"../../../images/OBM_EmbeddedEventBrowser_4c18589e.png\" style=\"width:800px;height:452px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:1px solid black;\" vspace=\"0\" width=\"800\"/> </a></h2>\n<h2>Schedule downtime</h2>\n<p>This use case is enabling customers to exchange downtime information from planned changes in Service Management. The scheduled downtime information and the affected CIs are sent to OBM to create a downtime record. OBM is then able to suppress events for the CIs listed in the downtime.</p>\n<h2>Related documents</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/integrateeventbrowser\" title=\"Set up embedded Event Browser\">Set up embedded Event Browser</a></li>\n<li><a href=\"/doc/423/26.1/intgomi\" title=\"Set up Closed Loop Incident Process (CLIP)\">Set up Closed Loop Incident Process (CLIP)</a></li>\n<li><a href=\"/doc/423/26.1/scheduledowntime\" title=\"Schedule downtime\">Schedule downtime</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}