{
  "title": "Integrate with Connect-It",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p><br/>\nYou can also use Connect-It to integrate OpenText Service Management with other products.</p>\n<p>The instructions in this section outline the configurations for Service Management.</p>\n<h2 class=\"mw-headline\">Prerequisite</h2>\n<p>Connect-It Management as a Service connector and Service Anywhere User connector rely on a user with sufficient rights to access the SaaS environment and write a Service Management database. As a consequence, an Integration user must be created in the Suite Administration portal for your Service Management tenant. This user must be granted administration rights to access and update the Service Management tenant. In Service Management administration console, the Connect-It Integration user must be granted tenant admin privileges. These 2 conditons must be met to prevent any error when running your Connect-It integration scenario.</p>\n<h2 class=\"mw-headline\" id=\"Install_Connect-It\">Install Connect-It</h2>\n<p>You can download Connect-It 9.90 from the <a href=\"https://sld.microfocus.com/mysoftware/index\" rel=\"nofollow\" target=\"1\" title=\"Software Licenses and Downloads (SLD)\">Software Licenses and Downloads (SLD)</a> website. </p>\n<p>The following are Connect-It 9.90 documentation links:</p>\n<ul>\n<li><a href=\"/doc/190/9.90/home\" rel=\"nofollow\" target=\"1\" title=\"Help center\">Help center</a></li>\n<li><a href=\"https://support.microfocus.com/kb/kmdoc.php?id=KM01636705\" rel=\"nofollow\" target=\"1\" title=\"Product manuals\">Product manuals</a></li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Configuration_for_untrusted_certificates\">Import the suite CA certificate to a local truststore</h2>\n<p>Connect-It requires the suite CA certificate to be put in a local truststore. Use the following steps to import the suite CA certificate to a local truststore:</p>\n<ol>\n<li>Get the suite CA certificate. For detailed steps, see <a href=\"/doc/423/26.1/getsuitecacertificate\" title=\"Get the suite CA certificate\">Get the suite CA certificate</a>.</li>\n<li>Make sure you have the latest version of openssl installed.</li>\n<li>\n<p>Run the following command:</p>\n<p><code>keytool -importcert -alias &lt;any_alias&gt; -file &lt;suite CA certificate file&gt; -keystore &lt;keystore file&gt; -storepass &lt;password&gt;</code><br/>\n\tThe &lt;suite CA certificate file&gt; placeholder represents the suite CA certificate file you obtained. The &lt;keystore file&gt; placeholder represents the keystore file generated by this command. The &lt;password&gt; placeholder represents the keystore password.<br/>\n\tFor example, the command may look like:</p>\n<code>keytool -importcert -alias Service Management -file sma_CA.cert -keystore keystore.jks -storepass changeit</code>\n<p>In the next step, you will need to specify the generated keystore file (keystore.jks in the example above) as the <b>CA certificate file (truststore)</b>.</p>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Configure_SMAX_as_a_Service_connector\">Configure Service Management as a Service connector</h2>\n<p>A wizard enables you to configure the connector. You can find detailed instructions for these wizard screens under <a class=\"external text\" href=\"/doc/190/9.90/connector_guide/configuring_connectors\" rel=\"nofollow\" target=\"1\" title=\"Configuring Connectors\">Configuring Connectors</a>. If there are any details that aren't covered under that section, they are available below.</p>\n<p>Specify the server information</p>\n<ul>\n<li>\n<p><b>Server</b>: The server address of the Service Management Automation server. The format of the address is:</p>\n<pre>https://&lt;IP or FQDN&gt;:&lt;port&gt;?TENANTID=&lt;tenant id&gt;</pre>\n</li>\n<li>\n<p><b>Login</b>: The user name of the Service Management Automation platform.</p>\n</li>\n<li>\n<p><b>Password</b>: The password for the user name.</p>\n</li>\n<li>\n<p><b>Threshold</b>: Select this option when the Service Management Automation system has a threshold limit on the number of entities the Service Management Automation system can accept per minute. When you select this option, the Service Management Automation connector can automatically retrieve the threshold value from the Service Management Automation system and send out requests with respect to the threshold.</p>\n<p>To reach optimum accuracy, it's recommended to include only one entity in each request. Otherwise, the number of entities sent in a minute may exceed the threshold. For example, if each request contains three entities and the threshold is 10, the Service Management Automation connector will send 12 entities in a minute.</p>\n</li>\n<li><b>Bulk size</b>: This option enables the Service Management Automation connector to send requests in bulk for the <code>CREATE</code>, <code>UPDATE</code>, and <code>DELETE</code>operations. When you select this option, you must also define the bulk size, which is the minimum number of entities in a single bulk transfer. The Service Management Automation connector sends multiple requests in bulk when the number of entities in these requests is no less than the bulk size.</li>\n<li>\n<p><b>Compression support for HTTP request and response</b></p>\n<p>The Service Management Automation connector supports sending compressed HTTP requests and accepting compressed HTTP responses.</p>\n<ul>\n<li>\n<p><b>Compress requests</b></p>\n<p>If the option is selected, the connector sends the compressed HTTP request that contains an HTTP header <code>Content-Encoding:gzip</code>.</p>\n</li>\n<li>\n<p><b>Accept compressed responses</b></p>\n<p>If the option is selected, the connector sends the HTTP request that contains an HTTP header <code>Accept-Encoding:gzip</code>, which tells the server that the connector allows a compressed response.</p>\n</li>\n</ul>\n</li>\n</ul>\n<p>For example, Connect-It configuration looks like this:<br/>\n<a class=\"image\" href=\"/file/images/e/e3/2018.02/attachments/15372082/15372087.png\" title=\"/file/images/e/e3/2018.02/attachments/15372082/15372087.png\"> <img alt=\"2018.02/attachments/15372082/15372087.png\" decoding=\"async\" height=\"480\" src=\"../../../images/15372087_446a597c.png\" width=\"826\"/> </a><br/>\nSpecify the SSL configuration:</p>\n<ul>\n<li>Select <strong>Use an SSL connection</strong></li>\n<li>CA certificate file (truststore): specify the local truststore file you generated in the \"Import the suite CA certificate to a local truststore\" step (in this example: keystore.jks)</li>\n<li>Truststore password: enter the password of the local truststore</li>\n<li>Truststore type: select <strong>JKS</strong></li>\n</ul>\n<div><a class=\"image\" href=\"/file/images/d/d8/2018.02/attachments/15372082/15372790.png\" title=\"/file/images/d/d8/2018.02/attachments/15372082/15372790.png\"> <img alt=\"2018.02/attachments/15372082/15372790.png\" decoding=\"async\" height=\"484\" src=\"../../../images/15372790_ae0af08f.png\" width=\"830\"/> </a></div>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">Limitation: The certificate and client key files can't have space in their names.</div>\n</div>\n<h2 id=\"Apply_security_patch_on_JRE/JDK_1.8\"><span class=\"mw-headline\" id=\"Apply_security_patch_on_JRE.2FJDK_1.8\"><span id=\"IntegratewithConnect-It-ApplysecuritypatchonJRE.2FJDK1.8\">Apply security patch on JRE/JDK 1.8</span></span></h2>\n<p>Connect-It requires the Java Cryptography Extension (JCE) Unlimited Strength Policy Files to establish secure connection to Service Management. \"Unlimited strength\" policy files contain no restrictions on cryptographic strengths, in contrast to the \"strong\" but limited cryptography policy files bundled in a JRE.</p>\n<p>You can download Java 8 JCE (Java Cryptography Extension) from <a class=\"external free\" href=\"http://www.oracle.com/technetwork/java/javase/downloads/jce8-download-2133166.html\" rel=\"nofollow\" target=\"1\" title=\"http://www.oracle.com/technetwork/java/javase/downloads/jce8-download-2133166.html\">http://www.oracle.com/technetwork/java/javase/downloads/jce8-download-2133166.html</a>.</p>\n<p>To apply it, please refer to the readme.txt file in the JCE package.</p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}