{
  "title": "Integrate with UCMDB",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p class=\"mw-headline\">You can integrate Service Management with UCMDB through either On-Premises Bridge (OPB) or the Native SACM solution (using UCMDB Gateway).</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-important-icon\"></div>\n<div class=\"admonition-content admonition-important-content\">The Service Management-UCMDB integration through OPB is deprecated and might be removed in a future release. Existing customers can continue to use it, but the support might be discontinued in a future release. </div>\n</div>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">Native SACM is one single solution for the entire Service Asset &amp; Configuration Management (SACM) process with instant access to the data and embedded graphical widgets for CI topology representation. It is a natively connected solution and enables bi-directional data federations between SMA and UCMDB. Therefore, we highly recommend that you use Native SACM to integrate SMA and UCMDB.</div>\n</div>\n<h2 class=\"mw-headline\" id=\"On-Premises_Bridge\">On-Premises Bridge</h2>\n<p>Through On-Premises Bridge (OPB), integration with UCMDB enables you to synchronize configuration item (CI) data from UCMDB with Service Management. You can perform the automatic synchronization or tailor your custom synchronization with UCMDB. The OPB is a platform that enables communications between on-premises applications and Service Management - in both directions. Because on-premises applications are located behind firewalls, initiating a connection from Service Management to an on-premises application isn't possible; therefore, a bridge component is required.</p>\n<p>By using OPB, Service Management can integrate with an external non-containerized UCMDB (classic UCMDB). You need to download and install the OPB agent to complete the integration in both cases.</p>\n<ul>\n<li><a href=\"/doc/423/26.1/integexternalucmdb\" title=\"SMAX:25.1/IntegExternalUCMDB\">Integrate with classic UCMDB through OPB</a></li>\n<li><a href=\"/doc/423/26.1/setupautomaticsync\" title=\"SMAX:25.1/SetUpAutomaticSync\">How to set up automatic synchronization with UCMDB</a></li>\n<li><a href=\"/doc/423/26.1/setupcustomsync\" title=\"SMAX:25.1/SetUpCustomSync\">How to set up custom synchronization with UCMDB</a></li>\n<li><a href=\"/doc/423/26.1/communicatewithucmdb\" title=\"SMAX:25.1/CommunicateWithUCMDB\">How to communicate with UCMDB using HTTPS</a></li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Native_SACM\">Native SACM</h2>\n<p>Apart from the traditional integration with UCMDB through On-Premises Bridge (OPB), customers can now use a solution called Native SACM to achieve seamless data federation through UCMDB Gateway.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\"> the Native SACM solution needs to work with an externally deployed UCMDB server: classic or containerized. In addition, the Native SACM solution is available for on-premises and AWS (EKS) environments. If you want to use Native SACM in an Azure environment, please contact support. </div>\n</div>\n<p>Native SACM is implemented for the following SMA record types:</p>\n<ul>\n<li>Actual Service</li>\n<li>Devices</li>\n<li>Service Component</li>\n<li>System Element</li>\n</ul>\n<p>Once Native SACM is active, any objects created with one of these 4 record types are joined with an identical record in UCMDB. This means, whenever a new record is created in either SMA or UCMDB, the same record will immediately appear on both sides. Therefore, you don't need to manually set up synchronization anymore as you did when using the OPB connection.</p>\n<p>After UCMDB Gateway is set up and ready, you can enable Native SACM in the tenant application settings. Please be aware that this operation can't be reverted, once you enabled Native SACM, you can no longer use OPB to connect SMA and UCMDB.</p>\n<p>For more information about how to set up and use Native SACM, see the following topics:</p>\n<ul>\n<li>Data model mapping between Service Management and UCMDB: <a href=\"/doc/423/26.1/syncdcis\" title=\"SMAX:25.1/SyncdCIs\">Synchronized configuration items (CIs)</a></li>\n<li>Supported topologies: <a href=\"/doc/423/26.1/supportedtopologies\" title=\"SMAX:25.1/SupportedTopologies\">Supported topologies</a></li>\n<li><a href=\"/doc/423/26.1/nativesacm\" title=\"SMAX:25.1/NativeSACM\">Native SACM</a></li>\n<li><a href=\"/doc/423/26.1/deploynativesacm\" title=\"SMAX:25.1/DeployNativeSACM\">Deploy Native SACM</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}