{
  "title": "Integrate with Operations Orchestration",
  "content": "<div class=\"mw-parser-output\">\n<p class=\"mw-empty-elt\">This topic provides information for integrating Service Management with Operations Orchestration (OO).</p>\n<p>You can integrate Service Management with:</p>\n<ul>\n<li><strong>Classic (external) OO</strong> - For the product versions supported for this integration, visit the <a class=\"external text\" href=\"/integration/Operations_Orchestration/all/56\" rel=\"nofollow\" target=\"1\" title=\"SMAX integration with Operations Orchestration (OO)\">Service Management integration with Operations Orchestration (OO)</a>. Depending on your requirement to execute flows, you can install Operations Orchestration Remote Action Service (OO RAS). The version of OO RAS supported is the same as the version of the standalone OO.</li>\n<br/>\n<li><strong>Operations Orchestration (OO) Containerized -</strong> The Operations Orchestration (OO), which was embedded as part of Design and Deploy, has been removed. If you have integrated Service Management with the embedded OO, you need to install OO Containerized and re-configure the integration. For more information on how to install Operations Orchestration, see <a href=\"/doc/423/26.1/installoocontainerized\" title=\"Install OO on-premises\">Install OO on-premises</a>, <a href=\"/doc/423/26.1/ooceks\" title=\"Install OO on EKS\">Install OO on EKS</a>, and <a href=\"/doc/423/26.1/installooaks\" title=\"Install OO on AKS\">Install OO on AKS</a>.  OO Containerized comes with an Internal OO Remote Action Service (RAS), which is deployed automatically for each OO Central tenant. You can additionally install an external OO Remote Action Service (OO RAS) on-premises, depending on your requirements to execute flows in remote data centers and networks. </li>\n</ul>\n<h2>Benefits of integrating Service Management and OO</h2>\n<p>The integration adds the following capabilities to your current deployment:</p>\n<ul>\n<li>Define business rules or detailed task plan workflows that coordinate repeatable work and run automation business rules that can result in actions ranging from sending notifications.</li>\n<li>Updating records and invoking external processes.</li>\n<li>Extending the automation of a task plan to include run-book flows that run on-premises.</li>\n<li>Import content from Operations Orchestration using the <span class=\"SAW_Variablesopb\">On-Premises Bridge and </span>run the imported flows as a workflow action of a record type, or as a task in an automatic task in a record.</li>\n<li>Provides asymmetric encryption to protect sensitive data during integration.</li>\n<li>Execute flows in remote data centers and networks through OO RAS.</li>\n<li>Automate actions such as patch deployments, application execution management, system resets, user password resets, and other actions. It includes out-of-the-box scenarios and an automation flow creation editor to define custom flows.</li>\n<li>Enable codeless configuration to select the proper on-premises Operations Orchestration flows to run within a record type/record type workflow or a task plan in Service Management. You can map Service Management data as parameters to use in the flows. Execution and status are tracked within the Service Management task plan so that the on-premises automation integrates seamlessly into the broader context of the task plan. </li>\n</ul>\n<h2>Use cases</h2>\n<h3>Operations Orchestration</h3>\n<ul>\n<li>In Change Management, it's common to define change models with automation task plans that invoke Operations Orchestration for patch deployment, server upgrades, and application management.</li>\n<li>In Service Request Management, it's common to define catalog offerings with automation task plans that invoke Operations Orchestration for new computer request configurations and self-service password resets.</li>\n</ul>\n<h3>Operations Orchestration Remote Action Service</h3>\n<p>If you have installed OO Central on Linux and want to run flows using Microsoft .NET Framework content, such as the OO content for Microsoft System Center Virtual Machine Manager, you must install OO RAS on a Microsoft Windows target, create a worker group, and assign a worker to it. </p>\n<ul>\n</ul>\n<h2 class=\"mw-headline\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/integrateoosteps\" title=\"SMAX:Main/IntegrateOOSteps\">How to perform integration with Operations Orchestration</a></li>\n<li><a href=\"/doc/423/26.1/ooencrypt\" title=\"SMAX:Main/OOEncrypt\">How to set up encryption for an Operations Orchestration integration</a></li>\n<li><a href=\"/doc/423/26.1/integrateoousecase\" title=\"SMAX:Main/IntegrateOOUseCase\">Operations Orchestration integration use case</a></li>\n</ul>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}