{
  "title": "Key concepts",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div class=\"Admonition_Note\"><em>This guide encompasses the Service Management applications inside of Service Management,including Service Request, Incident, Change, and many others. Join implementer Glenn Walker as he learns what functionality is available in Service Management, investigating the \"what\" and \"why\" aspects of the product rather than the \"how\".</em></div>\n<p><br/>\nMeet Glenn.</p>\n<p><br/>\nGlenn is the newly appointed administrator for a new implementation of the OpenText Service Management product at his company, <strong>ACME Products Inc</strong>. <strong>ACME </strong>provides widgets for many other companies and handles shipping them worldwide from a number of locations.</p>\n<p><br/>\n<strong>ACME</strong> has grown over the years, and the number of systems it needs to ensure the delivery of its widgets has grown as well. Additionally, the company has invested in internal products to help it run smoothly. This growth has resulted in the need for IT to run in an agile and streamlined manner, which was one of the biggest reasons for <strong>ACME </strong>to go with Service Management.</p>\n<p><br/>\nJoin us as we follow the implementation process that Glenn uses to get Service Management Automation X up and running. We will document how the system is designed to meet the continuing demands of the company to offer the best service to their customers.</p>\n<p><br/>\nWe will be focusing on the decisions that Glenn makes that result in a quick and efficient implementation. This involves an iterative approach to problem solving and delivering value quickly, then circling back and adding additional value and deeper process definitions. We can watch as the system evolves over time from simple call center processes to a fully functional service desk that includes all facets of IT management (and possibly beyond).</p>\n<p><br/>\nWe also offer a simple checklist of the tasks Glenn will perform to implement Service Management Automation X. If you would like to use this checklist as a template for your own implementation, you can find it <a href=\"/doc/423/26.1/implementationchecklist\" target=\"_blank\">here</a>.</p>\n<!-- NewPP limit reportCached time: 20200217093953Cache expiry: 86400Dynamic content: falseCPU time usage: 0.008 secondsReal time usage: 0.016 secondsPreprocessor visited node count: 4/1000000Preprocessor generated node count: 18/1000000Post‐expand include size: 1952/2097152 bytesTemplate argument size: 0/2097152 bytesHighest expansion depth: 2/40Expensive parser function count: 0/100Unstrip recursion depth: 0/20Unstrip post‐expand size: 0/5000000 bytes--><!--Transclusion expansion time report (%,ms,calls,template)100.00%    0.000      1 -total-->\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}