{
  "title": "Create and manage purchase order lines",
  "content": "<div class=\"mw-parser-output\">\n<p>A purchase order line is used to specify the detailed information about the individual items to order. A purchase order can include a set of purchase order lines.</p>\n<h2 class=\"mw-headline\" id=\"View_a_purchase_order_line\">View a purchase order line</h2>\n<p>To view a purchase order line, follow these steps:</p>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Build &gt; Procurement &gt; Purchase Order Lines</b>. Service Management displays a list of purchase order lines.</li>\n<li>Select the check box of a purchase order line record to view the summary on the right-handed preview pane, or click the ID link to view the details.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Create_a_new_purchase_order_line\">Create a new purchase order line</h2>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<p>You can add purchase order lines only for a purchase order with <b>New</b> phase.</p>\n<p>To add purchase order lines for suspended purchase orders, move the purchase order to the <b>New</b> phase first.</p>\n<p>To add purchase order lines for issued purchase orders, move the purchase order to the <b>Suspended</b> phase first and then <b>New</b>.</p>\n</div></div></div>\n<p>To create a new purchase order line, follow these steps:</p>\n<ol>\n<li>\n<p>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Build &gt; Procurement &gt; Purchase Order Lines</b>.</p>\n</li>\n<li>\n<p>Click <b>New</b>.</p>\n</li>\n<li>\n<p>Fill in the form.</p>\n<table>\n<tbody>\n<tr>\n<th>\n<p>Field</p>\n</th>\n<th>\n<p>Description</p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Title</p>\n</td>\n<td>\n<p>Mandatory. Specify the name of the purchase order line.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Purchase order</p>\n</td>\n<td>\n<p>Mandatory. Select the purchase order for which the purchase order line is intended.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Ordered quantity</p>\n</td>\n<td>\n<p>Mandatory. Specify the quantity to order.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Vendor</p>\n</td>\n<td>\n<p>Read-only. This field is automatically populated from the purchase order.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Asset model</p>\n</td>\n<td>\n<p>Specify the asset model of the item to order. If you select a vendor catalog item or product offering, this field is automatically populated with the asset model defined in the vendor catalog item or product offering.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Product offering</p>\n</td>\n<td>\n<p>Select the desired product offering from the list. The list of product offerings is divided into two sections:</p>\n<ul>\n<li><strong>\"Preferred offering\" section.</strong> If a vendor is specified, this section contains the offerings provided by that vendor. If an asset model is specified, this section contains the offerings provided by that model. If both the vendor and the model are specified, this section contains the offerings provided by the vendor for the model.</li>\n<li><strong>\"Active offering\" section.</strong> If the asset model is specified, this section contains the active offerings in the system that offer that asset model. If the asset model is not specified, this section contains all active offerings in the system. The offerings in this section include the offerings in \"Preferred offering\" section.</li>\n</ul>\n<p>This field can be filled manually (higher priority). If you leave this field blank, and this purchase order line is related to a request, this field will inherit the value of the offering in the request.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Vendor catalog item</p>\n</td>\n<td>\n<p>Select the desired vendor catalog item from the list. The list displays only vendor catalog items provided by the vendor specified in the purchase order. Once you select an asset model, the list is further filtered to display only vendor catalog items that have that asset model.</p>\n<p>This field can be filled manually (higher priority) or synced from the product offering. If you leave this field blank, and this purchase order line is related to a request, this field will then inherit the value of the vendor catalog item from the offering in the request. </p>\n</td>\n</tr>\n<tr>\n<td>Reference type</td>\n<td>\n<p>Select <b>Manual</b> or <b>Request</b> to suit your needs. </p>\n<p>Select <b>Manual</b> if you aren't going to link this purchase order to any service request. Otherwise, select <b>Request</b>.</p>\n<p>Note that when the creation of a purchase order line is triggered by a request, the reference type is automatically set to <strong>Request</strong>.</p>\n</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p>Click <b>SAVE</b>, <b>SAVE &amp; ADD ANOTHER</b>, <b>SAVE &amp; EDIT</b> or <b>CANCEL</b> as needed.<br/>\n\tIf the Reference type is <b>Request</b>, a dialog will pop up after you click <strong>SAVE</strong>, <strong>SAVE &amp; ADD ANOTHER, </strong>or <strong>SAVE &amp; EDIT</strong> button. You can select the request related to the purchase order line to be created.</p>\n</li>\n</ol>\n<p>Alternatively, you can create a purchase order line from a purchase order record. To do this, follow these steps:</p>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Build &gt; Procurement &gt; Purchase Orders</b>. Service Management displays a list of purchase orders.</li>\n<li>Open the desired purchase order record to which you want to add the purchase order line.</li>\n<li>Click the <b>Purchase order line</b> tab.</li>\n<li>Click <b>New</b>.</li>\n<li>Fill in the form.</li>\n<li>Click <b>SAVE</b>.</li>\n</ol>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-important-icon\"></div><div class=\"admonition-content admonition-important-content\"><div>When a purchase order line is triggered by a request or when you create a purchase order line from a purchase order record, you must ensure that the asset model, product offering, and vendor catalog item follow these rules. Otherwise, these values won't be set in the purchase order line.\n<ul>\n<li>The product offering and vendor catalog item must have the same asset model.</li>\n<li>The vendor catalog item and the purchase order must have the same vendor.</li>\n</ul>\n<p>For a purchase order line that's created upon a request, the value of <strong>Product offering</strong>, <strong>Ordered quantity</strong>, <strong>Cost type</strong>, <strong>Cost center</strong>, <strong>Delivered stock ID</strong>, <strong>Delivered to</strong> will be synced from the request to the purchase order line.<br/>\n<br/>\nThe <b>Delivered to</b> inherits the value of <strong>Deliver location</strong> from the request. If this value is null, <strong>Delivered to</strong> inherits the value of location for <strong>Requested for</strong>. The <strong>Delivered stock ID</strong> for the location will also be synced if any.<br/>\n<br/>\nIf <strong>Vendor catalog item</strong> is filled in the product offering of request, the value of <strong>Asset model</strong>, <strong>Unit of measurement</strong>, <b>Vendor SKU number</b>, <strong>List unit price</strong>, <strong>Order unit price</strong> and <strong>Currency</strong> will also be synced to the purchase order line.</p>\n</div></div></div>\n<h2 class=\"mw-headline\" id=\"Update_a_purchase_order_line\">Update a purchase order line</h2>\n<ol>\n<li>\n<p>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Build &gt; Procurement &gt; Purchase Order Lines</b>. Service Management displays a list of purchase order lines.</p>\n</li>\n<li>\n<p>Open the desired record.</p>\n</li>\n<li>\n<p>By default, the purchase order line record is displayed with the <b>General</b> tab selected. Click the tab you want to update.</p>\n<table>\n<tbody>\n<tr>\n<th>Tab</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>General</td>\n<td>\n<p>Displays general information about the current record. For more information, see the <em>General tab </em>section.</p>\n</td>\n</tr>\n<tr>\n<td>Workflow</td>\n<td>Displays the predefined purchase order line workflow. Fore more information, see <a href=\"/doc/423/26.1/polwflw\" title=\"SMAX:Main/polWflw\">Purchase order line workflow</a>.</td>\n</tr>\n<tr>\n<td>Receiving line</td>\n<td>Displays the receiving lines associated with this purchase order line.</td>\n</tr>\n<tr>\n<td>Discussions</td>\n<td>Displays any relevant conversations about the current record. For more information about discussions, see <a href=\"/doc/423/26.1/discussions\" title=\"SMAX:Main/Discussions\">Discussions</a>.</td>\n</tr>\n<tr>\n<td>History</td>\n<td>Displays changes to the selected record. For more information about history, see <a href=\"/doc/423/26.1/history\" title=\"SMAX:Main/History\">History</a>.</td>\n</tr>\n</tbody>\n</table>\n</li>\n</ol>\n<h3 class=\"mw-headline\" id=\"General_tab\">General tab</h3>\n<ol>\n<li>\n<table>\n<tbody>\n<tr>\n<th>Section</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>General details</td>\n<td>\n<p>Displays general information about the current record.</p>\n<ul>\n<li>\n<p>Title</p>\n</li>\n<li>\n<p>Description</p>\n</li>\n<li>\n<p>Purchase order</p>\n</li>\n<li>\n<p>Vendor</p>\n</li>\n<li>\n<p>Reference type</p>\n</li>\n<li>\n<p>Request</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Purchase product</td>\n<td>\n<p>This section includes the following fields:</p>\n<ul>\n<li>\n<p>Product offering</p>\n</li>\n<li>\n<p>Asset model: read-only. Displays the value of <b>Asset model</b> defined in the associated product offering (if set).</p>\n</li>\n<li>\n<p>Vendor catalog item: read-only. Displays the value of <b>Vendor catalog item</b> defined in the associated product offering (if set)</p>\n</li>\n<li>\n<p>Unit of measurement: unit of measurement. This field is hidden when a license model is selected in the <strong>Asset model</strong> field.</p>\n</li>\n<li>\n<p>Vendor SKU number</p>\n</li>\n<li>\n<p>Ordered quantity</p>\n</li>\n<li>\n<p>Received quantity</p>\n</li>\n<li>\n<p>Remaining quantity</p>\n</li>\n<li>\n<p>First received date</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Cost</td>\n<td>\n<p>This section includes the following fields:</p>\n<ul>\n<li><b>Cost type</b>: By default, the cost type(if any) specified in the related asset model record.</li>\n<li><b>Cost center</b>: By default, the cost center of the product offering request submitter, if any.</li>\n<li><b>List unit price</b>: The price at which the item retails, not including discounts. If the system creates the purchase order from the service catalog ordering process, the purchase order line item inherits the list price from the associated vendor catalog item.</li>\n<li><b>Order unit price</b>: The cost of a single product model, including discounts. If the system creates the purchase order from the service catalog ordering process, the purchase order line item inherits the cost from the associated vendor catalog item <b>Vendor Price</b>.</li>\n<li><b>Total cost</b>: The cost of a single product model unit price/cost multiplied by the value specified in Quantity.</li>\n<li><b>Currency</b></li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Delivery</td>\n<td>\n<p>This section includes the following fields:</p>\n<ul>\n<li>\n<p><b>Delivered stock ID</b>: The ID of the stock where the ordered items are received.</p>\n</li>\n<li>\n<p><b>Delivered to</b>: The location where the ordered items are received.</p>\n</li>\n<li>\n<p><b>Ship rate</b>: The shipping cost of the ordered items.</p>\n</li>\n<li>\n<p><b>Scheduled delivery date</b>: The date on which the purchase order was scheduled to be delivered.</p>\n</li>\n<li>\n<p><b>Receipt date</b>: The latest date to receive any asset on the purchase order.</p>\n</li>\n</ul>\n<p>Note that when the purchase order is canceled, all the five fields under Delivery section is read-only.</p>\n</td>\n</tr>\n<tr>\n<td>Entitlement</td>\n<td>\n<p>This section is displayed only when a license model is selected in the <b>Asset model</b> field. It includes the following fields:</p>\n<ul>\n<li><b>Unit rights</b>: The number of authorized user rights included in each license. The default value is 1.</li>\n<li><strong>Total rights</strong>: The total number of rights in the purchase order line, calculated by multiplying the Ordered quantity by the Unit rights. This field is read only.</li>\n<li><strong>Perpetual</strong>: Select if the license is perpetual. </li>\n<li><strong>Upgrade license</strong>: Displayed only if you select the <strong>Perpetual </strong>option. Indicates that the license is an upgrade license.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Attachments</td>\n<td>\n<p>You can add attachments to a record if the record type supports attachments. </p>\n<p>Your suite administrator defines an <a href=\"/doc/423/26.1/tenantdetails#File_settings\" title=\"attachment allowlist\">attachment allowlist</a> in Suite Administration. You can only upload attachments with a file type in this allowlist.</p>\n<p>Note that:</p>\n<ul>\n<li>Each attachment file name mustn't exceed 200 characters in length. </li>\n<li>If the Attachments field has been defined as encrypted for this record type and you are a member of an encryption domain, click <strong>Add encrypted attachments</strong> to attach an encrypted file to the record.</li>\n<li>Attachments aren't visible in the Service Portal.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p>Modify the fields as needed.</p>\n</li>\n<li>\n<p>Click <b>Save</b> on the toolbar.</p>\n</li>\n</ol>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}