{
  "title": "managereceivingslip",
  "content": "<div class=\"mw-parser-output\">\n<p>This section provides instructions about the following:</p>\n<h2 class=\"mw-headline\" id=\"View_a_receiving_slip\">View a receiving slip</h2>\n<p>To view a receiving slip, follow these steps:</p>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Build &gt; Procurement &gt; Receiving Slips</b>. Service Management displays a list of receiving slips.</li>\n<li>Select the check box of a record to view the summary on the right-handed preview pane, or click the ID link to view the details.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Create_a_new_receiving_slip\">Create a new receiving slip</h2>\n<p>You can create a new receiving slip in either way:</p>\n<h3 class=\"mw-headline\" id=\"Create_a_receiving_slip_from_the_Receiving_Slips_page\">Create a receiving slip from the Receiving Slips page</h3>\n<p>To create a new receiving slip from the <b>Receiving Slips</b> page, follow these steps:</p>\n<ol>\n<li>\n<p>From the main menu, select <b>Build &gt; Procurement &gt; Receiving Slips</b>.</p>\n</li>\n<li>\n<p>Click <b>Receiving on PO</b>.</p>\n</li>\n<li>\n<p>From the <b>Purchase Order</b> drop-down list that opens, select a purchase order on which you want to create the receiving slip.</p>\n</li>\n<li>\n<p>Fill in the form.</p>\n<table>\n<caption></caption>\n<tbody>\n<tr>\n<th>Section</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>General details</td>\n<td>\n<p>Specify general information about the current record.</p>\n<ul>\n<li>\n<p><b>Receiving slip title</b>. Mandatory. By default, the receiving slip title is automatically populated starting with \"Received on\" in the format of \"Received on &lt;purchase order title&gt;\". You can modify the title to suit your needs.</p>\n</li>\n<li>\n<p><b>Receive reference type</b>: This field is read-only and the default value is Purchase Order.</p>\n</li>\n<li>\n<p><b>Vendor</b>. This field is read-only and displays the value of <b>Vendor</b> specified in the associated purchase order line.</p>\n</li>\n<li>\n<p><b>Receiving method</b>: <b>Direct stock deliveries</b> or <b>Direct in use</b>.</p>\n<p>When selecting <b>Direct stock deliveries</b>, the <strong>Received stock</strong> field will be displayed and the status of the received items will be \"in stock\". When selecting <strong>Direct in use</strong>, the status of the received items will be \"in use\".</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<ul>\n<li>When you receive an Enterprise Asset and the process type of the enterprise asset is <strong>Stationary</strong>, the item will be \"Ready\".</li>\n<li>When you receive a license and select <strong>Direct stock deliveries</strong>, the license record is created in the <strong>Receive</strong> phase. When you select <strong>Direct in use</strong>, the license record is created in the <b>Pool</b> phase.</li>\n</ul>\n</div></div></div>\n</li>\n<li>\n<p><b>Receiver</b>: The person who received the ordered items.</p>\n</li>\n<li>\n<p><b>Received stock</b>: Mandatory. The field will only be displayed when selecting <b>Direct stock deliveries</b>. The stock name where the ordered items were received.</p>\n</li>\n<li>\n<p><b>Location</b>: The location where the items are received. This field is read-only and auto-filled when you choose a stockroom in the <b>Received stock</b> field.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Purchase order lines</td>\n<td>Displays all the issued or partially received purchase order lines under the purchase order on which this receiving slip is to be created, with information about ID, title, related product offering, asset mode, ordered quantity and remaining quantity. The <b>Remaining quantity</b> column indicates the number of ordered items that haven't been received yet.</td>\n</tr>\n<tr>\n<td>Receiving lines</td>\n<td>\n<p>Add receiving lines for purchase order lines under this receiving slip. To do so:</p>\n<ol>\n<li>\n<p>Select the purchase order line which includes the item that has been received.</p>\n</li>\n<li>\n<p>Click <b>Add</b>.</p>\n</li>\n<li>\n<p>Fill in the Add receiving line form that opens. For more information, see the \"Add receiving lines form\" section, below.</p>\n</li>\n</ol>\n</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p>Click <b>SAVE</b>.</p>\n</li>\n</ol>\n<h4>Add receiving lines form</h4>\n<table>\n<caption></caption>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Asset tag prefix</td>\n<td>\n<p>The prefix for the asset tag identifier. Service Management will automatically append the unique numeric number for an asset to the pre-defined prefix for each asset. The asset titles will be in the format of &lt;Asset tag prefix&gt; &lt;'n'+'m'&gt;,</p>\n<p>where,</p>\n<ul>\n<li>'n' represents the number of assets with the same asset model already in stock</li>\n<li>'m' represents the number of received quantity, starting from 1 to the total number of items received in this receiving line</li>\n</ul>\n<p>Example:</p>\n<p>You are adding a receiving line for 3 IphoneX ordered for testing purpose. There are already 2 IphoneX registered in stock. You type Testing IphoneX in the <b>Asset tag prefix</b> field and save the receiving slip. Then, the asset titles of these 3 newly received IphoneX will be Testing IphoneX3, Testing IphoneX4 and Testing IphoneX5, respectively.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>Mandatory if <b>Asset type</b> is set to <b>Infrastructure &amp; Peripheral</b> for <b>Asset type</b>.</div></div></div>\n</td>\n</tr>\n<tr>\n<td>Asset type</td>\n<td><b>Device</b>, <b>Infrastructure &amp; Peripheral, Enterprise Asset, License</b>.</td>\n</tr>\n<tr>\n<td>Subtype</td>\n<td>\n<p>Mandatory. The subtype of the asset.</p>\n<p><b>Available when</b>: The asset type isn't <b>License</b>.</p>\n</td>\n</tr>\n<tr>\n<td>Asset model</td>\n<td>\n<p><span style=\"font-size:12pt\"><span style=\"font-family:Aptos,sans-serif\"><span lang=\"EN-GB\" style=\"font-size:11.0pt\">Mandatory if <b>Asset type</b> is set to <b>Enterprise Asset</b></span><b>,</b><span style=\"font-size:11.0pt\"> </span><b><span lang=\"EN-GB\" style=\"font-size:11.0pt\">Infrastructure &amp; Peripheral</span></b></span></span>, or <strong>License</strong>. The model of the asset. Normally this was built by the manufacturer.</p>\n</td>\n</tr>\n<tr>\n<td>Warranty end date</td>\n<td>\n<p>The date when the warranty of the item is to end.</p>\n<p><b>Available when</b>: The asset type isn't <b>License</b>.</p>\n</td>\n</tr>\n<tr>\n<td>Received date</td>\n<td>The date when the ordered item is received. By default, it's the date and time when the receiving slip is created.</td>\n</tr>\n<tr>\n<td>Quantity</td>\n<td>Any quantity less than or equal to the remaining quantity and greater than 0. When you save the receiving line, a corresponding number of assets is created. However, if you have selected a batch or license asset model, a single asset is created.</td>\n</tr>\n<tr>\n<td>Unit of measurement</td>\n<td>\n<p>The unit of measure of the individual assets in batch assets. </p>\n<p><b>Available when</b>: The asset model is a batch model. The unit of measurement is copied from the purchase order line but can be edited.</p>\n</td>\n</tr>\n<tr>\n<td>Serial Number</td>\n<td>\n<p>The serial number of the asset. </p>\n<p><b>Available when</b>: The asset model isn't a batch or license model.</p>\n</td>\n</tr>\n<tr>\n<td>Unit rights</td>\n<td>\n<p>The number of authorized user rights included in each license. This field is read only- its value is copied from the purchase order line. The default value is 1.</p>\n<p><b>Available when</b>: The asset type is <strong>License</strong>.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<ul>\n<li>\n<p>The receiving slip can't be saved without adding receiving lines.</p>\n</li>\n<li>\n<p>Once you add a receiving line and save the receiving slip, a record is created for each received item. You can view these in the <b>Received assets</b> tab of the receiving line. Note that when you receive licenses, a single record is created for all purchase order lines in the original purchase order.</p>\n</li>\n<li>\n<p>You can find the receiving lines in the <b>Receiving lines</b> tab of the related purchase order and purchase order line records, with the information specified here.</p>\n</li>\n<li>\n<p>You can receive items of the same asset model for each receiving line. Items of different asset models should be specified in different receiving lines.</p>\n</li>\n<li>\n<p>The asset model of the received items can be different from the one ordered.</p>\n</li>\n<li>\n<p>A single receiving slip can have multiple receiving lines of different asset models.</p>\n</li>\n</ul>\n</div></div></div>\n<ol>\n</ol>\n<h3 class=\"mw-headline\" id=\"Create_a_receiving_slip_from_the_Purchase_Orders_page\">Create a receiving slip from the Purchase Orders page</h3>\n<p>Alternatively, you can create a new receiving slip from the <b>Purchase Orders</b> page upon a purchase order record. To do this, follow these steps:</p>\n<ol>\n<li>\n<p>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Build &gt; Procurement &gt; Purchase Orders</b>. Service Management displays a list of purchase orders.</p>\n</li>\n<li>\n<p>Select the check box of the purchase order on which you want to create the receiving slip.</p>\n</li>\n<li>\n<p>Click <b>Create receiving slip</b>.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<p>The <b>Create receiving slip</b> button is enabled only for purchase orders with status <b>Issued</b> or <b>Partially received</b>.</p>\n</div></div></div>\n</li>\n<li>\n<p>Fill in the form where necessary.</p>\n</li>\n<li>\n<p>Click <b>SAVE</b>.</p>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Update_a_receiving_slip\">Update a receiving slip</h2>\n<p>To update a single receiving slip, follow these steps:</p>\n<ol>\n<li>\n<p>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Build &gt; Procurement &gt; Receiving Slips</b>.</p>\n</li>\n<li>\n<p>Open the desired record.</p>\n</li>\n<li>\n<p>By default, the record is displayed with the <b>General</b> tab selected. Click the tab you want to edit.</p>\n<table>\n<tbody>\n<tr>\n<th>Tab</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>General</td>\n<td>Displays general information about this record. You can update the title, carrier and location.</td>\n</tr>\n<tr>\n<td>Receiving line</td>\n<td>Displays the receiving lines under this receiving slip record.</td>\n</tr>\n<tr>\n<td>Discussions</td>\n<td>Displays any relevant conversations about the current record. For more information about discussions, see <a href=\"/doc/423/26.1/discussions\" title=\"SMAX:Main/Discussions\">Discussions</a>.</td>\n</tr>\n<tr>\n<td>History</td>\n<td>Displays changes to the selected record. For more information about history, see <a href=\"/doc/423/26.1/history\" title=\"SMAX:Main/History\">History</a>.</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p>Modify the fields as needed.</p>\n</li>\n<li>\n<p>Click <b>Save</b> on the toolbar.</p>\n</li>\n</ol>\n<p>You can edit multiple records simultaneously by selecting them in the grid and updating them in the Preview pane on the right. For more information, see <a href=\"/doc/423/26.1/editrecpreview#Mass\" title=\"SMAX:Main/EditRecPreview\">Mass update</a>.</p>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}