{
  "title": "Manage software compliance using SAM",
  "content": "<div class=\"mw-parser-output\">\n<div></div>\n<p>Knowing the software license position is critical to any organization aiming to manage software spending and prevent audit issues. The Software Asset Management (SAM) capability allows you to create and analyze license compliance reports so that you can systematically manage, control your software assets, and make insightful business decisions.</p>\n<p>This use case describes how to navigate SAM, and how elements such as license, license rule, and license metric can be consumed to create and analyze compliance reports.</p>\n<p>This topic assumes that you have installed and enabled the SAM capability, and have deployed a Universal CMDB (UCMDB) environment with Universal Discovery (UD). If this isn’t the case, see <a href=\"/doc/423/26.1/addcapabilitieshelm\" title=\"Install add-on capabilities\">Install add-on capabilities</a> and <a href=\"/doc/423/26.1/deploysam\" title=\"Enable SAM\">Enable SAM</a> to deploy SAM.<!--cke_bookmark_275S--><!--cke_bookmark_275E--></p>\n<p>Because the configuration items (CIs) discovered will vary between environments and with the introduction of new SAM features in each release, the screenshots in this document might slightly differ from yours.</p>\n<h2>Key concepts and their relationships</h2>\n<ul>\n<li>Vendor: A company offering software products for sale.</li>\n<li>Product family: A group of related software versions under the same product produced by the vendor.</li>\n<li>License model: A classification applied to license assets. Each license must be based on a specific license model. Key attributes defined in the license model are the cost attributes used to calculate the cost for compliance or overspending, and the related license metric and product.</li>\n<li>License metric: A metric that measures software usage and defines the consumption calculation algorithms. For a publisher, products are licensed under one or more metrics. Generally, you can measure the use of products licensed under the same metric with the same license rule.</li>\n<li>License: A document that provides legally binding guidelines for the use and distribution of the software product.  Each license must be based on a specific license model.  </li>\n<li>License rule: A set of license calculation formulas published by vendors. It can be used to count the number of licenses required in different scenarios based on data including hardware information and deployment information.</li>\n<li>Compatibility matrix: Information defined by software vendors for specifying the product version downgrade capability among different versions and editions. The upgrade matrix is also available for purchasing new licenses when they’re in shortage to cover the installations. License rules will consume the compatibility matrix during license consumption calculation.</li>\n<li>Compliance: Compares the software installed in your environment against what you are legally entitled to use so that you can view and report on over- or under-licensed software titles.</li>\n</ul>\n<p>The following figure shows the relationships among these concepts.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"Concepts\" border=\"2\" src=\"../../../images/Concepts_847c848d.png\" style=\"width:600px;height:368px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:2px solid black;\" vspace=\"0\"/> </a></div>\n<h2>Overview and navigation</h2>\n<p>To access SAM, from the main menu of Service Management, choose <strong>Run </strong>&gt; <strong>Software Asset</strong>.</p>\n<p>To use the SAM capability, you must have the required permissions. Out of the box, Service Management provides a <strong>Software manager</strong> role that has all the privileges needed for using the SAM capability.</p>\n<p>If you've been assigned the <strong>Software manager</strong> role, clicking Software Asset opens the SAM Home menu, which gives an overview of the potential costs that a company could incur for license overspend and the products that are at risk due to insufficient licenses. If you are using SAM for the first time, the home screen won’t display any data. Once the system calculates license usage, the report widgets will be populated. The displaying data is driven by UD linked with license information created within Service Management. To navigate between SAM menus, click the arrow icon.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"Acpt2ecom8xFAAAAAElFTkSuQmCC\" border=\"0\" hspace=\"0\" src=\"../../../images/pn_image_66a0a235c76582.36776403_a2cca45f.png\" style=\"width:1200px;height:534px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a></div>\n<h2>Workflow</h2>\n<p>This figure shows how to create compliance reports for analyzing your software license position using SAM.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"SAMWorkflow\" border=\"2\" src=\"../../../images/SAMWorkflow_0483e60c.png\"/> </a></div>\n<p>Out of the box, SAM provides a number of license metrics and license rules, which are essential in compliance calculations. This use case directly leverages an OOTB license metric and license rule to calculate license consumption. If your business scenario is more complex and requires creating new license metrics and license rules, see the <em>Advanced use </em>section of this topic.</p>\n<p>In case if you don’t have the necessary data for demo for testing purposes, you can deploy the SAM sample data in your environment planned to run SAM. See <a href=\"/doc/423/26.1/sambestpracticesmax#(Optional)_Deploy_sample_data\" title=\"Deploy sample data\">Deploy sample data</a>.</p>\n<h2>Preparation</h2>\n<p>Before calculating license compliance for a product, you need to synchronize the product family information from UCMDB to learn about the products deployed in your environment.</p>\n<p>By default, SAM synchronizes the product family at midnight every day. You can also manually start a synchronization task following these steps:</p>\n<ol>\n<li>From the top menu, select <strong>Products</strong>.</li>\n<li>Click <strong>Sync from UD/UCMDB</strong> to synchronize the product family from UCMDB.<br/>\n\tThe time needed to complete the synchronization depends on how many installed software CIs are held in UCMDB.</li>\n<li>Click the notification icon <a class=\"image\" href=\"\"> <img alt=\"NotificationIcon\" border=\"0\" file=\"/mediawiki/images/7/79/NotificationIcon.png\" hspace=\"0\" src=\"../../../images/NotificationIcon_d6162440.png\" style=\"width:20px;height:21px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a> in the upper-right corner to view the task status.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"SyncProduct\" border=\"2\" src=\"../../../images/SyncProduct_f746bbd9.png\"/> </a></li>\n<li>If the task completes successfully, click <a class=\"image\" href=\"\"> <img alt=\"/mediawiki/images/6/6e/SAM_Refresh.PNG\" border=\"0\" file=\"/mediawiki/images/6/6e/SAM_Refresh.PNG\" hspace=\"0\" id=\"Picture_x0020_4\" src=\"../../../images/SAM_Refresh_d8caca4e.png\" style=\"width:70px;height:24px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a> to view the imported products.<br/>\n\tOnce the products currently available in UCMDB have been imported, they can be used within SAM to create license models.</li>\n</ol>\n<h2>Configurations</h2>\n<p>For SAM to generate correct compliance reports, certain license and product configurations are required. For example, your desired license for covering the software installations, the license rule used to count the license usage against installations, and how the license can downgrade and upgrade to different versions.</p>\n<p>Such configurations can fall into two categories:</p>\n<ul>\n<li>For OOTB products, only license configurations are needed.</li>\n</ul>\n<ul>\n<li>For non-OOTB products, first you need to configure the license. If an existing license rule can be used on the product, link the license rule to that product and configure the compatibility matrix. If no license rules can be reused, you need to develop a new license rule.</li>\n</ul>\n<h3>Configure the license</h3>\n<p>In this step, you need to define your desired license for covering the software installations. First, create a license model with information that classifies the license, including the unit price, license metric, and covered products. Then, create a license that tells how many license rights are purchased and link it with the license model you created.</p>\n<h4>Create a license model</h4>\n<ol>\n<li>From the top menu, select <strong>License Models</strong>.</li>\n<li>Click <a class=\"image\" href=\"\"> <img alt=\"NewIcon.png\" src=\"../../../images/NewIcon_7074e789.png\"/> </a> <strong>New</strong>.</li>\n<li>In the <strong>New Asset Model</strong> dialog box that appears, enter the required information, and then click <strong>SAVE</strong>.<br/>\n\tIn this example, we create a license model for the Microsoft Office Visio product. This is a desktop application that can run on both physical and OSE instances.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"new_asset_model1\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/8/84/new_asset_model1.png\" hspace=\"0\" src=\"../../../images/new_asset_model1_8991cbfc.png\" style=\"width: 800px; height: 546px; margin: 0px; border: 0px solid black;\" vspace=\"0\"/> </a></li>\n<li>Click the ID of the new license model record.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"LicenseModelRecord\" border=\"2\" src=\"../../../images/LicenseModelRecord_2fea59a0.png\"/> </a></li>\n<li>On the General tab that appears:\n\t<ol start=\"1\">\n<li>In the Asset Model details section, click <strong>Show more</strong>, and then specify the <strong>Count per pack</strong>, <strong>Pack price</strong>, and <b>Currency </b>fields based on the software asset information as part of the contractual agreement with the vendor for their product. This information is used to calculate the cost of the license gap. Other fields are optional.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"AssetModelDetails\" border=\"2\" src=\"../../../images/AssetModelDetails_291f8f6b.png\"/> </a></li>\n<li>In the Software coverage section, specify the license metric and product version.<br/>\n\t\tFor each product, you can only set one version. For cost-effectiveness, we recommend that you select the highest product version available for your license. Later you can configure the downgrade matrix to enable lower-version product installations to consume the higher-version license. See the <em>Maintain license compatibility matrix </em>section.<br/>\n\t\tIn this example, we use the <strong>Desktop Applications – Device License - Microsoft</strong> license metric and add the latest version available Office Visio 2019 Pro. <a class=\"image\" href=\"\"> <img alt=\"SoftwareCoverageConfig\" border=\"2\" src=\"../../../images/SoftwareCoverageConfig_e28fca6d.png\"/> </a></li>\n<li>Click <strong>Save</strong>.<br/>\n\t\tA message will appear at the top of the page, indicating that the new license model is created.</li>\n</ol>\n</li>\n</ol>\n<h4>Create a license</h4>\n<ol>\n<li>From the top menu, select <strong>Licenses</strong>.</li>\n<li>Click <a class=\"image\" href=\"\"> <img alt=\"NewIcon.png\" src=\"../../../images/NewIcon_7074e789.png\"/> </a> <strong>New</strong>.<br/>\n\tIn the <strong>New License</strong> dialog box that appears, enter the required information. <a class=\"image\" href=\"\"> <img alt=\"lciense_de_5\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/5/54/lciense_de_5.8.png\" hspace=\"0\" src=\"../../../images/lciense_de_5.8_bc517397.png\" style=\"width:745px;height:681px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a>\n<ul>\n<li>For the <strong>License model</strong> field, select the <strong>Microsoft Visio Desktop Application License Model</strong> record we created previously.</li>\n<li>The asset tag must be unique for each software license, and it’s also important to create a consistent naming convention. Try to include the product vendor and some details about the product.</li>\n<li>Specify the number of licenses purchased for the product and details about the unit rights. Once you set <b>Quantity </b>and <strong>Unit rights</strong>, the <strong>Total entitlements</strong> field will be automatically populated.</li>\n<li>Decide whether to check <strong>Perpetual</strong> and <strong>Upgrade license</strong> or not based on the license actual attributes.</li>\n<li>Select the <strong>Pool</strong> phase. The license consumption calculation is based on the license pool.</li>\n<li>If you are also using the <a href=\"/doc/423/26.1/originalsam\" title=\"original SAM application\">original SAM application</a> in Service Management, you will see a License metric field in the dialog box. We recommend that you remove this legacy field from all the forms that contain this field for the License and Asset Model record types in <b>Administration </b>&gt; <b>Configuration </b>&gt; <strong>Studio</strong>. For more information, see <a href=\"/doc/423/26.1/fieldsadd#How_to_delete_a_custom_field_from_a_record_type\" title=\"How to delete a custom field from a record type\">How to delete a custom field from a record type</a>.</li>\n</ul>\n</li>\n<li>Click <strong>SAVE</strong>.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"LicenseRecord\" border=\"2\" src=\"../../../images/LicenseRecord_d6386c53.png\"/> </a></li>\n<li>To check the license data, go to the <b>Products </b>page, search for and click the <strong>Office Visio</strong> product, and then click the <b>License </b>tab. <a class=\"image\" href=\"\"> <img alt=\"CheckLicenseData\" border=\"2\" src=\"../../../images/CheckLicenseData_6b0d7a87.png\"/> </a></li>\n</ol>\n<h3>Configure the product</h3>\n<p>In this step, you need to configure the product with information such as the license rules used to count product licenses and the product compatibility matrix that allows you to define the downgrade and upgrade paths.</p>\n<h4>Maintain license compatibility matrix</h4>\n<p>The compatibility matrix feature built in SAM offers you the capability to downgrade or upgrade the license for a product. The downgrade matrix allows a license to cover the installations of lower-version products. In addition, if you’ve used up the licenses for a product version, you can use the upgrade matrix to recalculate the number of the higher-version licenses needed for covering the product installations and then buy the corresponding number of licenses to stay compliant.</p>\n<ol>\n<li>From the top menu, select <strong>Products</strong>.</li>\n<li>Search for Visio and then click the product name.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"VisioProductRec\" border=\"2\" src=\"../../../images/VisioProductRec_f5c23140.png\"/> </a></li>\n<li>Go to the <strong>License compatibility matrix</strong> tab.</li>\n<li>\n<p>On this page, you can manage the upgrade and downgrade relationships between product versions. For license compatibility, see the publisher’s official documentation.</p>\n\tIn the <b>Downgrade </b>tab, hover over <strong>Visio 2019 Pro</strong>, press and hold down the left mouse button, and then draw a line between it and Visio 2016 Pro. This indicates that the licenses for Visio 2019 Pro can be downgraded to entitle the use of Visio 2016 Pro.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"DowngradePath\" border=\"2\" src=\"../../../images/DowngradePath_2af412ec.png\"/> </a><br/>\n\tIn the <b>Upgrade </b>tab, draw a line between the Visio 2019 Pro and Visio 2016 Pro. After you set the upgrade relationship, once the licenses for Visio 2016 Pro are used up, SAM will recalculate the number of extra licenses you need to purchase for entitling Visio 2019 Pro. This helps bring you back to compliance. <a class=\"image\" href=\"\"> <img alt=\"UpgradePath\" border=\"2\" src=\"../../../images/UpgradePath_0decec16.png\"/> </a></li>\n<li>Click <strong>Save</strong>.</li>\n</ol>\n<h4>Link a license rule to a product</h4>\n<p>For products whose license rules are the same across product versions, you can simply configure a license rule at the product level. In this way, you don't need to link license rules for each product version.</p>\n<p>When license rules are configured on both the product and product version level, SAM will prioritize the rule linked to product versions.</p>\n<ol>\n<li>Go to the <strong>Products </strong>page.</li>\n<li>On the <b>On-premises</b> tab page, click a product name.\n\t<p>This takes you to the <b>General</b> tab page where you can view the product details and a product version list.</p>\n</li>\n<li>\n<p>In the navigation pane on the left, click <b>License rule settings</b>.</p>\n</li>\n<li>In the <strong>Product rule settings</strong> section, select a license rule for the <strong>Default license rule across versions</strong> field.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"fKXnIkxsFKEABClCAAhSgAAXcRYABxF1Ggu2gAAUoQAEKUIACFKBAIRBgACkEg8wuUoACFKAABShAAQpQwF0EGEDcZSTYDgpQgAIUoAAFKEABChQCAQaQQjDI7CIFKEABClCAAhSgAAXcRYABxF1Ggu2gAAUoQAEKUIACFKBAIRBgACkEg8wuUoACFKAABShAAQpQwF0EGEDcZSTYDgpQgAIUoAAFKEABChQCAQaQQjDI7CIFKEABClCAAhSgAAXcRYABxF1Ggu2gAAUoQAEKUIACFKBAIRBgACkEg8wuUoACFKAABShAAQpQwF0EGEDcZSTYDgpQgAIUoAAFKEABChQCAQaQQjDI7CIFKEABClCAAhSgAAXcRYABxF1Ggu2gAAUoQAEKUIACFKBAIRBgACkEg8wuUoACFKAABShAAQpQwF0EGEDcZSTYDgpQgAIUoAAFKEABChQCAQaQQjDI7CIFKEABClCAAhSgAAXcRYABxF1Ggu2gAAUoQAEKUIACFKBAIRBgACkEg8wuUoACFKAABShAAQpQwF0EGEDcZSTYDgpQgAIUoAAFKEABChQCAQaQQjDI7CIFKEABClCAAhSgAAXcRYABxF1Ggu2gAAUoQAEKUIACFKBAIRBgACkEg8wuUoACFKAABShAAQpQwF0EGEDcZSTYDgpQgAIUoAAFKEABChQCAQaQQjDI7CIFKEABClCAAhSgAAXcRYABxF1Ggu2gAAUoQAEKUIACFKBAIRBgACkEg8wuUoACFKAABShAAQpQwF0EGEDcZSTYDgpQgAIUoAAFKEABChQCAQaQQjDI7CIFKEABClCAAhSgAAXcRYABxF1Ggu2gAAUoQAEKUIACFKBAIRBgACkEg8wuUoACFKAABShAAQpQwF0EGEDcZSTYDgpQgAIUoAAFKEABChQCAQaQQjDI7CIFKEABClCAAhSgAAXcRYABxF1Ggu2gAAUoQAEKUIACFKBAIRBgACkEg8wuUoACFKAABShAAQpQwF0EGEDcZSTYDgpQgAIUoAAFKEABChQCAQaQQjDI7CIFKEABClCAAhSgAAXcRYABxF1Ggu2gAAUoQAEKUIACFKBAIRBgACkEg8wuUoACFKAABShAAQpQwF0EGEDcZSTYDgpQgAIUoAAFKEABChQCAQaQQjDI7CIFKEABClCAAhSgAAXcRYABxF1Ggu2gAAUoQAEKUIACFKBAIRD4P5JKyfw+TmUQAAAAAElFTkSuQmCC\" border=\"0\" hspace=\"0\" src=\"../../../images/pn_image_66a0a23759b0e5.82373677_ccaccdfd.png\" style=\"width:1200px;height:412px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a></li>\n<li>Click <strong>Save </strong>to update the settings.</li>\n</ol>\n<p>For products that have multiple license rules, you might need to link different license rules to different product versions. The license rules must meet any of the following criteria:</p>\n<ul>\n<li>The product version exists in the UD/UCMDB system.</li>\n<li>\n<p>The product version is the latest version of the product.</p>\n</li>\n</ul>\n<p>To configure license rules for a product version, follow these steps:</p>\n<ol>\n<li>Go to the <b>License rule settings </b>tab.</li>\n<li>In the <strong>Product version rule settings</strong> section, click a product version.</li>\n<li>In the dialog box that appears, view the default rule that you have configured and the other license rules available.<br/>\n\tLicense rules that meet either of the following requirements are available:\n\t<ul>\n<li>The publisher of the license rule is \"Generic.\"</li>\n<li>The publisher of the license rule is the same as the publisher of the selected product. <br/>\n<a class=\"image\" href=\"\"> <img alt=\"IIIIAAAggggAACCPhL4C9R1igxLzl5PwAAAABJRU5ErkJggg==\" border=\"0\" hspace=\"0\" src=\"../../../images/pn_image_66a0a2386e1df1.00050801_155ec351.png\" style=\"width:1200px;height:576px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a></li>\n</ul>\n</li>\n<li>\n<p>Select one or more license rules as needed, and then click <strong>OK</strong>.</p>\n<ul>\n<li><b>One license rule:</b><br/>\n\t\tBy default, you only need to set one license rule. If you configure one rule, this rule becomes the default license rule for the product. The license compliance status of the product that you see on the <a href=\"/doc/423/26.1/samcompliance\" title=\"Compliance\">Compliance</a> page comes from the calculation result based on the default rule.</li>\n<li><b>Multiple license rules:</b><br/>\n\t\tSome products have special versions that can be entitled by using different license metrics. For example, you can entitle the SQL Server 2012 Enterprise edition with a core-based license or server/CAL license. For such versions, you can apply multiple license rules. For user-based license rules, all rules you apply must be user-based license rules. SAM calculates license consumption for each selected rule, and allocates licenses from the license pool based on the license metrics.<br/>\n\t\tNote that you can't assign multiple rules with the same metric to one product version. If you find a new product or product version in your environment, check if it's possible to reuse an existing rule. For details on this, see the publisher's licensing guide. If you apply an existing license rule to a new product, make sure you save the changes.<br/>\n\t\tSelect one license rule from the <b>Default value </b>drop-down list box as your desired default rule for the unlicensed devices.</li>\n</ul>\n</li>\n<li>Click <strong>Save </strong>to update the settings.</li>\n<li>For device-based licensing, you can now start calculating license compliance, but the user-based licensing requires some additional configurations.</li>\n</ol>\n<h3>Configurations required for user-based licensing</h3>\n<p>For the type of user-based licensing, you need to configure the entitlement information before calculating license compliance. See <a href=\"/doc/423/26.1/sameditlicenserec\" title=\"Edit a license record\">Edit a license record</a> and <a href=\"/doc/423/26.1/bpforuserbased\" title=\"Create compliance reports for products using user-based license rules\">Create compliance reports for products using user-based license rules</a> for more information.</p>\n<p>First, entitle users who can use the license by following these steps. </p>\n<ol>\n<li>Go to the <b>Licenses </b>page.</li>\n<li>Select the license record that's linked to a user-based license rule you want to edit.</li>\n<li>On the <b>General </b>tab page, go to the <strong>User list</strong> section.</li>\n<li>Click <b>Add </b>or the grid icon <a class=\"image\" href=\"\"> <img alt=\"Grid icon\" data-file-height=\"16\" data-file-width=\"16\" src=\"../../../images/EntityPickerIcon_40fcd801.png\" style=\"width: 16px; height: 16px;\"/> </a> .</li>\n<li>Select the users as needed.</li>\n<li>Click <strong>Save</strong>.<br/>\n\tThe added users are entitled to use the license. By default, one user can consume one license.</li>\n</ol>\n<p>Then, assign an owner to the device. </p>\n<ol>\n<li>From the main menu, select <strong>Build</strong> &gt; <strong>Service Asset &amp; Configuration</strong>.</li>\n<li>With Native SACM enabled, select <strong>Devices </strong>from the <strong>SACM Home.</strong></li>\n<li>Select the device record you want to edit or view.</li>\n<li>On the <strong>General</strong> tab page, go to the <b>Overview </b>section.</li>\n<li>Assign an owner to the device as needed.</li>\n<li>Click <strong>Save</strong>.</li>\n</ol>\n<h2>Calculation</h2>\n<p>You can <a href=\"/doc/423/26.1/samproducts#Define_a_scheduler\" title=\"define a scheduler\">define a scheduler</a> to calculate license compliance periodically. In this use case, we manually start a product synchronization job.</p>\n<ol>\n<li>On the <b>Products </b>page, search for Office Visio and select that row.</li>\n<li>Click<b> <a class=\"image\" href=\"\"> <img alt=\"SAM2020\" border=\"0\" file=\"/mediawiki/images/b/be/SAM2020.08_Calculate.PNG\" hspace=\"0\" src=\"../../../images/SAM2020.08_Calculate_ad66663d.png\" style=\"width: 84px; height: 27px;\" vspace=\"0\"/> </a> </b>.<br/>\n\tService Management will create a task to run in the background. SAM will then run a calculation using the license details, license model, license rules, and the number of discovered software applications to determine how the product is being used across the infrastructure.</li>\n<li>Click the notification icon <a class=\"image\" href=\"\"> <img alt=\"NotificationIcon\" border=\"0\" file=\"/mediawiki/images/7/79/NotificationIcon.png\" hspace=\"0\" src=\"../../../images/NotificationIcon_d6162440.png\" style=\"width:20px;height:21px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a> in the upper-right corner to view the task status.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"CalcNotif\" border=\"2\" src=\"../../../images/CalcNotif_ead575a5.png\"/> </a></li>\n</ol>\n<h2>Compliance</h2>\n<p>When the calculation task completes successfully, you can now view and analyze the license compliance position of the product.</p>\n<h3>View compliance report</h3>\n<p>To view software compliance at the product and product version levels, follow these steps:</p>\n<ol>\n<li>Go to the <b>Compliance </b>menu to view the license compliance of Office Visio.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"visio-dashboard\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/2/29/visio-dashboard.png\" hspace=\"0\" src=\"../../../images/visio-dashboard_c1214103.png\" style=\"width:540px;height:449px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a><br/>\n\t </li>\n<li>Click the compliance card to view the license details for each product version. <a class=\"image\" href=\"\"> <img alt=\"dqibiwHYeu0AAAAASUVORK5CYII=\" border=\"0\" hspace=\"0\" src=\"../../../images/pn_image_66a0a23942a5e6.06552655_01802961.png\" style=\"width:1000px;height:505px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a>\n<p>From the cards, we can see that all Office Visio products are compliant. To avoid audit issues caused by software noncompliance, you need to uninstall any unnecessary installations and purchase the required licenses.</p>\n</li>\n<li>Click the card to drill down to the consumption summary of the selected product version.<br/>\n\tThe information you see will depend on the licensing type of the product.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"xmFF7XmxxpgAAAABJRU5ErkJggg==\" border=\"0\" hspace=\"0\" src=\"../../../images/pn_image_66a0a23a45af28.48256440_65088c04.png\" style=\"width:1200px;height:232px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a></li>\n</ol>\n<p>For products of the user-based licensing type, the user interfaces will be different. For more information, see <a href=\"/doc/423/26.1/samcompliance#User-based_licensing\" title=\"Compliance\">Compliance</a>.</p>\n<h3>Analyze license compliance</h3>\n<p>To analyze software compliance per device. follow these steps:</p>\n<ol>\n<li>From the top menu, select <strong>Analysis</strong>.</li>\n<li>Click the <strong>Compliance analysis</strong> card to view the compliance information of each product.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"compliance_card\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/7/71/compliance_card.png\" hspace=\"0\" src=\"../../../images/compliance_card_50bfeaaf.png\" style=\"width:352px;height:255px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a></li>\n<li>Locate Office Visio in the product, and the <strong>License</strong> tab page opens by default. The <strong>License</strong> tab provides a summary of license details and related licenses of the selected product. For details, see <a href=\"/doc/423/26.1/samanalysis#License%C2%A0\" title=\"Analysis\">Analysis</a>.  <a class=\"image\" href=\"\"> <img alt=\"yktqDQAhIe3BMLkEgCASBIBAEgkAQCAKtIdASAWktq9w1iAiEgAxir6XOQSAIBIEgEASCQBAYXARCQAa379pS8xCQtsCYTIJAEAgCQSAIBIEgEARaRKASkP8Pu4A+F1MEMBgAAAAASUVORK5CYII=\" border=\"0\" hspace=\"0\" src=\"../../../images/pn_image_66a0a23b500d25.82385096_d3c9ad58.png\" style=\"width: 700px; height: 284px; margin: 0px; border: 0px solid black;\" vspace=\"0\"/> </a>\n<p><br/>\n\tOpen the <strong>Consumption</strong> tab. For device-based licensing and user-based licensing, the data you see might be different. In this example, all devices that have Office Visio installed appear in the Devices section on the right of the page.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"XSCxKusE5DEY+4tOgKOgCPgCDgCjoAj0BQQ+H+AbSiT6ohSyQAAAABJRU5ErkJggg==\" border=\"0\" hspace=\"0\" src=\"../../../images/pn_image_66a0a23c95ec33.30367918_b6b9bf37.png\" style=\"width: 700px; height: 271px; margin: 0px; border: 0px solid black;\" vspace=\"0\"/> </a></p>\n</li>\n<li>If the license model is more complex, you can look at the <strong>Number of processors</strong> and <strong>Cores per processor</strong> columns. This information helps you understand how each device is configured and how that could potentially impact the license consumption points for each software license they create.</li>\n<li>Click a device to understand how it’s consuming the product:\n\t<ul>\n<li>General tab: This page gives the same level of details shown on the previous page listing all the devices but now specific to the device that you selected. <a class=\"image\" href=\"\"> <img alt=\"General\" border=\"2\" src=\"../../../images/General_dbdc9459.png\"/> </a></li>\n<li>Deployment tab: This page gives additional details about the deployment of the software. You can see the type of machine that has the product installed (in this example, virtual machine), the version of the software installed, and the installation path of the software as discovered by UCMDB.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"DeploymentTab\" border=\"2\" src=\"../../../images/DeploymentTab_94001627.png\"/> </a></li>\n<li>Consumption tab: This page gives details of what rule is being used and how many consumption points are used by this device. It also gives details about the software license. If it was associated with a contract in the Contract Management module in Service Management, it will also show the details of the contract along with start and end dates.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"Consumption\" border=\"2\" src=\"../../../images/Consumption_eea2457c.png\"/> </a></li>\n</ul>\n</li>\n</ol>\n<p>For products of the user-based licensing type, the user interfaces will be different. For more information, see <a href=\"/doc/423/26.1/samanalysis\" title=\"Analysis\">Analysis</a>.</p>\n<h2>Advanced use</h2>\n<h3>License metrics</h3>\n<p>Out of the box, SAM comes with some major publishers for using with license rules. One is the generic publisher, which can deal with the license models of most vendors.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"GenericLicenseMetric\" border=\"2\" src=\"../../../images/GenericLicenseMetric_728d0106.png\"/> </a></p>\n<p>If a new license metric needs to be used over and above the OOTB metrics, you can create one. See <a href=\"/doc/423/26.1/samlicensemetrics\" title=\"License metrics\">License metrics</a>. Once saved, the new publisher is added to the publisher list. The new metric can be used with any license rules that require this algorithm to work out license usage.</p>\n<h3>License rules</h3>\n<p>In the current version of SAM, more than 20 rules come out of the box. More rules will be generated and published with later releases of SAM. In most cases for the majority of vendors, the OOTB rules should be sufficient. If new rules are required, you can either create new or clone existing rules depending on your business requirements. </p>\n<div><a class=\"image\" href=\"\"> <img alt=\"OOTBLicenseRules\" border=\"2\" src=\"../../../images/OOTBLicenseRules_1693672d.png\"/> </a></div>\n<p>For more information on how to create a new rule or clone one, see <a href=\"/doc/423/26.1/samlicenserules\" title=\"License rules\">License rules</a>.</p>\n<h2>Troubleshoot</h2>\n<h3>Toubleshoot based on SAM documentations</h3>\n<p>For SAM-related issues, you can check the topics in <a href=\"/doc/423/26.1/troubleshootsam\" title=\"Troubleshoot SAM\">Troubleshoot SAM</a>.<br/>\nIf the issue persists, contact support and create a ticket. Be sure to include all relevant log files from SAM and Service Management when raising the support ticket.</p>\n<h3 id=\"SAM_Logs\">Troubleshoot based on SAM logs</h3>\n<p>On the NFS server configured for Service Management, check the following location:</p>\n<p>For example:</p>\n<p>/var/vols/itom/itsma/logging-volume/sam/</p>\n<p>This location contains various subfolders that are dependent on the running components of SAM:This location contains various subfolders that are dependent on the running components of SAM:</p>\n<ul>\n<li>Backend   </li>\n<li>Init    </li>\n<li>UI</li>\n</ul>\n<p>If SAM isn't functioning correctly, the key logs to examine are: </p>\n<ul>\n<li>Full.log    </li>\n<li>Spring.log</li>\n</ul>\n<p>When running a compliance caculation or analysis in SAM and not obtaining the expected results, it is worth looking into the following logs:  </p>\n<ul>\n<li>Full_adapter.log    </li>\n<li>Full_calc.log</li>\n</ul>\n<p>For troubleshooting compliance calculations, there are folders to explore within /SAM/Backend/&lt;TenantID&gt;:</p>\n<ul>\n<li>Adapter    </li>\n<li>Compliance</li>\n</ul>\n<h4>Example of troubleshooting based on SAM logs</h4>\n<p>These folders contain the results of SAM's calculations, using information from UCMDB and Service Management, based on the applied License rules for the products used in SAM. If a compliance report doesn't yield the expected results for a specific product, these logs can provide insights into the reasons. Typically, the logs are named after the product in the Compliance area, such as \"MCAFEE_MCAFEE VIRUSSCAN_calc.log.\" Here's an example of such a log:</p>\n<p><code>020-07-17 02:19:21.427 [Calc queue consumer(McAfee VirusScan:db643b29-4140-4b73-975c-1045c055dcc9)] INFO  c.m.s.c.r.q.CalcUnitMessageConsumer - Calc queue consumer(McAfee VirusScan:db643b29-4140-4b73-975c-1045c055dcc9) is started.</code></p>\n<p><code>2020-07-17 02:19:24.164 [Calc-0] INFO  c.m.s.c.r.q.CalcUnitMessageWorker - The license consumption of the db643b29-4140-4b73-975c-1045c055dcc9 product on the sov02om20 host is calculated.</code></p>\n<p><code>2020-07-17 02:19:24.179 [Calc-1] INFO  c.m.s.c.r.q.CalcUnitMessageWorker - The license consumption of the db643b29-4140-4b73-975c-1045c055dcc9 product on the sov02om28 host is calculated.</code></p>\n<p><code>2020-07-17 02:19:24.179 [Calc-2] INFO  c.m.s.c.r.q.CalcUnitMessageWorker - The license consumption of the db643b29-4140-4b73-975c-1045c055dcc9 product on the sov02oo11 host is calculated.</code></p>\n<p><code>2020-07-17 02:19:24.195 [Calc-0] INFO  c.m.s.c.r.q.CalcUnitMessageWorker - The license consumption of the db643b29-4140-4b73-975c-1045c055dcc9 product on the sov02ft36 host is calculated.</code></p>\n<p><code>2020-07-17 02:19:24.195 [Calc-1] INFO  c.m.s.c.r.q.CalcUnitMessageWorker - The license consumption of the db643b29-4140-4b73-975c-1045c055dcc9 product on the sov02bac02 host is calculated.</code></p>\n<p><code>2020-07-17 02:19:24.211 [Calc-2] INFO  c.m.s.c.r.q.CalcUnitMessageWorker - The license consumption of the db643b29-4140-4b73-975c-1045c055dcc9 product on the sov02nnm71 host is calculated.</code></p>\n<p><code>2020-07-17 02:19:24.211 [Calc-0] INFO  c.m.s.c.r.q.CalcUnitMessageWorker - The license consumption of the db643b29-4140-4b73-975c-1045c055dcc9 product on the sov02nnm68 host is calculated.</code></p>\n<p><code>2020-07-17 02:19:25.258 [pool-1-thread-1] INFO  c.m.s.c.controller.RuleController - Sent 'END_FLAG' for product[McAfee VirusScan]</code></p>\n<p><code>2020-07-17 02:19:25.258 [pool-1-thread-1] INFO  c.m.s.c.controller.RuleController - Waiting for calculation finish...</code></p>\n<p><code>2020-07-17 02:19:30.262 [pool-1-thread-1] INFO  c.m.s.c.controller.RuleController - Round 1 allocation finished! Consumed time: 0 ms.</code></p>\n<p><code>2020-07-17 02:19:30.356 [pool-1-thread-1] INFO  c.m.s.c.controller.RuleController - Consumed time of compliance results aggregation: 94 ms.</code></p>\n<p><code>2020-07-17 02:19:30.528 [pool-1-thread-1] INFO  c.m.s.c.controller.RuleController - Consumed time of compliance results saving: 172 ms.</code></p>\n<p><code>2020-07-17 02:19:30.559 [pool-1-thread-1] INFO  c.m.s.c.controller.RuleController - Consumed time of license consumption relation saving: 31 ms.</code></p>\n<p><code>2020-07-17 02:19:30.559 [pool-1-thread-1] INFO  c.m.s.c.controller.RuleController - Calculation completed on total 7 physical devices!</code></p>\n<p>The highlighted line indicates that only physical devices were considered in the calculation. If the Agent knew more devices had this product installed but was wondering why only 7 were showing in the compliance report, this explains why. Currently, for virtual machines (VMs) to be included in the calculation, the physical hosts that accommodate the VMs must also be discovered. A VM without an associated physical host won't be considered in the calculation using the<strong> Generic per Device </strong>rule applied in the given example. This rule specifically examines the <strong>Host is Virtual </strong>attribute in UCMDB to determine its inclusion in the calculation.</p>\n<h2>Related topics</h2>\n<p><a href=\"/doc/423/26.1/newsam\" title=\"New SAM\">New SAM</a></p>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}