{
  "title": "Manage the data domains list",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The system stores all data domains in the <strong>Data domains</strong> list. As the tenant admin, you can directly update the out-of-the-box (OOB) list in the Lists Management module. However, if you have many data domains, use the Export and Import features to manage your data domains in an easier way. <br/>\n<br/>\nThe Export and Import features process data domain values for English (US) and other supported languages. </p>\n<p><b>Notes</b>:</p>\n<ul>\n<li>By default, all Service Management tenants come with a single data domain named <b>Public</b>.</li>\n<li>Each tenant can have up to 1,000 data domains. When you reach this limit, the system disables the <b>Add</b> button in the List items area. Pagination occurs when there are more than 250 data domains. </li>\n<li>There is no option to define the order of the items in the data domains list. The system always adds new list items to the end of the existing list. </li>\n</ul>\n<h2>Update the OOB data domains list</h2>\n<p>If you have a limited number of data domains, you can directly update the OOB data domains list with your custom values. </p>\n<ul>\n</ul>\n<p>To update the list: </p>\n<ol>\n<li>Log in to the agent interface as the tenant admin.</li>\n<li>Go to <strong>Administration</strong> &gt; <strong>Configuration</strong> &gt; <strong>Lists</strong> to open the <strong>Data domains</strong> list. </li>\n<li>Click <strong>Add</strong>, enter a name and display label, and then click <strong>OK</strong> or <strong>Add Another</strong> to add one or more custom data domains. </li>\n<li>If you want to disable any OOB or custom data domains, clear the <strong>Active</strong> check box for them. Note that you can't disable the Public domain.  </li>\n<li>Click <strong>Save</strong> to save the list. </li>\n</ol>\n<h2>Import custom data domains</h2>\n<p>If your system needs to use many custom data domains, instead of adding them one by one in the Lists Management module, you can import them as a .zip file.<br/>\n<br/>\n<strong>Notes</strong>:</p>\n<ul>\n<li>To avoid import failures, you can export the existing data domains list from the system as a .zip file and then use the exported XLS files in the .zip file as templates when preparing your own data for import.</li>\n<li>When editing an XLS file, make sure that the file contains no empty rows. Note that clearing contents from a row will create an empty row. To avoid this issue, delete the row instead of clearing the contents.</li>\n<li>When creating a zip file with the updated XLS files, pay attention to the following:\n\t<ul>\n<li>You must name each XLS file as <code>DataDomains_&lt;language_code&gt;.xls.</code></li>\n<li>You must place the XLS files directly under the zip package instead of in any subfolders.</li>\n<li>You must include at least the <code>DataDomains_en.xls</code> file in the zip file; the XLS files for other languages are optional.</li>\n</ul>\n</li>\n<li>Imported data domains will override the existing ones in the system. Items that exist in the system but not in the imported list become inactive after the import (the only exception is the Public data domain, which you can't disable). </li>\n</ul>\n<p>To import your custom data domains:</p>\n<ol>\n<li>Log in to Suite Administration as suite-admin: https://&lt;External Access Host&gt;/bo.</li>\n<li>Open your tenant,  go to the <strong>Application settings</strong> tab, and make sure that .zip is in the <strong>Attachment allowlist</strong> field. If it's not there, add it. You can remove it after the import.  </li>\n<li>Log in to the agent interface as the tenant admin.</li>\n<li>Go to <strong>Administration</strong> &gt; <strong>Lists</strong> to open the <strong>Data domains</strong> list. </li>\n<li>Click <strong>Save </strong>in case you have made any edits to the OOB list.  </li>\n<li>Click <strong>Export</strong>. The system exports the list of data domains to a zip file (DataDomains_YYYYMMDD_XXXXXXX.zip), which is automatically downloaded to your download folder. The zip file contains a set of XLS files for supported languages. These files are named DataDomains_&lt;language_code&gt;.xls, such as DataDomains_fr.xls. <br/>\n<strong>Note:</strong> The Active column only appears in the English version (<strong>DataDomains_en.xls</strong>) to ensure the data consistency.</li>\n<li>The <strong>DataDomains_en.xls</strong> file is mandatory when you import custom data domains later. Edit this file in the following columns: \n\t<ul>\n<li>Name: Must start with a capital letter, may contain A–Z, a–z, 0–9, and must not contain any spaces. For example: <strong>IT</strong>.  Note that Service Management automatically appends <strong>_c </strong>to the imported Name values. </li>\n<li>Display Label: the display name of the data domain. For example: <strong>IT</strong>. Note that you must provide Name and Display Label values as pairs; otherwise, errors will occur during import. </li>\n<li>Active: <strong>true</strong> or <strong>false<br/>\n\t\tNote:</strong> Make sure only the <strong>Active</strong> column exists only in the English version (<strong>DataDomains_en.xls</strong>). <strong> </strong></li>\n</ul>\n</li>\n<li>Optionally, edit the <strong>DataDomains_en-GB.xls</strong> file by copying the Name and Display Label values from the <strong>DataDomains_en.xls</strong> file and update the display labels to British English if needed. </li>\n<li>Optionally, update the XLS files for other desired languages by copying the Name and Display Label values from the <strong>DataDomains_en.xls</strong> file, and then have the display labels localized. Note that each localization XLS file must include the same set or a subset of Name values as the English XLS file. If a localization file contains a Name that doesn't exist in the <strong>DataDomains_en.xls</strong> file, the import won't fail but will ignore the localized display label for that Name. </li>\n<li>Compress the updated XLS files to a zip file without including any subfolders. The zip file must contain at least the <strong>DataDomains_en.xls</strong> file, and a localization XLS file must contain at least one localized display label value.  </li>\n<li>Return to the Lists Management module, open the <strong>Data domains</strong> list and then click <strong>Import</strong>. Browse to your zip file, and then click <strong>Import</strong>.  </li>\n<li>Check that your custom data domains and their translated values have been imported successfully. To view the localized values of an item, select the item from the list, click <strong>Edit</strong>, and click the More (<strong>...</strong>) icon next to the <strong>Display name</strong> field. </li>\n<li>Click <strong>Save</strong> to save the imported data.<br/>\n<strong>Note</strong>: If you want to discard the imported data, click <strong>Discard</strong>.  </li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}