{
  "title": "Manage custom Service Level Target types",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>To manage custom target types, follow these steps.</p>\n<h2 id=\"Create_a_custom_target_type_in_Lists\">Create a custom target type in Lists</h2>\n<p>You can go to <strong>Lists</strong>, open the <strong>Target type</strong> (<strong>TargetType</strong>) list, and add custom target type items as needed.</p>\n<p><strong>Notes:</strong></p>\n<ul>\n<li>The custom target types created this way are all SLA target types. There is only one OLA target type, which is Time in Group. </li>\n<li>You can activate or deactivate custom target types in this list.\n\t<ul>\n<li>If you deactivate a custom target type, it won't be available when you create/edit a Target Set. However, this Active/Inactive switch doesn't take effect on records that have already applied this target type. </li>\n<li>For an inactive target type, you need to manually delete its configurations in order to stop the corresponding SLT calculation.</li>\n</ul>\n</li>\n<li>When an SLT is already running for a record, if you go to Lists and add a custom target type item and then try to append it to the target set, the newly added custom target type won't show up in the record.</li>\n</ul>\n<h2 id=\"Add_the_custom_target_type_to_a_Service_Level_Target_Set\">Add the custom target type to a Service Level Target Set</h2>\n<p>Add the custom target type to the <strong>Target Types</strong> field of a Service Level Target Set.</p>\n<h2 id=\"Add_SLT_operation_rules_for the_custom_target_type\">Add SLT operation rules for the custom target type</h2>\n<p>Follow the instructions in <a href=\"/doc/423/26.1/addslteventrules\">Manage Service Level Target business rules</a> to add SLT operation rules for the custom target type. You can do this through either the Studio workflow or the Rules tab of the target set record.</p>\n<p>When you are managing rule conditions for <strong>Execute SLT operation</strong> rules, pay attention to the following scenarios:</p>\n<ul>\n<li>If you want to start a target based on metaphase changes, you need to set an <strong>Execute SLT operation</strong> rule on the metaphase level in the workflow and include the following additional condition: <code>${current_update.MetaPhase.IsChanged}</code></li>\n<li>Especially for Change, there is a default process (Normal Change by default). Based on this default process, every Change is first created and then may flow into other change processes. Therefore, we recommend that you add an additional condition if the SLT target operation is based on metaphase changes: <code>${current_update.MetaPhase.IsChanged || current_update.ProcessId.IsChanged}</code></li>\n<li>As Change has three processes that share one set of Target types for a Change Target Set, if you want to operate a target for one specific Change process, you need to manage the rule based on Change processes differently. For example, if you want to operate a target on Emergency Change only, we recommend that you include the following condition when you create the SLT operation rule on the Emergency Change process: <code>${(entity.BasedOnChangeModel.ChangeWorkflowType == 'EmergencyChange'}</code></li>\n</ul>\n<p><strong>Notes:</strong></p>\n<ul>\n<li>The out-of-the-box <strong>Start SLT operation</strong> rules in the Change workflow are defined for the out-of-the-box Change targets which are shared by all three processes. Therefore, if you want to make use of these out-of-the-box rules to start your own target for one specific Change process, you need to modify the rule condition. Take Emergency Change for example, you need to include the following condition: <code>${(current_update.MetaPhase.IsChanged || current_update.ProcessId.IsChanged) &amp;&amp; entity.BasedOnChangeModel.ChangeWorkflowType == 'EmergencyChange'}</code>. </li>\n<li>One special unsupported use case for Change target: Suppose you define a target type shared by more than one Change process, for example, Normal and Emergency Change. After a Normal Change is created, a user manually switches the Change type from Normal to Emergency, and you want to stop the target from running on the previous Normal Change and make a fresh start with the same target on the Emergency Change. This is not supported. This is because, within one transaction, the start operation is always executed before the stop operation for the same target. In such a case, the same target needs to be continued with the change type switch.</li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}