{
  "title": "Manage roles in IdM Admin Portal",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Roles added or updated in IdM won't be automatically replicated to Service Management. Therefore, it's better to manage roles in Service Management. However, you can use IdM Admin Portal to manage roles when:</p>\n<ul>\n<li>You must set up roles and use them at the farm level in the IdM <strong>sysbo</strong> organization for your capabilities.</li>\n<li>You don't use the 1 tier tenancy model.</li>\n<li>You don't need converged authorization.</li>\n</ul>\n<p>To open the IdM Admin Portal, go to the tenant's details page from Suite Administration and then click the <b>IdM settings </b>tab.</p>\n<p>The following roles are read-only. The only field that you can update is the <strong>Associated Permissions</strong> field.</p>\n<ul>\n<li>Roles added in Service Management, which are automatically replicated to IdM.</li>\n<li>Roles added in IdM, which meet these conditions:\n\t<ul>\n<li>The roles' <strong>Application</strong> field is one of these values: <strong>SMAX</strong>, <b>CMDB</b>, <strong>DND</strong>, <strong>CGRO</strong>, <strong>CONTENTSTORE</strong>, <strong>OO</strong>, <strong>AUDIT</strong>.<br/>\n<strong>Note:</strong> The system doesn't prevent you from updating the <strong>Application</strong> field for these roles. Don't do this because it will result in data consistency between IdM and Service Management and other unexpected behaviors.</li>\n<li>The roles' tenant has gone through the authorization migration process in Suite Administration.</li>\n</ul>\n</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-caution-icon\"></div>\n<div class=\"admonition-content admonition-caution-content\"> <br/>\nTo align with the out-of-the-box roles associated with <strong>SMAX</strong>, <strong>CMDB</strong>, <strong>DND</strong>, <strong>CGRO</strong>, <strong>CONTENTSTORE</strong>, <strong>OO</strong>, and <strong>AUDIT</strong>, these applications are currently locked in IdM. When you try to delete any of these applications from <strong>Global settings</strong> &gt; <strong>Applications</strong>, an error message will appear indicating that the action isn’t allowed. You can delete custom applications, but use caution when doing this because it will remove the applications and the corresponding roles at the farm level.</div>\n</div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}