{
  "title": "Import and export a service design",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>In this topic, artifacts refer to service design and its associated resource offering(s).</p>\n<p>You can import and export many of the artifacts that provide the basis for cloud automation. The export operation provides the ability to preserve the selected artifacts so they can be used to replicate the services on another system or to restore the artifacts. These exported archive files are preserved in an industry-standard zip archive file format.</p>\n<p>Installing or replacing artifacts on the target system is supported by import and update operations. The import operation only adds artifacts, whereas the update operation replaces matching artifacts. See the <i>Tasks</i> section below for more information.</p>\n<p>Note that an import does not automatically associate the resource offering to existing resource providers on the system. After the import, you should manually associate the imported resource offering with the appropriate resource provider. For more information, refer to <em>Select or remove providers for a resource offering</em>.</p>\n<h2 id=\"Process_information\">Process information</h2>\n<ul>\n<li>\n<p><b>Custom component types</b> — If the service design you want to import has a dependency on any custom component types, these custom component types must be imported before the service design can be imported.</p>\n</li>\n<li><b>Configuration options</b> — If a service design has active configuration options associated with it, the configuration options for the service design being imported must match those of the service design on the target system; otherwise, the import of the service design doesn't succeed.</li>\n<li><b>Update operation</b> — The update operation is destructive to existing data. You should understand the differences between the import operation, update operation, and update options to ensure you choose the operations and options that match your expectations. See the <i>Tasks</i> section below for more information.</li>\n<li>\n<p><b>Flows</b> — During an import, update, or preview operation, if required dependencies don't exist on the Operations Orchestration system, an error message identifies these missing dependencies (dependencies such as flows). The content pack that contains these flows must have been deployed to the Operations Orchestration system prior to importing these artifacts. The flows must also have identical signatures and identical paths as the flows on the system from which the artifact was exported.</p>\n<p>During import, flow signature-related information is verified in or added to the database (flow signatures are used during the creation of an artifact and when adding a resource synchronization action or an external approval type). This information is resolved by <b>name</b> which corresponds to the full path to the Operations Orchestration flow</p>\n</li>\n<li><b>Archive content</b> — The archive (<code>.zip)</code> file can only reference files or content contained within the <code>.zip</code> file itself, or that are already contained in the <code>csa.war</code> file.</li>\n<li>\n<p><b>Image files</b> — All images in the archive files must end in one of the following suffix values (for information on adding additional suffix values, see the Configuration section):</p>\n<p><code>jpg|jpeg|jpe|jfif|svg|tif|tiff|ras|cmx|ico|pnm|pbm|pgm|ppm|rgb|xbm|xpm|xwd|png</code></p>\n</li>\n<li><b>Back up your data</b> — Create a backup of your system or data. Before proceeding, be sure to create a backup of any artifacts you may be affected by using the export operation to save an archive zip file.</li>\n</ul>\n<p>When you import a design, any tags you have selected in the designs area don't affect the imported design. The imported design will contain the tags that were included when the design was exported, and new tags will be created on the system, as necessary, to match what was exported.</p>\n<p>Note<br/>\nIf authenticity of imported service design content archives is verified (which is done by setting the property <code>csa.security.enable</code>) , then service design content archives that were successfully imported will no longer import properly until they have been digitally signed.</p>\n<h2 id=\"Tasks\">Tasks</h2>\n<ul>\n<li>\n<p><b>Import</b> option — Adds only new artifacts to the target system (the archived artifacts do no exist on the target system).</p>\n\tThe import operation identifies service designs by functional equivalence to determine if an identical service design exists on the target system. Archived service design is considered to be functionally equivalent to the service design on the target system if the archived service design has the same internal name as a service design on the target system. If the import operation identifies a functionally equivalent service design on the target system, the archived service design isn't imported.</li>\n<li>\n<p><b>Update</b> option — Imports new artifacts and overwrites existing artifacts. New artifacts are created if they don't exist on the target system. Identical artifacts that exist on the target system are overwritten with changes from the archive.</p>\n<p>There may be cases where an existing artifact on the target system can't be updated. For example, if the existing artifact is a service offering or design and the service offering or design is published, the service offering or design will not be updated because a published service offering or design can't be edited.</p>\n<p>An existing service offering or design can be updated from a published offering or service design archive if the existing service offering or design isn't published.</p>\n<p><b>Preserve originals</b> — Select this option to create a copy of the original artifact if the artifact exists on the target system. On import, a copy of the original artifact is created and then the original artifact is overwritten by the imported artifact. The version of the copy is appended with \"Superseded on\" and the date. The version of the artifacts being imported remains intact. If the artifact doesn't exist on the target system, a copy isn't created.</p>\n</li>\n<li><b>Preview</b> — Generate a report of prospective results for the import process, including information about the artifacts and their status.</li>\n<li><b>View Detailed Report</b> - From the Import Summary dialog, select this link to see a summary and details of the import process, including information about the artifacts and their status.</li>\n<li>\n<p><b>Export</b> — Create a content archive (.zip) file. The content archive contains XML documents for the artifacts you are exporting, as well as icons for customizing the artifacts, and the Manifest XML document, which contains meta-information about the archive files.</p>\n<p>The service designs are packaged in an archive file whose name is:</p>\n<p><code>SERVICE_DESIGN_&lt;service_design_display_name&gt;_&lt;service_design_id&gt;.zip</code></p>\n</li>\n</ul>\n<h2>Related topics</h2>\n<ul>\n<li>For information on how to select or remove providers, see <a href=\"/doc/423/26.1/mgmtconsroassocdissocproviders\">Select or remove providers for a resource offering</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}