{
  "title": "Manage resource category",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Resource offering categories allow you to classify resource offerings for improved filtering and identification. The product includes some predefined categories out-of-the-box (shown below) or you can create your own. A category is associated with a resource offering and can be used when assigning resource offerings to service designs.</p>\n<p>Service components within a service design can accept offering assignments only for those offerings with a category that's supported by the service component type. For example, a <b>Server</b> service component can be associated with offerings from a category of <i>Compute</i> (among others), while a <b>Software Application Service</b> component can be associated with offerings with a category of <i>Application</i>.</p>\n<p>Resource categories are available by selecting <b>By Category</b> from the list in the left navigation pane.</p>\n<p>In the resource offering's landing page, click the <span class=\"UIElementsgear icon\">gear icon</span> and chose <b>Manage Resource Category</b>. Use the add, edit, or delete icons to add, edit, or delete the category.</p>\n<h2 class=\"mw-headline\" id=\"Tasks\">Tasks</h2>\n<h3 class=\"mw-headline\" id=\"Create_a_resource_category\">Create a resource category</h3>\n<p>To create a resource category, select <b>By Category</b> from the dropdown, then click the gear icon and select <b>Manage Resource Category</b>. Click the add icon, add the category properties, and then click <b>Create</b>.</p>\n<p>Resource category properties:</p>\n<table>\n<tbody>\n<tr>\n<th width=\"50%\">Item</th>\n<th width=\"50%\">Description</th>\n</tr>\n<tr>\n<td>Display Name</td>\n<td>The display name you provide for the category.</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>The description you provide for the category.</td>\n</tr>\n<tr>\n<td>Image</td>\n<td>An image that displays for the category. Click <b>Change Image</b>. Choose the image you want, and click <b>Select</b>. Click <b>Upload Image</b> to add your own image. Supported file extensions include .<code>jpg</code>, .<code>jpeg</code>, .<code>gif</code>, and .<code>png</code>. The recommended image size is 256 by 256 pixels, and the image will be scaled to the appropriate size.</td>\n</tr>\n</tbody>\n</table>\n<h3 class=\"mw-headline\" id=\"Edit_a_resource_category\">Edit a resource category</h3>\n<p>To edit a resource category, choose to filter <b>By Category</b>, then select the category to edit. Click the gear icon and choose <b>Manage Resource Category</b>. Click the edit icon, edit the category properties, click <b>Save</b>, and then click <b>Done</b>.</p>\n<h3 class=\"mw-headline\" id=\"Delete_a_resource_category\">Delete a resource category</h3>\n<p>Categories can't be deleted:</p>\n<ul>\n<li>If offerings are using them.</li>\n<li>If they're out-of-the-box.</li>\n</ul>\n<p>To delete a category, choose to filter <b>By Category</b>, then select the category to delete. Click the gear icon and choose <b>Manage Resource Category</b>. Click the delete icon, confirm your deletion, then click <b>Done</b>.</p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}