{
  "title": "Associate resource offerings with service design components",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>You can associate a resource offering with a service component in a service design. For example, a resource offering for a <span class=\"ProductNamesvCenter\">VMware vCenter</span> VM template can be linked to a Server service component. This association or link ensures that the resource offering will be provisioned when the Server service component is deployed.</p>\n<p>You can also associate resource offerings with component templates.</p>\n<h2 class=\"mw-headline\" id=\"Tasks\">Tasks</h2>\n<ul>\n<li><b>Navigate to</b> (the Resource Offerings tab) — Select a service design version. Click the <b>Designer</b> tab. Select the service component to which you want to add, modify, or delete a resource offering. In the right pane, click the <span class=\"UIElementsgear icon\">gear icon</span>, select <b>Edit Component</b>, and select the <b>Resource Offerings</b> tab.</li>\n<li>\n<p><b>Add</b> — Navigate to the Resource Offerings tab and click <b>Add</b>. If no resource offerings are associated, click the <b>Add</b> icon in the middle of the window. In the <b>Select Resource Offering</b> dialog box, select the <b>Resource Category</b> from the dropdown, select <b>Resource Offering</b> from the list, and click <b>Add</b>.</p>\n<p>A resource offering can't be associated with a service component if the service component is part of a published design.</p>\n</li>\n<li>\n<p><b>Delete</b> — Click the <span class=\"UIElementsgear icon\">gear icon</span> next to the resource offering you want to delete. Click <b>Delete</b> and click <b>Yes</b> in the confirmation dialog.</p>\n<p>A resource offering can't be deleted if the service component is part of a published design.</p>\n</li>\n<li><b>Replace Resource Offering</b> — Click the <span class=\"UIElementsgear icon\">gear icon</span> next to the resource offering you want to replace. Select <b>Replace Resource Offering</b>, and select the replacement resource offering. The displayed resource offerings aren't bound to the service component and are of the same resource category and provider type as the resource offering being replaced.</li>\n<li>\n<p><b>Navigate to Resource Offering</b> – Click the <span class=\"UIElementsgear icon\">gear icon</span> next to the resource offering to which you want to navigate. Select <b>Navigate to Resource Offering</b>, which takes you to the resource offering.</p>\n</li>\n<li>\n<p><b>Group</b> — Ctrl-Click to select multiple resource offerings, and click <b>Group</b> on the right panel to create a parallel processing group. You can also click and drag individual resource offerings to group them. Resource offerings in a parallel processing group are processed at the same time.</p>\n</li>\n<li>\n<p><b>Ungroup</b> — Click the <span class=\"UIElementsgear icon\">gear icon</span> next to a resource offering inside a group and select <b>Remove from Group</b>. You can also ungroup a resource offering by dragging it out of the parallel processing group.</p>\n<p>To ungroup multiple resource offerings at one time, click and select multiple resource offerings and click <b>Ungroup</b> on the right panel.</p>\n</li>\n<li>\n<p><b>Set Processing Order</b> — The processing order of a resource offering specifies the order in which the associated resource offering will be provisioned relative to the other resource offerings added on this service component. The order in which you see the resource offerings is the order in which they will be provisioned. You can click and drag a resource offering or a group of resource offerings and move them around to set a processing order.</p>\n</li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}