{
  "title": "Provider selection panel",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>After adding a resource offering to a component template, you can create one or more provider selection actions for that resource offering. You can also choose not to specify provider selection actions, in which case a provider associated to the resource offering will be randomly selected, honoring any environment to catalog associations that may be configured. The provider selection actions run during the <b>Before</b> phase of the <b>Reserving lifecycle</b> stage; the lifecycle stage can't be changed.</p>\n<p>The product ships with internal actions to help with provider selection. For more information about these provider selection internal actions, see Provider selection internal actions.</p>\n<h2 id=\"Tasks\">Tasks</h2>\n<ul>\n<li><b>Navigate to</b> or <b>View</b> (the Provider Selection panel) — Select a service design version. Click the <b>Designer</b> tab. Select the service component on which you want to add a provider selection action. In the right pane, click the gear icon, select <b>Edit Component</b>, and select the <b>Resource Offerings</b> tab. In the <b>Resource Offerings</b> tab, click the name of the resource offering, and then click <b>Provider Selection</b> from the panel on the right.</li>\n<li>\n<p><b>Add</b> (a provider selection action) — Navigate to the <b>Provider Selection</b> panel and click <b>Add</b>. If no provider selection actions are configured, click the <b>Add</b> icon in the middle of the panel. Enter the information as described in the Lifecycle action selection wizard for sequenced designs.</p>\n<p>A provider selection action can't be created if the service component is part of a published design.</p>\n</li>\n<li>\n<p><b>Edit</b> (a provider selection action) — Navigate to the <b>Provider Selection</b> panel, click the gear icon next to the action you want to edit, and select <b>Edit</b>. Update the information as described in the Lifecycle action selection wizard for sequenced designs.</p>\n<p>The properties of an action can't be edited if the service component is part of a published design.</p>\n</li>\n<li>\n<p><b>Delete</b> (a provider selection action) — Navigate to the <b>Provider Selection</b> panel, click the gear icon next to the action you want to delete, and select <b>Delete</b>.</p>\n</li>\n<li>\n<p><b>Set Processing Order</b> — The processing order of a provider selection action is relative to the other provider selection actions on this resource offering. The order in which you see the provider selection actions is the order in which they will be run. You can click and drag a provider selection action to change its processing order</p>\n</li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}