{
  "title": "Create a service design component",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><ol>\n<li>Complete the steps in the sub-topic To navigate to the sequenced designer in the topic Sequenced designer and select the <b>Designer</b> tab.</li>\n<li>Use the list in the left pane to select a component palette. A component palette contains a group of component types from which you can choose when creating service components in a service design.</li>\n<li>The component types available for this palette appear. Use the search box to filter the component type list by display name and description. Select a component type.</li>\n<li>\n<p>When you select a component type, the templates available for that component type appear.</p>\n<ul>\n<li>A search box appears for component types with five or more templates. Use the search box to filter the component template list by display name and description.</li>\n<li>A component template is a specialized version of a component type and is used to simplify service design creation. Component templates can include customized property values and lifecycle actions that provide initial settings for the service design. When a template is added to a design, any default properties, bindings, and lifecycle actions are automatically populated in that service component within the design. This list always includes a <b>Blank Template</b>, which uses the settings as configured for the selected component type.</li>\n</ul>\n</li>\n<li>Select the template of the component type you want, and add it to the design canvas on the right using any of the following methods. You can add parent or child components using these methods, and you can add as many components as you need for your design:\n\t<ul>\n<li>Drag and drop the template to the canvas.</li>\n<li>Double click on a template to add it to the canvas.</li>\n<li>Click the orange dot on a service component on the canvas to bring up the designer controls toolbar (see Designer controls in the topic Sequenced designer). Click the <b>Add</b> icon <a class=\"image\" href=\"/file/images/e/e8/4.92/Management_Console/Shared_Content/icons/icon-add.png\" title=\"/file/images/e/e8/4.92/Management_Console/Shared_Content/icons/icon-add.png\"> <img alt=\"icon-add.png\" data-file-height=\"11\" data-file-width=\"11\" height=\"11\" src=\"../../../images/icon-add_71fe2bfe.png\" width=\"11\"/> </a> to add a parent or child service component.</li>\n</ul>\n</li>\n<li>\n<p>To establish parent-child relationships between component types on the canvas, click the orange dot on a service component on the canvas, and draw a line to the parent or child component type.</p>\n<p>If a relationship is defined incorrectly, component type constraints will not allow you to create the relationship. If a component doesn't have an established parent-child relationship, a validation error is displayed and the design can't be published.</p>\n</li>\n<li>Click the Automatic Layout icon <a class=\"image\" href=\"/file/images/9/98/4.92/Management_Console/Shared_Content/icons/icon-tree.png\" title=\"/file/images/9/98/4.92/Management_Console/Shared_Content/icons/icon-tree.png\"> <img alt=\"icon-tree.png\" data-file-height=\"23\" data-file-width=\"25\" height=\"23\" src=\"../../../images/icon-tree_d7ddf7ea.png\" width=\"25\"/> </a> to organize and display your design in a graphical format.</li>\n</ol>\n<p>For more information about component palettes, types, and constraints, see Components for sequenced designs.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/mgmtconssddesigner\" title=\"SMAX:25.1/MgmtConsSDDesigner\">Sequenced designer</a></li>\n<li><a href=\"/doc/423/26.1/mgmtconssdservicecompabout\">Service design components</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}