{
  "title": "Create component types",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><ol>\n<li>In the left pane of the Service Components area, select the component palette in which you want to create a component type.</li>\n<li>Click <b>Create Component Type</b>.</li>\n<li>Provide the following information and then click <b>Create.</b></li>\n</ol>\n<table>\n<tbody>\n<tr>\n<th>Item</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Base Component Type</td>\n<td>\n<p>Select the component palette from which you want to select a base component type, and then select a base component type from which the new component type will inherit properties and constraints. Component types aren't required to have a <b>Base Component Type</b>. The lists display only component palettes and component types that are compatible with (that is, they don't create circular dependencies with) the palette in which you are creating the component type.</p>\n<p>This field can't be modified after a base component type has been selected.</p>\n</td>\n</tr>\n<tr>\n<td>Name</td>\n<td>A name for the component type. The component type name must be unique within a component palette. No white space is permitted; all letters are changed to upper case for this value. This field can't be modified after a component type has been created.</td>\n</tr>\n<tr>\n<td>Display Name</td>\n<td>The name that displays for the component type.</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>The description you provide for the component type.</td>\n</tr>\n<tr>\n<td>CI Type</td>\n<td>\n<p>The Name of the CI Type to which the created Component Type will be mapped. For example, if the Component created is Server, it will be mapped to CI Type Computer.<br/>\n\t\t\tThis field is visible only if a CI Type Component is selected as the Base Component Type. Else, this field will be hidden and invisible to the designer.</p>\n</td>\n</tr>\n<tr>\n<td>Image</td>\n<td>An image that displays for the component type. Click <b>Change Image</b>. Choose the image you want, and click <b>Select</b>. Click <b>Upload</b> to add your own image. Supported file extensions include .<code>jpg</code>, .<code>jpeg</code>, .<code>gif</code>, and .<code>png</code>. The recommended image size is 256 by 256 pixels, and the image will be scaled to the appropriate size.</td>\n</tr>\n<tr>\n<td>Default Settings</td>\n<td>\n<p>Select the following items as needed. These items specify the initial default values for service components:</p>\n<ul>\n<li>\n<p><b>Consumer Visible</b> - Select this box to specify that, by default, the service component is visible in the Service Portal. Deselect it to specify that the service component will not be visible.<br/>\n\t\t\t\tProperties that have been configured as consumer visible will only display in the Service Portal if the associated service component itself is configured to be visible. The visibility of a service component doesn't affect visibility of its child service components, and it's not necessary for a parent of a service component to be visible for the child component to be visible in the Service Portal.</p>\n<p>The <b>Consumer Visible</b> check box will not be selected by default.</p>\n</li>\n<li><b>Designer Visible</b> - Select this box to specify that, by default, this component is visible in the Designer page while creating Sequenced Service Designs. Deselect to specify that the Component will not be visible in Designer page.</li>\n<li>\n<p><b>Pattern</b> - Select this box to mark the service component as a pattern by default. This indicates that the service component will not be automatically processed by the lifecycle engine. When you create a pattern service component, you must also create a Clone Pattern action in the parent service component. If the Clone Pattern action isn't created in the parent service component, a validation error is displayed in the designer. For example, the out-of-the-box component type, Server, is typically marked as a pattern, and its parent service component, Server Group, includes the Clone Pattern action. At subscription time, the Clone Pattern action creates one or more service component instances from this service component pattern.</p>\n<ul>\n<li>\n<p>You can identify a service component that is marked as a pattern because its icon appears with a grid-like background, as shown below.</p>\n<p><a class=\"image\" href=\"/file/images/7/75/4.92/Management_Console/Sequenced_Designs/images/pattern3.png\" title=\"/file/images/7/75/4.92/Management_Console/Sequenced_Designs/images/pattern3.png\"> <img alt=\"pattern3.png\" data-file-height=\"88\" data-file-width=\"81\" height=\"88\" src=\"../../../images/pattern3_c959613a.png\" width=\"81\"/> </a></p>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}