{
  "title": "Action selection wizard for resource offering",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p>Use the Action Selection wizard to create or edit a user operation. </p><h2>Tasks</h2><ul><li><p><b>Select an action</b> — Search for flows or actions by name or select the process engine from which flow or action is selected.</p><div class=\"Admonition_Tip\"><span class=\"autonumber\">Best practice for creating the OO Flows that will be used in Cloud Management lifecycle actions</span><br/>\n\tIt's recommended that the OO flows are created in the below packages so that they automatically appear in the default CSA lifecycle action field.\n\t<ul><li>/Library/io/cloudslang/amazon</li><li>/Library/io/cloudslang/microfocus</li><li>/Library/Integrations</li><li>/Library/CSA Content Pack</li></ul></div><p>If you have OO flows that aren't created within the above folders, you can update the property <code>application.oo_content_root.lifecycle_action</code> by appending the OO folder path that needs to be listed in the lifecycle action wizard. To append the OO folder path, perform the following steps using the DND application property APIs:</p><ol><li><p><a href=\"/doc/423/26.1/dndapplicationpropertiesapi#Generate_authorization_token\">Generate the authorization token</a>.</p></li><li><p>Get a list of all application properties using the API: <a href=\"/doc/423/26.1/dndapplicationpropertiesapi#Get_all_application_properties\">GetAllApplicationProperties</a></p></li><li><p>Get details of the property <code>application.oo_content_root.lifecycle_action</code> using the API: <a href=\"/doc/423/26.1/dndapplicationpropertiesapi#Get_a_single_application_property_by_id\">GetApplicationProperty</a>.</p></li><li><p>Append the value of the property with custom folder paths.</p></li><li><p>Update the <code>application.oo_content_root.lifecycle_action property</code> using the API <a href=\"/doc/423/26.1/dndapplicationpropertiesapi#Update_a_single_application_property_by_id\">UpdateApplicationProperty</a>.<br/><br/>\n\t\tSimilarly, you can modify the property <code>application.oo_content_root.resource_pool_sync</code> for custom OO flows, for resource pool synchronization.</p></li></ol></li></ul><ul><li><p><b>Configure Action</b> — Configure information about the action.</p><table><tbody><tr><th>Item</th><th>Description</th></tr><tr><td>Process Engine</td><td>Read-only. The container of the flow or internal action.</td></tr><tr><td>Locator</td><td>Read-only. The location of the flow or internal action.</td></tr><tr><td>Display Name</td><td>The name you provide for the action.</td></tr><tr><td>Description</td><td>The description you provide for the action.</td></tr><tr><td>Execution Properties</td><td><ul><li><strong>Fail on Error </strong>— The Fail on Error setting is ignored for user operations.  During provisioning, modification, or cancellation, the Fail on Error setting, combined with the failure handling configuration of the service design that references an action, determines if the lifecycle execution should continue, pause, or fail when an action fails.  The setting is not applicable to user operations because user operations are run independently by a user and not as part of the automated provisioning, modification, or de-provisioning lifecycles.</li><br/><li><strong>Error on Timeout </strong>— If selected, the user operation will be considered to have failed if the time to perform the action exceeds the Timeout value (see below).</li></ul></td></tr><tr><td>Timeout (seconds)</td><td>The amount of time to wait for the action to complete. Set this field to zero (0) if you don't want the action to time out.</td></tr></tbody></table></li><li><p><b>Configure parameters</b> — Configure the input parameters whose values are passed to the flow or internal action prior to invoking the action.</p><ul><li><p><strong>Auto-configure</strong> - Click <b>Auto-Configure</b> to automatically map any parameter that's not mapped to a corresponding property. If a matching property doesn't exist, it's created.</p></li><li><p><strong>Edit Mapping</strong> - Click the gear icon next to the parameter you want to configure and select <b>Edit Mapping</b>. From the Edit Parameter Mapping dialog, edit the name, display name, description, and mapping type of the parameter.</p><p>Select one of the following mapping types:</p><ul><li><b>Constant Value</b> — Type a value for the parameter.</li><li><b>Not Mapped</b> — The parameter isn't mapped to a value.</li><li><b>Prompt User</b> — Allows the user to enter a value for the parameter when running the user operation. A default value for the parameter is required. When either Prompt User is selected, you can optionally select an <b>Input Validation</b> script. This script will be run to validate the user-supplied value for this user operation parameter in the Service Portal.\n\t\t\t<p>You can manage the available set of <b>Input Validation</b> scripts, and configure parameters to the selected script, using the <b>Manage Scripts</b> and <b>Configure Parameters</b> links.</p><ul><li><b>Manage Scripts</b>: To add, download, edit, or delete scripts, click <b>Manage Scripts</b>. For more information on Manage Scripts, see the topic on Manage scripts.</li><li><b>Configure Parameters</b>: To configure the parameters that should be supplied when running the selected script, click <b>Configure Parameters</b>. For more information on Configure Parameters, see Configure parameters for input validation.</li></ul></li><li><p><b>Prompt User List</b> — Allows the user to select a value for a parameter by selecting from a list of items when running the user operation. When the Prompt User List is selected, you can configure a Static Entry list or click <b>Switch to Dynamic Entry</b> to select a script. When a script is selected, it will determine the values that should be presented to a user for this user operation parameter in the Service Portal. You can manage the available set of <b>Dynamic Entry</b> scripts, and configure parameters to the selected script, using the <b>Manage Scripts</b> and <b>Configure Parameters</b> links.</p><ul><li><b>Manage Scripts</b>: To add, download, edit, or delete scripts, click <b>Manage Scripts</b>. For more information on Manage Scripts, see Manage scripts.</li><li><b>Configure Parameters</b>: To configure the parameters that should be supplied when running the selected script, click <b>Configure Parameters</b>. For more information on Configure Parameters, see Configure parameters for the dynamic entry list</li></ul></li><li><b>Property</b> — Select a property.</li><li><b>Provider Property</b> — Select a provider property from the list. All properties defined by providers that are applicable for this resource offering are listed.</li><li><b>Token</b> — Select a token, which is a system value that's automatically resolved internally when the parameter is read. Tokens aren't available for Boolean or Integer parameters. See Tokens for a description of the tokens.</li></ul></li><li><p><strong>Delete Mapping</strong> - Click the gear icon next to a parameter and select <b>Delete Mapping</b> to delete a property mapping.</p></li><li><p><b>Auto-Select Property for Mapping - </b>Click the gear icon next to a parameter and select <b>Auto-Select Property for Mapping</b> to automatically create a property mapping. If no matching property is found, it's created.</p></li></ul></li></ul><div class=\"Admonition_Caution\"><p><span class=\"autonumber\">Caution</span><br/>\nIf you find changes in the action signature from the last time it was edited then review the Input Parameters and Output Parameters sections to see the <b>New</b>, <b>Modified</b> and <b>Deleted</b> parameters in the action.</p></div><p>The changes in the parameters can be seen as follows:</p><ul><li><b>New</b> — This parameter is newly added to the action signature.</li></ul><ul><li><b>Modified</b> — This parameter remains in the action signature but has been modified in some way. For example, its <b>required</b> or <b>confidential</b> setting may have changed. </li></ul><ul><li><b>Deleted</b> —This parameter has been deleted from the action signature. Pay particular attention to a deleted parameter that has property mappings configured. This mapping will be removed when the action is saved and should be carefully analyzed prior to saving the action. In some cases, a mapping will need to be created on another parameter as a result of a parameter deletion.  </li></ul><span class=\"snippet-start\" data-sname=\"423-25.4-423-25.3-MgmtConsSDLCActionWiz|OOrootConfiguration|N\"></span><p>defalut snipet content</p><span class=\"snippet-end\" data-sname=\"423-25.4-423-25.3-MgmtConsSDLCActionWiz|OOrootConfiguration|N\"></span><h2>Relates topics</h2><ul><li>For more information on Manage Scripts, see <a href=\"/doc/423/26.1/managescripts\">Manage scripts</a>.</li><li>For more information on Configure Parameters for input validation, see <a href=\"/doc/423/26.1/configureinputvalidation\">Configure parameters for input validation</a>.</li><li>For more information on Configure Parameters for the dynamic entry list, see <a href=\"/doc/423/2021.02/configuredynamicentrylist\">Configure parameters for the dynamic entry list</a>.</li><li>For information on getting the values of the properties using APIs, see <a href=\"/doc/423/26.1/dndapplicationpropertiesapi\">DND APIs to get or update application properties</a></li></ul></div><p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}