{
  "title": "Create configuration option properties",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The <b>Configuration options</b> tab is read-only if the service design is published.</p>\n<p>You can create properties on configuration options within an option set. The option property can then be copied to the other options in the option set using the <b>Copy Property to All Options</b> icon.</p>\n<p>You can't copy a property to all options in an option set when the <b>Enable Multi-Select</b> setting for that option set is selected.</p>\n<h2 id=\"Create_a_configuration_option_property\">Create a configuration option property</h2>\n<p>To create a configuration option property:</p>\n<ol>\n<li>Select the service design version whose configuration option properties you want to configure.</li>\n<li>Click the <b>Configuration options</b> tab.</li>\n<li>Select the option set containing the option to which you want to add an option property.</li>\n<li>Click <b>Navigate to Option Set</b>.</li>\n<li>Select the option to which you want to add an option property.</li>\n<li>In the right pane, click <b>Add Property</b>.</li>\n<li>In the Add Property dialog, select the property type and details as described in the following table.</li>\n<li>Click <b>Done</b>.</li>\n<li>Click <b>Save</b>.</li>\n</ol>\n<table>\n<tbody>\n<tr>\n<th>Item</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Property Type</td>\n<td>\n<p>Select one of the following:</p>\n<ul>\n<li><b>Boolean</b> — A property whose value is <b>True</b> or <b>False</b>.</li>\n<li><b>Integer</b> — A property whose value is a positive or negative whole number or zero.</li>\n<li><b>List</b> — A property whose value is a list of string values.</li>\n<li><b>String</b> — A property whose value is a sequence of characters.</li>\n</ul>\n<p>Configure the following items for each property type:</p>\n<ul>\n<li><b>Name</b> — A unique name for the property. The name should not contain an ampersand(&amp;) as this character is not supported.</li>\n<li><b>Display Name</b> — The display name for the property.</li>\n<li><b>Description</b> — A description of the property.</li>\n<li><b>Editable</b> — If selected, indicates the property is editable in a service offering created from the design and can be configured in the offering to be editable in the Service Portal.</li>\n<li><b>Required</b> — If the property is <b>Editable</b>, you can select <b>Required</b> to require the service offering or subscriber to provide a value for the property. Boolean properties that are <b>Editable</b> are implicitly <b>Required</b>.</li>\n<li>\n<p><b>Input Validation</b> - If the property is <b>Editable</b>, you can configure an Input Validation script to run and validate user input. This provides an additional level of control to ensure that user supplied values will work properly during provisioning.</p>\n<p>When a script is selected to be used for Input Validation, the script will be run to validate the user supplied value for this option property in the Service Portal.</p>\n<p>You can manage the available set of scripts, and configure parameters to the selected script, using the <b>Manage Scripts</b> and <b>Configure Parameters</b> links:</p>\n<ul>\n<li><b>Manage Scripts</b>: To add, download, edit, or delete scripts, click <b>Manage Scripts</b>. For more information on Manage Scripts, see Manage scripts.</li>\n<li><b>Configure Parameters</b>: To configure the parameters that should be supplied when running the selected script, click <b>Configure Parameters</b>. For more information on Configure Parameters, see Configure parameters for input validation.</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Property Details</td>\n<td>\n<p><b><u>For Boolean properties</u>:</b></p>\n<ul>\n<li>\n<p><b>Service Offering and Service Portal Settings</b>:</p>\n<ul>\n<li><b>Editable</b> - Indicates that this property can be made editable in the Offerings area and in the Service Portal</li>\n</ul>\n</li>\n<li>\n<p><b>Default Value</b> - Select <b>true</b> or <b>false</b></p>\n<p>Note<br/>\n\t\t\t\tBoolean properties are always required, which means that when a subscription is ordered, a value must be provided for this field. This option can't be changed for Boolean properties.</p>\n</li>\n</ul>\n<p><u><b>For Integer properties</b></u>:</p>\n<p><b>Service Offering and Service Portal Settings</b></p>\n<ul>\n<li><b>Editable</b> - Select to make this field editable in the Offerings area and in the Service Portal</li>\n<li><b>Required</b> - Integer properties are always required, which means that when a subscription is ordered, a value must be provided for this field.</li>\n<li><b>Value Range</b> - If <b>Editable</b> is checked, configure a minimum and maximum allowed value for the property.</li>\n<li><b>Default Value</b> - Select or type a positive or negative whole number or zero. If you enter a decimal number, the value will be truncated to the nearest integer. The maximum allowed integer value is 2147483647 and the minimum is -2147483648; if you enter a value outside these bounds the value will be automatically converted to the closest maximum or minimum value.</li>\n</ul>\n<p><b><u>For List properties</u>:</b></p>\n<p><b>Service Offering and Service Portal Settings</b>:</p>\n<ul>\n<li><b>Editable</b> - Indicates that this property can be made editable in the Offerings area and in the Service Portal. Dynamic entry properties are always editable; this field can't be changed for dynamic entry properties.</li>\n<li><b>Required</b> - Select to indicate that when a subscription is ordered, a value must be provided for this field.</li>\n</ul>\n<p><b>List Selection Type:</b></p>\n<ul>\n<li><b>Single-Select</b> - Select to present options as radio boxes in the Service Portal.</li>\n<li><b>Multi-Select</b> - Select to present options as check boxes in the Service Portal.</li>\n</ul>\n<p><b>List Items</b>:</p>\n<ul>\n<li><b>Switch to Static Entry</b> (default) - Enter the name and value for an entry in the list. After the value entry, a new item line is displayed automatically.</li>\n<li><b>Switch to Dynamic Entry</b> - Select a script that will determine the values that should be presented to a user in the Service Portal.</li>\n</ul>\n<p><br/>\n\t\t\tYou can set the default value using a JS script file. The default value selection can be achieved by setting the property attribute <code>&lt;selected&gt;</code> to <b>True</b> for one or more values.</p>\n<p><br/>\n\t\t\tExample:</p>\n<pre>&lt;Property&gt;\n&lt;availableValues&gt;\n&lt;value&gt;[TOKEN:PRN_COMPONENT_ID]&lt;/value&gt;\n&lt;displayName&gt;Result 1&lt;/displayName&gt;        \n&lt;description&gt;The first artificial result&lt;/description&gt;\n&lt;orderIndex&gt;0&lt;/orderIndex&gt;        \n&lt;initialPrice&gt;12&lt;/initialPrice&gt;\n&lt;recurringPrice&gt;2&lt;/recurringPrice&gt;        \n<b>&lt;selected&gt;true&lt;/selected&gt;</b>\n&lt;/availableValues&gt;\n&lt;/Property&gt;\n</pre>\n<p>At the Service portal while subscribing for an offering single or multiple default options will selected.<br/>\n\t\t\t </p>\n<p>You can manage the available set of scripts, and configure parameters to the selected script, using the <b>Manage Scripts</b> and <b>Configure Parameters</b> links:</p>\n<ul>\n<li><b>Manage Scripts</b> - To add, download, edit, or delete scripts, click <b>Manage Scripts</b>. For more information, see Manage scripts.</li>\n<li><b>Configure Parameters</b> - To configure the parameters that should be supplied when running the selected script, click <b>Configure Parameters</b>. For more information on Configure Parameters, see Configure parameters for dynamic entry list.</li>\n</ul>\n<p><b><u>For String properties</u>:</b></p>\n<p><b>Service Offering and Service Portal Settings</b>:</p>\n<ul>\n<li><b>Editable</b> - Select to make this field editable in the Offerings area and in the Service Portal.</li>\n<li><b>Required</b> - Select to indicate that when a subscription is ordered, a value must be provided for this field.</li>\n</ul>\n<p><b>Input Type</b>:</p>\n<p><b>Single-Line</b> - The input area is presented as and accepts only one line of text.</p>\n<ul>\n<li><b>Multi-Line</b> - The input area is presented as a text box and can accept one or more lines of content.</li>\n</ul>\n<p><b>Number of Characters</b> - Configure the minimum and maximum number of characters that can be entered for this property. These fields are available only when the <b>Editable</b> and <b>Single-Line</b> options are selected.</p>\n<p><b>Input Restriction</b> - Choose an Input Restriction from the following list. These fields are available only when the <b>Editable</b> and <b>Single-Line</b> options are selected.</p>\n<ul>\n<li><b>(none)</b> - No input restriction will be performed. A minimum and maximum length can still be configured.</li>\n<li><b>Custom Regular Expression</b> - Validates the value based on a regular expression, as specified in the <b>Regular Expression</b> text box.</li>\n<li><b>Email Address</b> - Checks that a valid email format is entered.</li>\n<li><b>IPV4 Address</b> - Checks that a valid IPV4 address is entered.</li>\n<li><b>IPV6 Address</b> - Checks that a valid IPV6 address is entered.</li>\n<li><b>Non-Numeric Characters</b> - Checks that no numeric characters are entered.</li>\n<li><b>URL Address</b> - Checks that a valid URL format is entered. The regular expression used for validating the URL values may allow creating some invalid URL values such as <code>http</code>, <code>http:/</code>, <code>http://</code> or <code>hhh:////</code>. This is because the regular expression validates a wide range of official IANA-registered schemes, which may not detect some invalid URL values.</li>\n</ul>\n<ul>\n<li><b>Default Value</b> - Type a string of characters.</li>\n<li><b>Confidential</b> - Select this box to mask the values so that they can't be read in the user interface; no encryption of the value is performed. Note that this field is available only when the <b>Single-Line</b> option is selected.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<p>For descriptions of the additional icons available on the <b>Configuration options</b> tab, see Sequenced design configuration options.</p>\n<h2 id=\"Related_topics\">Related topics</h2>\n<ul>\n<li>For information on how to add and manage scripts, see <a href=\"/doc/423/26.1/managescripts\">Manage scripts</a>.</li>\n<li>For information on how to configure the parameters that should be supplied when running the selected script, see <a href=\"/doc/423/26.1/configuredynamicentrylist\">Configure dynamic list</a>.</li>\n<li>For information on option property mapping, see <a href=\"/doc/423/26.1/selectpropertytomaptoscriptparameter\">Select Property to Map to Script Parameter</a>.</li>\n<li>For information on how to use OPB endpoints of DND for use in dynamic option properties, see <a href=\"/doc/423/26.1/opbendpointsusecase\">Use case: OPB endpoints of Design and Deploy</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}