{
  "title": "Import and export a resource offering",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>In this topic, an artifact refers to a resource offering.</p>\n<p>You can import and export many of the artifacts that provide the basis for cloud automation. The export operation provides the ability to preserve the selected artifacts so they can be used to replicate the services on another system or to restore the artifacts. These exported archive files are preserved in an industry-standard zip archive file format.</p>\n<p>Installing or replacing artifacts on the target system is supported by import and update operations. The import operation only adds artifacts, whereas the update operation replaces matching artifacts. See the <i>Tasks</i> section below for more information.</p>\n<p>Note that an import does not automatically associate the resource offering to existing resource providers on the system. After the import, you should manually associate the imported resource offering with the appropriate resource provider. For more information, refer to <em>Select or remove providers for a resource offering</em>.</p>\n<h2 class=\"mw-headline\" id=\"Process_information\">Process information</h2>\n<ul>\n<li>\n<p><b>Resource categories and provider types</b> - Resource categories (such as Compute) and provider types (such as VMware vCenter) are resolved first by <b>name</b> and second by <b>display name</b> during import of a resource offering.</p>\n<p>Out-of-the box resource categories and provider types have identical <b>name</b> values on all installations of <span class=\"_FTc_Basic_Variables_FT_Product_Acronym\">the product</span>, and automatically resolve correctly during import. User-created resource categories and provider types don't have a <b>name</b> match on different installations and instead are resolved by <b>display name</b>.</p>\n<p>For example, if a user created resource category with a display name of Auditing is used for a resource offering, when that resource offering is imported on another installation, an attempt will be made to match a resource category with a <b>display name</b> of Auditing. This match is successful only if the user has already created this corresponding resource category on the system in which the import occurs.</p>\n<p>If a resource category or provider type can't be resolved by either <b>name</b> or <b>display name</b>, a new resource category or provider type is automatically created during import of the resource offering. There is no need to add user-created resource categories and provider types ahead of time on the import system; however, if you have done so, ensure the <b>display name</b> values used match those on the export system.</p>\n</li>\n<li><b>Update operation</b> — The update operation is destructive to existing data. You should understand the differences between the import operation, update operation, and update options to ensure you choose the operations and options that match your expectations. See the <i>Tasks</i> section below for more information.</li>\n<li>\n<p><b>Flows</b> — During an import, update, or preview operation, if required dependencies don't exist on the <span class=\"ProductNamesOO\">Operations Orchestration</span> system, an error message identifies these missing dependencies (dependencies such as flows). The content pack that contain these flows must have been deployed to the <span class=\"ProductNamesOO\">Operations Orchestration</span> system prior to importing these artifacts. The flows must also have identical signatures and identical paths as the flows on the system from which the artifact was exported.</p>\n<p>During import, flow signature-related information is verified in or added to the database (flow signatures are used during the creation of an artifact and when adding a resource synchronization action or an external approval type). This information is resolved by <b>name</b> which corresponds to the full path to the <span class=\"ProductNamesOO\">Operations Orchestration</span> flow. For information about how to deploy <span class=\"ProductNamesOO\">Operations Orchestration</span> content packs, see the document on <i>Central User</i>.</p>\n</li>\n<li><b>Archive content</b> — The archive (<code>.zip)</code> file can only reference files or content contained within the <code>.zip</code> file itself, or that are already contained in the <code>csa.war</code> file.</li>\n<li>\n<p><b>Image files</b> — All images in the archive files must end in one of the following suffix values (for information on adding additional suffix values, see the Configuration section):</p>\n<p><code>jpg|jpeg|jpe|jfif|svg|tif|tiff|ras|cmx|ico|pnm|pbm|pgm|ppm|rgb|xbm|xpm|xwd|png</code></p>\n</li>\n<li><b>Back up your data</b> — Create a backup of your system or data. Before proceeding, be sure to create a backup of any artifacts you may be affecting by using the export operation to save an archive zip file.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Tasks\">Tasks</h2>\n<ul>\n<li>\n<p><b>Import</b> option — Adds only new artifacts to the target system (the archived artifacts do no exist on the target system).</p>\n<p>The import operation identifies resource offerings by functional equivalence to determine if an identical resource offering exists on the target system. An archived resource offering is considered to be functionally equivalent to the resource offering on the target system if the archived resource offering has the same resource category, provider type, properties, and actions as a resource offering on the target system. If the import operation identifies a functionally equivalent resource offering on the target system, the archived resource offering isn't imported. See the topic <b>Identify matching artifacts</b> for more information.</p>\n</li>\n<li>\n<p><b>Update</b> option — Imports new artifacts and overwrites existing artifacts. New artifacts are created if they don't exist on the target system. Identical artifacts that exist on the target system are overwritten with changes from the archive.</p>\n<p>There may be cases where an existing artifact on the target system can't be updated. For example, if the existing artifact is a service offering or design and the service offering or design is published, the service offering or design will not be updated because a published service offering or design can't be edited.</p>\n<p>An existing service offering or design can be updated from a published offering or service design archive if the existing service offering or design isn't published.</p>\n<p>The update operation identifies resource offerings by name instead of functional equivalence to determine if the resource offering exists on the target system.</p>\n<p><b>Preserve originals</b> — Select this option to create a copy of the original artifact if the artifact exists on the target system. On import, a copy of the original artifact is created and then the original artifact is overwritten by the imported artifact. The version of the copy is appended with \"Superseded on\" and the date. The version of the artifacts being imported remain intact. If the artifact doesn't exist on the target system, a copy isn't created.</p>\n</li>\n<li><b>Preview</b> — Generate a report of prospective results for the import process, including information about the artifacts and their status.</li>\n<li><b>View Detailed Report</b> - From the Import Summary dialog, select this link to see a summary and details of the import process, including information about the artifacts and their status.</li>\n<li>\n<p><b>Export</b> — Create a content archive (.zip) file. The content archive contains XML documents for the artifacts you are exporting, as well as icons for customizing the artifacts, and the Manifest XML document, which contains meta-information about the archive files.</p>\n<p>The resource offerings are packaged in an archive file whose name is: </p>\n<p><code>RESOURCE_OFFERING_&lt;resource_offering_display_name&gt;_&lt;resource_offering_id&gt;.zip</code></p>\n</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Identify_matching_artifacts\">Identify matching artifacts</h2>\n<p>When you import a resource offering, the product determines if a functionally equivalent resource offering already exists on the system. If a functionally equivalent resource offering exists, then the import may be skipped depending on the options selected. Functional equivalence is determined by comparing the imported resource offering with other resource offerings that exist on the system, as follows:</p>\n<ul>\n<li>At a high level, two resource offerings are functionally equivalent if they share the same Provider Type and Resource Category, the same set of user defined custom properties, and the same set of lifecycle actions.</li>\n<li>Properties are considered equivalent if they share the same Type, Name, and Value (or Values for List properties).</li>\n<li>Lifecycle actions are considered equivalent if they share the same internal action or flow, lifecycle stage and phase, execution order, and action input properties and values.</li>\n<li>There are some additional attributes on properties and lifecycle actions that must be identical for equivalence.</li>\n</ul>\n<p>For more specifics on the precise requirements for resource offering equivalence as it relates to entries in the .zip file produced during resource offering export, see the following table:</p>\n<table>\n<tbody>\n<tr>\n<th>Element</th>\n<th>Necessary for Equivalence</th>\n</tr>\n<tr>\n<td>property</td>\n<td>\n<ul>\n<li>name</li>\n<li>valueType</li>\n<li>values</li>\n<li>confidential – only for String property types</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>action</td>\n<td>\n<ul>\n<li>processDefinition name</li>\n<li>lifecycleState name</li>\n<li>lifecycleSubstate name</li>\n<li>lifecycleExecOrder</li>\n<li>errorOnTimeout</li>\n<li>failOnError</li>\n<li>timeout</li>\n<li>all properties must be identical, including the consumerVisible and consumerReadOnly elements for each property</li>\n<li>consumerVisible</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>resourceCategory</td>\n<td>\n<ul>\n<li>isCriticalSystemObject determines if this is an out -of-box resourceCategory. If true, name determines equivalence, otherwise displayName determines equivalence.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>providerType</td>\n<td>\n<ul>\n<li>isCriticalSystemObject determines if this is an out -of-box providerType. If true, name determines equivalence, otherwise displayName determines equivalence.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<h2>Related topics</h2>\n<ul>\n<li>For information on how to select or remove providers, see <a href=\"/doc/423/26.1/mgmtconsroassocdissocproviders\">Select or remove providers for a resource offering</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}