{
  "title": "User operations for service design",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>User operations are actions configured on resource offerings, component templates, or service components in a design that can be invoked by subscribers in the Service Portal after a subscription has been provisioned. For example, a Restart Server user operation can be configured on a server service component or on an associated resource offering, allowing a subscriber to restart a particular provisioned server after the subscription has been provisioned. User operations can also be invoked on a service instance in the Operations area.</p>\n<h2 class=\"mw-headline\" id=\"Tasks\">Tasks</h2>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span><br/>\nIf a service design is published, its user operations are read-only.</p>\n</div>\n<ul>\n<li><b>Navigate to</b> (the <b>User Operations</b> tab) — In the left pane of the <b>All Design</b> area, select the tag associated with the design you want to view. Select the service design and, in the <b>Designer</b> canvas, select the service component on which you want to complete the task. In the right pane, click the <span class=\"UIElementsgear icon\">gear icon</span>, select <b>Edit Component</b>, and select the <b>User Operations</b> tab. From here, you can:</li>\n<li>View a list of user operations for this service component.</li>\n</ul>\n<ul>\n<li><b>Add Action</b> — Click <b>Add</b>, and enter the information as described in Action selection wizard.</li>\n<li><b>Edit Action</b> — Click the <span class=\"UIElementsgear icon\">gear icon</span> on the action you want to edit and select <b>Edit</b>. Update the information as described in Action selection wizard.</li>\n<li><b>View User Operation</b> — Click the <b>User Operations</b> tab to view all user operations associated with a resource offering.</li>\n<li><b>Delete User Operation</b> — Click the gear icon next to the user operation you want to remove, and select <b>Delete</b>.</li>\n</ul>\n<h2>Approvals for user operations in cloud offerings</h2>\n<p>When you build a task/approval plan as a <strong>Catalog Administrator</strong> user, you can design the approval workflow for the user operations. See <a href=\"/doc/423/26.1/editofferings#Approvals_for%C2%A0user_operations_in_cloud_offerings\">Approvals for user operations in cloud offerings</a>.</p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}