{
  "title": "Lifecycle action selection wizard for resource offering",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p>Use the action selection wizard to create or edit action for the selected lifecycle phase. </p><p>Required parameters are indicated with an asterisk. If you don't define a value, then you will see a warning message that explains possible issues but you can still apply the change.</p><h2>Tasks</h2><ul><li><p><b>Select an action</b> — Search for flows or actions by name. </p><div class=\"Admonition_Tip\"><span class=\"autonumber\">Best practice for creating the OO Flows that will be used in Cloud Management lifecycle actions</span><br/>\n\tIt's recommended that the OO flows are created in the below packages so that they automatically appear in the default CSA lifecycle action field.\n\t<ul><li><code>/Library/io/cloudslang/amazon</code></li><li><code>/Library/io/cloudslang/microfocus</code></li><li><code>/Library/Integrations</code></li><li><code>/Library/CSA Content Pack</code></li></ul></div><p>If you have OO flows that aren't created within the above folders, you can configure the property DND_PROP_CSA_OO_CONTENT_ROOT_LIFECYCLE_ACTION to list the OO flow in the lifecycle action wizard. For more information on how to configure the OO properties, see the section <a href=\"/doc/423/26.1/mgmtconssdlcactionwiz#Operations_Orchestration_root_content_configuration\">Operation Orchestration root content configuration</a> below.</p></li></ul><ul><li><p><b>Configure an action</b> — You can configure the following properties for an action:</p><table><tbody><tr><th>Item</th><th>Description</th></tr><tr><td>Process Engine</td><td>Read-only. The container of the flow or internal action.</td></tr><tr><td>Locator</td><td>Read-only. The location of the flow or internal action.</td></tr><tr><td>Display Name</td><td>The name you provide for the action.</td></tr><tr><td>Description</td><td>The description you provide for the action.</td></tr><tr><td>Execution Properties</td><td><ul><li><strong>Fail on Error: </strong>If selected, lifecycle execution will either fail or pause if the action fails, depending on whether the service design that references the action is configured to Fail on Errors or Pause on Errors.  If unselected, lifecycle execution will continue if the action fails, regardless of the failure handling configuration of the service design.  By default, Fail on Error isn't selected for actions created in the de-provisioning stages.</li><br/><li><strong>Error on Timeout</strong> - If selected, provisioning or de-provisioning will stop if the time to perform the action exceeds the timeout value configured.</li><br/><li><strong>Pause on Successful Completion: </strong>When checked, the lifecycle execution of the instance will pause after the action completes successfully. The lifecycle execution can later be resumed by an operator or by invoking an API. </li></ul></td></tr><tr><td><p>Timeout</p><p>(Seconds)</p></td><td>The amount of time to wait for the action to complete. Set this field to zero (0) if you don't want the action to time out. Note that this creates the potential of an action not finishing, which may cause the underlying subscription to remain in the Pending state.</td></tr></tbody></table></li><li><b>Configure parameters</b> — Configure the input parameters whose values are passed to the flow or internal action prior to invoking the action.\n\t<ul><li><p><strong>Auto-configure</strong> - Click <b>Auto-Configure</b> to automatically map any parameter that's not mapped to a corresponding property. If a matching property doesn't exist, it's created.</p></li><li><p><strong>Edit Mapping</strong> - Click the gear icon next to the parameter you want to configure and select <b>Edit Mapping</b>. From the Edit Parameter Mapping dialog, edit the name, display name, description, and mapping type of the parameter.</p><p>Select one of the following mapping types:</p><ul><li><b>Constant Value</b> — Type a value for the parameter.</li><li><b>Not Mapped</b> — The parameter isn't mapped to a value.</li><li><b>Property</b> — Select a property.</li><li><b>Token</b> — Select a token, which is a system value that is automatically resolved internally when the parameter is read. Tokens are not available for Boolean or Integer parameters. See Tokens for a description of the tokens.</li><li><b>Provider Property</b> — Select a provider property from the list. All properties defined by providers that are applicable for this resource offering are listed.</li></ul></li><li><p><strong>Delete Mapping</strong> - Click the gear icon next to a parameter and select <b>Delete Mapping</b> to delete a property mapping.</p></li><li><p><b>Auto-Select Property for Mapping - </b>Click the gear icon next to a parameter and select <b>Auto-Select Property for Mapping</b> to automatically create a property mapping. If no matching property is found, it's created.</p></li></ul></li></ul><div class=\"Admonition_Caution\"><p><span class=\"autonumber\">Caution</span><br/>\nIf you find changes in the action signature from the last time it was edited then review the Input Parameters and Output Parameters sections to see the <b>New</b>, <b>Modified</b> and <b>Deleted</b> parameters in the action.</p></div><p>The changes in the parameters can be seen as follows :</p><ul><li><b>New</b> — This parameter is newly added to the action signature.</li></ul><ul><li><b>Modified</b> — This parameter remains in the action signature but has been modified in some way. For example, its <b>required</b> or <b>confidential</b> setting may have changed.</li></ul><ul><li><b>Deleted</b> —This parameter has been deleted from the action signature. Pay particular attention to a deleted parameter that has property mappings configured. This mapping will be removed when the action is saved and should be carefully analyzed prior to saving the action. In some cases, a mapping will need to be created on another parameter as a result of a parameter deletion.</li></ul><h2 id=\"Resume_a_paused_service_instance_using_an_API\" tabindex=\"-1\">Resume a paused service instance using an API</h2><p id=\"Details\">An instance that is paused after successful completion of an action can be resumed in the Deployment Operations UI or by invoking an API.<br/>\nTo resume the paused instance by invoking an API, issue an HTTP POST call, with an empty body, to the endpoint <code>https://&lt;hostname&gt;/dnd/api/service/instance/&lt;instanceId&gt;/resume</code>.</p><p>Set the following headers in the HTTP call</p><p><strong>Accept </strong>- application/json</p><p><strong>Authorization </strong>- <code>&lt;Base64EncodedUserNameAndPassword&gt;</code></p><p>To create the <code>&lt;Base64EncodedUserNameAndPassword&gt;</code> value, use a Base64 encoder to encode <code>&lt;username&gt;:&lt;password&gt;</code> (e.g. dndAdminUser:myPassword) for a user with permissions to resume service instances (such as the tenant admin user created for DND).</p><p>To get the <code>&lt;instanceId&gt;</code>, go to <strong>Deployment Operations</strong> and select the service instance that you would like to resume. The browser URL will be in the format <code>https://&lt;hostname&gt;/dnd-operations-gateway/?TENANTID=&lt;Tenant_id&gt;#/instance/&lt;instanceId&gt;/components</code>. The <code>&lt;instanceId&gt;</code> will be the value that immediately follows <code>/instance/ </code>in the URL.</p><p><strong>Example: </strong>If the service instance URL is  <code>https://myHost.myLab.net/dnd-operations-gateway/?TENANTID=174106658#/instance/2c9082c37e828b97017eb4bca2a5003a/components</code>, the <code>&lt;instanceId&gt;</code> will be <code>2c9082c37e828b97017eb4bca2a5003a</code>.</p><p>If the instance was able to be resumed successfully, a 200 HTTP response and empty JSON body will be returned. </p><span class=\"snippet-start\" data-sname=\"423-25.4-423-25.3-MgmtConsSDLCActionWiz|OOrootConfiguration|N\"></span><p>defalut snipet content</p><span class=\"snippet-end\" data-sname=\"423-25.4-423-25.3-MgmtConsSDLCActionWiz|OOrootConfiguration|N\"></span><h2>Relates topics</h2><ul><li>For information on the actions that can be performed for paused service instances, see <a href=\"/doc/423/26.1/mgmtconssoinstancemanagement\">Instance Management</a>. </li></ul></div><p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}