{
  "title": "Create and deploy a new instance",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>You can create and deploy a new service instance from a service design. This page describes how to create, cancel, or delete a deployment.</p>\n<h2>Create a deployment</h2>\n<ol>\n<li>In the Deployments area, click <b>Deploy a New Instance</b> or go to the gear icon  <a class=\"image\" href=\"/file/images/7/74/2018.02/Management_Console/Sequenced_Designs/images/gear_icon.png\" title=\"/file/images/7/74/2018.02/Management_Console/Sequenced_Designs/images/gear_icon.png\"> <img alt=\"\" border=\"0\" file=\"\" height=\"22\" hspace=\"0\" src=\"../../../images/gear_icon_3d7a236d.png\" vspace=\"0\" width=\"28\"/> </a> and click <b>Deploy</b>. The <strong>Deploy Instance</strong> dialog box appears.</li>\n<li>Enter a deployment name. The service instance created from this action will have the same name as the deployment.</li>\n<li>Enter a description of the deployment.</li>\n</ol>\n<p>You can choose how to deploy a test instance by selecting <strong>Configuration Options</strong> or <strong>Component Properties</strong> under <strong>Deploy instance by configuring</strong>. You will see that the default is <strong>Configuration Options</strong>.</p>\n<h3>Configuration options</h3>\n<p>If you choose <strong>Configuration Options</strong>, enter the design options for the new instance.</p>\n<ul>\n<li>When you choose <strong>Configuration Options</strong>, on the next screen, you will see a list of all the option sets with the respective options. The list shows only the editable properties.</li>\n<li>There is semantic validation and input validation in place. The semantic validation happens when you select <strong>Deploy</strong>. Semantic validation occurs only after input validation is complete and successful. </li>\n<li>If there are any errors while providing inputs, an error icon will appear near that field. On hover, you will see the description of the error. You will also see the total number of errors at the bottom left of the dialog box. </li>\n<li>To see if you have rectified the semantic errors and if the error count has reduced, you need to select <strong>Deploy</strong>. </li>\n<li>You won't be able to proceed with the deployment until the validation errors are resolved.</li>\n<li>For interdependent fields, changing the value of the \"depends on\" field clears all its dependent field values. You have to select the dependent field values again.</li>\n</ul>\n<h3>Component properties</h3>\n<p>If you choose <strong>Component Properties</strong>, enter properties for the new instance.</p>\n<ol>\n<li>The design associated with the instance appears on the canvas. Select a service component from the design, and modify the properties as needed. </li>\n<li>You can change the properties of multiple components in the design. The message icon appears next to modified components in the design. Click on the icon for details about what changes you have made.</li>\n</ol>\n<p>When viewing the design canvas:</p>\n<ul>\n<li>You will see an error status message for components that contain properties that require a value but are empty.</li>\n<li>If you click <b>Deploy</b> without supplying the required value(s), an error dialog box will appear. You need to supply appropriate values before initiating deployment.</li>\n</ul>\n<p>When viewing component properties:</p>\n<ul>\n<li>You can see only properties marked as visible. </li>\n<li>Properties that require a value but are empty will show as red with a tooltip indicating they're a required field.</li>\n<li>An error box will appear if other components in the design have empty required properties.</li>\n<li>Clicking <b>Deploy</b> when errors are present (either on this component or other components) will stay on the screen and not deploy.</li>\n</ul>\n<h2>Modify a deployment</h2>\n<p>You can modify a test deployment from the <strong>DEPLOYMENTS</strong> tab. The deployment must be in <strong>Active, User Operation Failed</strong>, or <strong>Modification Failed</strong> state. You can't modify a test deployment that's in <strong>Modifying, Provisioning, Provisioning Failed, or Canceled</strong> state. You can't modify a deployment made through a Service Portal subscription from the <strong>DEPLOYMENTS</strong> tab. You can modify the subscription from the Service Portal only.</p>\n<p>To modify a test deployment:</p>\n<ol>\n<li>Go to <strong>Build </strong>&gt; <strong>Design </strong>&gt; <strong>SERVICE DESIGNER</strong>.</li>\n<li>Select a version of a service design.</li>\n<li>Select the <strong>DEPLOYMENTS</strong> tab.</li>\n<li>Go to the gear icon  <a class=\"image\" href=\"/file/images/7/74/2018.02/Management_Console/Sequenced_Designs/images/gear_icon.png\" title=\"/file/images/7/74/2018.02/Management_Console/Sequenced_Designs/images/gear_icon.png\"> <img alt=\"\" border=\"0\" file=\"\" height=\"22\" hspace=\"0\" src=\"../../../images/gear_icon_3d7a236d.png\" vspace=\"0\" width=\"28\"/> </a>  to the right of the deployment you want to modify.</li>\n<li>Select <strong>Modify Deployment</strong>. You will see a dialog box with the deployment name. In the next screen, you will see the options that you had selected when creating the test deployment.</li>\n<li>You can only modify the configuration options that are set as <strong>Modifiable during service modification</strong> at the time of deploying the instance.</li>\n<li>Select <strong>Modify</strong> after modifying the option sets.</li>\n</ol>\n<p>The modify option doesn't support modifying a test deployment that you created using component properties. If you try to modify a test deployment created using component properties, you may see empty values for some options and you are able to select <strong>Modify</strong> despite the empty values. </p>\n<h2 id=\"Cancel_a_deployment\">Cancel a deployment</h2>\n<p>To cancel a deployment, click the gear icon to the right of the deployment you want to cancel, and select <b>Cancel Deployment</b>. Click <b>Yes</b> to confirm the cancellation. A canceled deployment is in the <b>Canceled </b>state. </p>\n<p>You can’t cancel a deployment that's in progress, paused, or that's a deployment for a subscription.</p>\n<h2 id=\"Delete_a_deployment\">Delete a deployment</h2>\n<p>When you delete a deployment, it's removed from the list on the <b>Deployments</b> tab, and all its references are marked internally as being in <b>Retired</b> state. </p>\n<p>To delete a deployment, click the gear icon to the right of the deployment in <b>Canceled</b> state that you want to delete, and select <b>Delete Deployment</b>. Click <b>Yes</b> to confirm the deletion. </p>\n<p>You can't delete the deployment for a subscription. </p>\n<h2>Related topics</h2>\n<ul>\n<li>To know about service design components, see <a href=\"/doc/423/26.1/mgmtconssdservicecompabout\">Service components</a>.</li>\n<li>To edit service component properties, see <a href=\"/doc/423/26.1/mgmtconssdeditcompproperties\">Edit service component properties</a></li>\n<li>To create component template properties, see <a href=\"/doc/423/26.1/comptmpltcreateproperties\">Create component template properties</a>.</li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}