{
  "title": "Service design deployments",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The <strong>DEPLOYMENTS</strong> tab displays test deployments and subscriptions created for a service design.</p>\n<ol start=\"1\">\n<li>\n<p>Test Deployment:  You create a test deployment from the <strong>DEPLOYMENTS </strong>tab for a service design to test the service design properties and configurations as a developer. A test deployment has the tag <strong>Test Deployment</strong> associated with it. You can cancel or delete a test deployment.</p>\n</li>\n<li>\n<p>Subscription: A subscription originates with a subscription request, initiated by the subscriber (end user) in the Service Portal. You can differentiate a subscription from a test deployment by the tag <strong>subscription</strong> associated with it. You can't cancel or delete the deployment for a subscription. You can cancel or delete a subscription from the Service Portal only.</p>\n</li>\n</ol>\n<h2>To view deployments</h2>\n<ol>\n<li>Go to <strong>Build </strong>&gt; <strong>Design </strong>&gt; <strong>SERVICE DESIGNER</strong>.</li>\n<li>Select a version of a service design.</li>\n<li>\n<p>Select the <strong>DEPLOYMENTS</strong> tab to view test deployments and subscriptions created for a service design. If you are a tenant administrator, you can see all the subscriptions and test deployments. If you are a designer you can only see the subscriptions and deployments created by you. </p>\n</li>\n<li>\n<p>Use the search box to filter deployments by name or description.</p>\n</li>\n</ol>\n<p>The test deployments and subscriptions listed contain a link to launch the service instance detail page of deployment operations. You can view the tree of all the components that are part of the deployed instance. Only if you are a tenant administrator, you can navigate from the instance detail page to the main deployment operations page to view all the service instances.</p>\n<h2>Related topics</h2>\n<p>For details on how to create, delete, and cancel test deployments, see <a href=\"/doc/423/26.1/mgmtconssddeploy\">Create and deploy a new instance</a>.</p>\n<p>For information on how to request a subscription, see <a href=\"/doc/423/26.1/serviceportal#Submit_a_service_request\">Service Portal</a>.</p>\n<p>For details on the service instances, see <a href=\"/doc/423/26.1/mgmtconssoinstancemanagement#Component_Details\">Service Instance management</a>.</p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}