{
  "title": "Resource offerings for sequenced designs",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>From the main menu go to <b>Build &gt; Design &gt; Resource Offerings</b>.</p>\n<p>A resource offering links the capabilities of providers to the provisioning requirements of a service design. For example, you can create a resource offering that corresponds to a specific <span class=\"ProductNamesvCenter\">VMware vCenter</span> VM template that can be cloned to create a VM.</p>\n<p>A resource offering includes a user-specified set of lifecycle actions that are performed during the provisioning of the resource offering. A resource offering can also include actions that will be exposed to a subscriber in the Service Portal.</p>\n<p>A resource offering may include one or more user-created properties that can be used to pass or exchange information with <span class=\"ProductNamesOO\">Operations Orchestration</span> during the provisioning of the resource offering. The following tasks can be performed for a <b>Resource Offering</b>:</p>\n<ul>\n<li>Create Resource Offerings</li>\n<li>Import Resource Offerings</li>\n<li>Manage Resource Category</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Scenarios\">Scenarios</h2>\n<p>The following scenarios describe a few of the ways you can use resource offerings:</p>\n<ul>\n<li>A resource offering can be used to configure a <i>specific</i> capability offered by a provider (or a group of providers of the same provider type). For example, you can create a resource offering named <code>Red Hat 5.3 64-bit</code> that corresponds to a specific <span class=\"ProductNamesvCenter\">VMware vCenter</span> VM template named <code>rhel53x64</code>, which when provisioned results in a Red Hat 5.3 64-bit VM being created. Such a resource offering would likely contain a user-created property, such as <code>VM_TEMPLATE_NAME</code>, that specifies the precise VM template name associated with the resource offering (in this case, <code>rhel53x64</code>). In this use of resource offerings, you need to create a resource offering for every VM template you wish to use in a service design.</li>\n<li>A resource offering can be used to configure a <i>general</i> capability offered by a provider (or a group of providers). For example, you can create a resource offering named <code>vCenter VM Template</code> that can be used to provision any <span class=\"ProductNamesvCenter\">VMware vCenter</span> VM template. Such a resource offering requires that you create service component properties in the associated service designs that specify the precise VM template to be created. In this use of resource offerings, only a single resource offering is needed to expose VM template functionality to service designs.</li>\n<li>A resource offering can be used for the primary purpose of selecting a provider. Most resource offerings include lifecycle actions that are used to provision the resource offering, but some resource offerings have no such lifecycle actions and exist primarily to force provider selection. Typically, you would use this style of resource offering to select a provider at a group level in a service design (for example, for a Server Group) that's shared by all child components (for example, by all Server child components).</li>\n</ul>\n<p><br/>\nIn this approach, you create one resource offering for the Server Group (for example <code>vCenter Server Group</code>) and a separate resource offering for the Servers (for example, <code>vCenter VM Template</code>). When associating <code>vCenter Server Group</code> to a Server Group, specify the provider selection actions to run. When associating <code>vCenter VM Template</code> to a Server, specify the <b>Select Resource Provider from Parent</b> or the <b>Select Resource Provider and Pool from Parent</b> action. In such an approach, the <code>vCenter Server Group</code> probably will not have lifecycle actions that are invoked automatically during provisioning; however, this resource offering may include actions to be exposed to a subscriber (for example, an action such as <code>Restart All VMs</code>).</p>\n<p>A resource offering has a single provider type and a single category. For example, each of the resource offerings discussed above would have a provider type of <span class=\"ProductNamesvCenter\">VMware vCenter</span> and a category of Compute.</p>\n<p>A resource offering can be exported to a .zip file and imported to the same or different installation. An exported resource offering includes all of its lifecycle actions and properties.</p>\n<p>A resource offering can also be copied, which allows you to share a set of lifecycle actions and properties across a number of resource offerings.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/mgmtconsrocreate\" title=\"SMAX:25.1/MgmtConsROCreate\">Create a resource offering</a></li>\n<li><a href=\"/doc/423/26.1/mgmtconsroimportexport\" title=\"SMAX:25.1/MgmtConsROImportExport\">Import and export a resource offering</a></li>\n<li><a href=\"/doc/423/26.1/mgmtconsroresourcecategory\" title=\"SMAX:25.1/MgmtConsROResourceCategory\">Manage resource category</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}