{
  "title": "Property mapping",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><p>You can create a property mapping between the properties of two components in a design when the property of one component should obtain its value from the property of another component.</p>\n<p>Using property mapping, you can share a single property value between multiple components in a design without the need to duplicate the value of the property across those components. For example, if your design includes three components that represent servers, and you need each server to be provisioned with the same number of CPUs, you can define the number of CPUs on one component and then create a property mapping between the CPU properties of the other components and the component that stores that common value.</p>\n<p>A property mapping can only be created between properties of the same type.</p>\n<p>A property mapping can't be created between two properties on the same component, or where the mapping creates a loop. For example, a property mapping where property A is mapped to obtain its value from property B, which is mapped to obtain its value from property A isn't valid.</p>\n<h2 id=\"Tasks\">Tasks</h2>\n<ul>\n<li>\n<p><b>Create a property mapping</b> — Select the service component to which you want to add a property mapping. In the component properties pane, click the gear icon next to the property you want to map and then select <b>Map Property</b>. In the Select Mapping dialog, select a different component that has compatible properties to create the mapping. Select a compatible property of the selected component.</p>\n<p>The flow of the property mapping is displayed at the bottom of the Select Mapping dialog.</p>\n</li>\n<li>\n<p><b>Delete a mapping —</b> Click the gear icon next to the mapped property you want to delete and then select <b>Delete Mapping</b>.</p>\n</li>\n<li><b>View mapped properties —</b> Select the service component with the property mapping you want to view. Mapped properties are displayed with the chain icon in the properties pane on the right.</li>\n<li><b>Edit a mapping—</b> In the properties pane, click the gear icon next to the property mapping you want to update and then select <b>Update Mapping</b>. The component with the property mapping is highlighted in the Select Mapping dialog. The properties of the mapped component are displayed in the right pane. The mapped property is displayed at the bottom of the Select Mapping dialog. Click a property on the right pane to create a mapping to a different property of the mapped component. You can also select a different component and its property to create a mapping in the Select Mapping dialog.</li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}