{
  "title": "Lifecycle actions for resource offerings",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>A resource offering lifecycle is a collection of actions defined for a resource offering. The Lifecycle area allows you to specify the actions that are needed to provision, update, and deprovision resource offerings. Use the action selection wizard to add a lifecycle action to a resource offering from one of the available process engines.</p>\n<h2 class=\"mw-headline\" id=\"Lifecycle_actions\">Lifecycle actions</h2>\n<p>A lifecycle action is a function that's either run automatically at a specified lifecycle stage or phase, or that's exposed to the subscriber. Most lifecycle actions correspond to OO flows, which contain the logic for running the function. There are actions that run internally. Many internal actions relate to provider and pool selection and resource accounting. Actions include input parameters that provide configuration information to the function.</p>\n<h2 class=\"mw-headline\" id=\"Lifecycle_stages\">Lifecycle stages</h2>\n<p>A lifecycle stage represents a step within the service lifecycle. There are three categories of lifecycle stages: Provisioning, Operational, and De-provisioning.</p>\n<p>The Provisioning lifecycle stages are:</p>\n<ul>\n<li><b>Initializing</b>— Initializing is the first stage that's processed during provisioning. Use the Initializing stage for actions that perform any type of initialization that's required before proceeding to the Reserving stage, such as actions that perform input validation or create change request records.</li>\n<li><b>Reserving</b> — Reserving is the second stage that's processed during provisioning, after the Initializing stage. When a resource offering is associated to a service component, any configured provider selection and pool selection actions run during the Reserving stage. If resource accounting is enabled, actions to reserve resources from a pool run during the Reserving stage. In general, any resources needed during provisioning, such as storage or networking, can be reserved during the Reserving stage.</li>\n<li><b>Deploying</b>— Deploying is the final stage that's processed during provisioning, after the Initializing and Reserving stages, and is the most common stage in which provisioning actions are defined. Define actions in the Initializing and Reserving stages to prepare the environment for provisioning. Define actions in the Deploying stage to perform actual provisioning. For example, you can define actions that deploy a VM or an application in the Deploying stage.</li>\n</ul>\n<p>The Operational lifecycle stages are:</p>\n<ul>\n<li><b>Modifying</b>— The Modifying stage is processed when a subscription modification request is received from a subscriber and that modification results in a change to property values on a service component. Modifying actions run on any impacted service components and their associated resource offerings at this time. Define actions that are needed to process this change in property values in the Modifying stage.</li>\n</ul>\n<p>The De-provisioning lifecycle stages are:</p>\n<ul>\n<li><b>Un-deploying</b> — Un-deploying is the first stage that's processed during de-provisioning and is the most common stage in which de-provisioning actions are defined. Use the Un-deploying stage to undo or to finalize the actions that took place during the Deploying stage. For example, if actions in the Deploying stage deploy a VM, define actions in the Un-deploying stage to un-deploy the VM.</li>\n<li><b>Un-reserving</b> — Un-reserving is the second stage that's processed during de-provisioning, after the Un-deploying stage. Use the Un-reserving stage to undo or to finalize the actions that took place during the Reserving stage. For example, if resource accounting is enabled, actions to return resources to the pool run during the Un-reserving stage.</li>\n<li><b>Un-initializing</b> — Un-initializing is the final stage that's processed during de-provisioning, after the Un-deploying and Un-reserving stages. Use the Un-initializing stage to undo or to finalize the actions that took place during the Initializing stage. For example, if actions in the Initializing stage create a change request, define actions in the Un-initializing stage to finalize that change request.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Lifecycle_phases\">Lifecycle phases</h2>\n<p>A lifecycle phase is a further refinement of a lifecycle stage. When defining a lifecycle action at a lifecycle stage, you can also specify the phase for the action. The phases are:</p>\n<ul>\n<li><b>Before</b> — Actions configured in the Before phase on a service component run before all actions on child service components in a design and before all actions on any associated resource offerings. Actions configured in the Before phase on a resource offering run after all of the <strong>Before actions</strong> on the associated service component have completed.</li>\n<li><b>During</b> — Actions configured in the During phase on a service component run after all of the actions have completed on child service components in a design but before any of the During actions run on any associated resource offerings. Actions configured in the During phase on a resource offering run after all of the <strong>During actions</strong> on the associated service component have completed.</li>\n<li><b>After</b> — Actions configured in the After phase on a service component run after all actions have completed on child service components and after all of the During actions have completed on the service component and any associated resource offerings. Actions configured in the After phase on a resource offering run after all of the <strong>After actions</strong> on the associated service component have completed.</li>\n<li><b>On Failure</b> — Actions configured in the On Failure phase on a service component or resource offering run after an action failure occurs in any of the Before, During, or After phases for that service component or resource offering. <strong>On Failure</strong> actions aren't run if the design has been configured to pause on errors during this lifecycle stage.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Tasks\">Tasks</h2>\n<ul>\n<li><b>Navigate to</b> (the Lifecycle tab) — In the left pane of the <b>Resource Offerings</b> area, select the category or provider type associated with the resource offering you want to view. Select the resource offering and then select the <b>Lifecycle</b> tab.</li>\n<li><b>Add Action</b> — Click the <b>Add Action</b> or <b>Add More Actions</b> link in the stage and phase to which you want to add an action. Enter the information as described in Lifecycle action selection wizard.</li>\n<li><b>Edit Action</b> — Select the <span class=\"UIElementsgear icon\">gear icon</span> on the action you want to edit and select <b>Edit</b>. Update the information as described in Lifecycle action selection wizard.</li>\n<li><b>Delete</b> <b>Action</b> — Click the <span class=\"UIElementsgear icon\">gear icon</span> next to the action you want to delete and select <b>Delete</b>. You can also delete an action that's in a group.</li>\n<li><b>Move Action</b> — Select the <span class=\"UIElementsgear icon\">gear icon</span> on the action or group of actions you want to move to another stage or phase and select <b>Move</b>. In the Move dialog, select the Target Stage and Target Phase from the pull-down menus and then click <b>Move</b>. You can also click and drag to move an action or group of actions. To move an action or group of actions using the keyboard, press the tab key to provide focus on the action or group and then press Ctrl and the up or down keys to move the action or group within a phase.</li>\n<li><b>Group Actions</b> — Click to select multiple actions in a lifecycle phase and then click <b>Group</b> <b>Actions</b> to create a parallel processing group. Actions in a parallel processing group are processed at the same time.</li>\n<li><b>Ungroup Actions</b> — Click the <span class=\"UIElementsgear icon\">gear icon</span> next to an action in a group and then select <b>Remove from Group</b>.</li>\n<li><b>View Lifecycle Stages</b> — The Deploying Provisioning stage, the Modifying Operational stage, the Un-deploying De-provisioning stage, and any stage that has an action, are displayed by default. Select a filter from the All Selected Stages pull-down menu to display only Provisioning Stages, Operational Stages, or De-provisioning stages. Click <b>Select Stages</b> to view additional stages.</li>\n<li><b>View Lifecycle Phases</b>— The During and On Failure phases are displayed by default. Select <b>Show All Phases</b> to display the Before and After phases.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li>To know how to configure lifecycle action for sequenced designs, see <a href=\"/doc/423/26.1/mgmtconsrolifecycleactionwiz\" title=\"SMAX:25.1/MgmtConsROLifecycleActionWiz\">Lifecycle action selection wizard</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}