{
  "title": "Overview tab for service design components",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The Edit Component Overview tab allows you to modify attributes of a service component, including its Display Name, Description, Processing Order, and Consumer Visible and Pattern settings. For more information about these properties, see topics Edit a service component and Create a component type.</p>\n<h2 class=\"mw-headline\" id=\"Tasks\">Tasks</h2>\n<ul>\n<li>\n<p><b>Edit</b> - If a field is editable, enter data or select/clear a check box.</p>\n<p>For a published design, you can't edit the following attributes:</p>\n<ul>\n<li><b>Display Name</b> — The name you provide for the service component.</li>\n<li><b>Description —</b> The description you provide for the service component.</li>\n<li><b>Processing Order</b> (default value is 1, minimum value is 1, maximum value is 99) — Select a number to specify the deployment processing order for this service component relative to its sibling service components (that is, service components who share the same parent). Service components are processed in ascending order during service deployment and in descending order during undeployment.</li>\n<li><b>Image</b> — An image appears for the component. Click <b>Change Image</b>, as desired. The <b>Select Image</b> dialog appears, allowing you to choose from a variety of available images or click <b>Upload Image</b> to add your own image.</li>\n<li><b>Consumer Visible</b> (the default is false) — Select Visible to specify that this service component is visible to the Consumer. De-select it to specify that the service component will not be visible.  Service component properties and lifecycle actions that have been configured to be visible will be displayed only if the associated service component itself is configured to be visible. The visibility of a service component doesn't affect the visibility of its child service components, and it's not necessary for a parent of a service component to be visible for the child component to be visible to the Consumer.</li>\n<li><b>Pattern</b> (the default is false) —Select this box to mark the service component as a pattern. This indicates that the service component will not be automatically processed by the lifecycle engine. When you create a pattern service component, you must also create a Clone Pattern action in the parent service component. For example, the out-of-the-box component type, Server, is typically marked as a pattern, and its parent service component, Server Group, includes the Clone Pattern action. At subscription time, the Clone Pattern action creates one or more service component instances from this service component pattern. A pattern component can have direct children, which aren't patterns. When a pattern component contains a direct child component, the Clone Pattern action creates one or more instances of the pattern including the child component.<br/>\n\t\t \n\t\t<ul>\n<li>\n<p>A validation error is displayed in the designer when a parent-child relationship is established between a pattern service component and its parent component if the Clone Pattern action isn't created in the parent service component.</p>\n</li>\n<li>A validation warning is displayed when the service design has a pattern component whose parent component doesn't have the Clone Pattern action.</li>\n<li>A validation error is displayed when the service design has a pattern component whose parent component has a Clone Pattern action that doesn't have a value in the “Name of the Property for Service Component Count” property field.</li>\n<li>A validation error is displayed when the service design has a pattern component whose parent component has a Clone Pattern action that doesn't have a value in the “Name of the Property for Service Component Count” property field or has a value that doesn't point to the name of a property on the component.</li>\n</ul>\n<ul>\n<li>\n<p>You can identify a service component that is marked as a pattern because its icon appears with a grid-like background, as shown below.</p>\n<p><a class=\"image\" href=\"/file/images/7/75/4.92/Management_Console/Sequenced_Designs/images/pattern3.png\" title=\"/file/images/7/75/4.92/Management_Console/Sequenced_Designs/images/pattern3.png\"> <img alt=\"pattern3.png\" data-file-height=\"88\" data-file-width=\"81\" height=\"88\" src=\"../../../images/pattern3_c959613a.png\" width=\"81\"/> </a></p>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><b>Save</b> — Click <b>Done</b> to save any changes and exit the dialog.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/mgmtconsolesdservicecomedit\" title=\"SMAX:25.1/MgmtConsoleSDServiceComEdit\">Edit a service component</a></li>\n<li><a href=\"/doc/423/26.1/mgmtconscomptypecreate\" title=\"SMAX:25.1/MgmtConsCompTypeCreate\">Create a component type</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}