{
  "title": "Edit service design component properties",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The following information is displayed:</p>\n<table>\n<tbody>\n<tr>\n<th>Item</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Type</td>\n<td>\n<p>Determines the kind of value that can be assigned to the property. The available types are:</p>\n<ul>\n<li>Boolean</li>\n<li>Integer</li>\n<li>List</li>\n<li>String</li>\n</ul>\n<p>You can't change the type once the property has been created.</p>\n</td>\n</tr>\n<tr>\n<td>Display Name</td>\n<td>The label that will be displayed for the property. Hover the cursor over a display name to show the unique name (<b>Name</b>) and description (if supplied) of the property.</td>\n</tr>\n<tr>\n<td>Value</td>\n<td>\n<p>The value of the property. What's entered for the value depends on the property type:</p>\n<ul>\n<li><b>Boolean</b> — A property whose value is true or false.</li>\n<li><b>Integer</b> — A property whose value is a positive or negative whole number (or zero). The <b>Resource Type and Unit for a Measurable Property</b>, if configured, is displayed in parentheses (see Create component type properties for more information).</li>\n<li><b>List</b> — A property whose value is a list of string values. Every entry in the list supports a maximum of 4000 characters.</li>\n<li><b>String</b> — A property whose value is a sequence of characters. A string supports a maximum of 4000 characters.</li>\n</ul>\n<p>If the property has a property mapping, the value displayed is the component and property from which the value is mapped. Property mappings are configured from the design canvas. See Property mapping for more information.</p>\n<p>If the property has a target binding, the value is mapped from a subscriber option at runtime (when a subscription has been created). Target bindings are configured from the <b>Subscriber Options</b> tab. See Sequenced design subscriber options for more information.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span><br/>\n\t\t\tIf a property has a target binding, by default (until runtime) the value displayed is the value that was configured when the property was created.</p>\n</div>\n<p>If the property is mapped to a token (String properties only), the value displayed is the name of the token (a token is a system value that's automatically resolved internally when the property is read). See Select tokens for a description of the tokens.</p>\n<p>If the property is configured as <b>Confidential Data</b> (String properties only), the value is masked (no encryption of the value is performed).</p>\n</td>\n</tr>\n<tr>\n<td>References</td>\n<td>If a component has references, you can click <b>View References</b> to see the component properties to which this property is mapped and the subscriber option properties from which this property has a target binding. A component property that has a property mapping (its value is mapped <i>from</i> another property) isn't considered a reference. See topic View component property references.</td>\n</tr>\n<tr>\n<td>Attributes</td>\n<td>\n<p>The attributes configured for the property such as:</p>\n<ul>\n<li><b>Inherited</b> — The property is inherited from a component type.</li>\n<li><b>Consumer Visible</b> — The property will be made visible in the Service Portal.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Actions</td>\n<td>The <span class=\"UIElementsgear icon\">gear icon</span>, when selected, allowing you to edit or delete the property (if the action is permitted on the property). See the descriptions of these actions in the Tasks section below.</td>\n</tr>\n<tr>\n<td>Deploy Settings</td>\n<td>These attributes influence whether the property will be visible and/or required in the Management Console’s <b>Deploy a New Instance</b> dialog.\n\t\t\t<ul>\n<li><b>Visible</b> — This property and its value will be visible to the user performing deployments from the Management Console’s deploy dialogs.</li>\n</ul>\n<ul>\n<li><b>Required</b> — This property will be mandatory when performing deployments from the Management Console’s deploy dialogs.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"Tasks\">Tasks</h2>\n<ul>\n<li><b>Navigate to</b> (the Properties tab) — Select a service design version. Click the <b>Designer</b> tab. Select the service component on which you want to complete the task. In the right pane, click the <span class=\"UIElementsgear icon\">gear icon</span>, select <b>Edit Component</b>, and select the <b>Properties</b> tab.</li>\n<li>\n<p><b>Create a property</b> — Click <b>Create</b>. Enter the information described in the table above (see also Create component type properties) and click <b>Create</b>.</p>\n<p>A service component property can't be created if the service design is published.</p>\n<p>Property mappings are configured from the design canvas. See Property mapping for more information. Target bindings are configured from the <b>Subscriber Options</b> tab. See Sequenced design subscriber options for more information.</p>\n</li>\n<li>\n<p><b>Edit a property</b>— Click the <span class=\"UIElementsgear icon\">gear icon</span> next to the component property to be modified and select <b>Edit</b>.</p>\n<p>A service component property can't be edited if the service design is published.</p>\n</li>\n<li>\n<p><b>Delete a property</b> — Click the <span class=\"UIElementsgear icon\">gear icon</span> next to the component property to be deleted, and select <b>Delete</b>.</p>\n</li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}