{
  "title": "Import and export a component palette",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>In this topic, artifacts refer to a component palette and its associated component types, templates, component type constraints, and resource offerings.</p>\n<p>You can import and export many of the artifacts that provide the basis for cloud automation. The export operation provides the ability to preserve the selected artifacts so they can be used to replicate the services on another system or to restore the artifacts. These exported archive files are preserved in an industry-standard zip archive file format.</p>\n<p>The import operation provides the ability to install and replace artifacts. See the <i>Tasks</i> section below for more information.</p>\n<h2 class=\"mw-headline\" id=\"Process_information\">Process information</h2>\n<ul>\n<li><b>Resource offerings</b> - If a component template in a component palette is associated with a resource offering, when the component palette is exported, resource offering XML files are included in the component palette archive. Therefore, when importing this archive, the resource offerings are also imported.</li>\n<li>\n<p><b>Import operation</b> - The import operation is destructive to existing data (unlike the import operations for service designs and resource offerings for which there are options to only import new artifacts without overwriting existing ones). If an imported artifact exists on the target system, the existing artifact on the target system is overwritten. For example, if the imported component palette contains a resource offering that exists on the target system, the existing resource offering on the target system is overwritten by the resource offering from the archive.</p>\n<p>Select the preview button to view prospective results for the import process.</p>\n</li>\n<li><b>Import process integrity</b> - The import process for component palettes always ensures system integrity with respect to component type derivation and property propagation. For example, say you have modified properties of a component type in a palette called \"Palette A,\" and there are component types in other palettes that are derived from this component type. When an update of \"Palette A\" occurs during import, changes that have been made to the component types are propagated to component types in other palettes.</li>\n<li><b>Palette dependencies</b> - Import multiple, dependent palettes in the order of their dependencies if these palettes exist on the target system.</li>\n<li><b>Circular dependencies</b> - Circular dependencies between palettes aren't allowed. For example, Palette A can't have components that are derived from Palette B while, at the same time, Palette B has components that are derived from Palette A.</li>\n<li>\n<p><b>Flows</b> — During an import, update, or preview operation, if required dependencies don't exist on the <span class=\"ProductNamesOO\">Operations Orchestration</span> system, an error message identifies these missing dependencies (dependencies such as flows). The content pack that contain these flows must have been deployed to the <span class=\"ProductNamesOO\">Operations Orchestration</span> system prior to importing these artifacts. The flows must also have identical signatures and identical paths as the flows on the system from which the artifact was exported.</p>\n<p>During import, flow signature-related information is verified in or added to the database (flow signatures are used during the creation of an artifact and when adding a resource synchronization action or an external approval type). This information is resolved by <b>name</b> which corresponds to the full path to the <span class=\"ProductNamesOO\">Operations Orchestration</span> flow. For information about how to deploy <span class=\"ProductNamesOO\">Operations Orchestration</span> content packs, see the document on <i>Central User</i>.</p>\n</li>\n<li><b>Archive content</b> — The archive (<code>.zip)</code> file can only reference files or content contained within the <code>.zip</code> file itself, or that are already contained in the <code>csa.war</code> file.</li>\n<li>\n<p><b>Image files</b> — All images in the archive files must end in one of the following suffix values (for information on adding additional suffix values, see the Configuration section):</p>\n<p><code>jpg|jpeg|jpe|jfif|svg|tif|tiff|ras|cmx|ico|pnm|pbm|pgm|ppm|rgb|xbm|xpm|xwd|png</code></p>\n</li>\n<li><b>Back up your data</b> — Create a backup of your system or data. Before proceeding, be sure to create a backup of any artifacts you may be affecting by using the export operation to save an archive zip file.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Tasks\">Tasks</h2>\n<p>Import and export tasks are completed from the <b>Manage Component Palettes</b> dialog.</p>\n<ul>\n<li>\n<p><b>Import</b> - Imports new artifacts and overwrites existing artifacts. New artifacts are created if they don't exist on the target system. Identical artifacts that exist on the target system are overwritten with changes from the archive.</p>\n\tThe import operation identifies artifacts by name to determine if the artifact exists on the target system.</li>\n<li><b>Preview</b> — Generate a report of prospective results for the import process, including information about the artifacts and their status.</li>\n<li><b>View Detailed Report</b> - From the Import Summary dialog, select this link to see a summary and details of the import process, including information about the artifacts and their status.</li>\n<li>\n<p><b>Export</b> — Create a content archive (.zip) file. The content archive contains XML documents for the artifacts you are exporting, as well as icons for customizing the artifacts, and the Manifest XML document, which contains meta-information about the archive files.</p>\n<p>The component palettes are packaged in an archive file whose name is:</p>\n<p><code>COMPONENT_PALETTE_&lt;component_palette_display_name&gt;_&lt;component_palette_id&gt;.zip</code></p>\n</li>\n</ul>\n<p>For more information about importing and exporting artifacts, see the white paper on Content Archive Tool.</p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}