{
  "title": "Service design component properties",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>For more advanced configuration of the properties on a component, including the ability to add or delete properties, use the Edit Component menu. For more information, see Edit a service component.</p>\n<p>Properties for service components are user-defined properties that you may want to create in the following situations:</p>\n<ul>\n<li><b>When a service component receives its value from a subscriber option</b>. For example, you may wish to receive the number of CPUs for a server after its value has been specified in the Service Portal. To do this, create a property (for example, NCPU) on the server service component and create a subscriber option property (for example, NCPU). Finally, use a target binding, as described in the topic Sequenced design subscriber options, to push the value from the subscriber option to the server NCPU property.</li>\n<li><b>When an action that runs on a service component or its associated resource offering expects a property</b> value with a given name and value to exist on the service component. For example, an action may need to retrieve an IP address that's stored on a server service component.</li>\n<li><b>When you want to create a property mapping between components in a design</b>, where the property of a component obtains its value from the property of another component in a design. For example, a software application tier service component may need to know the service component ID of a server group. You can create a property on the server group service component called <code>SVC_COMPONENT_ID</code>, which has a token value of <code>[TOKEN:SVC_COMPONENT_ID]</code>. You would also create a property on the software application tier service component whose value contains a property mapping to the server group property (<code>SVC_COMPONENT_ID</code>). The property value is then pulled by the software application tier from that <code>SVC_COMPONENT_ID</code> property on the server group. This use of service component properties to pull a value from another service component property is called a <i>property mapping</i>. Another type of relationship between properties is called a target binding. For more information about target bindings, see Sequenced design subscriber options.</li>\n<li><b>When you want to expose a property value in the</b> Service Portal. The property value can be explicitly defined on the service component, or may be set as the result of an action execution (for example, a HOSTNAME property might be set on a server service component as part of deploying the server).</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Tasks\">Tasks</h2>\n<p>Service component properties are managed using the Properties panel and the Edit Component menu in the Designer tab.</p>\n<ul>\n<li><b>View</b> — Select the service component whose properties you want to view. The <b>Properties</b> pane opens on the right and displays the properties of the selected component. A property that's set as a measurable property is displayed with its unit in parenthesis. The component type and the palette to which the component belongs are displayed at the top of the <b>Properties</b> pane. Click the <b>View References</b> link under a property to view references to this property from other service component properties and subscriber option properties. See View service component property references.</li>\n<li><b>Edit —</b> Select the service component whose properties you want to edit. The <b>Properties</b> pane opens on the right and displays the properties of the selected component. You can edit the values of any property and click <b>Save</b> to persist the changes.</li>\n<li><b>Select Token</b> — Choose a token for string properties that aren't mapped. Choose the <b>Select Token</b> option, and select from the list of available tokens. See Select tokens for a description of the tokens.</li>\n<li><b>Map properties</b> — Create a mapping between the properties of components in a design. For more information, see Property mapping.</li>\n<li><b>Add, edit, or delete list items</b> — Add, edit, or delete list items for list properties. Use the <b>Edit Component</b> menu to add list properties.</li>\n<li><b>Configure advanced settings</b> — Add, edit, delete, or modify properties of a service component, configure lifecycle actions, and configure resource offerings. For more information, see Edit a service component.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/mgmtconsolesdservicecomedit\" title=\"SMAX:25.1/MgmtConsoleSDServiceComEdit\">Edit a service component</a></li>\n<li><a href=\"/doc/423/26.1/mgmtconssdservicecompropref\" title=\"SMAX:25.1/MgmtConsSDServiceComPropRef\">View service component property references</a></li>\n<li><a href=\"/doc/423/26.1/mgmtconssdservicecompropmapping\" title=\"SMAX:25.1/MgmtConsSDServiceComPropMapping\">Property mapping</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}