{
  "title": "SACM modeling use case",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>This use case provides a practical step-by-step modeling guide for the online book store service example. The modeling approach used in this example is top-down modeling; we start from the top logical record types of the service and the relationships between them and proceed to describe the lower infrastructure elements of the tree and their relationships with the upper logical elements.</p>\n<p>A service-model is a topological graph structure composed of records which are connected via relationships. The most important design consideration behind the Service Management service model is simplifying the complexity of service model graph structures. This ensures that any person with any role in the enterprise can easily consume and understand the service model.</p>\n<p>Service Management enforces a strict service structure - all services follow the same graphical pattern to facilitate easy interpretation of the model at a single glance. All service models created in Service Management are tree models; general complex service graphs structures aren't supported.</p>\n<h2 class=\"mw-headline\" id=\"Top_logical_record_types_and_relationships\">Top logical record types and relationships</h2>\n<h3 class=\"mw-headline\" id=\"Actual-service_and_Service-component\">Actual-service and Service-component</h3>\n<p>The record type that represents a service, whether a business service or an infrastructure service, is the actual service record type. In Service Management, a service is composed of multiple service components. A service component can represent a business application, for example. Therefore, if an actual service is composed of multiple business applications, each business application should be represented as a service component contained by the parent actual service.</p>\n<p>For example, the online book store service is comprised of multiple business applications - the shipment management application, the order management application, and the books catalog browsing application. In this case the online book store service should be represented by an actual service record and each of the business applications comprising the service should be represented by a service component record.</p>\n<p>An actual service must be comprised of at least one service component. This ensures that all actual services follow the same tree model and include the same layers.</p>\n<h3 class=\"mw-headline\" id=\"Containment_relationship_type\">Containment relationship type</h3>\n<p>The containment relationship is used to connect a parent actual service with its child service components. You can refer to its child service components of the actual service record using the <b>ActualServiceContainsServiceComponents</b> MANY2MANY relationship. To model the fact that the online book store is composed of the business applications mentioned above, it's necessary to connect the online book store actual service to each of its service components via a containment relationship, as can be seen in the following service tree:</p>\n<p><a class=\"image\" href=\"/file/images/c/cd/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_containment.png\" title=\"/file/images/c/cd/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_containment.png\"> <img alt=\"sacm modeling containment.png\" class=\"fit_width\" decoding=\"async\" height=\"344\" src=\"../../../images/sacm_modeling_containment_b37430ec.png\" width=\"872\"/> </a></p>\n<h3 class=\"mw-headline\" id=\"Usage_relationship_type\">Usage relationship type</h3>\n<p>The usage relationship should be used to model dependencies between actual services. A dependency means that actual service X consumes some service from actual service Y. This usually means that actual service Y is a shared infrastructure which can be used by other actual services (in addition to actual service X).</p>\n<p>It's possible to model the fact that service component X is using actual service Y. In our example, assume that the online book store service is using the credit card payment actual service and the Paypal payment actual service. This can be modeled as follows:</p>\n<p><a class=\"image\" href=\"/file/images/c/cf/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_usage1.png\" title=\"/file/images/c/cf/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_usage1.png\"> <img alt=\"sacm modeling usage1.png\" class=\"fit_width\" decoding=\"async\" height=\"226\" src=\"../../../images/sacm_modeling_usage1_017f5090.png\" width=\"856\"/> </a></p>\n<p>If you know which service component is using each of the payment services, it's better to connect the service component record to the payment services directly, rather than connecting the online book store actual service record to the payment services. This generates a more accurate service model and the impact analysis calculations provide more accurate results. The user viewing the impact result map can see which functionality of the actual service (i.e. which service component) is impacted. Therefore, the following model is preferred:</p>\n<p><a class=\"image\" href=\"/file/images/a/ad/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_usage2.png\" title=\"/file/images/a/ad/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_usage2.png\"> <img alt=\"sacm modeling usage2.png\" class=\"fit_width\" decoding=\"async\" height=\"383\" src=\"../../../images/sacm_modeling_usage2_0bf22fb9.png\" width=\"556\"/> </a></p>\n<p>You can refer to the actual services used by an actual service record via the <b>ActualServiceUsageActualService</b> MANY2MANY relationship. You can refer to the actual services used by a service component record via the <b>ServiceComponentUsesActualService</b> MANY2MANY relationship.</p>\n<h3 class=\"mw-headline\" id=\"Containment_vs._usage_relationship\">Containment vs. usage relationship</h3>\n<p>To further clarify the difference between the usage and containment relationships, consider the following:</p>\n<p>The online book store service is composed of the following service-components:</p>\n<ul>\n<li>shipment service component</li>\n<li>book catalog service component</li>\n<li>book orders service component</li>\n</ul>\n<p>No other service can use these service components and they all have the same owner (the owner of the online book store service). In addition, all the service components in the online book store are subject to the same SLA – the SLA of the online book store service. In such a case, the best practice is to associate the online book store with all its service components via containment relationships.</p>\n<p>If, however, the online book store consumes the functionality of the payment service, which is a shared service (i.e., it could also be used by the online music store and online clothes store, etc.), in such a case the payment service should be associated with the online book store actual service via a usage relationship. The owner of the online book store isn't usually the same as the owner of the payment actual service.</p>\n<p>To summarize:</p>\n<ul>\n<li>Containment represents composition; usage represents sharing (multiple business services can use a shared infrastructure-service).</li>\n<li>Containment involves the same ownership of the associated records; usage implies different ownership.</li>\n<li>Contained records generally have the same SLA as their parent. This isn't the case with usage, as the owners are different.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Service_scope_demarcation\">Service scope demarcation</h3>\n<p>The usage relationships demarcate the scope of services – the usage relationships form the borders between services.</p>\n<p><a class=\"image\" href=\"/file/images/c/c4/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_service_scope.png\" title=\"/file/images/c/c4/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_service_scope.png\"> <img alt=\"sacm modeling service scope.png\" class=\"fit_width\" decoding=\"async\" height=\"454\" src=\"../../../images/sacm_modeling_service_scope_b2eef302.png\" width=\"940\"/> </a></p>\n<p>For example, to calculate the cost of ownership of the online book store actual service, it's necessary to sum up the cost of every record which is directly or indirectly connected to the root online book store actual service via a containment relationship. These are the records that compose this actual service.</p>\n<h3 class=\"mw-headline\" id=\"Distinguishing_between_infrastructure_and_business_services\">Distinguishing between infrastructure and business services</h3>\n<p>The actual service record type can represent either a business service or an infrastructure service. This is determined by setting the appropriate value (business-service or infrastructure-service) in the actual service’s subtype attribute. In our example, the online book store service is a business service and both of the payment services (Paypal and credit card) are infrastructure services because these services aren't used directly by business customers.</p>\n<h2 class=\"mw-headline\" id=\"Record_types_representing_infrastructure_elements\">Record types representing infrastructure elements</h2>\n<p>In Service Management, there are two record types that represent infrastructure configuration items:</p>\n<ul>\n<li>\n<p>Device</p>\n<p>This record type may represent any kind of node: a smartphone, a laptop, a network device, a server, a storage device, etc. A device record may represent either a physical or a virtual machine. Use the device subtype ENUM field to set the type of device represented.</p>\n</li>\n<li>\n<p>System element</p>\n<p>This record type may represent one of the following according to the content of the subtype ENUM field:</p>\n<ul>\n<li><b>WebServer.</b> A web server such as Apache or IIS.</li>\n<li><b>Database.</b> A database such as Oracle or MSSQL.</li>\n<li><b>Virtualization.</b> Represents a hypervisor.</li>\n<li><b>ApplicationServer.</b> Represents an application server such as JBOSS or WebSphere.</li>\n<li><b>Running software.</b> Represents any software running on the device (usually a server device) which isn't one of the following: a web server, a database, a hypervisor, or an application server.</li>\n<li>\n<p><b>CI collection.</b> Represents a generic logical collection of devices. The collection of devices may represent one of the tiers of an n-tiered service or application (e.g. the devices where the web servers are deployed i.e. the web tier).</p>\n</li>\n<li><b>Other.</b> Represents anything not listed above.</li>\n</ul>\n<p>A system element can also represent a failover cluster or a load-balancing cluster, comprised of multiple machines. In this case, the cluster type attribute should include either the value <b>FailOver</b> or <b>LoadBalancer</b>. In addition, this record type may represent a complicated distributed system comprised of multiple machines and running software instances such as Active Directory, Sharepoint Farm, SAP System, etc. (In that case, the value <b>other</b> should be set in the subtype field).</p>\n</li>\n</ul>\n<p>The following diagram summarizes all the record types and valid relationships that can be used to build service model trees in Service Management:</p>\n<p><a class=\"image\" href=\"/file/images/7/7e/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_all_relationships.png\" title=\"/file/images/7/7e/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_all_relationships.png\"> <img alt=\"sacm modeling all relationships.png\" class=\"fit_width\" decoding=\"async\" height=\"568\" src=\"../../../images/sacm_modeling_all_relationships_a686e561.png\" width=\"730\"/> </a></p>\n<h2 class=\"mw-headline\" id=\"Modeling_the_service_components_of_the_online_book_store_service\">Modeling the service components of the online book store service</h2>\n<p>The following is a description of the implementation of each of the service components (business-applications) comprising the online book store service. For each description, we will show how the service component subtree should be modeled in Service Management.</p>\n<h3 class=\"mw-headline\" id=\"Shipment_management_service_component\">Shipment management service component</h3>\n<p>The shipment management service component is composed of one dedicated web server running on one machine and one dedicated database running on another machine. The web server appears in the picture below as Apache WebServer2 and the database appears as PostGreSQL Database1.</p>\n<p>Each of the machines (seen below as Windows Server1 and Windows Server2) may host other running software instances which are dedicated for other actual services. For example, the shipment application doesn't use Apache WebServer1 which is also running on Windows Server1. The Apache WebServer1 is used by a different service or application. Therefore, the shipment management service component should be connected via containment directly to Apache WebServer2. It should not be connected to Windows Server1, as this machine isn't dedicated for the shipment application.</p>\n<p>The same approach should be used to model PostGreSQL Database1 which is dedicated for the shipment application. Note that PostGreSQL Database2 isn't used by the shipment application, hence Windows Server2 isn't dedicated for the shipment application hence the shipment service component isn't connected to Windows Server2 instead it's connected to the PostGreSQL Database1 directly.</p>\n<p><a class=\"image\" href=\"/file/images/e/eb/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_shipment_mgmt.png\" title=\"/file/images/e/eb/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_shipment_mgmt.png\"> <img alt=\"sacm modeling shipment mgmt.png\" class=\"fit_width\" decoding=\"async\" height=\"479\" src=\"../../../images/sacm_modeling_shipment_mgmt_c10ef6d0.png\" width=\"1014\"/> </a></p>\n<h3 class=\"mw-headline\" id=\"Order_management_service_component\">Order management service component</h3>\n<p>The order management service component is composed of four JBoss application servers running the orders business logic. Each pair of application servers are deployed on a separate machine dedicated for the order management application. The two dedicated machines appear in the picture below as Windows Server3 and Windows Server4. Therefore, running software instances which aren't running the order management application can't be installed on Windows Server3 and Windows Server4 which are dedicated for order management only. In addition, the JBoss application servers use the following infrastructure services:</p>\n<ul>\n<li><b>Database infrastructure service.</b> The data of the orders application is stored on a shared infrastructure database owned by the Database-Admin group (not owned by the owner of the online book store business service). The name of the infrastructure service is Database RAC-Farm-1.</li>\n<li><b>Paypal payment infrastructure service.</b> This infrastructure service is also used by the online music store business-service (in addition to the online book store business service).</li>\n<li><b>Credit card payment infrastructure service.</b> This infrastructure service is also used by the online music store business-service (in addition to the online book store business service).</li>\n</ul>\n<p>Since Windows Server3 and Windows Server4 are dedicated for the order management application, it's recommended to connect the order management service component directly to Windows Server3 and Windows Server4. This is preferred over connecting the service component to each application server individually because, if at some future point, the owner of the online book store service decides to deploy additional application servers on these machines (to increase scale), he would have to manually connect the newly added instances to the order management service component. By directly connecting the service component to its dedicated machines, the owner will not need to manually update the service model in the event of adding/removing a running-software from these machines. The following picture displays the usage relationships connecting the order management service component with its three infrastructure services:</p>\n<p><a class=\"image\" href=\"/file/images/d/dc/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_orders_mgmt.png\" title=\"/file/images/d/dc/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_orders_mgmt.png\"> <img alt=\"sacm modeling orders mgmt.png\" class=\"fit_width\" decoding=\"async\" height=\"427\" src=\"../../../images/sacm_modeling_orders_mgmt_8bb3b3c4.png\" width=\"1034\"/> </a></p>\n<h3 class=\"mw-headline\" id=\"Book_catalog_browsing_service_component\">Book catalog browsing service component</h3>\n<p>The book catalog browsing service component is a two tier application – a web tier and a database tier. The web tier is composed of two Apache web servers where each web server is running on a separate machine dedicated to the catalog browsing application exclusively. The database tier is composed of a failover cluster comprising two PostGreSQL database instances, where each instance is running on a separate dedicated machine of its own.</p>\n<p>A tier of an application or service should be modeled as a CI collection. A CI collection is a subtype of the system element record type. The machines hosting the running-software instances are dedicated and there is no need to associate the web-servers to the CI collection – it's enough to associate each device to the CI collection. The database tier consists of a failover cluster composed of two dedicated machines. A failover cluster is modeled as a system element with the <b>ClusterType</b> field set to <b>FailOver</b>. The following diagram displays the model:</p>\n<p><a class=\"image\" href=\"/file/images/4/49/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_catalog_browsing.png\" title=\"/file/images/4/49/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_catalog_browsing.png\"> <img alt=\"sacm modeling catalog browsing.png\" class=\"fit_width\" decoding=\"async\" height=\"554\" src=\"../../../images/sacm_modeling_catalog_browsing_7c40c874.png\" width=\"712\"/> </a></p>\n<p>The complete model is depicted in the following diagram:</p>\n<p><a class=\"image\" href=\"/file/images/5/52/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_complete_model.png\" title=\"/file/images/5/52/2018.08_Helpcenter/Resources/Images/SACM/sacm_modeling_complete_model.png\"> <img alt=\"sacm modeling complete model.png\" class=\"fit_width\" decoding=\"async\" height=\"521\" src=\"../../../images/sacm_modeling_complete_model_2a553f6e.png\" width=\"1071\"/> </a></p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/configremotecms\" title=\"SMAX:25.1/ConfigRemoteCMS\">Configure a remote UCMDB</a></li>\n<li><a href=\"/doc/423/26.1/connectremotedesktop\" title=\"SMAX:25.1/ConnectRemoteDesktop\">How to create a remote desktop connection</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}