{
  "title": "MT console for shared service providers",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Service Management provides the ability for shared services providers to manage their business units' and clients' request and incident records in one user interface via a multi-tenant (MT) Console in the provider tenant. Each business unit and client can use its own Service Management tenant while the MT Console displays all data together in one consolidated view. The data provided empowers agents to prioritize their work and be more efficient. </p>\n<ul>\n</ul>\n<ul>\n</ul>\n<p>The provider tenants and managed tenants are created and managed in <a href=\"/doc/423/26.1/sharedserviceprovider\" title=\"Suite Administration\">Suite Administration</a>.</p>\n<ul>\n<li>When a managed tenant is added to the provider tenant, a vendor record is created in the provider tenant automatically. The vendor's name is the same as the managed account name and the code is the same as the managed account's shared service customer code. This code appears in the MT Console as the prefix to all incidents and requests belonging to this managed tenant.</li>\n<li>When a shared service user is granted access to a managed tenant, this user will also be synced to the managed tenant when one of the following occurs:\n\t<ul>\n<li>this user logs in to the managed tenant</li>\n<li>the tenant admin click Sync in the managed tenant</li>\n<li>an auto synchronization job completes</li>\n</ul>\n</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Use_the_MT_Console\">Use the MT Console</h2>\n<p>Shared services users manage incidents and requests using the MT Console. You access the console from the <span class=\"SAW_VariablesMain_menu_Starter\">Main menu</span>. The MT Console is available only in the provider tenant, it includes the following tabs:</p>\n<ul>\n<li><b>Dashboard</b>. Displays all managed customers including:\n\n\t<ul>\n<li>Total open requests and incidents for all managed tenants at the top of the dashboard.</li>\n<li>An icon per managed customer displaying open incidents or requests for that managed client. Hovering on the icon displays a tooltip detailing the priority level of the open requests or incidents.</li>\n<li>Totals for only the selected managed customers at the bottom of the dashboard. Each is a link to view the requests or incidents of the selected customers in the request or incident grid.</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li><b>Requests</b>. A grid view of the open requests for selected customers. You can select up to five customers to view in the grid.</li>\n<li><b>Incidents</b>. A grid view of the open incidents for selected customers. You can select up to five customers to view in the grid.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Viewing_and_Filtering_in_the_MT_Console_Dashboard\">Viewing and Filtering in the MT Console Dashboard</h3>\n<ul>\n<li>The information in the MT Console Dashboard is filtered to display only <b>active</b> incidents and requests by default.</li>\n<li>You can add additional filters to limit the information you can view in the dashboard. Filtering here works like any other filter in Service Management, although on fewer available properties. For more information, see <a href=\"/doc/423/26.1/filters\" title=\"SMAX:25.1/Filters\">Filters</a>.</li>\n<li>You can also use the dashboard to select the customers to view in the requests and incidents grids.\n\t<ul>\n<li>Select a client by clicking the icon.</li>\n<li>A selected customer has a checkmark added to its icon.</li>\n<li>You can select up to five customers to view in the grids.</li>\n</ul>\n</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Viewing_and_Filtering_in_the_MT_Console_Requests_or_Incidents_Grid\">Viewing and Filtering in the MT Console Requests or Incidents Grid</h3>\n<p>The grid page where you can view requests and incidents of the selected managed customers works like any grid page in Service Management. This includes using <a href=\"/doc/423/26.1/filters\" title=\"SMAX:25.1/Filters\">filters</a> and <a href=\"/doc/423/26.1/views\" title=\"SMAX:25.1/Views\">views</a>.</p>\n<p>The records displayed in the dashboard include only records that are active by default. On the grid page, you can change the filter setting to view the records that aren't currently active.</p>\n<p>The following options are unique to the MT Console grid pages:</p>\n<ul>\n<li>The records are listed with the managed customer's code (as entered in Vendor Management) at the beginning of each record ID. You can easily identify the record as belonging to which customer.</li>\n<li>You can change the managed customers who are selected at the top of the grid page:\n\t<ul>\n<li>Click the edit button to open the customer selection box.</li>\n<li>Click the <b>x</b> on an icon to remove that customer from the selection.</li>\n<li>Click inside the box to see a list of all managed clients from which to select.</li>\n</ul>\n</li>\n<li>Clicking an individual record opens the record within a separate tab that opens an instance of the managed tenant. Only users who have permission on the managed tenant can access and update data in this managed tenant instance of Service Management. Accessing the managed tenant via MT Console doesn't consume license capacities of the managed tenant.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/smgmtadmin\" title=\"SMAX:25.1/SMgmtAdmin\">Service Management Administration</a></li>\n<li><a href=\"/doc/423/26.1/createvendor\" title=\"SMAX:25.1/CreateVendor\">How to create a company record</a></li>\n<li><a href=\"/doc/423/26.1/editvendor\" title=\"SMAX:25.1/EditVendor\">How to edit a company record</a></li>\n<li><a href=\"/doc/423/26.1/sharedserviceprovider\" title=\"SMAX:25.1/SharedServiceProvider\">Suite Administration for shared service providers</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}