{
  "title": "Native SACM hybrid mode",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><h2>What's Native SACM hybrid mode?</h2>\n<p>When implementing Native SACM, the following deployment isn't rare:</p>\n<ul>\n<li>Service Management is installed in a cloud environment such as Azure, AWS, or Google Cloud.</li>\n<li>UCMDB is running in an on-premises data center.</li>\n</ul>\n<p>Due to those different setups, some special considerations must be taken into account in order to connect the on-premises UCMDB with the cloud-based Service Management. This is what we call the “Hybrid deployment” mode.</p>\n<h2>Communication methods</h2>\n<h3>Local data-center components</h3>\n<p>Before connecting UD/UCMDB and Service Management through UCMDB Gateway, it's required to understand how these 3 components communicate together.</p>\n<ul>\n<li>All actions done in Service Management such as CI creations and updates are synchronized to UCMDB through HTTP requests orchestrated by UCMDB Gateway.</li>\n<li>For all background activities, a WebSocket connection is established by Service Management to the Gateway and then from the Gateway to UCMDB. This WebSocket connection handles all requests from UCMDB such as CI creations and discoveries and keeps Service Management synchronized. WebSocket allows long-lasting HTTP connections, which are required in the Native SACM context. All components in the network like Firewalls, Proxy server, and Load-balancer need to support “HTTP upgrade header.” For details about the “HTTP upgrade” mechanism, see <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Protocol_upgrade_mechanism\" title=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Protocol_upgrade_mechanism\">https://developer.mozilla.org/en-US/docs/Web/HTTP/Protocol_upgrade_mechanism</a>.</li>\n<li>Using the “Explore” button in Service Management SACM records will launch the UCMDB Browser which typically runs at the same port of the UCMDB server.</li>\n</ul>\n<p>The following diagram illustrates how these components interact.</p>\n<div><a class=\"image\" href=\"/file/images/f/f3/NativeSacmHybrid1.png\" title=\"/file/images/f/f3/NativeSacmHybrid1.png\"> <img alt=\"NativeSacmHybrid1\" border=\"0\" file=\"/mediawiki/images/f/f3/NativeSacmHybrid1.png\" height=\"272\" hspace=\"0\" src=\"../../../images/NativeSacmHybrid1_45381c71.png\" style=\"width: 800px; height: 272px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<p>The following reference architecture illustrates a typical Native SACM hybrid deployment.</p>\n<div><a class=\"image\" href=\"/file/images/3/34/NativeSacmHybrid2.png\" title=\"/file/images/3/34/NativeSacmHybrid2.png\"> <img alt=\"NativeSacmHybrid2\" border=\"0\" file=\"/mediawiki/images/3/34/NativeSacmHybrid2.png\" height=\"445\" hspace=\"0\" src=\"../../../images/NativeSacmHybrid2_ccc63278.png\" style=\"width: 800px; height: 445px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h2>Implementing the hybrid mode</h2>\n<h3>Service Management cloud deployment</h3>\n<p>Deploy Service Management in the cloud. For detailed instructions, see the cloud deployment sections in <a href=\"/doc/423/26.1/install\" title=\"Install\">Install</a>. </p>\n<h3>Prerequisites for Native SACM</h3>\n<p>Make sure the following conditions are met.</p>\n<ul>\n<li>Make sure your network and firewall can support “HTTP upgrade header” for the WebSocket connection.</li>\n<li>Make sure you have a 1 GB fast Ethernet network link or something equivalent between the on-premises data center and the cloud data center.</li>\n<li>Make sure the latency is short than 30 ms.</li>\n</ul>\n<h3>Implementation steps</h3>\n<p>Follow these steps to implement the Native SACM hybrid mode.</p>\n<ol>\n<li>The UCMDB server already runs on a dedicated port. The UCMDB Gateway will use this port to connect the UCMDB Server. This is configurable in the UCMDB Gateway config.properties file. For details, see <a href=\"/doc/423/26.1/nativesacmucmdb#Install_UCMDB_Gateway\" title=\"Install UCMDB Gateway\">Install UCMDB Gateway</a>.</li>\n<li>Configure the UCMDB Gateway to run on a dedicated port. This is configurable in the config.properties file in the UCMDB Gateway installation folder. In the config.properties file, you also have to set the URL and Port to The Service Management system. For details, see <a href=\"/doc/423/26.1/nativesacmucmdb#Install_UCMDB_Gateway\" title=\"Install UCMDB Gateway\">Install UCMDB Gateway</a>. </li>\n<li>Now, the connectivity between UCMDB and UCMDB Gateway is established.</li>\n<li>Open the firewall on the port where UCMDB Gateway is running so that Service Management can connect to the UCMDB Gateway. This is the port you configured in step 2.</li>\n<li>In the Service Management Suite Administration, go to the <strong>Tenants application</strong> settings and enter the connection details of the UCMDB Gateway server. For details, see <a href=\"/doc/423/26.1/enablenativesacminsma\" title=\"Enable Native SACM in Service ManagementX\">Enable Native SACM in Service ManagementX</a>.</li>\n<li>To ensure Service Management can connect to the UCMDB Browser, the port to connect with the UCMDB Browser needs to be opened in the Firewall.</li>\n</ol>\n<h3>Enable Single Sign-On</h3>\n<p>First <a href=\"/doc/423/26.1/associatetenantcustomer\" title=\"Associate SMAX tenants with UCMDB customers\">Associate Service Management tenants with UCMDB customers</a>, and then follow these steps to enable Single Sign-On:</p>\n<ol>\n<li>Go to the SACM homepage, click <strong>SACM configuration</strong>.</li>\n<li>Check the <strong>Enable UCMDB browser</strong> check box.</li>\n<li>Enter the UCMDB Browser URL of the corresponding UCMDB customer. The UCMDB Browser URL resembles <code>https://&lt;UCMDB_Server_Host&gt;:&lt;UCMDB_Server_Port&gt;/ucmdb-browser</code>. You don't need to specify the UCMDB customer ID, which is automatically handled by Service Management.</li>\n<li>Click <strong>Save</strong>.</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}