{
  "title": "Native SACM overview",
  "content": "<div class=\"mw-parser-output\">\n<div></div>\n<h2>Native SACM vs. the traditional SACM module</h2>\n<p>After Native SACM is enabled, the <a href=\"/doc/423/26.1/sacm\" title=\" general configurations and functionalities\">general configurations and functionalities</a> of the SACM module are still valid, with the following behavior changes: </p>\n<ul>\n<li>Data is federated with UCMDB in a bi-directional manner; Service Management and UCMDB are tightly coupled. Specifically, actual services, service components, and devices that are created through Service Management UI will appear in UCMDB immediately. Likewise, they can be created in UCMDB and appear in Service Management immediately.  </li>\n<li>In the traditional Service Management SACM module, you can create several services with the same name. This is no longer possible in the Native SACM solution since the reconciliation engine in UCMDB prevents creating several services with the same name. In case it's required to create several services with the same name, we recommend that you deactivate the identification rule (set the UCMDB <strong>Identification</strong> field to <strong>No identification</strong>) for the Business and Infrastructure Service CI types. </li>\n<li>System Elements can no longer be created in Service Management because the underlying UCMDB CI types have different prerequisites. Therefore, these elements need to be created or discovered in UCMDB and then be synchronized into Service Management. </li>\n<li>CI relationships are mostly maintained in UCMDB rather than Service Management. In Service Management, the only way to create/delete CI relationships is to use business rules. Other than that, all CI relationships are directly created and managed in UCMDB, either automatically (via discovery) or manually. The topology created in UCMDB is displayed 1:1 in \"Related CIs\" tab of Service Management’s records.  </li>\n<li>The \"Related CIs\" tab shows a view of the end-to-end CI topology rather than providing controls to set up CI relationships. The CI topology can be filtered now. </li>\n<li>The \"Show Impact\" functionality shows the impact analysis based on the UCMDB-configured impact bundle.  </li>\n<li>Infrastructure and Peripheral records aren't federated with UCMDB. These records are still in the original Service Management database. The management of those related records is moved to the \"Related Records\" tab. </li>\n<li>Some federated attributes can be updated through the Service Management UI, however, they can also get updated on the UCMDB side either through UCMDB UI or through discovery. Therefore, the attributes being displayed are the ones that got last updated in either Service Management or UCMDB. </li>\n<li>With Native SACM, all modifications to attributes for either federated and Service Management local attributes are tracked in the Service Management history, including the attribute changes that happened on the UCMDB side. </li>\n</ul>\n<p><strong>Note:</strong> Native SACM is an optional feature. Without activating it, Service Management will run with the traditional SACM module. <br/>\n </p>\n<h2>Create and edit new records</h2>\n<p>When creating actual services, service components, or devices through the Service Management UI, the approach is the same as in the traditional SACM module. The only difference is that these records are also created in UCMDB automatically. You can also create these records in UCMDB. Any changes in either system are directly reflected in the other.  </p>\n<h2>Manage system elements </h2>\n<p>System elements are mapped to many different CI types in UCMDB. All these CI types have different prerequisites, which makes it difficult to allow the creation of system elements from the Service Management UI. System elements map to the following CI types (including their subtypes): </p>\n<ul role=\"list\">\n<li aria-setsize=\"-1\" data-aria-level=\"1\" data-aria-posinset=\"1\" data-font=\"Symbol\" data-leveltext=\"\" data-listid=\"15\" role=\"listitem\">\n<p>Application System </p>\n</li>\n<li aria-setsize=\"-1\" data-aria-level=\"1\" data-aria-posinset=\"2\" data-font=\"Symbol\" data-leveltext=\"\" data-listid=\"15\" role=\"listitem\">\n<p>Running Software </p>\n</li>\n<li aria-setsize=\"-1\" data-aria-level=\"1\" data-aria-posinset=\"3\" data-font=\"Symbol\" data-leveltext=\"\" data-listid=\"15\" role=\"listitem\">\n<p>AWS Resource </p>\n</li>\n</ul>\n<ul role=\"list\">\n<li aria-setsize=\"-1\" data-aria-level=\"1\" data-aria-posinset=\"1\" data-font=\"Symbol\" data-leveltext=\"\" data-listid=\"15\" role=\"listitem\">\n<p>Database Resource </p>\n</li>\n<li aria-setsize=\"-1\" data-aria-level=\"1\" data-aria-posinset=\"2\" data-font=\"Symbol\" data-leveltext=\"\" data-listid=\"15\" role=\"listitem\">\n<p>Web Service Resource </p>\n</li>\n<li aria-setsize=\"-1\" data-aria-level=\"1\" data-aria-posinset=\"3\" data-font=\"Symbol\" data-leveltext=\"\" data-listid=\"15\" role=\"listitem\">\n<p>Cloud Service </p>\n</li>\n</ul>\n<p>These CI types typically require a device/node as a parent CI. Therefore, we recommend that you:  </p>\n<ul role=\"list\">\n<li aria-setsize=\"-1\" data-aria-level=\"1\" data-aria-posinset=\"1\" data-font=\"\" data-leveltext=\"%1)\" data-listid=\"14\" role=\"listitem\">\n<p>Use discovery to detect CI types like the system elements listed above and have them related to a proper parent CI and federated into Service Management. </p>\n</li>\n<li aria-setsize=\"-1\" data-aria-level=\"1\" data-aria-posinset=\"2\" data-font=\"\" data-leveltext=\"%1)\" data-listid=\"14\" role=\"listitem\">\n<p>Manually create a related CI for the CI types covered by System Elements in UCMDB. </p>\n</li>\n</ul>\n<h2>Delete records </h2>\n<p>Since Service Management and UCMDB are sharing data now, we recommend that you:</p>\n<ul>\n<li>If you decide not to use the <a href=\"/doc/423/26.1/cilifecycleaging\" title=\"Enhanced CI aging solution with Native SACM\">enhanced CI aging</a> feature, disable the CI aging process in UCMDB. If the UCMDB aging process is still active, CIs not discovered by Universal Discovery for more than 40 days will be automatically removed by UCMDB and therefore will also be removed in Service Management without any warnings or notifications. This breaks the CI lifecycle management.</li>\n<li>Let Service Management take control when CIs are deleted, in order to avoid losing references in tickets or other areas like subscriptions. \n\t<ul>\n<li aria-setsize=\"-1\" data-aria-level=\"1\" data-aria-posinset=\"1\" data-font=\"Symbol\" data-leveltext=\"\" data-listid=\"16\" role=\"listitem\">\n<p>When deleting a federated record through the Service Management UI, the CI is also deleted in UCMDB.  </p>\n</li>\n<li aria-setsize=\"-1\" data-aria-level=\"1\" data-aria-posinset=\"2\" data-font=\"Symbol\" data-leveltext=\"\" data-listid=\"16\" role=\"listitem\">\n<p>When deleting a CI in UCMDB, the record is also deleted in Service Management. </p>\n</li>\n</ul>\n</li>\n</ul>\n<h2>Service modeling </h2>\n<p>You can now create end-to-end service models by leveraging the powerful UCMDB relationship capabilities. The start of a service model is typically an Actual Service as documented in <a href=\"/doc/423/26.1/sacmmodel\" rel=\"noreferrer noopener\" target=\"_blank\" title=\"Service Asset and Configuration Management model\">SACM Model</a>. The general SACM model is still fully supported, but the way to create the service model is different. </p>\n<p>We recommend that you create the logical elements of a service model like Business Services, Infrastructure Services, or Service Components directly in Service Management through UI or business rules.  </p>\n<p>Devices and System Elements are typically physical elements that are discovered or imported. <br/>\n<br/>\nIf required, you can create your own templates in UCMDB for the Assisted Service Modelling function.  </p>\n<p>To build an end-to-end topology, it's required to connect the logic with the physical elements. To do so, you can use the Assisted Service Modelling feature from the UCMDB browser. The UCMDB browser is directly accessible from the Service Management UI by using the “Explore” functionality.  </p>\n<p><strong>Note:</strong> You need to have the <strong>Enable 'Explore' in CI details</strong> permission enabled in the user role. For details about how to enable this permission, see <a href=\"/doc/423/26.1/pplroles\" title=\"Roles\">Roles</a>.</p>\n<p>In Assisted Service Modelling, you can easily link the different components together by using the “Simple Business Application” template. Click the “+” button to select existing data. <br/>\n<br/>\n<strong>Note:</strong> In Assisted Modeling, you can configure an Owner for the Service, however, this isn't synchronized with the Owner in Service Management.  Therefore, Owner and Location need to be separately maintained in Service Management and in the UCMDB if they are needed on both sides.<br/>\n<br/>\nFor more information, see <a href=\"/doc/401/2023.05/ubassistmodel\" title=\"Assisted Modeling\">Assisted Modeling</a>.  <br/>\n<br/>\nAnother option to build relationships is the usage of Studio business rules. The following three relationships can be created or deleted using business rules: </p>\n<ul role=\"list\">\n<li aria-setsize=\"-1\" data-aria-level=\"1\" data-aria-posinset=\"1\" data-font=\"Symbol\" data-leveltext=\"\" data-listid=\"19\" role=\"listitem\">\n<p>Composition </p>\n</li>\n<li aria-setsize=\"-1\" data-aria-level=\"1\" data-aria-posinset=\"2\" data-font=\"Symbol\" data-leveltext=\"\" data-listid=\"19\" role=\"listitem\">\n<p>Containment </p>\n</li>\n</ul>\n<ul role=\"list\">\n<li aria-setsize=\"-1\" data-aria-level=\"1\" data-aria-posinset=\"1\" data-font=\"Symbol\" data-leveltext=\"\" data-listid=\"19\" role=\"listitem\">\n<p>Usage </p>\n</li>\n</ul>\n<p>For more details, see <a href=\"/doc/423/26.1/nativesacmstudio\" title=\"Configure Native SACM with Studio\">Configure Native SACM with Studio</a>. </p>\n<h2>Related CIs, CI relationships, and Impact Analysis </h2>\n<p>With Native SACM enabled, the CI relationships of Actual Service, Device, Service Component, and System Element records are federated between Service Management and UCMDB. That is, whenever you modify the CI relationship of one of these four records in either UCMDB or Service Management, the change will be instantly synchronized to the other system.<br/>\n<br/>\nUsing the Native SACM solution, all relationships among these CIs are managed directly in UCMDB with the standard procedures UCMDB offers. Please be aware that this might impact your existing integrations or BI syncs that utilize the relationship information from Service Management,these relationships are now stored in UCMDB instead and you will have to adjust your existing logic. </p>\n<h2>Native SACM limitations</h2>\n<p>Currently, Native SACM has the following limitations:</p>\n<ul>\n<li>User Options and federated SACM attributes can't be displayed together in the Request, Incident, Change, and Release record lists.</li>\n<li>Service Management customized enum values can't map to UCMDB enums unless UCMDB enum values are exactly the same as Service Management ones, including case sensitivity. </li>\n<li>After NSACM is enabled, CI relationships are no longer saved in associations. Instead, they are synchronized from UCMDB. Therefore, all local CI relationships saved as associations (e.g., SystemElementContainsDevice of Device) before Native SACM was enabled will become invalid even though the data still exists. We suggest that you don't use them in business rules. Similarly, CI relationships cannot be extracted through BI sync APIs.</li>\n<li>\"OR\" can't be used between a Service Management local field and a federated field in a CI query condition at the REST API level, it can only be used between two Service Management local fields or two federated fields. \n\t<ul>\n<li><strong>Supported:</strong> Both attributes are in the Service Management database<br/>\n<code>/ems/Device?layout=Id,SerialNumber,HostName,DisplayLabel&amp;filter=(DisplayLabel='serv02sd059' or SubType='Server')</code></li>\n<li><strong>Supported:</strong> Both attributes are federated attributes (in UCMDB)<br/>\n<code>/ems/Device?layout=Id,SerialNumber,HostName,DisplayLabel&amp;filter=(OsName='win2019' or SerialNumber='HP77SDFSDF')</code></li>\n<li><strong>Unsupported:</strong> One attribute in the Service Management database (DisplayLabel) and one federated attribute (SerialNumber)<br/>\n<code>/ems/Device?layout=Id,SerialNumber,HostName,DisplayLabel&amp;filter=(DisplayLabel='serv02sd059' or SerialNumber='HP77SDFSDF')</code></li>\n</ul>\n</li>\n</ul>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}