{
  "title": "Create or edit a flow",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>A flow is a composition of steps that forms a set of actions that are linked by decision-making logic in order to automate tasks. For example: Health checks, troubleshooting, remediation, or any other repetitive IT tasks.</p>\n<p>Creating flows is the main function of OO Workflow Designer</p>\n<p>You can also display and edit a flow that was created externally from OO Workflow Designer, for example in ATOM. However, if the flow contains errors, OO Workflow Designer may not be able to display it in the Authoring pane. In such a case, you will need to fix the flow in the editor in which it was created and import it to OO Workflow Designer again.</p>\n<h2 class=\"mw-headline\" id=\"Naming_flows\">Naming flows</h2>\n<p>The name of a flow is limited to 128 characters.</p>\n<p>The combined name and path of a flow (under the <b>Library</b> folder) is limited to 220 characters.</p>\n<p>Names must be unique within their folders.</p>\n<p>Names are not case-sensitive, so names such as \"Ping\" and \"ping\" are considered duplicates. However, when calling an item, make sure to use the correct case.</p>\n<p>Flow names must contain alphanumeric characters (A-Z, a-z, 0-9), hyphens ( - ), and underscores ( _ ).</p>\n<p>Flow names cannot contain white spaces, parentheses ( () ), square brackets ( [] ), curly braces ( {} ), and only digits (0-9).</p>\n<p>Names cannot be identical to the following Windows reserved words: <b>CON</b>, <b>PRN</b>, <b>AUX</b>, <b>CLOCK$</b>, <b>COM1</b>, <b>COM2</b>, <b>COM3</b>, <b>COM4</b>, <b>COM5</b>, <b>COM6</b>, <b>COM7</b>, <b>COM8</b>, <b>COM9</b>, <b>NUL</b>, <b>LPT1</b>, <b>LPT2</b>, <b>LPT3</b>, <b>LPT4</b>, <b>LPT5</b>, <b>LPT6</b>, <b>LPT7</b>, <b>LPT8</b>, <b>LPT9</b> .</p>\n<h2 class=\"mw-headline\" id=\"Create_a_new_flow\">Create a new flow</h2>\n<p>To create a flow:</p>\n<ol>\n<li>In the <b>Projects</b> pane, select the folder in which you want to locate the new flow.</li>\n<li>\n<p>Click the <b>New</b><a class=\"image\" href=\"/file/images/0/0d/2018.02/OO_Designer/but_add_arrow.png\" title=\"/file/images/0/0d/2018.02/OO_Designer/but_add_arrow.png\"> <img alt=\"but add arrow.png\" decoding=\"async\" height=\"29\" src=\"../../../images/but_add_arrow_a21ac586.png\" width=\"30\"/> </a> button and select <b>Flow</b>.</p>\n</li>\n<li>\n<p>In the <b>New Flow</b> dialog box, enter a name for the flow and click <b>OK</b>.</p>\n<p>When naming a flow, make sure the naming conventions are followed. To change a flow name, copy it as a new flow with the correct name.</p>\n<p>A new tab opens in the <b>Authoring</b> pane with the name of the new flow.</p>\n</li>\n<li>\n<p>Click <b>PROPERTIES</b> to display the flow's <b>Properties</b> pane.</p>\n</li>\n<li>\n<p>Click the <b>Description</b> tab to enter a summary of what the flow does.</p>\n</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}