{
  "title": "Notification history",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>When the email notification is triggered for a record, the notification history and detailed information will be available on the <strong>History </strong>page of this record. This is available for all agent users, not only for tenant admin users.</p>\n<p>If you are a tenant admin and want to view all notification history events, you may go to the <strong>Notification History</strong> UI. When the associated record of a notification event is deleted, the notification event and event details are also deleted.</p>\n<p>Tenant admins can use the notification history capability to view email notification events sent by Service Management. It allows the tenant admin to view the recipient details of each notification event and the notification template used by the notification service to send the email.</p>\n<p>Notification history doesn't capture notifications not associated with a tenant, for example, emails generated during user account activation.</p>\n<p>To view the <strong>Notification History</strong> UI, go to <strong>Administration </strong>&gt; <strong>Utilities </strong>&gt; <b>Notification History</b>.<b> </b>To show the <strong>Notification History</strong> menu item, the tenant admin must turn on <strong>Enable Notification History</strong> in <strong>Administration</strong> &gt; <strong>Configuration</strong> &gt; <strong>Application Settings</strong>.</p>\n<p>The <strong>Notification History</strong> tab includes the following pages:</p>\n<ul>\n<li>Notification history events page: This page lists all notification events.</li>\n<li>Notification history event detail page: This page shows the details of a selected notification event.</li>\n</ul>\n<h2>Notification history events page</h2>\n<p>The notification history events page comprises the following fields:</p>\n<ul>\n<li><strong>Edit views</strong>: You can use the OOTB views or create and manage your own views.</li>\n<li><strong>Filters</strong>: You can click  <a class=\"image\" href=\"/file/images/c/cb/2018.08_Helpcenter/Resources/Images/Icons/FilterByIcon.png\" title=\"/file/images/c/cb/2018.08_Helpcenter/Resources/Images/Icons/FilterByIcon.png\"> <img alt=\"FilterByIcon.png\" decoding=\"async\" height=\"18\" src=\"../../../images/FilterByIcon_8e3dccb1.png\" width=\"19\"/> </a>  and select any option to filter the data. For example, you can filter the events based on Creation Time, Id, Last Update Time, Parent Id, Parent Type Id, Record Id, Record Type, Sent Time, and Status.</li>\n<li><strong>Group by</strong>: You can group the notification events based on Creation Time, Id, Last Update Time, Parent Id, Parent Type Id, Record Id, Record Type, Sent Time, and Status. You can select a primary, secondary, or tertiary field to group the events.</li>\n<li><strong>Columns</strong>: You can customize your view based on Id, Record Id, Record Type, Subject, Sent Time, and Status. </li>\n<li><strong>Export</strong>: You can export the notification history events to CSV or XLS format. You can also send the notification history events by email.</li>\n<li><strong>Details</strong>: You can view the details page of a selected event.</li>\n<li><strong>Refresh</strong>: You can refresh the page.</li>\n</ul>\n<p>A notification history event can have either a Success, Failed, or Partial Success status. Success implies that the notification service has sent the email successfully to all the recipients. Failed implies that the notification service failed to send the email to any of the recipients. Partial Success implies that the notification service sent the email only to some recipients.</p>\n<h2>Notification history event detail page</h2>\n<p>The notification history event details page comprises the <strong>General </strong>tab and the <strong>Resending history</strong> tab. The <strong>Resend all failed events</strong> option is available on the top of the notification history event details page when there exists failed events under <strong>Recipients</strong>.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">On Entity History page, the entity history shows the status of the notification along with the View Details page link.</div>\n</div>\n<h3>General</h3>\n<p>Under the <strong>Detail</strong> section, you can see the record ID, record type, status of the notification event, subject of the notification email, timestamp of the notification event, and the email template used to send the notification email.</p>\n<p>You can also see a list of email recipients under <strong>Recipients</strong>. The recipient list shows the event Id, recipients' name and email, status, and failure reason. If the notification service sends the email to a group, you will see the group name and email listed under <strong>Recipients</strong>. The recipient grid of notification history only shows the recipients listed in the \"To\" field of the email.</p>\n<p>The <strong>Recipients</strong> section has a status column that indicates whether the notification service has sent an email to a specific recipient successfully. If the notification service has sent the email successfully to a recipient, the status for that recipient is Success. If the notification service failed to send the email to a recipient, the status for that recipient is Failed, and the <strong>Failure Reason </strong>column displays an error message. Note that the status only reflects whether Service Management was able to send the email through the SMTP server configured for the tenant. It doesn't guarantee that the recipient has received the email. </p>\n<h3>Resending history</h3>\n<p>After you resend the failed events, the system records the details under the <strong>Resending history</strong> page, which comprises the following information:</p>\n<ul>\n<li><b>Resent by</b>: The user who triggers the resending action.</li>\n<li><strong>Resent on: </strong>The date and time when the user triggers the resending action.</li>\n<li><strong>Details: </strong>The result of this resending action: Success or Failed. If the resending was failed, you may also find the error message in the <strong>Details </strong>field.</li>\n</ul>\n<h3></h3>\n<div></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}