{
  "title": "Notifications",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Notifications are pre-formatted email messages that the system sends when certain workflow events or business rule conditions occur. The administrators can define which notifications are sent for such specific events.</p>\n<h2>Work with notification templates</h2>\n<p>the system sends notifications based on predefined notification templates. Notification templates contain the structure for each type of message. You can add, update, or delete any template for an email notification if you have administration permissions. Each template contains the information that the recipient needs to know when the workflow triggers the email to be sent.</p>\n<p>For example, a template for a new incident notification includes all the details of a new incident. Service Management sends this email when the recipient is the owner of the new incident, or belongs to the assignment group that owns the new incident. A template for an impending SLT breach contains information about the service target and the amount of time that remains until the breach occurs.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> Before sending an email notification, the system validates that the submitter has permission to view the record for which the message is being sent.</p>\n</div>\n<p class=\"mw-headline\">For instructions on how to work with notification templates, see <a href=\"/doc/423/26.1/workwithnotificationtemplates\">Work with notification templates</a>.</p>\n<h2 class=\"mw-headline\">Customize notification events</h2>\n<p>Administrators can customize the list of events named <strong>Notification event names</strong> in the Lists module. For details, see <a href=\"/doc/423/26.1/listsmgmt#EditList\" title=\"SMAX:25.1/listsMgmt\">Edit a list</a>. </p>\n<h2 class=\"mw-headline\">Enable user notification preferences in application settings</h2>\n<p>To allow users to set notification preferences, the tenant admin must make sure that the <strong>Enable user notification preferences</strong> option is set to On under <strong>Administration</strong> &gt; <strong>Configuration</strong> &gt; <strong>Application Settings</strong>.</p>\n<p>Only when this option is <strong>On</strong>, the <strong>Notification settings</strong> section is available under each agent's user profile. If this option is <strong>Off</strong>, this section is hidden.</p>\n<p><a class=\"image\" href=\"/file/images/3/35/SMA_202108_user_profile_notification_settings.png\" title=\"/file/images/3/35/SMA_202108_user_profile_notification_settings.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/3/35/SMA_202108_user_profile_notification_settings.png\" height=\"253\" hspace=\"0\" src=\"../../../images/SMA_202108_user_profile_notification_settings_30aee7aa.png\" style=\"width:495px;height:253px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"495\"/> </a></p>\n<h2 class=\"mw-headline\">Set user notification preferences</h2>\n<p>Agents can customize when they want to receive these notifications from their user profile, by specifying work status and/or ticket priority. For details, see <a href=\"/doc/423/26.1/profilepreferences#Notification_settings\">Profile and preferences &gt; Notification settings</a>.</p>\n<h3>Settings in a notification template</h3>\n<p>In addition to user notification preferences, the following settings in a notification template also affect what notifications a user can receive:</p>\n<p><a class=\"image\" href=\"/file/images/f/f1/SMA_202108_notification_template_settings.png\" title=\"/file/images/f/f1/SMA_202108_notification_template_settings.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/f/f1/SMA_202108_notification_template_settings.png\" height=\"81\" hspace=\"0\" src=\"../../../images/SMA_202108_notification_template_settings_fca7ce22.png\" style=\"width:766px;height:81px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"766\"/> </a></p>\n<ul>\n<li>Use group email\n\t<p>If the <b>Use group email</b> check box is selected in the notification template, the system sends the notification to the group email, rather than to each group member individually. It's relevant when a group is selected for the <b>recipients</b> parameter in the <b>Send notification</b> business rule. If no group email is defined for the selected group, the notification is sent to each group member individually. </p>\n<p>This setting overrides each agent user's notification preference setting under their user profile. That is, a user may still receive notifications about records that are assigned to the user's group even if the user hasn't selected the \"Assigned to group\" notification event in the user profile.</p>\n<p>Example:</p>\n<ul>\n<li>Group A has 3 group members: m1, m2, and m3.</li>\n<li>User notification preferences: m1 doesn't select the <strong>Assigned to group</strong> event for Request, and m2 and m3 select all events for Request.</li>\n<li>There is a notification business rule defined in the Request workflow to notify the assignment group.</li>\n</ul>\n<p>Then, the following behavior applies when you assign a request to group A:</p>\n<ul>\n<li>If the notification template has <strong>Use group email</strong> checked and there is a group email such as “groupa-pdl@domain.com” set in the Group record: The group PDL ( all of m1, m2 and m3)  will receive the notification email.</li>\n<li>If the notification template has <strong>Use group email</strong> checked but there's no group email specified in the Group record: m2 and m3 will receive the notification email, but m1 won't.</li>\n<li>If the notification template has <strong>Use group email</strong> unchecked, no matter whether there is a group email set in the Group record or not: m2 and m3 will receive the notification email, but m1 won't.</li>\n</ul>\n</li>\n<li>\n<p>Enable agent notification preferences</p>\n<p>The <strong>Enable agent notification preferences</strong> check box controls what events will appear in the notification settings section of the user preferences page. For example, as long as one notification template for Request has this check box selected along with the <strong>Assigned to me</strong> event, the <strong>Assigned to me</strong> event appears in the Request section in the user preferences page, as shown in the following figure.</p>\n<p><a class=\"image\" href=\"/file/images/3/3c/SMA_202108_notification_preferences.png\" title=\"/file/images/3/3c/SMA_202108_notification_preferences.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/3/3c/SMA_202108_notification_preferences.png\" height=\"193\" hspace=\"0\" src=\"../../../images/SMA_202108_notification_preferences_0847080b.png\" style=\"width:482px;height:193px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"482\"/> </a></p>\n</li>\n</ul>\n<h2 class=\"mw-headline\">Notification frequency</h2>\n<p>Notifications that are manually triggered (for example, notifications triggered by the <strong>Send by Email</strong> button and the <strong>Reset Password</strong> button) have a frequency limit. Specifically, if you try to trigger the same notification more than three times a minute, some emails won't be sent. </p>\n<h3>Limits that trigger email notifications</h3>\n<p>The system limits the number of messages you can send and the number of recipients per message within one minute. The limits help prevent the overconsumption of system resources and keep the account safe. Notifications will be triggered when the account reaches any one of the following limits. </p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<thead>\n<tr>\n<th scope=\"col\">Feature</th>\n<th scope=\"col\">Limit per minute</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Message rate limit </td>\n<td>6</td>\n</tr>\n<tr>\n<td>Recipient rate limit </td>\n<td>10</td>\n</tr>\n<tr>\n<td>Sender-recipient pair limit</td>\n<td>4</td>\n</tr>\n</tbody>\n</table>\n<h4>Message rate limit</h4>\n<p>This limit applies to the number of messages you send per minute. You can send up to six messages to one recipient, or one message to up to six recipients. Not all addresses in the <strong>To</strong>, <strong>Cc</strong> and <strong>Bcc</strong> fields are included in the count of recipients per message. The system counts recipients in the order of priority: <strong>To</strong> &gt; <strong>Cc</strong> &gt; <strong>Bcc</strong>. For example, if you have one address in the <strong>To</strong> field, five in the <strong>Cc</strong>, and ten in the <strong>Bcc</strong>, that counts as one recipient. If the <strong>To</strong> field is empty, only five addresses in the <strong>Cc</strong> and ten in the <strong>Bcc</strong>, that counts as five recipients.</p>\n<h4>Recipient rate limit</h4>\n<p>This limit applies to the number of messages you receive from any resources per minute. You can receive up to ten messages in one minute. Note that messages sent to the account beyond this limit cannot be recovered. The system will automatically drop those messages as they pass through, so they will not be queued to wait for the next delivery. Once the limit is reset, you can receive new incoming messages again.</p>\n<h4>Sender-recipient pair limit</h4>\n<p>This limit applies to the number of messages you send to a single recipient per minute. If the same recipient appears in four of the messages you sent in one minute, you cannot send another message to that recipient until the next minute.<br/>\n </p>\n<h2 class=\"mw-headline\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/workwithnotificationtemplates\">Work with notification templates</a></li>\n<li><a href=\"/doc/423/26.1/profilepreferences\">Profile and preferences</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}