{
  "title": "Service modeling in Native SACM",
  "content": "<div class=\"mw-parser-output\"><br/><p xml:lang=\"EN-US\"><span style=\"font-size: 14px;\">The Service Asset and Configuration Management (SACM) model is a framework to define, manage, and track all the individual components that support your organizational business services. Each hierarchical level in the model is a container for one or more components. The hierarchy includes Actual Service, Service Component, Device, and System Element. </span></p>\n<h2>SACM model hierarchy</h2>\n<ul>\n<li><strong>Actual Service</strong> <br/>\n\tThe Actual Service record type in Native SACM is mapped to the Service CI type in UCMDB. An Actual Service is an instance of a service that benefits end users. It might be a business service or an infrastructure service. Typical examples of an Actual Service are the Payroll and Employee services, which manage the payroll and employee systems in HR management.\n\t<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"> </div>\n<div class=\"admonition-content admonition-note-content\">The Actual Service record type can represent either a business service or an infrastructure service. This is determined by setting the appropriate value (<strong>business-service</strong> or <strong>infrastructure-service</strong>) in the Actual Service’s subtype attribute. Business services can be used directly by business customers, while infrastructure services usually can't. Instead, infrastructure services support business services in the backend (for example, database services). </div>\n</div>\n\t </li>\n<li><strong>Service Component </strong><br/>\n\tThe Service Component record type in Native SACM is mapped to the Business Application CI type in UCMDB. A Service Component represents the second-level business service logic or subsystem to support the high-level Actual Service. For example, an HR - Web Server Service Component could be defined to support the high-level Payroll or Employee services. </li>\n<li><strong>Device </strong><br/>\n\tThe Device record type in Native SACM is mapped to the Node CI type in UCMDB. A Device represents either physical or virtual configurable items that can be discovered or  created as UCMDB nodes to support high-level Actual Services or Service Components. For example, a smartphone, laptop, network device, server, or storage device. The Device subtype ENUM field sets the type of device represented. For the example, more than one independent server can be discovered and defined as the devices to support the HR - Web Server Service Component. </li>\n<li><strong>System Element</strong> <br/>\n\tThe System Element record type in Native SACM is mapped to the Application Resource, Application System, Cloud Service, and Running Software CI types in UCMDB. A System Element represents a specific software application that fulfills high-level Actual Service or Service Component usage. The System element subtype ENUM field sets the type of system element represented. For the example, one or more apache tomcat servers can be discovered on specific Device host to fulfill the HR - Web Server Service Component. </li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"> </div>\n<div class=\"admonition-content admonition-note-content\">Service Management has OOB business rules to initialize the subtypes for incoming CIs from UCMDB, especially for Devices and System Elements. For more information, see <a href=\"/doc/423/26.1/nativesacmfunction#UCMDB_CI_type_to_Service_Management_Subtype\" title=\"UCMDB CI type to Service Management Subtype\">UCMDB CI type to Service Management Subtype</a>. </div>\n</div>\n<h2>CI relationships</h2>\n<p>In contrast to the legacy SACM model (where there are only hardcoded \"Containment\" or \"Usage\" CI relationships defined as M2M links between different Configuration Items), in Native SACM all CI relationships are determined by UCMDB. This approach is more accurate and specific, and broader than only \"Containment\" and \"Usage\" relationships. Service Management users can manage CI relationships between different CIs. For example, it is especially useful to create and manage the CI relationship between logical CIs (Actual Service and Service Component) and physical CIs (Device and System Element) by using the service modeling widget in Service Management. </p>\n<p>The following example of service modelling shows an HR system including Payroll and Employee.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"Service modeling widget\" height=\"364\" src=\"../../../images/nsacmservicemodeling1_b85b7a73.png\" width=\"800\"/> </a></div>\n<h2>How to build the model: top-down and UCMDB auto-discovery</h2>\n<ol>\n<li>All Devices, System Elements (for example, Running Software), and related CI relationships are auto-discovered. We recommend that you keep this and not change it. <br/>\n<a class=\"image\" href=\"\"> <img alt=\"All device and system elements and related CI relationships are auto discovered\" height=\"138\" src=\"../../../images/nsacmservicemodeling2_be871c0d.png\" width=\"800\"/> </a></li>\n<li>To create the CI relationship from Employee and Payroll to their respective child Service Components, you can select the suitable CI relationship in the Service Modeling widget. For example, from Payroll or Employee to HR Web Server. <br/>\n<a class=\"image\" href=\"\"> <img alt=\"Creating a CI relationship from Employee\" height=\"270\" src=\"../../../images/nsacmservicemodeling3_8c7cb600.png\" width=\"500\"/> </a><br/>\n<a class=\"image\" href=\"\"> <img alt=\"Creating a CI relationship from Payroll\" height=\"260\" src=\"../../../images/nsacmservicemodeling4_cdb3bf4e.png\" width=\"500\"/> </a></li>\n<li>To create CI relationships from each Service Component to its supported host Device(s), you can select the suitable CI relationship in the Service Modeling widget. For example, from HR Web Server to Server 050 and Server 051. However, don't create CI relationships directly to System Element (Running Software) as this is managed automatically by UCMDB discovery. <br/>\n<a class=\"image\" href=\"\"> <img alt=\"Creating a CI relationship from a service component to its supported host devices\" height=\"608\" src=\"../../../images/nsacmservicemodeling5_4e5f751f.png\" width=\"500\"/> </a><br/>\n<a class=\"image\" href=\"\"> <img alt=\"Creating a CI relationship from a service component to its supported host devices\" height=\"605\" src=\"../../../images/nsacmservicemodeling6_abf776d6.png\" width=\"500\"/> </a><br/>\n<a class=\"image\" href=\"\"> <img alt=\"Creating a CI relationship from a service component to its supported host devices\" height=\"612\" src=\"../../../images/nsacmservicemodeling7_81e696be.png\" width=\"500\"/> </a><br/>\n<a class=\"image\" href=\"\"> <img alt=\"Creating a CI relationship from a service component to its supported host devices\" height=\"601\" src=\"../../../images/nsacmservicemodeling8_b140d3e9.png\" width=\"500\"/> </a></li>\n</ol>\n<h2>Related topics</h2>\n<p><a href=\"/doc/423/26.1/nativesacmcirelation#Service_modeling\" title=\"Service modeling\">Service modeling</a></p>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}