{
  "title": "Dev2Prod - Task plan business rules of an offering bundle are skipped during import",
  "content": "<div class=\"mw-parser-output\"><p>During a Dev2Prod import, the task plan business rules of an offering bundle are skipped, and a warning that resembles the following is displayed:<br/>\n<a class=\"image\" href=\"\"> <img alt=\"SMA_202011_dev2prod_offering_bundle_skipped\" border=\"0\" file=\"/mediawiki/images/1/14/SMA_202011_dev2prod_offering_bundle_skipped.png\" height=\"223\" hspace=\"0\" src=\"../../../images/SMA_202011_dev2prod_offering_bundle_skipped_82dd9a92.png\" style=\"width: 800px; height: 223px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<h2>Cause 1</h2>\n<p>During import, the Package Manager doesn't convert an offering ID (such as [Id='12263']) in a business rule to a unique ID in the target tenant, so it can't find the offering in the target tenant. </p>\n<p>In this example, the offering bundle defines user option mappings (Bundled offerings &gt; Set user option mappings); tasks are created in the Task plan tab. Each task contains a business rule that references the ID of the corresponding bundled offering. The following is an example:</p>\n<pre><code>Description: ${entity.RequestsOffering.OfferingBundlesToOfferings[Id='12263'].Description}\n</code></pre>\n<p>Although the package manager creates the task plan for the target tenant, the tasks can't be associated with an offering with a unique ID for the target tenant. </p>\n<h2>Solution 1</h2>\n<p>Manually set the user option mappings of the offering bundle in the target tenant. </p>\n<h2>Cause 2</h2>\n<div>During import, the Package Manager doesn't convert an offering ID in a business rule to a unique ID in the target tenant when multiple offering IDs have the same display label.</div>\n<div>In this example, the offering's Task Plan business rule \"Create a new record\" defines Offering mapping for the new Record (Request); however, the target tenant already has multiple offerings with the same Display Label.</div>\n<div><a class=\"image\" href=\"\"> <img alt=\"DisplayLabel\" height=\"75\" src=\"/file/images/423/25.4/DuplicateDisplaylabel.png\" width=\"589\"/> </a></div>\n<div>While the package manager generates the task plan for the target tenant according to this business rule, the tasks cannot be linked to an offering with a unique ID for the target tenant.</div>\n<p><span style=\"font-size: clamp(1.59375rem, 18.7895px + 1.39803vw, 2.125rem); color: rgb(22, 22, 22);\">Solution  2</span></p>\n<p><span>You can do any of the following to resolve the issue:</span></p>\n<ul>\n<li>Make sure offerings have distinct display labels.</li>\n<li>Once the import is successfully finished (with a warning), manually update the business rules referring to the Offering.</li>\n</ul>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}