{
  "title": "Change OO Database Maintenance Job retention interval",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>What is OO database maintenance job At install time, OO helm chart deploys a cron-job set to run every day at 00:00, whose purpose is to keep the size of the OO database under control, by purging the OO flow execution run data. </p>\n<p>By default, this job purges all <strong>OO run data older than 365 days</strong>. However, in some cases this data retention interval might not be sufficient in order to keep the OO database size under control.</p>\n<p>For example, the following factors can lead to a faster database size increase:</p>\n<ul>\n<li>OO runs heavy flows (flow inputs/outputs are processing dozens or hundreds of MBs of data).</li>\n<li>OO runs dozens, hundreds or more flows on a daily basis.</li>\n<li>A mix of the above</li>\n</ul>\n<p>In such cases, the retention interval of this job can be adjusted, so that only more recent OO data is retained in the database.  Change retention interval</p>\n<p>Perform the following steps in order to reconfigure the OO data retention interval in OO database maintenance job:</p>\n<ol>\n<li>Copy and save the following as <strong>oo_data_retention_config.yaml</strong>\n<pre>global:\n  deploymentType: install\n\noodata-maintenance-and-export:\n  deployment:\n    data:\n      # Specify the amount of days the OO run data is retained in the database\n      # - possible values: multiples of 14 (28, 42, 56, etc), minimum 28\n      <strong>retentionDays</strong>: </pre>\n</li>\n<li>Provide the desired retention interval at key index <em>retentionDays</em>\n<ul>\n<li>Possible values: multiples of 14 (28, 42, 56, etc), minimum 28</li>\n</ul>\n</li>\n<li>Run the following command on the control plane node / bastion host:\n\t<pre>helm upgrade &lt;oo_installation_name&gt; -n &lt;oo_namespace&gt; --reuse-values -f /path/to/oo_data_retention_config.yaml /path/to/oo-helm-chart.tgz</pre>\n\tWhere:\n\n\t<ul>\n<li><code>&lt;oo_installation_name&gt;</code> - the helm name of the OO chart installation, you can obtain this by running the command: <code>sudo helm list -n &lt;oo_namespace&gt;.</code></li>\n<li><code>&lt;oo_namespace&gt;</code> - the namespace where OO chart is installed.</li>\n<li><code>/path/to/oo_data_retention_config.yaml</code> - path fo the previously created <em>oo_data_retention_config.yaml</em> file.</li>\n<li><code>/path/to/oo-helm-chart.tgz</code> - the absolute to the OO helm chart archive which was last used with the OO installation.\n\t\t<ul>\n<li><strong>Notes: </strong>\n<ul>\n<li>If you have deployed a patch OO helm chart on top of the existing OO installation, then provide the path to the patch OO helm chart archive, and not to the initial OO chart.</li>\n<li>Additionally, if you have multiple patches deployed, then provide the path to the latest patch OO helm chart archive. </li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}