{
  "title": "Set up encryption for an Operations Orchestration integration",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>When working with sensitive customer data such as passwords, Service Management protects the data using asymmetric encryption. The sensitive data is encrypted with a public key provided by the customer. The private key is stored by the On-Premises Bridge agent at the customer site. To enable the encryption, you should follow this process:</p>\n<ol>\n<li>Generate a pair of public and private keys, using the key generation script provided in the On-Premises Bridge agent installation.</li>\n<li>Copy the content of the public key and paste it into the Service Management user interface.</li>\n<li>Import the key pair in all On-Premises Bridge agents to enable the decryption, using the import script provided in the On-Premises Bridge agent installation.</li>\n</ol>\n<p>Service Management provides scripts to generate public and private encryption keys and import them to the agent machine. This implements encryption between Service Management and the <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> agent, and ensures the security of the fields that are defined as encrypted in the original Operations Orchestration flow.</p>\n<ol>\n<li>\n<p>Generate the encryption keys.</p>\n<p>In the <b>C:\\ProgramData\\MicroFocus\\On-Premises Bridge Agent\\product\\util\\opb</b> directory on the <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> agent machine, run the following script:</p>\n<p>rsa_key_gen.bat</p>\n<p>The script generates a public key, <b>id_rsa.pub</b>, and a private key, <b>id_rsa.priv</b>. The keys are located in the same directory by default.</p>\n<p>There is an option to define a source of randomness when generating the keys, by adding the <b>seed</b> parameter and a character string of any length. For example:</p>\n<p>rsa_key_gen.bat -seed vb2FK8jgPTWefPOmkrAv/o44jOoYCsYu0k3Z</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span>  </p>\n<ul>\n<li>You only need to run the script once, on one agent machine, even if you are working with multiple <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> agents.</li>\n<li>\n<p>If you prefer, you can generate the public and private key pair using a different tool, instead of the script provided by Service Management. The tool must support 2048-bit encryption according to the RSA PKCS1 standard (RFC 3447). For more information, refer to the Public-Key Cryptography Standards website.</p>\n</li>\n<li>\n<p>If you are using a seed parameter to include randomness, make sure to use a random seed for each deployment to generate strong encryption keys and protect the seed parameter in a secure location.</p>\n</li>\n</ul>\n</div>\n</li>\n<li>\n<p>Enter the public key in Service Management.</p>\n<ol start=\"1\">\n<li>\n<p>From the <span class=\"SAW_VariablesMain_menu\" style=\"font-weight: bold;\">main menu</span>, select <b>Administration &gt; Utilities &gt; Integration</b>. Click the <b>Agents</b> tab.</p>\n</li>\n<li>\n<p>Click <b>Set encryption key</b>.</p>\n</li>\n<li>\n<p>Copy the public key you created, <b>id_rsa.pub</b>, and paste it into the <b>Encryption key</b> dialog box.</p>\n</li>\n<li>\n<p>Click <b>Save</b> to save the key.</p>\n</li>\n</ol>\n</li>\n<li>\n<p>If you are working with multiple <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> agents, copy the encryption keys to each agent machine.</p>\n</li>\n<li>\n<p>Import the encryption keys on the <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> agent machine(s).</p>\n<p>In the <b>C:\\ProgramData\\MicroFocus\\On-Premise Bridge Agent\\product\\util\\opb</b> directory on the <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> agent machine, run the following script using the keys as the parameters:</p>\n<p>import_rsa_keys.bat -pub id_rsa.pub -priv id_rsa.priv</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> You must run this script on each <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> agent machine.</p>\n</div>\n<p>After you import the keys, restart the <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> agent service.</p>\n</li>\n<li>For security purposes, delete the key files from the <b>C:\\ProgramData\\MicroFocus\\On-Premise Bridge Agent\\product\\util\\opb</b> on each agent machine. Save a copy of the keys in a secure location.</li>\n<li>\n<p>Ensure that you have permission to view the Encryption key.</p>\n<p>Your administrator should follow this procedure:</p>\n<ol start=\"1\">\n<li>Go to <b>Administration &gt; Master Data &gt; People &gt; Roles</b>.</li>\n<li>Select the user's role.</li>\n<li>Under Resources, click <a class=\"image\" href=\"/file/images/7/79/2018.08_Helpcenter/Resources/Images/EM/emAddIcon.png\" title=\"/file/images/7/79/2018.08_Helpcenter/Resources/Images/EM/emAddIcon.png\"> <img alt=\"emAddIcon.png\" data-file-height=\"25\" data-file-width=\"26\" height=\"25\" src=\"../../../images/emAddIcon_4cbadfc2.png\" width=\"26\"/> </a> <b>Add</b>.</li>\n<li>In the Add permission dialog box, select <b>EncryptionKey</b> from the drop-down list.</li>\n<li>Select <b>View</b> and click <b>OK</b>.</li>\n<li>Save the role.</li>\n</ol>\n</li>\n<li>\n<p>Encryption is now enabled. You can proceed with the Operations Orchestration integration.</p>\n<p>If you subsequently install a new <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> agent, you must copy the encryption keys to the new agent machine and run the import script on that agent.</p>\n</li>\n</ol>\n<div class=\"Admonition_Caution\">\n<p><span class=\"autonumber\">Caution</span> If you want to change the key after encryption has been enabled, repeat the procedure from the beginning to generate new keys. In this case, you must re-enter the data (passwords) previously encrypted with the old key to encrypt them again using the new public key.</p>\n</div>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/integrateoo\" title=\"SMAX:25.1/IntegrateOO\">Integration with Operations Orchestration</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}