{
  "title": "How to use On-Premises Bridge agents on Windows",
  "content": "<div class=\"mw-parser-output\"><br/>\n<h2>How to install and manage agents</h2>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">To install the On-Premises Bridge agent, you must have the following permissions:\n<ul>\n<li>Modify, read, write, and execute permissions in the On-Premises Bridge installation folder</li>\n<li>Permission to create the <b>OpbAgent</b> Windows service, and run <b>services.msc</b></li>\n<li>Permission to run <b>tasklist</b> and <b>taskkill</b> commands</li>\n</ul>\n</div>\n</div>\n<h3>Create an integration user</h3>\n<p>The OPB agent needs an integration user to connect to Service Management. You'll need to specify this integration user later when installing the OPB agent. </p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-important-icon\"></div>\n<div class=\"admonition-content admonition-important-content\">The On-Premises Bridge agent must use a dedicated integration user of the DB authentication type, and it can't use a federated user. Don't use an account user with the <strong>OPB Remote Agent</strong> role for the OPB agent, because the system doesn't allow any users with the <strong>OPB Remote Agent</strong> role to access either the agent interface or the Service Portal. See also <a href=\"/doc/423/26.1/opbsecurity\" title=\"On-Premises Bridge security additional information\">OPB Agent security additional information</a>.</div>\n</div>\n<p>Suite Admin can create an integration user with the following steps.</p>\n<ol>\n<li>Create a user in Suite Administration with the DB authentication type and the <b>Integration user</b> role.</li>\n<li>Activate the integration user from the activation email to set a password.</li>\n<li>Assign the <strong>OPB Remote Agent</strong> role to this user in Service Management.</li>\n</ol>\n<h3>Download and install the On-Premises Bridge Agent</h3>\n<p>You must download and install the On-Premises Bridge Agent before you can add an agent in Service Management. </p>\n<p>Note It's recommended to install the On-Premises Bridge on a dedicated server or VM in an established data center that has constant access to Service Management and the interfaced tool (for example, UCMDB or LDAP). For more information, see the OPB section in the \"System requirements\" topic.</p>\n<p>If you attempt to install the On-Premises Bridge agent on an unsupported operating system, the installer will quit with an <strong>Invocation Target Exception</strong> error.</p>\n<ol>\n<li>\n<p>Download the On-Premises Bridge Agent. <br/>\n\tFrom the main menu, select <b>Administration &gt; Utilities &gt; Integration</b>. The <b>Agents</b> page is displayed.<br/>\n\tClick <b>Download agent</b>, or click the download link in the <b>New agent</b> dialog box.</p>\n</li>\n<li>\n<p>To begin the installation, double-click the downloaded <b>opb-installation.exe</b> file.</p>\n</li>\n<li>\n<p>Select the installation language and click <strong>OK</strong> to continue.</p>\n</li>\n<li>\n<p>Read the recommendations on the <b>Introduction</b> page and click <b>Next</b> to continue.</p>\n</li>\n<li>\n<p>Accept the license terms on the <b>License agreement</b> page and click <b>Next</b> to continue.</p>\n</li>\n<li>\n<p>Select the folder where you are installing On-Premises Bridge on the <b>Choose installation folder</b> page.</p>\n<p>If you don't want to use the default folder, click <b>Choose</b> to select a different folder.</p>\n<p>When you are finished, click <b>Next</b> to continue.</p>\n</li>\n<li>\n<p>Complete the details on the <b>Setup authentication</b> page.</p>\n<table>\n<caption>Setup authentication fields and Descriptions</caption>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>User name</td>\n<td>\n<p>Enter the name of the integration user created. OPB will use this user to connect to Service Management. </p>\n</td>\n</tr>\n<tr>\n<td>Password</td>\n<td>\n<p>Enter the password of the integration user created. </p>\n</td>\n</tr>\n<tr>\n<td>Use proxy server</td>\n<td>\n<p>Select this option if you will be using a proxy server, and enter the following details:</p>\n<p><b>Host.</b> A valid address for the proxy server.</p>\n<p><b>Port.</b> A valid port number (an integer between 1 and 65535).</p>\n<p><b>User name.</b> The name of the user who will be logging in to the proxy server.</p>\n<p><b>Password.</b> The password of the user who will be logging in to the proxy server.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p>Click <b>Next</b> to continue.</p>\n</li>\n<li>\n<p>Review the installation details on the <b>Pre-installation summary</b> page.</p>\n<p>If all details are correct, click <b>Install</b> to proceed with the installation.</p>\n<p>To change any of the details, click <b>Previous</b> to return to the previous page of the installation wizard.</p>\n</li>\n<li>When the installation is finished, the <b>Installation complete</b> page appears. Click <b>Done</b> to quit the installer.</li>\n</ol>\n<h3>(Optional) Enable a thread dump </h3>\n<p>You can enable the Java thread dump feature, which saves Java threads from the OPB operations. In the event of a problem, you can submit the threads to Support to help them resolve the issue.</p>\n<p>To enable the thread dump feature:</p>\n<ol start=\"1\">\n<li>\n<p>In the <b>&lt;OPB_HOME&gt;/product/conf</b> folder, locate the <b>dump.conf</b> file.</p>\n</li>\n<li>\n<p>Set <b>enableDumpThread=true</b> (default is false).</p>\n</li>\n<li>\n<p>Restart the On-Premises Bridge agent.</p>\n</li>\n<li>\n<p>The thread dumps are saved in the <b>&lt;OPB_HOME&gt;/product/log/threadDumps</b> folder.</p>\n</li>\n</ol>\n<h3>Add an agent</h3>\n<ol start=\"1\">\n<li>From the main menu, select <b>Administration &gt; Utilities &gt; Integration</b>. Service Management displays the On-Premises Bridge <b>Agents</b> page.</li>\n<li>\n<p>Click <b>Add agent</b>.</p>\n</li>\n<li>\n<p>Enter the agent details.</p>\n<table>\n<caption>Agent fields and Descriptions</caption>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Name</td>\n<td>The name that you enter is displayed in the list of agents and is used when you create endpoints.</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>Enter a description that describes the agent.</td>\n</tr>\n<tr>\n<td>Enable notification</td>\n<td>Select this check box to enable the email notifications when the agent has not reached the Service Management server for 30 minutes, 2 hours, or 1 day.</td>\n</tr>\n<tr>\n<td>Recipients</td>\n<td>Specify the recipients that can receive the notifications.</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p>Click <b>Download connection file</b>. Copy the downloaded <b>server-connection.conf</b> file to the <b>&lt;<i>Agent_installation_directory</i>&gt;/product/conf</b> folder.</p>\n<p>The <b>server-connection.conf</b> file contains a unique agent identifier, which is used by Service Management when you create an endpoint to link between the agent and the endpoint. The identifier is also used to connect between the agent and the tasks that are routed to the agent in Service Management.</p>\n<p>The <b>server-connection.conf</b> file also contains the tenant ID and the base URL for Service Management. </p>\n</li>\n<li>\n<p>Grant read, write, and execute permissions to the server connection file. </p>\n</li>\n<li>\n<p>Follow the instructions given below in the <strong>How to import certificates into the OPB agent </strong>section to import the suite CA certificate into the <strong>cacerts</strong> file of the OPB agent. </p>\n</li>\n</ol>\n<h3>Customize the OPB installation configuration</h3>\n<p>The default values used when installing the On-Premises Bridge Agent are saved in the <b>wrapper-custom.conf</b> file in the <b>&lt;<i>Agent_installation_directory</i>&gt;\\product\\conf</b> folder. Pay attention to the following parameters.</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<caption><b>wrapper-custom.conf</b> parameters</caption>\n<thead>\n<tr>\n<th scope=\"col\">Parameter name</th>\n<th scope=\"col\">Default value</th>\n<th scope=\"col\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>RMI port</td>\n<td><code>wrapper.java.additional.108=-Drmi.server.port=1099</code> </td>\n<td>\n<p>To start the agent, you must change the value of the <b>rmi.server.port</b> to an available port if port 1099 is in use by another application. Otherwise, the application will shut down and the On-Premises Bridge Agent Windows service will be stopped after several attempts to start the agent. If this port is in use by another application, when you try to start the OPB agent, the following errors occur in the log files, located in the <b>&lt;<i>Agent_installation_directory</i>&gt;\\product\\log\\controller</b> folder:</p>\n<p>In the <b>wrapper.log</b> file:<code> java.rmi.server.ExportException: Port already in use: 1099</code><br/>\n\t\t\tIn the <b>controller.log</b> file:<code> java.rmi.NotBoundException: ControllerAPI</code><br/>\n<br/>\n\t\t\tThe RMI port (1099 or any other port) is only used internally inside OPB on the OPB host. See <a href=\"/doc/423/26.1/opbsecurity#Security_recommendations\" title=\"On-Premises Bridge security additional information\">On-Premises Bridge security additional information</a> for more information. </p>\n</td>\n</tr>\n<tr>\n<td>OPB service name</td>\n<td><code>set.OPB_SERVICE_NAME= On-Premises Bridge Agent</code></td>\n<td></td>\n</tr>\n</tbody>\n</table>\n<h3>Start or stop an agent</h3>\n<p>You must start an agent before you can manage it in Service Management.</p>\n<p>To start or stop an agent:</p>\n<ol>\n<li>\n<p>Run the <strong>services.msc</strong> command. </p>\n</li>\n<li>\n<p>Select the <strong>On-Premises Bridge Agent</strong> service.</p>\n</li>\n<li>\n<p>Select <strong>Start On-Premises Bridge</strong> <b>Agent</b> or <b>Stop</b> <strong>On-Premises Bridge</strong> <b>Agent</b>.</p>\n</li>\n</ol>\n<h3>Manage your installed agents</h3>\n<p>Select an agent in the Agents pane to display:</p>\n<ul>\n<li>\n<p>The endpoints that are connected to the agent.</p>\n</li>\n<li>\n<p>The three most recent events for the agent.</p>\n</li>\n</ul>\n<p>You have the following options for managing your agents.</p>\n<table>\n<caption>Managing agents actions</caption>\n<tbody>\n<tr>\n<th><b>Label</b></th>\n<th><b>Description</b></th>\n</tr>\n<tr>\n<td>Refresh</td>\n<td>Refresh the status of the tasks running on the selected agent.</td>\n</tr>\n<tr>\n<td>Remove</td>\n<td>\n<p>Removes the selected agent from the list of agents.</p>\n<p>You can remove an agent only if there are no tasks running on it. In addition, removing the agent also deletes all the endpoints that are configured to use it.</p>\n<p>Note To remove an On-Premises Bridge Agent, uninstall the software from its server. This doesn't uninstall an agent that you configured in the On-Premises Bridge.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3>Manage the On-Premises Bridge service</h3>\n<p>You can manage the On-Premises Bridge service using Windows Services as follows:</p>\n<ol>\n<li>\n<p>Run the <b>services.msc</b> command.</p>\n</li>\n<li>\n<p>Select the<strong> On-Premises Bridge Agent</strong> service.</p>\n</li>\n<li>\n<p>Stop or start the service as required.</p>\n</li>\n</ol>\n<p>You can also manage the On-Premises Bridge service using command line instructions in one of the following ways:</p>\n<ul>\n<li>\n<p>To run On-Premises Bridge Agent in a console, run the following command:<br/>\n<code>&lt;Agent_installation_directory&gt;/bin/OpbAgent.bat console</code></p>\n</li>\n<li>\n<p>To install the On-Premises Bridge as a service, run the following command:<br/>\n<code>&lt;Agent_installation_directory&gt;/bin/OpbAgent.bat install</code></p>\n</li>\n<li>\n<p>To start the On-Premises Bridge service (after installation), run the following command:<br/>\n<code>&lt;Agent_installation_directory&gt;/bin/OpbAgent.bat start</code></p>\n</li>\n<li>\n<p>To stop the On-Premises Bridge service (after installation), run the following command:<br/>\n<code>&lt;Agent_installation_directory&gt;/bin/OpbAgent.bat stop</code></p>\n</li>\n<li>\n<p>To restart the On-Premises Bridge service (after installation), run the following command:<br/>\n<code>&lt;Agent_installation_directory&gt;/bin/OpbAgent.bat restart</code></p>\n</li>\n<li>\n<p>To remove the On-Premises Bridge service, run the following command:<br/>\n<code>&lt;Agent_installation_directory&gt;/bin/OpbAgent.bat remove</code></p>\n</li>\n</ul>\n<h3>How to uninstall the On-Premises Bridge agent</h3>\n<p>You can uninstall the On-Premises Bridge Agent in one of the following ways:</p>\n<ul>\n<li>\n<p>Double-click the opb-uninstall.exe file in the &lt;<i>Agent_installation_directory</i>&gt;/install directory to start the uninstallation wizard.</p>\n</li>\n<li>\n<p>Click Start &gt; Programs &gt; MicroFocus &gt; On-Premises Bridge Agent &gt; Uninstall On-Premises Bridge Agent.</p>\n</li>\n<li>\n<p>Uninstall the On-Premises Bridge Agent through the Control Panel.</p>\n</li>\n</ul>\n<p>When you uninstall the On-Premises Bridge Agent, the following occurs:</p>\n<ul>\n<li>\n<p>All data is deleted, except for credentials that you created.</p>\n</li>\n<li>\n<p>Properties that you customized in the &lt;<i>Agent_installation_directory</i>&gt;/product/conf/wrapper-maas.conf file are deleted. However, this information is backed up in the wrapper-custom.conf.bak and wrapper-maas.bak files. To use this information, you must rename these backup files and then copy them to the corresponding folder in a new installation.</p>\n</li>\n</ul>\n<h2>How to import certificates into the OPB agent</h2>\n<div class=\"transcontent stn-begin--import_certificates\"></div>\n<p>Note Skip this section if you have replaced the certificates for the suite with CA trusted certificates.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-important-icon\"></div>\n<div class=\"admonition-content admonition-important-content\">After importing certificates into the OPB agent, be sure to restart the OPB agent.</div>\n</div>\n<p>OPB has its own trusted keystore file, which should not be confused with that of any other Java installation on the machine. The default OPB trusted keystore file is named <strong>cacerts </strong>and is located in the <strong>C:\\ProgramData\\MicroFocus\\On-Premise Bridge Agent\\product\\util\\3rd-party\\jre\\lib\\security</strong> directory.</p>\n<h3>Import the remote server's certificate to the OPB trusted keystore</h3>\n<p>When you create an integration to Service Management Automation with a remote system that has an SSL address, the certificate of the remote server might need to be imported into the trusted keystore file of the On-Premises Bridge. The cacerts file stores public certificates of the root Certificate Authority (CA).</p>\n<h4>Obtain the certificate of the remote server</h4>\n<p>In most cases, there is a company-created certificate available and the server administrator can send it to you. In cases where the certificate isn't available, it's also possible to use a Web browser to export the certificate so that it can be imported into the OPB's trusted keystore.</p>\n<h4>Add the certificate to the trusted keystore</h4>\n<p>The java keytool utility is used to import certificates into the trusted keystore. To run the utility, open a command window and navigate to the OPB installation folder, for example: C:\\ProgramData\\MicroFocus\\On-Premise Bridge Agent\\product\\util\\3rd-party\\jre\\bin directory. The command format is:</p>\n<p><code>keytool -importcert -keystore ..\\lib\\security\\cacerts -alias \"new Alias\" -file myCert.cer</code></p>\n<p>In this example, the myCert.cer file is the certificate of the remote server, cacerts is the trusted keystore, and the alias is a label set for the certificate. When prompted, the default password is \"changeit\".</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"Keystore.png\" data-file-height=\"94\" data-file-width=\"1441\" height=\"94\" src=\"../../../images/Keystore_5e8e3de0.png\" width=\"1441\"/> </a></div>\n<h3>Import the suite CA certificate to the OPB trusted keystore</h3>\n<p>To establish a connection between the suite and OPB, you must import the suite CA certificate to the OPB's trusted keystore. </p>\n<p>First, obtain the suite CA certificate. For details, see<i> Get the suite CA certificate</i> topic<em>.</em></p>\n<p>Next, import the suite CA certificate to the OPB agent's trusted keystore:</p>\n<ol>\n<li>\n<p>Copy the suite CA certificate file (for example, <strong>sma.cer</strong>) to the C:\\ProgramData\\MicroFocus\\On-Premise Bridge Agent\\product\\util\\3rd-party\\jre\\bin folder. Note that if you have exported the suite CA certificate as multiple CA certificate files, copy all of them to this folder. </p>\n</li>\n<li>\n<p>Run the Windows command prompt as an administrator, and then run the following commands:</p>\n<pre>cd C:\\ProgramData\\MicroFocus\\On-Premise Bridge Agent\\product\\util\\3rd-party\\jre\\bin\nkeytool -importcert -keystore ..\\lib\\security\\cacerts -alias \"new Alias\" -file sma.cer\n</pre>\n<p>When prompted to enter the keystore password, enter <strong>changeit</strong>.</p>\n<p>When asked if you want to trust the certificate, type <strong>y</strong>. The certificate is added to the OPB agent's trusted keystore.</p>\n</li>\n</ol>\n<h3>Confirm that the certificates are present</h3>\n<p>Java uses a tool called keytool to list or import any certificates in the trusted keystore file. Using this tool allows you to list all of the certificates that were imported into the keystore.</p>\n<p>Open a command window and navigate to the <strong>C:\\ProgramData\\MicroFocus\\On-Premise Bridge Agent\\product\\util\\3rd-party\\jre\\bin</strong> directory. Run the keytool while pointing to the <strong>cacerts</strong> file. The syntax for the command is:</p>\n<p><code>keytool -list -v -keystore ..\\lib\\security\\cacerts &gt; c:\\contents.txt</code></p>\n<div><a class=\"image\" href=\"\"> <img alt=\"Certificate.png\" data-file-height=\"91\" data-file-width=\"1400\" height=\"91\" src=\"../../../images/Certificate_b5554f39.png\" width=\"1400\"/> </a></div>\n<p>The default password for the keystore is \"<strong>changeit</strong>\". After you run the command, a file named C:\\contents.txt will list the entire content of the keystore. It's possible to search through this file using a text editor to confirm that the certificates for the remote server and the suite were loaded correctly. </p>\n<div class=\"transcontent stn-end--import_certificates\"></div>\n<h2>Specify credentials using the Endpoint Credentials Manager</h2>\n<p>Follow these steps:</p>\n<ol>\n<li>\n<p>In the Endpoint Credentials Manager, click <b>New</b> to add a new credentials record and select the required endpoint type.</p>\n</li>\n<li>\n<p>Enter the required user name and password for the on-premises application.</p>\n</li>\n</ol>\n<h2>Specify credentials using a command line tool</h2>\n<p>This command line tool enables you to create and manage client-side endpoint credentials. With this tool, you can:</p>\n<ul>\n<li>\n<p>List credentials, filtered by endpoint type name</p>\n</li>\n<li>\n<p>Create new credentials for a specified endpoint type</p>\n</li>\n<li>\n<p>Update existing credentials</p>\n</li>\n<li>\n<p>Delete existing credentials</p>\n</li>\n</ul>\n<p>To run the tool:</p>\n<p>Run the credentials_mng_console.bat file in the &lt;<i>Agent_installation_directory</i>&gt;\\product\\util\\opb folder.</p>\n<h3>list</h3>\n<p>Lists available credentials, filtered by endpoint type name.</p>\n<p>Usage:</p>\n<p><code>credentials_mng_console list -endpoint &lt;ENDPOINT TYPE&gt;</code></p>\n<p>Parameters:</p>\n<p><code>-endpoint &lt;ENDPOINT TYPE&gt;</code>: Endpoint type name (optional)</p>\n<p>Result:</p>\n<pre>======================\nEndpoint type  : sample-endpoint-type-12.5\nID             : 9460b7\nName           : sample credentials record\nUser           : sample username\nPassword       : ******\nParameters     :\nKey | Value\n-----------\nsample.secret.property | ******\nsample.url.property | 123</pre>\n<h3>listEndpointTypes</h3>\n<p>Lists available endpoint types, filtered by endpoint type name.</p>\n<p>Usage:</p>\n<p><code>credentials_mng_console listEndpointTypes -endpoint &lt;ENDPOINT TYPE&gt;</code></p>\n<p>Parameters:</p>\n<p><code>-endpoint &lt;ENDPOINT TYPE&gt;</code>: Endpoint type name (optional)</p>\n<p>Result:</p>\n<pre>Endpoint types  :\n1. indexing-domain\n2. ucmdb-10.20</pre>\n<h3>listCredentialIds</h3>\n<p>Lists all credential IDs and the endpoint type related to each credential ID.</p>\n<p>Usage:</p>\n<p><code>credentials_mng_console listCredentialIds -endpoint &lt;ENDPOINT TYPE&gt;</code></p>\n<p>Parameters:</p>\n<p><code>-endpoint &lt;ENDPOINT TYPE&gt;</code>: Endpoint type name (optional).</p>\n<p>Result:</p>\n<pre>====================\nEndpoint type : indexing-domain\nName | ID :\n1. sample credentials record name | 11e7\n====================\nEndpoint type : ucmdb-10.20\nName | ID :\n1. sample credentials record name | 21e0\n2. sample credentials record #2 name | 7e0</pre>\n<h3>listEndpointTypeParams</h3>\n<p>Lists the specific parameters required for saving credentials for each endpoint type.</p>\n<p>Usage:</p>\n<p><code>credentials_mng_console listEndpointTypeParams -endpoint &lt;ENDPOINT TYPE&gt;</code></p>\n<p>Parameters:</p>\n<p><code>-endpoint &lt;ENDPOINT TYPE&gt;</code>: Endpoint type name (optional).</p>\n<p>Result:</p>\n<pre>======================\nEndpoint type : indexing-domain-12.5\nOutput format:\nParameter:\nLabel:\nDescription:\nMandatory:\n--------------------------------------------\nEndpoint type specific parameters:\nParameter: sample.url.property\nLabel: Server URL\nDescription: URL address for sample server\nMandatory: true\nParameter: sample.secret.property\nLabel: Secret key\nDescription: Secret key for sample server\nMandatory: false\nUsage example:\ncredentials_mng_console create -endpointType indexing-domain-12.5 -name &lt;NAME_VALUE&gt; -user &lt;USER_VALUE&gt; -pass &lt;PASSWORD_VALUE&gt; -param sample.url.property &lt;PARAMETER_VALUE&gt; -param sample.secret.property &lt;PARAMETER_VALUE&gt;</pre>\n<h3>create</h3>\n<p>Creates a credentials record.</p>\n<p>Usage:</p>\n<p><code>credentials_mng_console create -file &lt;path to data file&gt; -user &lt;USER&gt; -pass &lt;PASSWORD&gt; -endpoint &lt;ENDPOINT TYPE&gt; -name &lt;CREDENTIALS NAME&gt; -param &lt;KEY&gt; &lt;VALUE&gt; -param &lt;KEY&gt; &lt;VALUE&gt;</code></p>\n<p>Usage example</p>\n<p><code>credentials_mng_console create -user &lt;USER_VALUE&gt; -pass &lt;PASSWORD&gt; -endpoint indexing-domain-12.5 -name &lt;NAME_VALUE&gt; -param sample.url.property &lt;PARAMETER_VALUE&gt; -param sample.secret.property &lt;PARAMETER_VALUE&gt;</code></p>\n<p>Parameters:</p>\n<table>\n<caption>parameters and descriptions</caption>\n<tbody>\n<tr>\n<td><code>-file &lt;FILE&gt;</code></td>\n<td>Read parameters from the property file (optional). Parameters will be overwritten if they are specified in the console.</td>\n</tr>\n<tr>\n<td><code>-user &lt;USER&gt;</code></td>\n<td>User name</td>\n</tr>\n<tr>\n<td><code>-pass &lt;PASSWORD&gt;</code></td>\n<td>Password</td>\n</tr>\n<tr>\n<td><code>-endpoint &lt;ENDPOINT TYPE&gt;</code></td>\n<td>Endpoint type name (optional)</td>\n</tr>\n<tr>\n<td><code>-name &lt;CREDENTIALS NAME&gt;</code></td>\n<td>Credentials name</td>\n</tr>\n<tr>\n<td><code>-param &lt;KEY&gt; &lt;VALUE&gt;</code></td>\n<td>Custom parameters (optional)</td>\n</tr>\n</tbody>\n</table>\n<p>The property file is a text file that describes the credential's properties. The file format is:</p>\n<pre>endpoint=\nname=\nuser=\npass=\ncustomParam1=value1\ncustomParam2=value2</pre>\n<p>Result:</p>\n<pre>endpoint=ALM_12.5\nname=Build-Jenkins-Master\ncustomParam1=value1\ncustomParam2=value2</pre>\n<h3>update</h3>\n<p>Updates an existing credentials record.</p>\n<p>Usage:</p>\n<p><code>credentials_mng_console update -file &lt;path to data file&gt; -user &lt;USER&gt; -pass &lt;PASSWORD&gt; -endpoint &lt;ENDPOINT TYPE&gt; -name &lt;CREDENTIALS NAME&gt; -param &lt;KEY&gt; &lt;VALUE&gt; -param &lt;KEY&gt; &lt;VALUE&gt; -replace</code></p>\n<p>Parameters:</p>\n<table>\n<caption>parameters and descriptions</caption>\n<tbody>\n<tr>\n<td><code>-file &lt;FILE&gt;</code></td>\n<td>Read parameters from the property file (optional). Parameters will be overwritten if they are specified in the console.</td>\n</tr>\n<tr>\n<td><code>-user &lt;USER&gt;</code></td>\n<td>User name</td>\n</tr>\n<tr>\n<td><code>-pass &lt;PASSWORD&gt;</code></td>\n<td>Password</td>\n</tr>\n<tr>\n<td><code>-endpoint &lt;ENDPOINT TYPE&gt;</code></td>\n<td>Endpoint type name</td>\n</tr>\n<tr>\n<td><code>-param &lt;KEY&gt; &lt;VALUE&gt;</code></td>\n<td>Custom parameters (optional)</td>\n</tr>\n<tr>\n<td><code>-replace</code></td>\n<td>Replace all existing parameters with input parameters (optional).</td>\n</tr>\n</tbody>\n</table>\n<h3>delete</h3>\n<p>Deletes a credential.</p>\n<p>Note You can't delete a single parameter from a credential. You can delete an entire credential.</p>\n<p>Usage:</p>\n<p><code>credentials_mng_console delete -endpoint &lt;ENDPOINT TYPE&gt; -credentialsId &lt;CREDENTIALS ID&gt;</code></p>\n<p>Parameters:</p>\n<table>\n<caption>parameters and descriptions</caption>\n<tbody>\n<tr>\n<td><code>-endpoint &lt;ENDPOINT TYPE&gt;</code></td>\n<td>Endpoint type name</td>\n</tr>\n<tr>\n<td><code>-credentialId &lt;CREDENTIALS ID&gt;</code></td>\n<td>The credentials ID</td>\n</tr>\n</tbody>\n</table>\n<h3>help</h3>\n<p>Provides help for the current topic.</p>\n<p>Usage:</p>\n<p><code>credentials_mng_console</code> <code>help</code></p>\n<h2>How to set credentials for Service Management and proxy configuration</h2>\n<p>Service Management credentials are encrypted and stored on your site in the agentCredentialsStore.xml file, located in the &lt;<i>Agent_installation_directory</i>&gt;/product/conf folder.</p>\n<p>Use a command line tool to configure Service Management credentials and proxy configurations.</p>\n<p>Run one of the following files:</p>\n<p>To run the tool for Service Management credentials:</p>\n<p>Run the agentAuthentication.bat file in the &lt;<i>Agent_installation_directory</i>&gt;/product/util/opb folder.</p>\n<p>For the Service Management configuration, the following command is relevant:</p>\n<h3>setAuth (for Service Management credentials)</h3>\n<p>Saves credentials connecting to a Service Management service.</p>\n<p>Usage:</p>\n<p><code>AgentAuthentication setAuth -user &lt;USER NAME&gt; -pass &lt;PASSWORD&gt;</code></p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-important-icon\"></div>\n<div class=\"admonition-content admonition-important-content\">For a password with special characters, use double quotation marks to enclose the password. Example: <strong> \"PassWord@#$\"</strong>.</div>\n</div>\n<p>Parameters:</p>\n<table>\n<caption>parameters and descriptions</caption>\n<tbody>\n<tr>\n<td><code>-user &lt;USER NAME&gt;</code></td>\n<td>The user name for connecting to the Service Management service.</td>\n</tr>\n<tr>\n<td><code>-pass &lt;PASSWORD&gt;</code></td>\n<td>The password for connecting to the Service Management service.</td>\n</tr>\n</tbody>\n</table>\n<p>To run the tool for proxy configuration:</p>\n<p>Run the proxyConfiguration.bat file in the &lt;<i>Agent_installation_directory</i>&gt;/product/util/opb folder.</p>\n<p>For the proxy configuration, the following commands are relevant:</p>\n<h3>setAddress</h3>\n<p>Saves the proxy host and port configuration.</p>\n<p>Usage:</p>\n<p><code>ProxyConfiguration setAddress -host &lt;PROXY HOST&gt; -port &lt;PROXY PORT&gt;</code></p>\n<p>Parameters:</p>\n<table>\n<caption>parameters and descriptions</caption>\n<tbody>\n<tr>\n<td><code>-host &lt;PROXY HOST&gt;</code></td>\n<td>The address of the proxy server host.</td>\n</tr>\n<tr>\n<td><code>-port &lt;PROXY PORT&gt;</code></td>\n<td>The port number of the proxy server.</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"removeProxyConfiguration\">removeProxyConfiguration</h3>\n<p>Deletes the configuration of a proxy server.</p>\n<p>Usage:</p>\n<p><code>ProxyConfiguration removeProxyConfiguration</code></p>\n<h3 id=\"setAuth_(for_a_proxy_server)\">setAuth (for a proxy server)</h3>\n<p>Saves credentials for a proxy server.</p>\n<p>Usage:</p>\n<p><code>ProxyConfiguration setAuth -user &lt;USER NAME&gt; -pass &lt;PASSWORD &gt;</code></p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-important-icon\"></div>\n<div class=\"admonition-content admonition-important-content\">For passwords with special characters, use double quotation when specifying. Example, \"PassWord@#$\" .</div>\n</div>\n<p>Parameters:</p>\n<table>\n<caption>parameters and descriptions</caption>\n<tbody>\n<tr>\n<td><code>-user &lt;USER NAME&gt;</code></td>\n<td>The user name for connecting to the proxy server.</td>\n</tr>\n<tr>\n<td><code>-pass &lt;PASSWORD&gt;</code></td>\n<td>The password for connecting to the proxy server.</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"removeAuth\">removeAuth</h3>\n<p>Deletes the credentials for connecting to a proxy server.</p>\n<p>Usage:</p>\n<p><code>ProxyConfiguration removeAuth</code> </p>\n<h2 id=\"How_to_enable_debug_logging_on_OPB\">How to enable debug logging on OPB</h2>\n<p>This section provides the needed steps to enable debug logging on OPB.</p>\n<h3>Enable debug logging for OPB Controller</h3>\n<p>If you want to enable debug logging on OPB controller, follow these steps:</p>\n<ol>\n<li>Open the following configuration file: <strong>C:\\ProgramData\\MicroFocus\\On-Premise Bridge Agent\\product\\agent\\opb-controller\\resources\\logback.xml</strong></li>\n<li>Edit the file by changing the value of each relevant logging level setting to ALL.<br/>\n\tHere is an example:\n\t<pre>  ```xml\n       &lt;logger name=\"com.hp\" level=\"DEBUG\" additivity=\"false\"&gt;\n           &lt;appender-ref ref=\"domain\" /&gt;\n       &lt;/logger&gt;\n   \n       &lt;logger name=\"com.microfocus\" level=\"DEBUG\" additivity=\"false\"&gt;\n           &lt;appender-ref ref=\"domain\" /&gt;\n       &lt;/logger&gt;\n   ```\n</pre>\n</li>\n</ol>\n<h3>Enable debug logging for OPB Executor</h3>\n<p>If you want to enable debug logging on OPB executor, follow these steps:</p>\n<ol>\n<li>Open the following configuration file: <strong>C:\\ProgramData\\MicroFocus\\On-Premise Bridge Agent\\product\\agent\\opb-executor\\resources\\logback.xml</strong></li>\n<li>Edit the file by changing the value of each relevant logging level setting to ALL.<br/>\n\tHere is an example:\n\t<pre>```xml\n       &lt;logger name=\"com.hp\" level=\"INFO\" additivity=\"false\"&gt;\n           &lt;appender-ref ref=\"controller\" /&gt;\n       &lt;/logger&gt;\n   \n       &lt;logger name=\"upgrader\" level=\"INFO\" additivity=\"false\"&gt;\n           &lt;appender-ref ref=\"upgrader\" /&gt;\n       &lt;/logger&gt;\n   ```\n</pre>\n</li>\n</ol>\n<h2>OPB controller log</h2>\n<p>If there is a problem with the connection between the OPB and the remote system, you can check the controller.log file of the OPB for the error defined below. If the error exists, then you may be required to follow the certificate import procedure in this section.</p>\n<p><code>javax.net.ssl.SSLHandshakeException: sun.security.validator.ValidatorException: PKIX path building failed: sun.security.provider.certpath.SunCertPathBuilderException: unable to find valid certification path to requested target</code></p>\n<p>The default location of the <b>controller.log</b> file is in the <b>C:\\ProgramData\\MicroFocus\\On-Premise Bridge Agent\\product\\log\\controller</b> directory. Once the log file is located, search the log file for the HandshakeException error. If the error appears, the fully qualified domain name will be logged, which allows you to verify that the endpoint in question is indeed the one that's giving the error.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"ErrorLocation.png\" data-file-height=\"146\" data-file-width=\"938\" height=\"146\" src=\"../../../images/ErrorLocation_fc32405c.png\" width=\"938\"/> </a></div>\n<h2 id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/opbsecurity\" title=\"On-Premises Bridge security additional information\">On-Premises Bridge security additional information</a></li>\n</ul>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}