{
  "title": "On-Premises Bridge security additional information",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><h2 class=\"mw-headline\" id=\"Security_aspects_addressed_by_the_agent\">Security aspects addressed by the agent</h2>\n<ul>\n<li>Communication between an <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> Agent (OPB) and Service Management uses SSL to secure the connection. In addition, the OPB Agent connects to Service Management using the user and password provided during installation. This user is created by the customer for the dedicated OPB Remote Agent role.</li>\n<li>Passwords for the endpoint credentials are saved encrypted on the customer's machine, which prevents the credentials from being transferred to another machine. The encryption method uses keys that are randomly generated during installation. The agent uses AES 128 as the main encryption method.</li>\n<li>The agent doesn't expose any internal information.</li>\n</ul>\n<h2 class=\"mw-headline\">Network configuration</h2>\n<p>Deploy the agent in an isolated network with a firewall between the agent and the target on-premises applications.</p>\n<ul>\n<li>\n<p>The outbound OPB communication with Service Management requires port 443 to be opened, and no inbound OPB connectivity is required on any ports. </p>\n</li>\n<li>\n<p>The RMI port is port 1099 (default) or any other port, which is configured in <strong>wrapper.java.additional.108=-Drmi.server.port=&lt;port&gt;</strong> in the <b>wrapper-custom.conf</b> file in the <b>&lt;<i>Agent_installation_directory</i>&gt;\\product\\conf</b> folder. The RMI port is only used internally inside OPB on the OPB host, there's no inbound connectivity required on the RMI port from outside the OPB host. Actually, for security reasons, configure your firewall to ensure that the RMI port is accessible only from the local machine and block any external access to this RMI port.         </p>\n</li>\n<li>\n<p>Internal communications with other on-premises applications may require you to open additional ports.</p>\n</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Security_recommendations\">Security recommendations</h2>\n<ul>\n<li>The agent should be installed on a dedicated machine. The machine that the agent runs on should be hardened.</li>\n<li>Do not download the <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> Agent installation or updates from unknown sources.</li>\n<li>(Windows only) The <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> Agent service is run using the Windows Local System service user. You can protect the <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> Agent installation folder by granting permissions for that folder only to administrators and to the Local System service user.</li>\n<li>(Linux only) The <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> Agent service is running using the user with Sudo permission. You can protect the <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> Agent installation folder by granting permissions for that folder only to non-root users with Sudo permission.</li>\n<li>Limit the permissions that you assign to on-premises application users to perform only specific required operations.</li>\n<li>Only the user who is specified during the installation of the <span class=\"SAW_Variablesopb\">On-Premises Bridge</span> Agent and who communicates between the agent and Service Management should have the OPB Remote Agent role.</li>\n<li>Edit the <b>PortRangeRMIServerSocketFactory</b> to use the specific port range for the RMI server, for example, 49152-65535. Configure the RMI registry (server) to listen to localhost. </li>\n<li>Assign the <b>OPB Remote Agent</b> role to integration users. To do this, in <b>Agent Interface</b> &gt; <b>Administration</b> &gt; <b>Master Data</b> &gt; <b>People</b>, select the integration user, under <b>System User Definitions</b>, add the <b>OPB Remote Agent</b> role.</li>\n<li>Edit <strong>wrapper-custom.conf </strong>to enable <strong>TLS 1.3</strong> if you upgraded your OPB Agent. See <a href=\"/doc/423/26.1/enabletls\" title=\"Enable TLS 1.3\">Enable TLS 1.3</a>.</li>\n</ul>\n<h2>OPB certificates</h2>\n<p>When creating an integration to Service Management with a remote system that has an SSL address, it's possible that the certificate of the remote server must be imported into the trusted keystore file of the On-Premises Bridge (OPB). The cacerts file stores public certificates of the root Certificate Authority (CA). If there is a problem with the connection between the OPB and the remote system, check the controller.log file of the OPB for the error defined below.</p>\n<p><em>javax.net.ssl.SSLHandshakeException: sun.security.validator.ValidatorException: PKIX path building failed: sun.security.provider.certpath.SunCertPathBuilderException: unable to find valid certification path to requested target</em></p>\n<p>If the error exists, then you may need to follow the procedure described below:</p>\n<ul>\n<li>Finding the location of the OPB controller log</li>\n<li>Finding the location of the OPB trusted keystore</li>\n<li>Obtaining the certificate of the remote server</li>\n<li>Adding the certificate to the trusted keystore</li>\n<li>Verify if the certificate is present</li>\n</ul>\n<h3>Finding the location of the OPB controller log</h3>\n<p>The default location of the controller.log file is in the <em>C:\\Program Files\\Micro Focus\\On-Premise Bridge Agent\\product\\log\\controller</em> directory. Once the log file is located, search the log file for the HandshakeException error. If the error appears, the Fully Qualified Domain Name (FQDN) will be logged, which will allow you to verify that the endpoint in question was indeed the one that's giving the error.</p>\n<div><a class=\"image\" href=\"/file/images/9/96/OPB_Image1.png\" title=\"/file/images/9/96/OPB_Image1.png\"> <img alt=\"/mediawiki/images/9/96/OPB_Image1.png\" border=\"0\" file=\"/mediawiki/images/9/96/OPB_Image1.png\" height=\"124\" hspace=\"0\" src=\"../../../images/OPB_Image1_18d15eed.png\" style=\"width: 800px; height: 124px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h3>Finding the location of the OPB trusted keystore</h3>\n<p>The default OPB trusted keystore file is named <strong>cacerts</strong> and is located in the <em>C:\\Program Files\\Micro Focus\\On-Premise Bridge Agent\\product\\util\\3rd-party\\jre\\lib\\security</em> directory. The OPB has its own file and should not be confused with any other Java installation on the machine.</p>\n<h3>Obtaining the certificate of the remote server</h3>\n<p>In most cases, there is a company created certificate available and the server administrator will be able to send it to you. In cases where this isn't available, it's also possible to use a browser (FireFox for example) to export the certificate so that it can be imported into OPB's trusted keystore.</p>\n<h3>Adding the certificate to the trusted keystore</h3>\n<p>The java keytool utility is used to import certificates into the trusted keystore. To run the utility, open a command window and navigate to C:\\Program Files\\MIcro Focus\\On-Premise Bridge Agent\\product\\util\\3rd-party\\jre\\bin directory. The format of the necessary command is as follows:</p>\n<pre><code>keytool -import -keystore ..\\lib\\security\\cacerts -alias \"new Alias\" –file myCert.crt </code></pre>\n<p>In this example the <strong>myCert.crt</strong> file is the certificate of the remote server, <strong>cacerts</strong> is the trusted keystore, and the alias is a label set for the certificate. When prompted for a password, \"changeit\" is the default.</p>\n<pre>C:\\Program Files\\Micro Focus\\On-Premise Bridge Agent\\product\\util\\3rd-party\\jre\\bin&gt;keytool -import -keystore ..\\lib\\security\\cacerts -alias \"new Alias\" -file c:\\myCert.crt\n</pre>\n<h3>Verify if the certificate is present</h3>\n<p>Java uses a tool named keytool to list or import any certificates in the trusted keystore file. Using this tool allows you to list all of the certificates that were imported into the keystore.</p>\n<ol>\n<li>Open a command window and navigate to the <em>C:\\Program Files\\Micro Focus\\On-Premises Bridge Agent\\product\\util\\3rd-party\\jre\\bin</em> directory.</li>\n<li>Run the keytool while pointing to the cacerts file. Syntax for the command is: <em><strong>keytool -list -v -keystore ..\\lib\\security\\cacerts &gt; c:\\contents.txt</strong></em></li>\n</ol>\n<pre>C:\\Program Files\\Micro Focus\\On-Premise Bridge Agent\\product\\util\\3rd-party\\jre\\bin&gt;keytool -list -v -keystore ..\\lib\\security\\cacerts &gt; c:\\contents.txt\nEnter keystore password:  changeit\n</pre>\n<p>The default password for the keystore is \"changeit\". Once the command has finished running, a file named c:\\contents.txt will list the entire content of the keystore. it's possible to search through this file in notepad or a similar text editor in order to confirm that the certificate for the remote server to confirm was loaded correctly. </p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}