{
  "title": "Optimization types",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div id=\"tag-premium\"></div>\n<p>Each optimization record is associated with a optimization type. The optimization type defines the algorithm logic and directs how the optimization result is calculated. Currently, <b>Application cloudification</b> is the only optimization type supported. It provides users with a quick way to identify the optimal cloud-based delivery model of an application within the target portfolio.</p>\n<p>The analysis is divided into two primary categories: business suitability and technical suitability. Each category is composed of six dimensions. For details of these dimensions, see the <a href=\"#See_also\">Configuration tab</a>.</p>\n<p>The following tabs are included:</p>\n<h2 class=\"mw-headline\" id=\"General_tab\">General tab</h2>\n<p>This tab contains the following basic information of the optimization type.</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Title</td>\n<td>The title of the optimization type. Currently, <b>Application cloudification</b> is the only optimization type supported.</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>A description that captures the details of the record.</td>\n</tr>\n<tr>\n<td>Model</td>\n<td>A classification applied to optimization type. Currently, Application cloudification model is the only model supported.</td>\n</tr>\n<tr>\n<td>Created by</td>\n<td>The name of the user that created the record.</td>\n</tr>\n<tr>\n<td>Creation time</td>\n<td>The time that the record was created.</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"Configuration_tab\">Configuration tab</h2>\n<p>This tab shows how the cloudification recommendation are calculated:</p>\n<table class=\"contenttable\">\n<tbody>\n<tr>\n<th>Category</th>\n<th>Dimension</th>\n<th>Description</th>\n</tr>\n<tr>\n<td rowspan=\"6\">Business alignment</td>\n<td>Regulatory</td>\n<td>Whether regulatory restrictions are identified that might prevent the application from moving into a public-cloud environment.</td>\n</tr>\n<tr>\n<td>Security</td>\n<td>Whether there are security constraints identified for the application.</td>\n</tr>\n<tr>\n<td>Workload variability</td>\n<td>Whether there are any technical workload variability issues that might prevent the application from moving into a public-cloud environment.</td>\n</tr>\n<tr>\n<td>Service availability</td>\n<td>Whether the availability service level required by the application is aligned with most major public cloud service providers to date.</td>\n</tr>\n<tr>\n<td>Geography</td>\n<td>Whether there are any geographic impediments for moving the application into a public-cloud environment.</td>\n</tr>\n<tr>\n<td>Vendor support</td>\n<td>Whether vendor support issues are identified that might prevent the application from moving into a public-cloud environment.</td>\n</tr>\n<tr>\n<td rowspan=\"6\">Technical alignment</td>\n<td>Infrastructure compatibility</td>\n<td>Whether the application is tied to individually-defined servers or legacy operating systems.</td>\n</tr>\n<tr>\n<td>Interfaces</td>\n<td>Whether there are issues identified with the application interfaces that might prevent the application from moving to a public-cloud environment.</td>\n</tr>\n<tr>\n<td>Architecture</td>\n<td>Whether there are any architecture issues that might prevent the application from moving into a public-cloud environment.</td>\n</tr>\n<tr>\n<td>Performance</td>\n<td>Whether the performance requirements of this application are compatible with public cloud environments, in terms of bandwidth and latency characteristics.</td>\n</tr>\n<tr>\n<td>Internet suitability</td>\n<td>Whether the application utilizes non-internet technologies or requires performance, reliability, or security greater than expected standard internet connectivity.</td>\n</tr>\n<tr>\n<td>Cloud operating model</td>\n<td>Whether there are any proprietary restrictions identified that might prevent the application from being compatible with a public-cloud environment.</td>\n</tr>\n</tbody>\n</table>\n<p>By clicking the title of each dimension, you can view the survey questions that fall into this category from the right pane.</p>\n<p>The decision of the cloud-based delivery model follows the Cask Principle. The security level of the following cloud-based delivery models is in descending order:</p>\n<ol>\n<li>\n<p>on-premises infrastructure (most secured)</p>\n<p>This delivery model reflects a traditional on-premises (physical or virtualized infrastructure) delivery model that for some organizations is inherently more suited for their organizational structure.</p>\n</li>\n<li>\n<p>Private cloud</p>\n<p>This delivery model brings the cloud “in house”. It reflects a private cloud using automation and virtualization technologies to deliver pools of scalable compute, storage, and I/O resources on-site.</p>\n</li>\n<li>\n<p>Virtual private cloud</p>\n<p>This delivery model still provides a private cloud but in a vendor managed environment. The cloud environment is provided at a service supplier location and usually is highly standardized.</p>\n</li>\n<li>\n<p>Public cloud (least secured)</p>\n<p>This delivery method reflects a public cloud in the traditional sense, whereby resources are dynamically provisioned using a self-service model.</p>\n</li>\n</ol>\n<p>If the algorithm result of any dimension is on-premises, the delivery model should be on-premises. The Public cloud delivery model is recommended only when the algorithm results for all dimensions are Public cloud.</p>\n<h2 class=\"mw-headline\" id=\"Sample_report_tab\">Sample report tab</h2>\n<p>This tab contains two optimization reports of the sample data.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> The reports aren't intended to provide a definitive answer as to whether this application should or should not move to the cloud. It's intended to provide potential cloud suitability from a business and a technical point of view.</p>\n</div>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>ID</td>\n<td>The application ID.</td>\n</tr>\n<tr>\n<td>Title</td>\n<td>The name of the application.</td>\n</tr>\n<tr>\n<td>Business suitability</td>\n<td>The optimal cloud solution for the business.</td>\n</tr>\n<tr>\n<td>Technical suitability</td>\n<td>The optimal cloud solution for the technical infrastructure.</td>\n</tr>\n<tr>\n<td>Recommendation</td>\n<td>The final recommendation for the cloud delivery model.</td>\n</tr>\n<tr>\n<td>View details</td>\n<td>A graphical report of the score of each dimension.</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/appportfoliomgmt\" title=\"SMAX:25.1/APPPortfolioMgmt\">Application Portfolio Management</a></li>\n<li><a href=\"/doc/423/26.1/optimoverview\" title=\"SMAX:25.1/OptimOverview\">Optimizations</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}