{
  "title": "Optimizations",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div id=\"tag-premium\"></div>\n<p>The Optimizations feature enables you to optimize portfolios and select the suitable cloud delivery model that suits your company's needs. This feature allows you to optimize your application portfolios by providing preliminary guidance for each application. Based on this, you can create proposals to migrate and modernize selected applications to the cloud. Application cloud optimization survey are provided to collect information on each criteria.</p>\n<p>A pre-defined survey (the Application Cloudification Survey) is provided for you to collect basic information of each application from the application owners. This feature assesses and analyzes the survey feedback and displays the findings as a graphical report. The assessment is intended to provide preliminary guidance as to fitness both from a business and a technical point of view and to provide recommendations for transforming the application to the cloud platform. The application portfolio owner can then create a proposal based on the report to implement the delivery model transformation.</p>\n<p>It's important to understand that the assessments made are based on the current broad risk and appetite parameters that are aligned to keeping regulated applications and sensitive data within the data-center environment.</p>\n<p>The optimization report isn't intended to provide a definitive answer as to whether this application should or should not move to the cloud. It's intended to provide potential cloud suitability from a business and a technical point of view.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/appportfoliomgmt\" title=\"SMAX:25.1/APPPortfolioMgmt\">Application Portfolio Management</a></li>\n<li><a href=\"/doc/423/26.1/createoptim\" title=\"SMAX:25.1/CreateOptim\">How to create an optimization record</a></li>\n<li><a href=\"/doc/423/26.1/editoptim\" title=\"SMAX:25.1/EditOptim\">How to edit an optimization record</a></li>\n<li><a href=\"/doc/423/26.1/createproposalfmoptim\" title=\"SMAX:25.1/CreateProposalFmOptim\">How to create a proposal from an optimization record</a></li>\n<li><a href=\"/doc/423/26.1/optimwflw\" title=\"SMAX:25.1/OptimWflw\">Optimization workflow</a></li>\n<li><a href=\"/doc/423/26.1/sendsurvey\" title=\"SMAX:25.1/SendSurvey\">How to send a survey to collect application information</a></li>\n<li><a href=\"/doc/423/26.1/ootbsurvey\" title=\"SMAX:25.1/OOTBSurvey\">Out-of-the-box optimization survey</a></li>\n<li><a href=\"/doc/423/26.1/optimapps\" title=\"SMAX:25.1/OptimAPPs\">How to optimize applications</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}