{
  "title": "Packaging and importing knowledge articles",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Service Management enables you to perform a mass import of knowledge articles to populate the Knowledge Management module. Articles are imported in a standard package created by the Knowledge Packaging Tool.</p>\n<p>The packaging process:</p>\n<ol>\n<li>\n<p>Retrieves articles from their source using a simple article retriever plugin that retrieves articles from a hierarchy of folders on a file system.</p>\n</li>\n<li>\n<p>Converts the articles to an HTML format using an article retriever plugin.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> Conversion capability of different file formats is NOT provided with the tool and is the responsibility of the customer to implement.</p>\n</div>\n</li>\n<li>Parses the articles to find links to images and other articles.</li>\n<li>Downloads images that are embedded in the articles.</li>\n<li>Rewrites links that refer to other articles to avoid broken links when the articles are imported into Service Management.</li>\n<li>Packages all articles and images together, so that after importing to Service Management, images are visible and links between articles work.</li>\n</ol>\n<p>The Knowledge Packaging tool includes metadata when packaging the articles, such as author and tags.</p>\n<p>Because the content and metadata for the articles can be located anywhere (such as a SharePoint site, a wiki, on a file system, and so on), the tool requires the implementation of some code that extracts the content and metadata from the data source while running the tool.</p>\n<p>When you run the Knowledge Packaging tool, a complete package is created that can later be imported into Service Management.</p>\n<p>For information on packaging your articles, see <a href=\"/doc/423/26.1/pckgknowledgearticle\" title=\"SMAX:25.1/PckgKnowledgeArticle\">Quickstart - How to package knowledge articles using the Knowledge Packaging Tool</a>.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> <b>For advanced users.</b> The Knowledge Packaging tool can also be used to package articles from other sources, and in various file formats.</p>\n</div>\n<p>For information on importing a knowledge package into Service Management, see <a href=\"/doc/423/26.1/importarticles\" title=\"SMAX:25.1/ImportArticles\">How to import knowledge article packages</a>.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/addarticle\" title=\"SMAX:25.1/AddArticle\">How to create or update a knowledge/news article</a></li>\n<li><a href=\"Integrate%20with%20SharePoint%20and%20Confluence\" title=\"SMAX:25.1/SyncArticles\">Integrate with SharePoint and Confluence</a></li>\n<li><a href=\"/doc/423/26.1/pckgknowledgearticle\" title=\"SMAX:25.1/PckgKnowledgeArticle\">Quickstart - How to package knowledge articles using the Knowledge Packaging Tool</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}