{
  "title": "PDF export",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>You can export PDF documents from Change, Incident, Request, and BYOA (customized application) records.</p>\n<h2>Export to a PDF document</h2>\n<ol>\n<li>Open a Change, an Incident, a Request, or a BYOA (customized application) record, and then click <strong>More</strong> &gt; <strong>Export to PDF</strong>. The system opens the Export to PDF dialog.</li>\n<li>Select tabs for PDF export. If you select no tabs, the default is the General tab. See the following table for the candidate tabs.\n\t<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<thead>\n<tr>\n<th scope=\"col\">Module</th>\n<th scope=\"col\">Tabs available for export</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Change</td>\n<td>General<br/>\n\t\t\t\tSchedule<br/>\n\t\t\t\tPlan and execute<br/>\n\t\t\t\tTargets<br/>\n\t\t\t\tInvolved CIs<br/>\n\t\t\t\tDiscussions<br/>\n\t\t\t\tUser options</td>\n</tr>\n<tr>\n<td>Incident</td>\n<td>General<br/>\n\t\t\t\tTask plan<br/>\n\t\t\t\tTargets<br/>\n\t\t\t\tInvolved CIs<br/>\n\t\t\t\tDiscussions<br/>\n\t\t\t\tUser options</td>\n</tr>\n<tr>\n<td>Request</td>\n<td>General<br/>\n\t\t\t\tTask plan<br/>\n\t\t\t\tTargets<br/>\n\t\t\t\tInvolved CIs<br/>\n\t\t\t\tDiscussions<br/>\n\t\t\t\tUser options</td>\n</tr>\n<tr>\n<td>BYOA</td>\n<td>General<br/>\n\t\t\t\tDiscussions</td>\n</tr>\n</tbody>\n</table>\n<strong>Note:</strong> In the table above, user options isn't the name of a tab. Instead, it refers to a section in an offering or a model. A PDF document will include user options when it exists in a record.</li>\n<li>Select a layout type: <strong>Portrait</strong> or <strong>Landscape</strong>.</li>\n<li>Click <strong>OK</strong> to trigger the PDF generation. The system starts downloading the PDF after generating the PDF successfully. The PDF document displays the tabs in the same sequence as they are on the left side.</li>\n</ol>\n<p><strong>Note:</strong> The backend will reject the request when the PDF queue is full to prevent overload. In case you receive the <code>PDF export was rejected</code> error message, wait for some time, and try again.</p>\n<h2>Limitation</h2>\n<p>In this release, this function has the following limitations.</p>\n<h3>Character output</h3>\n<p>Based on the current agent user's profile language and font, the PDF document may exclude some characters. One PDF document includes one font only. If the profile language doesn't support the characters in a record, these characters are missing from a PDF document.</p>\n<p>For example, suppose an agent user signs in with the English language. If this user selects a record that consists of both English and Chinese in its description and then generates a PDF document, the Chinese characters are missing from the printed PDF document because the English font doesn't support Chinese characters.</p>\n<p>In another example, when an agent user signs in with the Chinese language and then generates a PDF document for a record that consists of both English and Chinese in its description, the English characters are displayed in the printed PDF document because the Chinese font supports English characters.</p>\n<h3>Right-to-left support</h3>\n<p>Right-to-left display for Arabic and Hebrew is unsupported.</p>\n<h3>Tabs</h3>\n<h4>Task plan</h4>\n<p>Future tasks that are not created in Task Plan are missing from a PDF document.</p>\n<h4>Offering</h4>\n<p>The price in User Options is missing from a PDF document.</p>\n<h4>Involved CIs</h4>\n<p>The following items on the <strong>Involved CIs</strong> tab are missing from a PDF document.</p>\n<ul>\n<li>Affected services</li>\n<li>Short description of involved devices in a list</li>\n</ul>\n<h4>Discussions</h4>\n<p>Live discussions are missing from a PDF document.</p>\n<h3>Format</h3>\n<h4>Data format</h4>\n<p>The following constraints apply to an exported PDF document.</p>\n<ul>\n<li>The PDF document displays all dates in a <code>yyyy-mm-dd hh:mm:ss</code> (24-hour) format, which is not aligned with the UI. The Date field also includes a <code>UTC</code> suffix.</li>\n<li>Daylight saving time (DST) is unsupported. The PDF document displays the actual time of the timezone where the agent user locates.</li>\n<li>Fields with the logical type of Double keep 2 decimals</li>\n</ul>\n<h4>Image</h4>\n<p>The following images are missing from a PDF document.</p>\n<ul>\n<li>Images that are inserted in a rich text field (for example, the images that are inserted in a record's description)</li>\n<li>Images that are embedded on a form (for example, the images that are embedded in an offering in Service Catalog)</li>\n</ul>\n<h4>Rich text</h4>\n<p>The following styles in the rich text are missing from a PDF document.</p>\n<ul>\n<li>Sequence numbers for ordered items when there are tables in items</li>\n<li>Table border if an agent user copies this table from a Word document</li>\n<li>Background color</li>\n<li>Indents in paragraphs</li>\n</ul>\n<h4>Enum set</h4>\n<p>Localization of enum set is missing from a PDF document.</p>\n<h4>Table</h4>\n<p>The following items in tables are under constraint in a PDF document.</p>\n<ul>\n<li>For each table, the PDF document includes 6 columns at maximum. You cannot change this number.</li>\n<li>For each URL/Small/Medium/Large/Rich text field, the PDF document includes 50 characters at maximum. You cannot change this number.</li>\n<li>Personalization is missing (includes Added columns and Order by). The PDF document only displays columns that are defined in Studio.</li>\n</ul>\n<p><strong>Note:</strong> Tables on the <strong>Targets</strong> tab aren't confined to this limitation.</p>\n<h4></h4>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}