{
  "title": "People",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>System administrators manage the access that people in the organization have to different parts of different applications. The People domain includes individual users, groups, contacts, and user roles.</p>\n<p>When you add new employees to the organization, the first task is to enable them to log in to the areas where they have assigned work to do. Next, you might want to include them in one or more user groups, which makes it easy to send email to everyone with common interests or assignments. Finally, you want to assign a role to each user. Service Management uses a role-based permission system that makes it easy to assign a block of permissions to a role, and then assign that role to one or more end users. The default roles match industry-standard ITIL roles and best practice recommendations.</p>\n<p>Contacts are an enterprise-wide address book of internal and external individuals, stakeholders, vendor liaisons, or others who might have a business relationship with the organization.</p>\n<p>Encryption domains enable you to encrypt specific record type fields to restrict access to sensitive information to selected users.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> Data domain segmentation provides the ability to limit the records that a user is permitted to view. In general, the data domain that a user is permitted to view is automatically assigned by the Primary domain of the group to which the user belongs. To change the Primary domain, you must first add the <b>Primary domain</b> field to the relevant forms for the group or user. For more information on adding fields to forms, see <a href=\"/doc/423/26.1/editform\" title=\"SMAX:25.1/EditForm\">How to edit a form</a>. For more information on data domains, see <a href=\"/doc/423/26.1/datadomainseg\" title=\"SMAX:25.1/DataDomainSeg\">Data domain segmentation</a>.</p>\n</div>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/userscontacts\" title=\"SMAX:25.1/UsersContacts\">Users and contacts</a></li>\n</ul>\n<ul>\n<li><a href=\"/doc/423/26.1/pplroles\" title=\"SMAX:25.1/pplRoles\">Roles</a></li>\n</ul>\n<ul>\n<li><a href=\"/doc/423/26.1/groups\" title=\"SMAX:25.1/Groups\">Groups</a></li>\n</ul>\n<ul>\n<li><a href=\"/doc/423/26.1/encryptdomain\" title=\"SMAX:25.1/EncryptDomain\">Encryption domains</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}