{
  "title": "Per-schedule rules experience slow performance",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Your per-schedule rules experience slow performance. Normally, a per-schedule rule is expected to start in no more than 5 minutes after the scheduled start time. However, the limited velocity of one single thread will cause accumulated execution delay when the incoming volume of the per-schedule rules is high. In this scenario, the accumulated rule execution delay may be much longer than 5 minutes.</p>\n<h2>Cause</h2>\n<p>You can use only one thread to consume per-schedule rules and the limited velocity of the single thread may cause delay.</p>\n<h2>Resolution</h2>\n<ol>\n<li>Check the per-schedule rule and make sure the slow performance isn't caused by any other configuration issues.</li>\n<li>Monitor the per-schedule rule and see if the execution delay persists. </li>\n<li>Run the following command on the control plane node to create a configmap key:\n\t<pre>kubectl patch configmap itom-xruntime-infra-config --patch '{\"data\": {\"WORKFLOW_TIMER_THREAD_COUNT\": \"<strong><em>&lt;ThreadNumber&gt;</em></strong>\"}}' -n <strong><em>&lt;SuiteNamespace&gt;</em></strong><countnumber><suite-namespace></suite-namespace></countnumber></pre>\n<strong>Note: </strong>Replace <em>&lt;ThreadNumber&gt;</em> and <em>&lt;SuiteNamespace&gt; </em>with the expected number of threads and the suite namespace. The minimum value of WORKFLOW_TIMER_THREAD_COUNT is 1 and the maximum value is the total CPU core number of the offline pod. If you set a value larger than this, the total CPU core number of the platform offline pod would be used as this thread count. A suitable ThreadNumber improves the thread velocity and may reduce or even eliminate the execution delay. For example, setting it to 2 doubles the thread velocity. </li>\n<li>If the platform offline pod doesn't restart automatically, manually restart it by running the following command on the control plane node:\n\t<pre>kubectl rollout restart deployment itom-xruntime-platform-offline -n <strong><em>&lt;SuiteNamespace&gt;</em></strong>\n</pre>\n<strong>Note: </strong>Replace <strong><em>&lt;SuiteNamespace&gt;</em></strong> with the actual suite namespace.</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}