{
  "title": "Hot Topic Analytics for Incidents and Problems",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>\n<p class=\"mw-empty-elt\"></p>\n</div>\n<p>Hot Topic Analytics in Problem Management use the advanced search and analytics capabilities in Service Management to enable you to view and analyze incidents, and to create problem records based on those incidents.</p>\n<p>The hot topics map provides trend analysis so you can visually identify incidents that share common issues. The map in Problem Management includes all incidents in the system. It doesn't include any other record type. In the filter above the map, you can't select any other record types as it defaults to <b>Incidents</b>, but you can select a service type as a secondary filter using the <b>Add filter</b> button <a class=\"image\" href=\"/file/images/c/cb/2018.08_Helpcenter/Resources/Images/Icons/FilterByIcon.png\" title=\"/file/images/c/cb/2018.08_Helpcenter/Resources/Images/Icons/FilterByIcon.png\"> <img alt=\"FilterByIcon.png\" data-file-height=\"18\" data-file-width=\"19\" height=\"18\" src=\"../../../images/FilterByIcon_8e3dccb1.png\" width=\"19\"/> </a>.</p>\n<p>You can drill down into the map and view the specific incidents related to an issue. In the list of incidents on the right, you can select multiple incidents to create a problem based on those similar incidents. The fields in the created problem are populated by the information only from the first incident selected. All other incidents become the new problem's related links.</p>\n<p>When navigating through the map, click the <b>Clear</b> button to go back to your previous view of the map. If you used the search field at the top of the page to view incidents, that search remains active until the search field is cleared. This is regardless of clicking the <b>Clear</b> button which applies only to navigating within the map.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/problemmgmt\" title=\"SMAX:25.1/ProblemMgmt\">Problem Management</a></li>\n<li><a href=\"/doc/423/26.1/incidentmgmt\" title=\"SMAX:25.1/IncidentMgmt\">Incident Management</a></li>\n<li><a href=\"/doc/423/26.1/managehottopics\" title=\"SMAX:25.1/ManageHotTopics\">How to manage hot topic analytics</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}