{
  "title": "Project and Program Management roles and permissions",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>There are specific roles associated with project portfolios and their components. Service Management uses role based <a href=\"/doc/423/26.1/rolespermissions\" title=\"SMAX:25.1/RolesPermissions\">permissions</a> to enable you to complete a task that's appropriate to your role. The tenant administrator manages and assigns these permissions.</p>\n<p>By default, the following roles are related to various events in a project portfolio's lifecycle. These roles support portfolio creation and management, and process ownership.</p>\n<table>\n<tbody>\n<tr>\n<th>Role</th>\n<th>Responsibilities</th>\n</tr>\n<tr>\n<td>Project Portfolio Manager</td>\n<td>\n<ul>\n<li>Owner of project portfolios</li>\n<li>Allowed to create and add content to project portfolios</li>\n<li>Responsible for high level governance of a collection of projects or programs</li>\n<li>Able to add, edit, or delete budget relevant financial data such as budget and budget lines in Project Portfolios</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Program Manager</td>\n<td>\n<ul>\n<li>Owner of programs</li>\n<li>Allowed to create and add content to programs</li>\n<li>Responsible for managing related projects in a coordinated way to obtain benefits and control not available from managing the projects individually</li>\n<li>Able to add, edit, or delete budget relevant financial data such as budget and budget lines in Programs</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Project Manager</td>\n<td>\n<ul>\n<li>Owner of projects</li>\n<li>Responsible for managing all aspects of a project's success</li>\n<li>Able to add, edit, or delete budget relevant financial data such as budget and budget lines in Projects</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Proposal Reviewer</td>\n<td>\n<ul>\n<li>Responsible for reviewing the content of project proposals, approving proposals, and creating projects or programs</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Financial Manager</td>\n<td>\n<ul>\n<li>Able to add, edit, or delete budget lines in projects, programs, or portfolios</li>\n<li>Maintains the budget type list</li>\n<li>Maintains the financial metadata, including the financial calendar and chart of accounts</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<p>Review the individual permission assignments for each role in <b>Administration &gt; Master Data &gt; People &gt; Roles</b>.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/pplroles\" title=\"SMAX:25.1/pplRoles\">Roles</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}