{
  "title": "Problem Management",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><p class=\"mw-empty-elt\"></p><div><div><div class=\"Admonition_Tip\"><span class=\"autonumber\">Problem Management</span><div><div><p><br/>A problem is simply the cause of one or more incidents. The aim of the problem process is to minimize the impact of known problems on consumers and prevent recurring incidents.</p><p>Problem management encompasses the activities required to diagnose the root cause of incidents and determine short-term workarounds and long-term resolutions to those problems. It's also responsible for ensuring the correct resolutions are implemented through the correct control processes such as change management and release management.</p><p>Problem management also maintains information about existing problems and the appropriate workarounds and resolutions to reduce the number and impact of incidents over time. This results in a close relationship between problem management and knowledge management, with the addition of a known error database adding additional functionality to the knowledge process.</p>While incident management and problem management are separate processes, they are closely related and share attributes such as categorization, impact, and priority codes. This allows for easy consumption of problem management data by incidents.<div><div><a class=\"image\" href=\"/file/images/d/d5/Problem_Data_Model.gif\" title=\"/file/images/d/d5/Problem_Data_Model.gif\"> <img alt=\"Problem Data Model.gif\" border=\"0\" file=\"/mediawiki/images/d/d5/Problem_Data_Model.gif\" height=\"701\" hspace=\"0\" src=\"../../../images/Problem_Data_Model_6e5d1f3b.gif\" style=\"width:779px;height:701px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"779\"/> </a></div></div></div></div></div></div><h2>Using Problem Management</h2><p>One way we can reduce the number of Incidents our agents have to deal with is to keep them from happening in the first place. While that sounds far-fetched, that's exactly what the problem management process aims to do.</p><p>A problem, in the definition of this process, is the underlying cause of one or more incidents. To keep the problem from causing additional Incidents to occur, we need to diagnose the root cause, identify short-term workarounds if possible, and resolve the problem so that no more incidents will occur.</p><p>Think of it this way, if our roof is leaking we might run around and put down buckets to catch all the water. This is dealing with the incidents (the floor is getting wet), but the root cause of each of these incidents is the leaky roof. After the rain ends, we won't have to deal with the water again for a while, but if we don’t fix the root cause of the issue (our problem) then we will have to deal with a rash of incidents again the next time it rains.</p><p>While that simplistic example makes it clear that dealing with the problem will give us the best return on our investment over time, sometimes in the real world, we lose that focus while we are busy putting our buckets out and dealing with each incident as it occurs. Then when the rain lets up we forget about the problem because there are so many other things we need to focus on in our day-to-day operations. Then the cycle starts over again the next time our company sends out a mass email that causes a ton of users to hit the website at once causing overflow errors which start a chain reaction that ends up bringing down all of our servers… er, I mean the next time it rains.</p><p>We can use Service Management to not only keep these problems visible and prioritize them, but it also has tools to help us find problems we might not even realize we have.</p><p>Let’s take a look at how problem management works, and then we can see how some of the big data features of Service Management make it even more powerful.</p><h2>Setting up Problem Management</h2><p>We’re done! No really, we’ve done just about everything we need to do already. Problem uses the same record categories and groups we use for incident management, so there isn’t much more to do.</p><p>Okay, I know how much you love to work, so if you want to be gung-ho we can set up a few predefined views and reports specific to problem management. Happy now? Fine, now let’s check out the life cycle of an actual problem record.</p><h2>Problem Workflow</h2><p>The problem workflow uses the same high-level steps as incident management. Thinking about it, this shouldn’t be surprising. The difference between the two process is in the end goals rather than the execution. Incident stops once we resolve the immediate impact while problem goes farther to discover the root cause and remove the likelihood that the same issue will happen again.</p><p><a class=\"image\" href=\"/file/images/5/59/12.1-ProblemWorkflow.png\" title=\"/file/images/5/59/12.1-ProblemWorkflow.png\"> <img alt=\"12.1-ProblemWorkflow.png\" border=\"0\" file=\"/mediawiki/images/5/59/12.1-ProblemWorkflow.png\" height=\"245\" hspace=\"0\" src=\"../../../images/12.1-ProblemWorkflow_5384ac20.png\" style=\"width: 800px; height: 245px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p><h3>Classification</h3><p>Identical to the incident workflow, there are two phases of the 'Classification' step. The first is the 'Log' phase, where we enter the initial information such as the title and description of the issue and what service is being affected. After this information is saved the problem moves to the 'Classify' phase.</p><p>The only additional information required in the 'Classify' phase is a category. Once we fill the category in the problem will move on to the resolution step. When the problem created directly from an incident, this happens immediately.</p><h3>Resolution</h3><p>The 'Resolution' step comprises two phases, 'Investigate' and 'Resolve'. Our primary focus in the Investigate phase is the discovery of the root cause of the problem. The owner of the problem may create tasks for other agents to help with the investigation. Once he discovers the root cause and documents it in the problem record, the owner moves the problem into the 'Resolve' phase.</p><p>During the 'Investigation' phase, any related incidents dependent on the problem resolution receive notifications when the owner adds updates to the problem with certain information, including:</p><ul> <li>When a workaround is found</li> <li>When an expected resolution date is set</li></ul><p>These notifications are sent to the person assigned to the related incident.</p><p>Once the problem enters the 'Resolve' phase, it's classified as a known error. The focus on this phase is in resolving the root cause issue that's causing the problem. Note that this may often cause the agent to create related changes or more tasks within the problem itself. Once the agent resolves the primary issue and enters a resolution, the owner will manually move the problem to the next step for review.</p><p>When this transition to the 'Validation' step is taken, the people assigned to any related incidents are again notified.</p><h3>Validation</h3><p>The 'Validation' step includes a single phase, 'Review'. This phase allows the owner (or other designated person) to review the solution used to resolve the problem. If the solution isn't correct (if further testing showed the issue was ongoing for example), the owner may return the problem to the 'Resolve' phase for further troubleshooting.</p><p>Once the problem has been reviewed the person reviewing it may manually close the problem. When this step is taken, the assignees of any related incidents will again receive a notification that the problem has been resolved.</p><h2>Problem Tasks</h2><p>Similar to other areas in Service Management, tasks and task plans are available inside of the problems themselves. Again, these tasks become useful when we use them to assign work for someone to perform investigation around the root cause of the problem or help us to come up with the true resolution.</p><h2>When to Create Problems</h2><p>So how do we know that we have a problem? There are two primary methods we can use to create new problems: manual and guided.</p><h2>Manual Problem Analysis</h2><p>This part of the problem analysis process simply means we are looking at specific incidents as they occur. In this way, we are capitalizing on the knowledge of our agents as they resolve everyday issues. If an agent recognizes that an incident is very similar to one they have already looked at (or thinks it might readily occur again) they can create a problem directly from the incident — if they have the rights to create a new problem.</p><p>If they don’t have the rights to create a new problem, they simply mark the incident as a 'Problem candidate'. Our problem managers — agents responsible for the problem management process — will review all the flagged incidents. During the review, the problem manager will determine whether or not to create a problem from the incident.</p><h2>Guided Problem Analysis</h2><p>Guided Problem analysis takes advantage of Service Management’s powerful Big Data tools to analyze incident data to assist the problem managers in finding trends that may point out problems that aren’t apparent in manual analysis.</p><p>Using the Hot Topic Analytics engine on the incident records, the problem manager can find patterns and recurrences of related incidents. From these grouped incidents, they can then create a problem from multiple Incidents. These incidents will be linked to the created problem, so when the problem moves forward in its workflow Service Management updates the incident owners with relevant information.</p><p><a class=\"image\" href=\"/file/images/3/34/12.2-ProblemHotTopic.png\" title=\"/file/images/3/34/12.2-ProblemHotTopic.png\"> <img alt=\"12.2-ProblemHotTopic.png\" border=\"0\" file=\"/mediawiki/images/3/34/12.2-ProblemHotTopic.png\" height=\"392\" hspace=\"0\" src=\"../../../images/12.2-ProblemHotTopic_3c261b54.png\" style=\"width: 800px; height: 392px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p><!-- NewPP limit reportCached time: 20200217094210Cache expiry: 86400Dynamic content: falseCPU time usage: 0.020 secondsReal time usage: 0.097 secondsPreprocessor visited node count: 19/1000000Preprocessor generated node count: 48/1000000Post‐expand include size: 9079/2097152 bytesTemplate argument size: 0/2097152 bytesHighest expansion depth: 2/40Expensive parser function count: 0/100Unstrip recursion depth: 0/20Unstrip post‐expand size: 0/5000000 bytes--><!--Transclusion expansion time report (%,ms,calls,template)100.00%    0.000      1 -total--><!-- Saved in parser cache with key docops_wiki:pcache:idhash:875782-0!canonical and timestamp 20200217094210 and revision id 1577542 --></div><p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}