{
  "title": "Configuration comparison",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The configuration comparison feature on the <b>Processes and Rules</b> tab enables you to compare the latest out-of-the-box processes and rules with the existing configuration on your system. This feature can be very useful when activating new features or evaluating the level of customization of your system.</p>\n<p>To run a comparison between your existing configuration and the latest version of Service Management, click the <b>Standard mode/Comparison mode</b> toggle button on the <b>Processes and Rules</b> tab to display it in Comparison mode. The current rules and processes on your system appear on the left; the latest out-of-the-box rules and processes appear on the right.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> A user with permission to access the <b>Processes and Rules</b> tab for a record type can also access the configuration comparison feature for that record type.</p>\n</div>\n<h2 class=\"mw-headline\" id=\"Compare_rules\">Compare rules</h2>\n<p>To analyze the comparison of the rules, follow these steps:</p>\n<ol>\n<li>\n<p>In the tree on the left, the circled numbers next to the different levels of the tree indicate the number of differences found in rules defined for that level only.</p>\n<p><a class=\"image\" href=\"/file/images/1/11/2018.08_Helpcenter/Resources/Images/EM/Compare_changes_count.png\" title=\"/file/images/1/11/2018.08_Helpcenter/Resources/Images/EM/Compare_changes_count.png\"> <img alt=\"Compare changes count.png\" data-file-height=\"278\" data-file-width=\"236\" height=\"278\" src=\"../../../images/Compare_changes_count_cdc9b1ed.png\" width=\"236\"/> </a></p>\n<p>Select a level with differences (the record type or a process, metaphase, phase or transition). If the <b>Show identical rules</b> check box is selected, all the rules are displayed (rules with differences and rules without differences).</p>\n</li>\n<li>\n<p>In the right pane (the latest out-of-the-box rules and processes), a circled number appears in either the Properties or Rules tab (or both tabs), indicating the number of differences on that tab.</p>\n<p>In the Rules tab, a circled number next to a process event indicates the number of rules with differences under that process event. Select a process event with differences and expand it.</p>\n</li>\n<li>\n<p>The rules with differences are shown with a purple border. These represent current rules that differ from the out-of-the-box version in the condition and/or parameters. When you select the rule, a line appears connecting the out-of-the-box version with the current version.</p>\n<p>To replace the current rule with the out-of-the-box rule, click <b>Update rule</b>.</p>\n<p><a class=\"image\" href=\"/file/images/c/c9/2018.08_Helpcenter/Resources/Images/EM/Compare_update_rule.png\" title=\"/file/images/c/c9/2018.08_Helpcenter/Resources/Images/EM/Compare_update_rule.png\"> <img alt=\"Compare update rule.png\" data-file-height=\"203\" data-file-width=\"1365\" height=\"203\" src=\"../../../images/Compare_update_rule_befa3353.png\" width=\"1365\"/> </a></p>\n</li>\n<li>\n<p>If a current rule matches an out-of-the-box rule but the rule order was changed, both rules are shown with a purple border and a placeholder appears in the current rules opposite the out-of-the-box rule. When you select the rule, a line appears connecting the out-of-the-box version with the current version.</p>\n<p><a class=\"image\" href=\"/file/images/e/e4/2018.08_Helpcenter/Resources/Images/EM/Compare_moved_rule.png\" title=\"/file/images/e/e4/2018.08_Helpcenter/Resources/Images/EM/Compare_moved_rule.png\"> <img alt=\"Compare moved rule.png\" data-file-height=\"420\" data-file-width=\"1370\" height=\"420\" src=\"../../../images/Compare_moved_rule_55b26e3a.png\" width=\"1370\"/> </a></p>\n</li>\n<li>\n<p>If a rule in the current rules doesn't appear in the out-of-the-box rules (a custom rule), it appears in the current rules with a purple border. A blank space appears opposite it in the out-of-the-box rules.</p>\n<p><a class=\"image\" href=\"/file/images/3/39/2018.08_Helpcenter/Resources/Images/EM/Compare_custom_rule_only.png\" title=\"/file/images/3/39/2018.08_Helpcenter/Resources/Images/EM/Compare_custom_rule_only.png\"> <img alt=\"Compare custom rule only.png\" data-file-height=\"505\" data-file-width=\"1358\" height=\"505\" src=\"../../../images/Compare_custom_rule_only_5251ac6c.png\" width=\"1358\"/> </a></p>\n</li>\n<li>\n<p>If an out-of-the-box rule is missing in the current rules, a placeholder appears in the current rules opposite the out-of-the-box rule. To add the out-of-the-box rule to the current workflow, select the rule and click <b>Update rule</b>.</p>\n<p><a class=\"image\" href=\"/file/images/7/70/2018.08_Helpcenter/Resources/Images/EM/Compare_OOTB_rule_only.png\" title=\"/file/images/7/70/2018.08_Helpcenter/Resources/Images/EM/Compare_OOTB_rule_only.png\"> <img alt=\"Compare OOTB rule only.png\" data-file-height=\"302\" data-file-width=\"1356\" height=\"302\" src=\"../../../images/Compare_OOTB_rule_only_7e9c9182.png\" width=\"1356\"/> </a></p>\n</li>\n<li>If a rule is disabled in the current rules, it appears shaded in the current rules.</li>\n<li>\n<p>If you selected <b>Detect similar rules</b> on the toolbar, similar rules are shown with an orange border. These represent current rules that match the out-of-the-box version with minor differences in the condition and/or parameters. When you select the rule, a line appears connecting the out-of-the-box version with the current version.</p>\n<p>To link the current rule with the out-of-the-box rule, click <b>Link rules</b>. This identifies the current rule with the out-of-the-box rule within the system. If any change is made to the out-of-the-box rule in the future, it will be shown as a difference with the current rule.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> The current rule isn't overwritten with the out-of-the-box rule when using the <b>Link rules</b> option.</p>\n</div>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Compare_phases_and_transitions\">Compare phases and transitions</h2>\n<p>To analyze the comparison of the phases and transitions, follow these steps:</p>\n<ol>\n<li>\n<p>If a phase in the out-of-the-box rules isn't found in the current rules, it appears in purple in the tree. When you select it, the phase's rules and properties appear in the out-of-the-box rules. Click <b>Add to workflow</b> to add the phase along with its rules, properties, and transitions to the current workflow.</p>\n</li>\n<li>\n<p>If a transition in the out-of-the-box rules isn't found in the current rules, it appears in purple in the tree. When you select it, the transition's rules and properties appear in the out-of-the-box rules. Click <b>Add to workflow</b> to add the transition along with its rules and properties to the current workflow.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> If the transition missing from the current rules leads to or away from a phase that's also missing from the current rules, you must add the phase first and then add the transition.</p>\n</div>\n</li>\n<li>\n<p>If a phase or transition in the current rules isn't found in the out-of-the-box rules, it appears in black in the tree. Such phases and transitions are known as custom phases and transitions and a custom icon is displayed next to them.</p>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/workingwithprocesses\" title=\"SMAX:25.1/WorkingWithProcesses\">Working with processes</a></li>\n<li><a href=\"/doc/423/26.1/addphase\" title=\"SMAX:25.1/AddPhase\">How to add a phase in a process</a></li>\n<li><a href=\"/doc/423/26.1/addtransition\" title=\"SMAX:25.1/AddTransition\">How to add a transition in a process</a></li>\n<li><a href=\"/doc/423/26.1/movephase\" title=\"SMAX:25.1/MovePhase\">How to move a phase or transition in a process</a></li>\n<li><a href=\"/doc/423/26.1/embizrules\" title=\"SMAX:25.1/emBizRules\">Studio business rules</a></li>\n<li><a href=\"/doc/423/26.1/rulesdescriptionstags\" title=\"SMAX:25.1/RulesDescriptionsTags\">Business rule descriptions and tags</a></li>\n<li><a href=\"/doc/423/26.1/addbizrule\" title=\"SMAX:25.1/AddBizRule\">How to add a business rule</a></li>\n<li><a href=\"/doc/423/26.1/modifybizrule\" title=\"SMAX:25.1/ModifyBizRule\">How to edit, remove, or disable a business rule</a></li>\n<li><a href=\"/doc/423/26.1/processes\" title=\"SMAX:25.1/Processes\">Processes and Rules</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}