{
  "title": "Overview of promoting content pack",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>This topic gives an overview of promoting a content pack in Operations Orchestration (OO) Central.</p>\n<h2 id=\"What_is_promotion?\"><span class=\"mw-headline\" id=\"What_is_promotion.3F\">Promotion</span></h2>\n<p>Promotion is the process of deploying content packs across several environments, in order to ensure that results are predictable and without (unknown) risks. This is in particular important for maintaining a stable production environment that contains content that has been tested and validated prior to deployment.</p>\n<p>For example, deploying the content pack on the following Central environments: Development, QA, Staging, Production.</p>\n<p>The final aim of promotion is to deploy a new content pack to the Central Production server, to make the flows available to users.</p>\n<h2 id=\"Is_promotion_the_same_as_deployment?\"><span class=\"mw-headline\" id=\"Is_promotion_the_same_as_deployment.3F\">Promotion versus deployment</span></h2>\n<p>Deployment is part of a promotion. However, the promotion process also includes other tasks, such as:</p>\n<ul>\n<li>Configuring the content pack: configuring worker group aliases, mapping system accounts, and more</li>\n<li>Testing and troubleshooting the flows in the content pack</li>\n</ul>\n<h2 id=\"What_is_a_content_pack?\"><span class=\"mw-headline\" id=\"What_is_a_content_pack.3F\">Content pack</span></h2>\n<p>A content pack is a file containing operations, flows, actions, and configuration items. When flow authors complete a project, they package it into a content pack for promotion on the Central server.</p>\n<ul>\n<li>CloudSlang operations use actions that are Java based or python based.</li>\n<li>Native OO flows/operations use actions that are Java-based or <code>.Net</code> based.</li>\n</ul>\n<h2 id=\"When_do_you_promote_a_content_pack?\"><span class=\"mw-headline\" id=\"When_do_you_promote_a_content_pack.3F\">When do you promote a content pack?</span></h2>\n<p>You promote a content pack when:</p>\n<ul>\n<li>There is a need for new content in the Production environment.</li>\n<li>You have fixed a bug in a flow and need to upload the new version of the flow to the Production environment.</li>\n<li>You need to add new functionality to an existing flow in the Production environment.</li>\n<li>You are upgrading to a new version of an out-of-the-box content pack.</li>\n</ul>\n<h2 id=\"Who_does_the_promotion?\"><span class=\"mw-headline\" id=\"Who_does_the_promotion.3F\">Who does the promotion?</span></h2>\n<p>The promotion process in each of the environments is slightly different and may be done by a different persona. However, in most cases, it is the Tenant Admin who is responsible for promotion.</p>\n<p>The person doing the promotion must be assigned a role with <b>View Content Packs</b> and <b>Manage Content Packs</b> permissions.</p>\n<h2 id=\"What_is_a_content_pack_patch?\"><span class=\"mw-headline\" id=\"What_is_a_content_pack_patch.3F\">What is a content pack patch?</span></h2>\n<p>A content pack patch is used when a content pack has already been promoted on the Central server, and then modifications were made in the project in Studio. By deploying a patch, the Op Admin only replaces the files that were modified, and does not have to replace the entire content pack with a new version.</p>\n<p>For example, a flow author creates a content pack called <b>MyCP1.0</b>, which contains a large number of flows and operations. The Op Admin promotes this content pack to the Staging server. However, there are problems with three of the flows. The flow author fixes the problematic flows and creates a new content pack called <b>MyCP1.2-patch</b>, which contains only the three modified flows. When the Op Admin deploys <b>MyCP1.2-patch</b>, the three flows on the Staging server are overwritten with the new versions.</p>\n<h2 class=\"mw-headline\" id=\"Promotion_steps\">Promotion steps</h2>\n<div class=\"Admonition_Note\">This is just a high level look at the OO Central workflow, and there are many options that are not described here. For more detailed information about any of the steps, use the links to learn about the options in-depth.</div>\n<p><strong>Step 1: Get the Content Pack From the Flow Author</strong></p>\n<ol>\n<li>The Flow Author creates a content pack or a content pack patch in Workflow Designer.</li>\n<li>The Flow Author saves the content pack to the Artifact Repository.</li>\n<li>The Flow Author shares the content pack with the Suite/Tenant Admin/OO user with the promoter permission.</li>\n</ol>\n<p><b>Step 2: Deploy to a non-Production Server</b></p>\n<ol>\n<li>The Suite/Tenant Admin receives the content pack from the Flow Author/OO User.</li>\n<li>The Suite/Tenant Admin deploys the content pack on the non-Production server, for example, the Staging server.</li>\n</ol>\n<p><strong>Step 3: Configure the Content in the Content Pack</strong></p>\n<p>In this step, the Suite/Tenant Admin adjusts the content pack to the environment by configuring the content in it.</p>\n<ol>\n<li>The Suite/Tenant Admin the content permissions on the flows.</li>\n<li>The Suite/Tenant Admin sets the persistence level and runs timeout for the flows.</li>\n</ol>\n<p><strong>Step 4: Set up the Configuration Items in the Content Pack</strong></p>\n<p>In this step, the Suite/Tenant Admin adjusts the content pack to the environment by setting up the configuration items in it.</p>\n<ol>\n<li>If the content pack includes system and system properties, the Suite/Tenant Admin assigns values to these in the content pack.</li>\n<li>The Suite/Tenant Admin maps the aliases of the worker groups to actual worker groups.</li>\n</ol>\n<p><b>Step 5: Test and Troubleshoot the Flows in the Content Pack</b></p>\n<ol>\n<li>The Suite/Tenant Admin runs each flow from <b>Content Management</b> &gt; <b>Flow Library</b> and checks whether it runs properly.</li>\n<li>If a flow run fails, the Suite/Tenant Admin can drill down into a flow to identify the problems.</li>\n</ol>\n<p><b>Step 6: Deploy to the Production Server</b></p>\n<ol>\n<li>If required, the Suite/Tenant Admin adjusts the configuration of the content pack, for the Production server. For example, it may be necessary to map the worker group aliases and system accounts differently for this server.</li>\n<li>Finally, the Suite/Tenant Admin deploys the content pack to the Production server.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li>For instructions to deploy and manage content packs, see <a href=\"/doc/423/26.1/deploymanageoocp\" title=\"SMAX:25.1/DeployManageOOCP\">Deploy and manage content packs</a>.</li>\n<li>To learn how to manage the flow library, see <a href=\"/doc/423/26.1/manageooflowlibrary\" title=\"SMAX:25.1/ManageOOFlowLibrary\">Manage the flow library</a>.</li>\n<li>For information related to setting up configuration items, see <a href=\"/doc/423/26.1/setupooconfigitems\" title=\"SMAX:25.1/SetupOOConfigItems\">Set up configuration items for a content pack</a>.</li>\n<li>To track and manage your flow runs, see <a href=\"/doc/423/26.1/trackmanageooflowruns\" title=\"SMAX:25.1/TrackManageOOFlowruns\">Track and manage flow runs</a>.</li>\n<li>To test and troubleshoot a flow run, see <a href=\"/doc/423/26.1/testtroubleshootooflowrun\" title=\"SMAX:25.1/TestTroubleshootOOFlowrun\">Test and troubleshoot a flow run</a>.</li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}