{
  "title": "Deployment Resource Providers",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>A <strong>Cloud Management license</strong> should be assigned to the tenant to access the <strong>Deployment Resource Providers</strong> functionality. <br/>\n<br/>\nFrom the main menu, select <b>Administration </b>&gt; <b>Utilities </b>&gt; <b>Providers </b>&gt; <b>Deployment Resource Providers</b>.</p>\n<p>Deployment resource providers are management platforms that offer centralized control over the infrastructure and resources used in a cloud computing environment. For example, a provider such as VMware vCenter can deploy virtual machines, while a provider such as <code>OpenText</code> SiteScope can monitor applications.</p>\n<p>A provider corresponds to a specific instance of an application that can be used to provision service designs. For example, to provision service designs that target VMware vCenter, you must first create a provider (with a provider type of VMware vCenter).</p>\n<p><b>Provider types</b></p>\n<p>A provider type allows you to classify providers for improved filtering and identification. By default, the product includes some predefined, out-of-the-box provider types. Each instance of a provider can have a single provider type.</p>\n<p>Each instance of a resource offering (used with sequenced designs) can have a single provider type. In addition, resource offerings can be associated only with providers that share the same provider type.</p>\n<h2 id=\"Tasks\">Tasks</h2>\n<p>You can perform the following tasks in this area:</p>\n<ul>\n<li><b>Manage provider types</b> - Click the gear icon and select <b>Manage Provider Types</b>. For more information, see the topic on Manage provider types.</li>\n<li><b>Create a Provider</b> - In the left pane, select <b>All Providers</b> or select the type for which you want to create a provider. In the right pane, select the <b>Providers</b> tab. Click the gear icon and select <b>Create Resource Provider</b>. See the topic on Creating, editing and deleting providers for more information about configuring a provider.</li>\n<li><b>See more information about a provider</b> - Click a provider to see more information about the provider.</li>\n</ul>\n<p><a class=\"image\" href=\"/file/images/e/eb/4.92/Management_Console/Shared_Content/icons/icon-lock.png\" title=\"/file/images/e/eb/4.92/Management_Console/Shared_Content/icons/icon-lock.png\"> <img alt=\"icon-lock.png\" data-file-height=\"17\" data-file-width=\"14\" height=\"17\" src=\"../../../images/icon-lock_37ebf97d.png\" width=\"14\"/> </a> Locked items can't be deleted.</p>\n<p>If you do not see any providers in this area, then create the providers of your choice. You can refer to the capsule documentation for more information.</p>\n<h2>Related topics</h2>\n<p>To refer to the capsule documentation, see the <a href=\"/admin/A-Z/2\" title=\"ITOM Practitioner's Portal\">ITOM Practitioner's Portal</a>.</p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}