{
  "title": "Studio",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Studio enables a tenant admin to manage workflows for record types. This includes creating custom record types, defining and editing a record type's fields, forms, business rules, processes and notifications, as well as importing data and defining custom actions for the record type. The following tabs are available:</p>\n<ul>\n<li><a href=\"/doc/423/26.1/fields\" title=\"Fields\">Fields</a>. The fields of a record are derived from the metadata for the record type.</li>\n<li><a href=\"/doc/423/26.1/forms\" title=\"Forms\">Forms</a>. There are out-of-the-box forms defined for each record type. The forms are used for different purposes. For example, the <b>New Incident</b> form is used to create an incident in Incident Management.</li>\n<li><a href=\"/doc/423/26.1/processes\" title=\"Processes and Rules\">Processes and Rules</a>. A workflow service provides a consistent way for applications to define and run business logic for their records. A workflow for a record contains processes, which are broken down into metaphases, and further into phases. The passage from one phase into another is called a transition. The business logic of a record's workflow is established by business rules.</li>\n<li><a href=\"/doc/423/26.1/notifications\" title=\"Notifications\">Notifications</a>. Notification templates are pre-formatted email messages that you can edit. You can configure notifications to be sent to the relevant recipients at specific points in a record's workflow.</li>\n<li><a href=\"/doc/423/26.1/approvaldefn\" title=\"Approval definitions\">Approval definitions</a>. When implementing certain types of changes, approvals must be granted at certain phases of the workflow before moving on to the next phase. You can configure these approvals in the Approval definitions tab for the article, change, idea, proposal, release, and request record types only.</li>\n<li><a href=\"/doc/423/26.1/importdata\" title=\"Import data\">Import data</a>. Enables you to import record data for the selected record type. The imported data must be in CSV format.</li>\n<li><a href=\"/doc/423/26.1/importtrans\" title=\"Import translations\">Import translations</a>. You can import localized data files for the category, service definition, and offering record types only.</li>\n<li><a href=\"/doc/423/26.1/customactions\" title=\"Custom actions\">Custom actions</a>. Enables you to configure custom actions for the selected record type.</li>\n<li><a href=\"/doc/423/26.1/uicomponents\" title=\"UI components\">UI components</a>: Enables you to configure UI elements to improve both usability and visual appeal.</li>\n<li><a href=\"/doc/423/26.1/saglobalsearch\" title=\"Global search\">Global search</a>. Allows you to configure index fields so that you can enable global search for record types that you customized or other out-of-the-box (OOTB) record types that are currently unsearchable.</li>\n<li><a href=\"/doc/423/26.1/sltsettings\" title=\"SLT settings\">SLT settings</a>. Enables you to control the notifications sent for Service Level Target breaches for incidents and requests; enables you to control the SLT calculation and fields configuration for records created in Studio.</li>\n<li><a href=\"/doc/423/26.1/plfrmauthorization\" title=\"Authorization\">Authorization</a>. Enables you to manage strong identity validation for the approval task process. Available for the task record type only.</li>\n<li><a href=\"/doc/423/26.1/createcustomapp\" title=\"Create and configure custom application and record type\">Create and configure custom application and record type</a>. Enables you to create new applications and record types. Once custom application applications and record types are created, you can set their behaviors through the features above.</li>\n<li><a href=\"/doc/423/26.1/rlacsettings\" title=\"Access filter\">Access control</a>. Use this tab to configure record level access control (RLAC) for the record type. </li>\n<li><a href=\"/doc/423/26.1/nativesacmfunction\" title=\"SACM setting\">SACM setting</a>. Use this tab to find the mapping information and federation API (from the “UCMDB Gateway”) that's used.</li>\n<li><a href=\"/doc/423/26.1/configureinbox#Map_entities_to_inbox\" title=\"Inbox\">Inbox</a>: Use this tab to enable the inbox configuration and map entities to inbox.</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>A workflow, process, metaphase, phase, transition, or business rule can be locked, indicated by a lock icon <a class=\"image\" href=\"/file/images/e/e7/2018.08_Helpcenter/Resources/Images/Icons/PadlockIcon.png\" title=\"/file/images/e/e7/2018.08_Helpcenter/Resources/Images/Icons/PadlockIcon.png\"> <img alt=\"PadlockIcon.png\" data-file-height=\"13\" data-file-width=\"13\" height=\"13\" src=\"../../../images/PadlockIcon_42ddff3a.png\" width=\"13\"/> </a> . This means that its properties can't be edited, rules can't be added, and the phase or transition can't be deleted. The locked status is set out-of-the-box for specific phases, metaphases, and so on.</li>\n<li>On each tab in Studio, an asterisk on the tab indicates that unsaved changes were made in that tab.</li>\n<li>Some tabs (for example, Access control, Inbox, and UI components) are not available for certain record types.</li>\n<li>The Tenant Admin role is required to perform these actions in Studio. </li>\n</ul>\n</div>\n</div>\n<p>Each module has its own workflow(s). For example:</p>\n<ul>\n<li>For more information about the Incident Management workflow, see <a href=\"/doc/423/26.1/imwflw\" title=\"SMAX:25.1/imWflw\">Incident workflow</a>.</li>\n<li>For more information about the Change Management workflows, see <a href=\"/doc/423/26.1/changewflw\" title=\"SMAX:25.1/ChangeWflw\">Change workflow</a>.</li>\n<li>For more information about the Problem Management workflow, see <a href=\"/doc/423/26.1/pmwflw\" title=\"SMAX:25.1/pmWflw\">Problem workflow</a>.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<p><a href=\"/doc/423/26.1/fieldmapping\" title=\"SMAX:25.1/FieldMapping\">Cross-record field mapping</a></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}