{
  "title": "Reports list pane",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The Reports list pane, located on the left, displays a list of all existing reports.</p>\n<h2 class=\"mw-headline\" id=\"Reports_list_user_interface\">Reports list user interface</h2>\n<p>The following table describes the user interface elements of the pane:</p>\n<table>\n<tbody>\n<tr>\n<th>Element</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Report list</td>\n<td>\n<p>Select a report in the list to display it in the center pane. The reports in the list are color coded by report record type. For private reports, an icon indicates who created the report:</p>\n<ul>\n<li><a class=\"image\" href=\"/file/images/5/51/2018.08_Helpcenter/Resources/Images/Icons/PrivateReportMine.png\" title=\"/file/images/5/51/2018.08_Helpcenter/Resources/Images/Icons/PrivateReportMine.png\"> <img alt=\"PrivateReportMine.png\" data-file-height=\"29\" data-file-width=\"27\" height=\"29\" src=\"../../../images/PrivateReportMine_a161a5d5.png\" width=\"27\"/> </a> for private reports you created.</li>\n<li><a class=\"image\" href=\"/file/images/6/67/2018.08_Helpcenter/Resources/Images/Icons/PrivateReport.png\" title=\"/file/images/6/67/2018.08_Helpcenter/Resources/Images/Icons/PrivateReport.png\"> <img alt=\"PrivateReport.png\" data-file-height=\"24\" data-file-width=\"24\" height=\"24\" src=\"../../../images/PrivateReport_a4191626.png\" width=\"24\"/> </a> for private reports created by other users.</li>\n</ul>\n<p>The list has two sections:</p>\n<ul>\n<li><b>Recently viewed.</b> Displays the five most recently viewed reports.</li>\n<li>\n<p><b>All Reports.</b> Displays all existing reports.</p>\n<p>You can use the <b>Sort by</b> box to sort the list by the following criteria:</p>\n<ul>\n<li>Report name (alphabetically)</li>\n<li>Access (Private/Group/Public)</li>\n<li>State (Active/Inactive)</li>\n<li>\n<p>Report type (Analytic/Operational)</p>\n</li>\n</ul>\n</li>\n</ul>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> The sort functionality is case-sensitive.</p>\n</div>\n<p>For information on view permission for reports, see the <em>Report permissions</em> section.</p>\n</td>\n</tr>\n<tr>\n<td>Search window</td>\n<td>\n<p>Enter the first few letters of a report name in the Search window to search for the report.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> The search only matches the beginning of the report name. You must enter the first few letters of the first word of a report name.</p>\n</div>\n</td>\n</tr>\n<tr>\n<td>New</td>\n<td>Click <b>New</b> to create a new report. For more information on creating reports, see <a href=\"/doc/423/26.1/wokwithreport#Reports_Create_report\" title=\"SMAX:25.1/WokWithReport\">How to work with reports</a>.</td>\n</tr>\n<tr>\n<td>Delete</td>\n<td>\n<p>Click <b>Delete</b> to delete the selected report. </p>\n<p>For information on delete permission for reports, see the <em>Report permissions</em> section.</p>\n</td>\n</tr>\n<tr>\n<td>Display inactive reports</td>\n<td>Click <b>Display inactive reports</b> to include inactive reports in the Report list. The inactive reports appear in grey in the list and don't display data in the center pane when selected.</td>\n</tr>\n<tr>\n<td>Quota bar</td>\n<td>The <b>Quota bar</b> indicates the percent of the report quota currently used by the active analytic reports. For more information on the report quota, see the <em>Report quota management </em>section.</td>\n</tr>\n</tbody>\n</table>\n<p>By default, there are more than 100 preset reports, for example:</p>\n<ul>\n<li>Status of active Fulfillment SLTs</li>\n<li>Analysis of Group load by OLA</li>\n<li>Resolution SLT achievement results by team</li>\n<li>Status of active Time in Group OLTs</li>\n<li>Article ranking</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Report_permissions\">Report permissions</h2>\n<p>An <b>Admin user</b> is a user with the Reports publisher role. A <b>Non-admin user</b> is a user with other roles. The Reports list for an Admin user displays all public and private reports. For a Non-admin user, it displays only public reports and private reports created by that user.</p>\n<p>To view the report data for a report in the list, a user must have <b>View</b> permission for the record type of the selected report. View permission for the record type is also required to export a report.</p>\n<p>Permission to create and delete reports and to view and edit report properties</p>\n<p>An Admin user can view and edit report properties for all reports. He can create both public and private reports (both operational and analytic) and duplicate existing reports. He can delete all reports except for out-of-the-box reports, which can't be deleted. He also has permission to change the report type and activate and deactivate analytic reports.</p>\n<p>A non-admin user can view the report properties for reports that he created as well as for public reports created by other users on the tenant. He can edit the report properties only for reports that he created. He can create private reports but not public reports and duplicate public or private reports. He can change the report type and activate and deactivate analytic reports that he created. For analytic reports that he creates, the recalculation frequency is limited to once a day or a lower frequency (a calculation period of one day or longer). He can delete only reports that he created.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> These permissions are independent of the permission to view report data, which depends on permission for the record type. A user who doesn't have permission for a report record type can view or edit the report properties even though he can't view the report data.</p>\n</div>\n<p>The following table summarizes the report properties and create and delete permissions for reports:</p>\n<table>\n<tbody>\n<tr>\n<th></th>\n<th>Public reports</th>\n<th>Private reports created by this user</th>\n<th>Private reports created by a different user on the tenant</th>\n</tr>\n<tr>\n<td>Non-admin user</td>\n<td>\n<ul>\n<li>View report properties</li>\n<li>Duplicate reports</li>\n</ul>\n</td>\n<td>\n<ul>\n<li>View and edit report properties</li>\n<li>Create and duplicate reports</li>\n<li>Delete reports</li>\n<li>Activate/deactivate analytic reports</li>\n<li>Change report type</li>\n</ul>\n</td>\n<td>No permission</td>\n</tr>\n<tr>\n<td>Admin user</td>\n<td>\n<ul>\n<li>View and edit report properties</li>\n<li>Create and duplicate reports</li>\n<li>Delete reports (out-of-the-box reports can't be edited or deleted)</li>\n<li>Activate/deactivate analytic reports</li>\n<li>Change report type</li>\n</ul>\n</td>\n<td>\n<ul>\n<li>View and edit report properties</li>\n<li>Create and duplicate reports</li>\n<li>Delete reports</li>\n<li>Activate/deactivate analytic reports</li>\n<li>Change report type</li>\n</ul>\n</td>\n<td>\n<ul>\n<li>View and edit report properties</li>\n<li>Duplicate reports</li>\n<li>Delete reports</li>\n<li>Activate/deactivate analytic reports</li>\n<li>Change report type</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"Reports_and_data_domain_segmentation\">Reports and data domain segmentation</h2>\n<p>For operational reports, the data reflected in the report depends on the data domains assigned to the user viewing the report. Two users with different assigned data domains who are viewing the same operational report will see reports based on different data.</p>\n<p>For analytic and survey reports, the report is based on data from the data domains assigned to the user who created the report. A user assigned the same data domains or more can view the report. A user assigned fewer data domains than the one who created the report is unable to view the report (it appears in the Report list but can't be accessed).</p>\n<p>If you select <b>Duplicate</b> to create a duplicate of the analytic or survey report, the new report is visible and it's based on data from the data domains assigned to you.</p>\n<div class=\"example\">\n<p>Example: User A is assigned the HR data domain only and User B is assigned the IT data domain only. User A creates an analytic report based on Request record data consisting of a set of records:</p>\n<ul>\n<li>Request 1 is assigned to the HR data domain</li>\n<li>Request 2 is assigned to the HR and IT data domains</li>\n<li>Request 3 is assigned to the HR data domain</li>\n</ul>\n<p>User A's report includes all 3 records. User B can't view this report because he lacks the HR data domain assignment. However, if User B duplicates the report, he will create a new report with Request 2 only, which has the IT data domain assignment.</p>\n</div>\n<p>For more information on data domains, see <a href=\"/doc/423/26.1/datadomainseg\" title=\"SMAX:25.1/DataDomainSeg\">Data domain segmentation</a>.</p>\n<h2 class=\"mw-headline\" id=\"Report_quota_management\">Report quota management</h2>\n<p>Every tenant is given a total capacity, known as a quota. When an analytic or survey report is activated, it's counted toward the report quota. The quota usage is based on the number of active analytic and survey reports as well as the recalculation frequency of those reports. When you reach 90% of your quota, the quota bar indicator appears in yellow, and when the quota is full, the indicator appears in red. Click the <b>Activate/Deactivate</b> button on the toolbar to activate or deactivate the current report.</p>\n<p>If you attempt to activate a report that will result in exceeding your quota, an error message is displayed and the report isn't activated. You can deactivate other active reports to reduce your quota usage and then open the selected report. When a report is inactive, it doesn't display data in the main report pane. Alternatively, you can reduce the recalculation frequency of some reports to reduce your quota usage.</p>\n<p>New analytic and survey reports are defined as active by default. If the new report will result in exceeding your quota, the error message appears and the report is saved as inactive.</p>\n<h3>How report quota points are calculated</h3>\n<p>The report quota is calculated in \"points.\" With the tenant application setting \"<a href=\"/doc/423/26.1/tenantdetails#Application_settings\">Report quota</a>,\" the admin can set the maximum number of points, which ranges from 1,095,000 to 3,650,000.<strong> </strong>The number of points one single report consumes is its execution times per year. How many times will it be executed per year? Well, it depends on whether it is an hourly, daily, weekly, monthly, or yearly report. The following examples can give us an idea on how the points are calculated.</p>\n<ul>\n<li><strong>Hourly report:</strong> 365*24 = 8,760 points</li>\n<li><strong>Daily report:</strong> 365 points</li>\n<li><strong>Weekly report:</strong> 365/7 = 52 points</li>\n<li><strong>Monthly report:</strong> 12 points</li>\n<li><strong>Yearly report:</strong> 1 point</li>\n<li><strong>10 daily reports:</strong> 10*365 = 3,650 points</li>\n<li><strong>10 weekly reports:</strong> 10*52 = 520 points</li>\n<li><strong>10 monthly reports:</strong> 10*12 = 120 points</li>\n</ul>\n<div>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/report\" title=\"SMAX:25.1/Report\">Reports</a></li>\n<li><a href=\"/doc/423/26.1/reprtscenterpane\" title=\"SMAX:25.1/ReprtsCenterPane\">Reports center pane</a></li>\n<li><a href=\"/doc/423/26.1/wokwithreport\" title=\"SMAX:25.1/WokWithReport\">How to work with reports</a></li>\n<li><a href=\"/doc/423/26.1/reportscalculatedfields\" title=\"SMAX:25.1/ReportsCalculatedFields\">How to use duration based calculated fields in reports</a></li>\n</ul>\n</div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}