{
  "title": "Scheduled reports",
  "content": "<div class=\"mw-parser-output\"><br/><br/><p>With a preset schedule, SMAX can regularly generate certain reports and send them to a group of recipients through emails. To create/delete a report schedule, click the <b>Schedules</b> tab on the <b>Reports</b> page, and then click <b>New</b> or <b>Delete</b>.</p>\n<p><b>Note:</b> To create scheduled reports, an IT agent needs the <b>Define schedule tasks for email reports</b> role permission.</p>\n<p>The creation or deletion of a schedule is straightforward, the following schedule properties are provided as an example of how a schedule is configured.</p>\n<ul>\n<li><b>Name:</b> Daily schedule A</li>\n<li><b>Display name:</b> OLA analysis and article ranking</li>\n<li><b>Description:</b> It's a report schedule example.</li>\n<li><b>Reports:</b> Analysis of Group load by OLA; Article ranking</li>\n<li><b>Report format:</b> PDF and CSV</li>\n<li><b>Internal recipients:</b> Test user A</li>\n<li><b>External recipients:</b> Test user B </li>\n<li><b>Group recipients:</b> Release Manager Group</li>\n<li><b>Send email every:</b> 1 Day</li>\n<li><b>Send email at:</b> 5:00 PM</li>\n<li><b>Effective from</b> 06/01/2019 <b>Until</b> 06/10/2019</li>\n</ul>\n<p>In this example, a report schedule named \"OLA analysis and article ranking\" is shown in the schedule list. When it's enabled, the <b>Analysis of Group load by OLA</b> and <b>Article ranking</b> reports are generated at 5 p.m. from June 1 to June 10, 2019 on a daily basis. Meanwhile, they will be emailed to <b>Test user</b><b> A</b>, <b>Test user B</b>, and <b>Release Manager Group</b> in PDF and CSV formats.</p>\n<h2 class=\"mw-headline\" id=\"Notes_and_tips_of_using_scheduled_reports\">Notes and tips for using scheduled reports</h2>\n<p>Be aware of the following notes and tips while using scheduled reports.</p>\n<h3 class=\"mw-headline\" id=\"Maximum_number_of_schedules_and_reports\">Maximum number of schedules and reports</h3>\n<ul>\n<li>You can create up to 100 schedules.</li>\n<li>You can add up to 5 reports within each schedule.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Recipients\">Recipients</h3>\n<ul>\n<li>In each schedule, you can add:\n\t<ul>\n<li>Up to 50 internal recipients.</li>\n<li>Up to 50 external recipients, separated by semicolons.</li>\n<li>Up to 10 groups.</li>\n</ul>\n</li>\n<li>If the application setting <b>Recipient allowlist</b> is enabled, make sure your external recipient list complies with it.</li>\n<li>If an individual or group recipient's status is changed (for example, retired) after being added to the recipient list, it will not be automatically removed from the recipient list. To prevent such inactive users/groups from receiving further reporting emails, you need to manually remove them from the recipient list.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Time_zone\">Time zone</h3>\n<p>The time zone of the email schedule is as follows:</p>\n<ul>\n<li>\n<p>The time portion (the <strong>Send email at</strong> value) of the schedule is based on the time zone of the x-runtime platform pod.</p>\n</li>\n<li>\n<p>The date portion (the <strong>Effective from</strong> and <strong>Until</strong> values) of the schedule is based on the agent user's local time zone.</p>\n</li>\n</ul>\n<p>For example, if your SMAX server is in the UTC+1 time zone, and the email recipients are in the UTC+6 time zone, to schedule the email for 02:00 (users' time) everyday, from February 6th till March 6th, 2024, you can configure the schedule as follows:</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"report schedule example\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/a/a9/ReportScheduleExample.png\" height=\"253\" hspace=\"0\" src=\"../../../images/ReportScheduleExample_988eca7f.png\" style=\"width:800px;height:253px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h3 class=\"mw-headline\" id=\"Last_day_of_a_month\">Last day of a month</h3>\n<p>If a report is scheduled to run monthly, you may want to pay attention to the length of each month. For example, if you set the report to be triggered on the 31st day of each month, no reporting email will be sent in months that don't have 31 days. You can choose \"Last day\" from the dropdown list to trigger a reporting email on the last day of every month.</p>\n<h3 class=\"mw-headline\" id=\"Tenant_attachment_settings\">Tenant attachment settings</h3>\n<p>The supported report format (PDF, XLS, or CSV) and the maximum email attachment size are affected by the tenant <b>Application settings</b> in Suite Administration.</p>\n<p>The <b>Application settings</b> tab displays the following attachment settings of a tenant. All changes of attachment settings take up to 10 minutes to take effect.</p>\n<ul>\n<li>Max File Size (MB): This tab defines the maximum attachment size allowed in this tenant. If you enter 0, no attachment will be allowed. If you leave this field empty, attachments of all file sizes will be allowed. Note that since Ingress allows maximum 64 MB for an attachment file, the defined attachment size is ignored if Max File Size is greater than 64 MB.</li>\n<li>Attachment allowlist: This tab defines the attachment file types allowed in this tenant. Use a comma to separate file types. If you leave this field blank, users can submit all types of attachments.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Performance\">Performance</h3>\n<p>For optimal performance, SMAX processes no more than 10 schedule tasks simultaneously. Therefore, dispersing the schedules over time will help minimize performance impact. The following table lists the result of a performance test run on a lab virtual machine configured as 2.60 GHz 8 cores CPU, 32 GB memory, and 147 GB hard disk.</p>\n<table>\n<tbody>\n<tr>\n<td><b>Schedule tasks</b></td>\n<td>10</td>\n<td>10</td>\n</tr>\n<tr>\n<td><b>Number of reports per schedule task</b></td>\n<td>5</td>\n<td>5</td>\n</tr>\n<tr>\n<td><b>Report type</b></td>\n<td>Operational raw data report</td>\n<td>Analytic report</td>\n</tr>\n<tr>\n<td><b>Number of records per report</b></td>\n<td>800</td>\n<td>/</td>\n</tr>\n<tr>\n<td><b>Completed in</b></td>\n<td>23 minutes</td>\n<td>3 minutes</td>\n</tr>\n</tbody>\n</table>\n<p><b>Note:</b> As seen in the table above, analytic reports are sent much faster than operational raw data reports. This is because the emails use the most-recently-calculated analytic reports rather than re-generating the reports every time the task is triggered. All other report types (operational reports, operational raw data reports, and survey analytic reports) are re-generated before being sent with emails.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/wokwithreport\" title=\"SMAX:24.3/WokWithReport\">Work with reports</a></li>\n<li><a href=\"/doc/423/26.1/appsettings\" title=\"SMAX:24.3/APPSettings\">Application settings</a></li>\n</ul>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}