{
  "title": "How to use duration based calculated fields in reports",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>You can use duration based calculated fields in analytic reports to help present the information you need, in the way you want. The following sections discuss some of the practical considerations and techniques.</p>\n<h2 class=\"mw-headline\" id=\"Duration_and_calculated_fields\">Duration and calculated fields</h2>\n<p>Let’s assume you want to know how long change records stay in the Plan phase. To find this out, you create a calculated field using the Phase duration template, and selecting the Plan phase. You call the calculated field <b>Duration of Plan phase</b>.</p>\n<p>Having created the calculated field, you then create a report displaying changes, and using this field.</p>\n<p>It's likely the report will include a number of changes for which the <b>Duration of Plan phase</b> is zero. What does that mean?</p>\n<p>The possible explanations for <b>Duration of Plan phase</b> being zero are as follows:</p>\n<ul>\n<li>\n<p>The change record never was in the Plan phase.</p>\n</li>\n<li>\n<p>The change record is still in the Plan phase.</p>\n<p>The way that Service Management calculates duration is to measure the time between entering and exiting the selected phase. If a record remains in the phase – and so has not yet exited - its duration isn't calculated.</p>\n<p>See the following:</p>\n<p><a class=\"image\" href=\"/file/images/a/a5/2018.08_Helpcenter/Resources/Images/duration.png\" title=\"/file/images/a/a5/2018.08_Helpcenter/Resources/Images/duration.png\"> <img alt=\"Duration not calculated, and duration calculated\" data-file-height=\"409\" data-file-width=\"565\" height=\"409\" src=\"../../../images/duration_1e960713.png\" width=\"565\"/> </a></p>\n<p>Also, note that if a record is in a particular phase more than once, Service Management measures the cumulative duration in that phase.</p>\n</li>\n</ul>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> Calculated fields only apply to records created after the creation of the calculated fields. For example, assume change record 111111 was created before a new calculated field like Duration of plan phase. In change record 111111 there is, therefore, no value for Duration of plan phase.</p>\n</div>\n<p>In the next section, there is an example of one way to improve the display of data to take account of the records that remain in the Plan phase.</p>\n<h2 class=\"mw-headline\" id=\"How_to_improve_a_duration_based_report\">How to improve a duration based report</h2>\n<p>Let’s continue the example from the preceding section, and assume you want to know how long change records stay in the Plan phase. The following steps are one way to help improve the accuracy and usability of the information.</p>\n<p>Step 1: Create the calculated field - Duration of Plan phase</p>\n<ol>\n<li>From the main menu, select <b>Administration &gt; Configuration &gt; Studio &gt; Fields</b>.</li>\n<li>Select <b>Change</b> in the drop-down list at the top of the page.</li>\n<li>Click <b>New calculated-field</b>.</li>\n<li>Select <b>Phase duration</b> from the list of templates that's displayed.</li>\n<li>In the template:\n\t<ol>\n<li>Click <b>phase</b>.</li>\n<li>Select <b>Plan</b> from the drop-down list.</li>\n<li>Click <b>OK</b>.</li>\n</ol>\n</li>\n<li>Click <b>Create</b>.</li>\n</ol>\n<p>Step 2: Create the calculated field - Was record in Plan</p>\n<ol>\n<li>If not already there:\n\t<ol start=\"1\">\n<li>From the main menu, select <b>Administration &gt; Configuration &gt; Studio &gt; Fields</b>.</li>\n<li>Select <b>Change</b> in the drop-down list at the top of the page.</li>\n</ol>\n</li>\n<li>Click <b>New calculated-field</b>.</li>\n<li>Select <b>Was record in phase</b> from the list of templates that's displayed.</li>\n<li>In the template:\n\t<ol start=\"1\">\n<li>Click <b>phase</b>.</li>\n<li>Select <b>Plan</b> from the drop-down list.</li>\n<li>Click <b>OK</b>.</li>\n</ol>\n</li>\n<li>Click <b>Create</b>.</li>\n</ol>\n<p>Step 3: Create the report</p>\n<ol>\n<li>\n<p>From the main menu, click <b>Reports</b> to open the Reports page.</p>\n</li>\n<li>\n<p>Click to expand the left pane (Reports list).</p>\n</li>\n<li>\n<p>In the left pane, click <b>New</b>.</p>\n</li>\n<li>\n<p>Select <b>Analytic report</b>.</p>\n</li>\n<li>\n<p>The <b>New report</b> dialog box is displayed.</p>\n</li>\n<li>\n<p>Complete the following in the <b>General</b> tab:</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Action</th>\n</tr>\n<tr>\n<td>Report name</td>\n<td>Type a suitable name.</td>\n</tr>\n<tr>\n<td>Display label</td>\n<td>Type a suitable label.</td>\n</tr>\n<tr>\n<td>Record type</td>\n<td>Select <b>Change</b>.</td>\n</tr>\n<tr>\n<td>Filter by</td>\n<td>Select <b>Was record in Plan</b>, then <b>Yes</b>.</td>\n</tr>\n<tr>\n<td>Group by</td>\n<td>Click <b>Add group</b>, then select <b>Duration of Plan phase</b>.</td>\n</tr>\n<tr>\n<td>Function</td>\n<td>Leave as displayed by default, or configure as required.</td>\n</tr>\n<tr>\n<td>Additional table columns</td>\n<td>Leave as displayed by default, or configure as required.</td>\n</tr>\n<tr>\n<td>Display results</td>\n<td>Leave as displayed by default, or configure as required.</td>\n</tr>\n<tr>\n<td>Enable chart view</td>\n<td>True (Default).</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>\n<p>Click <b>Save</b>.</p>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"How_to_use_other_duration_templates\">How to use other duration templates</h2>\n<p>You can use the same technique as in the preceding section to sharpen the available data using the <b>Duration between phases</b> and <b>Duration between events</b> templates for calculated fields.</p>\n<p>In such cases, instead of using the <b>Was record in phase</b> template as in Step 2, above, you should use the <b>Was field assigned with value</b> template.</p>\n<p>For example, assume you use <b>Duration between phases</b> to measure the duration between change records:</p>\n<ul>\n<li><b>Entering</b> the <b>Plan</b> phase, and</li>\n<li><b>Exiting</b> the <b>Build and test</b> phase.</li>\n</ul>\n<p>To follow the example shown in this page, you would create an additional calculated field, using the <b>Was field assigned with value</b> template, to match the phase that would start the duration. In this case, Was <b>Phase Id</b> assigned with <b>Plan</b>.</p>\n<h2 class=\"mw-headline\" id=\"Report_guidelines\">Report guidelines</h2>\n<p>You can create operational or analytic reports, which are based on groupings and functions, or an operational raw data report, which is a more basic report on a record type without groupings or functions. In either case, follow the procedure described in <a href=\"/doc/423/26.1/wokwithreport#Reports_Create_report\" title=\"SMAX:25.1/WokWithReport\">How to work with reports</a>.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> You can't select a grouping without a function or a function without a grouping.</p>\n</div>\n<p>The following are guidelines for selecting the report properties.</p>\n<h3 class=\"mw-headline\" id=\"Create_an_operational_or_analytic_report\">Create an operational or analytic report</h3>\n<p>For these types of reports, you must select at least one grouping option and one function.</p>\n<ol>\n<li>\n<p>In the <b>General</b> tab of the Report properties pane, locate the <b>Group by</b> field and click <b>Add group</b>. Select a field from the drop-down list. These are the fields of the report record type.</p>\n</li>\n<li>\n<p>If the field you select is a record type in its own right, you can click the <b>+Related</b> link next to it and select a field of that record type from the drop-down list. The value in this field will appear in the report.</p>\n<p>If you don't click the <b>+Related</b> link, the record type appears under the <b>Columns</b> drop-down. Click in the box and select a field of that record type from the drop-down list. The value in this field will appear as an additional column in the grid view of the report.</p>\n</li>\n<li>\n<p>Optionally, click <b>Add group</b> again to add a second grouping. You can add additional groupings that are displayed in the grid view of the report. The chart view is relevant for up to two groupings.</p>\n</li>\n<li>\n<p>In the <b>Function</b> field, click <b>Add function</b> and select a function from the drop-down list. The selected function is applied to the grouping(s) you selected. The following functions are available:</p>\n<table>\n<tbody>\n<tr>\n<th>Function</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Average</td>\n<td>Calculates an average of the values in each group or subgroup.</td>\n</tr>\n<tr>\n<td>Count</td>\n<td>Calculates the number of values in each group or subgroup.</td>\n</tr>\n<tr>\n<td>Percent</td>\n<td>Calculates each group or subgroup's percent of the total. Percent is calculated by count or by the sum of a field. Select <b>Count</b> or <b>Sum</b> from the drop-down list.</td>\n</tr>\n<tr>\n<td>Percent per group</td>\n<td>\n<p>Calculates each subgroup's percent of its group. Percent per group is calculated by count or by the sum of a field. Select <b>Count</b> or <b>Sum</b> from the drop-down list.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> This option is only relevant when exactly two <b>Group by</b> options have been selected.</p>\n</div>\n</td>\n</tr>\n<tr>\n<td>Sum</td>\n<td>Calculates the sum of the values in each group or subgroup.</td>\n</tr>\n</tbody>\n</table>\n<p>For <b>Average</b>, <b>Sum</b>, <b>Percent by Sum</b>, and <b>Percent per group by Sum</b>, you must click the <b>+Field</b> link next to the function and select a numeric field from the drop-down list.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> For survey reports, only the <b>Average</b> and <b>Count</b> functions are available.</p>\n</div>\n<p>You can click <b>Add function</b> again to add additional functions that are displayed in the grid view of the report. For the chart view, only one function is displayed. If you added multiple functions in the General tab, you must select one of those functions in the <b>Chart function</b> field in the Chart tab.</p>\n</li>\n<li>\n<p>When you preview or save the report, the data is displayed as follows:</p>\n<ul>\n<li>In <b>Grid</b> view, the rows of the table represent the different combinations of options of the selected groupings. Each function is displayed as a column of the table.</li>\n<li>\n<p>In <b>Chart</b> view:</p>\n<ul>\n<li>If one grouping option was selected, the value of the selected function applied to each group appears as a bar, column, or pie slice.</li>\n<li>\n<p>If two grouping options were selected, the bars or columns for each group reflect the function applied to each of the subgroups in that group (the pie chart option isn't available).</p>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n</ol>\n<p>Example of a report with one grouping option</p>\n<p>The out-of-the-box report <b>Problems by status</b> displays a pie chart with each slice representing the number of problem records with a different status. The grouping field is <b>Status</b> and the function is <b>Count</b>. You can click a pie slice to drill down to Problem Management and view the problem records in the selected group.</p>\n<p><a class=\"image\" href=\"/file/images/0/0c/SMA_202105_reports_pie_chart.png\" title=\"/file/images/0/0c/SMA_202105_reports_pie_chart.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/0/0c/SMA_202105_reports_pie_chart.png\" height=\"423\" hspace=\"0\" src=\"../../../images/SMA_202105_reports_pie_chart_dea63d08.png\" style=\"width: 800px; height: 423px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<p>Example of a report with two grouping options</p>\n<p>The out-of-the-box report <b>Devices by stockroom and subtype</b> displays a stacked column chart with each column representing the number of devices from a different stockroom. The subsections of the columns represent devices of different subtypes (laptops or servers). The first grouping field is <b>Stockroom</b>, the second grouping field is <b>Subtype</b>, and the function is <b>Count</b>. You can click a column subsection to drill down to <b>Service Asset &amp; Configuration</b> &gt; <b>Devices</b> and view the devices in the selected group.</p>\n<p><a class=\"image\" href=\"/file/images/1/1b/SMA_202105_reports_stacked_column2.png\" title=\"/file/images/1/1b/SMA_202105_reports_stacked_column2.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/1/1b/SMA_202105_reports_stacked_column2.png\" height=\"390\" hspace=\"0\" src=\"../../../images/SMA_202105_reports_stacked_column2_6bf24068.png\" style=\"width: 800px; height: 390px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<h3 class=\"mw-headline\" id=\"Create_an_operational_raw_data_report\">Create an operational raw data report</h3>\n<p>An operational raw data report has no grouping options or functions. It displays only the raw data from the selected record type.</p>\n<p>You have the option to select the columns that appear in the report in the <b>Columns</b> section of the Report properties pane. At least one column must be selected. If you don't select columns, the default column selection is used.</p>\n<p>The report displays data from the record type grid page. There is no chart option for this report type. You can limit the size of the report using the <b>Row limit</b> option in the Details tab of the Report properties pane. The report displays all the data or the number of rows selected if the data exceeds the limit.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/report\" title=\"SMAX:25.1/Report\">Reports</a></li>\n<li><a href=\"/doc/423/26.1/wokwithreport\" title=\"SMAX:25.1/WokWithReport\">How to work with reports</a></li>\n<li><a href=\"/doc/423/26.1/calculatedfields\" title=\"SMAX:25.1/CalculatedFields\">Calculated fields</a></li>\n<li><a href=\"/doc/423/26.1/calculatedfieldtemplates\" title=\"SMAX:25.1/CalculatedFieldTemplates\">Calculated field templates</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}