{
  "title": "Report properties",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The Report properties pane, located on the right, defines the properties of the selected report. Data in reports can be filtered and grouped by the attributes of the record on which the report is based.</p>\n<p>The following tabs are available both for defining a new report in the <b>New report</b> dialog box and for editing an existing report in the Report properties pane.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>Locked reports (indicated by a lock icon <a class=\"image\" href=\"/file/images/e/e7/2018.08_Helpcenter/Resources/Images/Icons/PadlockIcon.png\" title=\"/file/images/e/e7/2018.08_Helpcenter/Resources/Images/Icons/PadlockIcon.png\"> <img alt=\"PadlockIcon.png\" data-file-height=\"13\" data-file-width=\"13\" height=\"13\" src=\"../../../images/PadlockIcon_42ddff3a.png\" width=\"13\"/> </a> in the Report properties pane) can't be edited. Out-of-the-box reports are locked, but analytic out-of-the-box reports can be activated or deactivated.</p>\n</div>\n</div>\n<h2 class=\"mw-headline\" id=\"General_tab\">General tab</h2>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Report name </td>\n<td>\n<p>Type a word or phrase that's a unique identifier for this report. It should be a value that makes it easy to understand the purpose of the report.</p>\n<p>Example: All employees by start date.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>Report name is the field used for matching a search value, not the Display label field.</p>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>Display label</td>\n<td>Enter the report title as it will appear in the report.</td>\n</tr>\n<tr>\n<td>Record type</td>\n<td>\n<p>Select a record type on which to base the data in this report. The <b>Filter by</b> and <b>Group by</b> fields are determined by the type of record selected.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>You can create a report based on any record type, but you must have <b>View</b> permission for the selected record type to view the report data.</li>\n<li>For analytic reports, the report you create is based on all records of the selected record type that match your assigned data domains.</li>\n</ul>\n</div>\n</div>\n<p>In Survey reports, this field is called <b>Survey</b>. Select a survey from the drop-down list.</p>\n</td>\n</tr>\n<tr>\n<td>Filter by</td>\n<td>\n<p>You can select to filter your report data by the properties of the selected record type. Not all properties of every record are available for selection.</p>\n<p>Select a property from the drop-down list and enter or select a value for the filter. For example, for incidents, select the <b>Location</b> property and select the required locations from the drop-down list. Only incidents with one of the specified locations are included in the report data.</p>\n<p>Note that the <strong>Filter by</strong> date field values (such as <strong>Creation time:</strong> <strong>Yesterday</strong>) are based on the time zone defined in <strong>Application Settings</strong> &gt; <strong>Time zone definition</strong> or based on the GMT time zone if there's no time zone defined in Application Settings.</p>\n<p>If the selected filter field is a record type, you can click <b>By &lt;record type&gt; fields</b> to select a field of the related record for the filter. You can select a maximum of three different related records for filtering by a related record field. (You can select more than three filters by related record field for the same related record.)</p>\n<p>In an analytic report, if one of the related record filters is of type Incident, Request, or Service Level Target, no other related record filter of those types can be selected.</p>\n<p><span style=\"background-color: transparent;\">For more information about filtering, see </span><a href=\"/doc/423/26.1/filters\" style=\"background-color: transparent;\" title=\"SMAX:25.1/Filters\">Filters</a><span style=\"background-color: transparent;\">.</span></p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>For the Request record type, if the <b>Filter by</b> field contains only one offering, you can select its user options as one of the filters.</li>\n<li>For the Incident record type, if the <b>Filter by</b> field contains only one model, you can select its user options as one of the filters.</li>\n<li>For the Change record type, if the <b>Filter by</b> field contains only one model, you can select its user options as one of the filters.</li>\n<li>In analytic reports, when filtering by a field of type person, there is no option to filter by <b>Me</b> as a substitute for the user's name.</li>\n<li>Do not select encrypted fields for the filter.</li>\n</ul>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>Group by</td>\n<td>\n<p>Group your report by the available properties of the selected record type. Click <b>Add group</b> and select a field from the drop-down list. Not all properties of every record are available for selection. You can select multiple groupings for the report.</p>\n<p>The grouping selections are reflected in the report as follows:</p>\n<ul>\n<li><b>Grid report.</b> Each grouping selection appears as a column in the grid report. The rows of the report reflect the combinations of the different groupings. The grid report can display up to 800 rows of data.</li>\n<li><b>Chart report.</b> For a report with one grouping selection, each grouping appears as a pie slice or chart column or bar or line. For a report with two grouping selections, each grouping appears as a bar or column or line subsection.</li>\n</ul>\n<p>If the selected grouping field is itself a record type, you can click <b>+Related</b> to select a field of the related record for the grouping. You can select a maximum of three different related records for groupings by a related record field. (You can select more than three groupings by related record field for the same related record.)</p>\n<p>In an analytic report, when you select a grouping by a time field, you must select a property of the time field (by Days, by Weeks, by Months, by Hours, or by Years). The grouping values are calculated using UTC. When there is a time field at either the primary or the secondary level of grouping, the analytic report or survey analytic report will display as a time series report, presenting a series of values at successive time intervals. If any of the time intervals has no data record, the report will display null as the value for that time interval. When the time field is beyond the primary and secondary grouping level, the report won’t display the time intervals which have no values. This also applies when grouping is by a time field of an entity link. The time series report supports only one Date or Date_Time field in the grouping.</p>\n<p><span style=\"background-color: transparent;\">In an analytic report, if one of the related record groupings is of type Incident, Request, or Service Level Target, no other related record grouping of those types can be selected.</span></p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>For the Request record type, if the <b>Filter by</b> field contains only one offering, its user options can be selected as one of the group-by fields.</p>\n<p>For the Incident record type, if the <b>Filter by</b> field contains only one model, its user options can be selected as one of the group-by fields.</p>\n<p>For the Change record type, if the <b>Filter by</b> field contains only one model, its user options can be selected as one of the group-by fields.</p>\n</div>\n</div>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>You can't group by time field properties in operational reports, but rather by the time field itself.</li>\n<li>In analytic reports, you can group by a time field of the original record, but not by a time field of a related record.</li>\n<li>In operational and analytic reports, you must select at least one grouping.</li>\n<li>Groupings aren't available for operational raw data reports.</li>\n<li>Do not select encrypted fields for the groupings.</li>\n</ul>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>Function</td>\n<td>\n<p>Click <b>Add function</b> and select a function from the drop-down list. You can add multiple functions to the report.</p>\n<p>In a grid report, each function appears as a column in the grid.</p>\n<p>In a chart report, the functions you add appear in the drop-down list for the <b>Chart function</b> field in the Chart tab.</p>\n<p>For more information on the available functions, see <a href=\"/doc/423/26.1/reportscalculatedfields#Reportguidelines\" title=\"SMAX:25.1/ReportsCalculatedFields\">Report guidelines</a>.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>In operational and analytic reports, you must select at least one function.</li>\n<li>Functions aren't available for operational raw data reports.</li>\n<li>For functions on calculated fields of type duration in analytic reports, the result is displayed in seconds.</li>\n</ul>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>Display results</td>\n<td>\n<p>Select the sorting and display options for your report:</p>\n<ul>\n<li>For <b>Sort by and then by</b>, select the primary and secondary sort criteria from the drop-down list. The list displays the selected groups and functions and the available columns. The primary sort (<b>Sort by</b>) is required. The secondary sort (<b>and then by</b>) is optional. You can also generate an analytic or survey analytic report to include time periods with and without values in the chart.</li>\n<li>\n<p>Select the <b>Display leading results only</b> check box to display only the leading groups after sorting. This option is available only when you select only one field in <strong>Group by</strong> that's not a time field was selected for the report.</p>\n<ul>\n<li>\n<p><b>Number of groups to display.</b> Select the number of groups to display from the drop-down list.</p>\n</li>\n<li>\n<p><b>Include other results as additional group.</b> Select this check box to include an aggregation of all the remaining groups as an additional group (<b>Other</b>).</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>This option is available only when:</p>\n<ul>\n<li>the selected number of groups to display is less than 800.</li>\n<li>the selected primary sort criteria is a Count or Percent function.</li>\n<li>the selected primary sort criteria is the function selected in the <b>Chart function</b> field in the Chart tab.</li>\n</ul>\n</div>\n</div>\n</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Additional table columns</td>\n<td>\n<p>The <strong>Additional table columns</strong> section displays the additional columns of the grid report. The columns are defined according to the following rules:</p>\n<ul>\n<li>Every <b>Group by</b> option selected which is a record type is displayed. Click in the box to select fields of that record type to be displayed as additional columns.</li>\n<li>If no <b>Group by</b> options are selected, you can select fields of the report record type to be displayed as additional columns. This option is only available for operational reports and includes a grid report only.</li>\n<li>Fields of the RICH_TEXT or COMPLEX_TYPE type aren't available.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Enable chart view</td>\n<td>\n<p>Select this option to enable the Chart tab of the Report properties pane, where you define the chart view of the report.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>The check box is disabled if more than two grouping options were selected or if no function or grouping option was selected.</p>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>Preview</td>\n<td>\n<p>Click to view a preview of the report before saving it.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>For analytic reports, the preview reflects the selected grouping but isn't based on actual data.</p>\n</div>\n</div>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"Chart_tab\">Chart tab</h2>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>This tab isn't available for operational raw data reports.</p>\n</div>\n</div>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Chart function</td>\n<td>\n<p>Select a function from the drop-down list. The list includes the available functions you selected in the General tab. If you don't select a function, the first function defined in the General tab will be used by default. </p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>This option changes to <strong>Chart functions</strong> when you select only one field in <strong>Group by</strong>, allowing you to choose multiple functions of the same type. </li>\n<li>For example, if you have selected an average function, you will only be able to choose the additional average functions.</li>\n</ul>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>Chart type</td>\n<td>\n<p>Select the chart type:</p>\n<ul>\n<li>\n<p>If one <b>Group by</b> option was defined in the General tab, the available chart types are:</p>\n<ul>\n<li>\n<p>Pie</p>\n</li>\n<li>\n<p>Bar</p>\n</li>\n<li>\n<p>Column</p>\n</li>\n<li>\n<p><b>Line</b></p>\n<p>This chart type is only available for analytic reports. The selected Group by option must be a time data field. For example, <b>Closed time</b>.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>If two <b>Group by</b> options were defined in the General tab, the available chart types are:</p>\n<ul>\n<li>\n<p>Grouped bar</p>\n</li>\n<li>\n<p>Grouped column</p>\n</li>\n<li>\n<p>Stacked bar</p>\n</li>\n<li>\n<p>Stacked column</p>\n</li>\n<li>\n<p><b>Grouped line</b></p>\n<p>This chart type is only available for analytic reports. All of the fields selected for the <b>Group by</b> option must be time data fields.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>If three or more <b>Group by</b> options were defined in the General tab, or if no <b>Group by</b> option and no function was defined, the report can't be displayed as a chart (the Chart tab is disabled).</p>\n</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>If you don't select a chart type, the first option in each category is used by default. For a report with one <b>Group by</b> option, a pie chart is the default type. For a report with two <b>Group by</b> options, the Grouped bar chart is the default type.</li>\n<li>A bar/column/line chart is limited to 40 bars/columns/points of data and a pie chart is limited to 40 slices. If the report data exceeds this limit, the chart report can't be viewed.</li>\n<li>The number of distinct subgroups in a stacked bar or column or line chart (reflected in the chart legend) is limited to 20. If the report data exceeds this limit, the chart report can't be viewed.</li>\n<li>If you selected <b>Percent per group</b> as the function, only the Stacked bar and Stacked column charts are available.</li>\n</ul>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>X-axis label</td>\n<td>\n<p>Enter the caption for the X-axis of the chart. If you don't enter a caption for the X-axis, the name of the first <b>Group by</b> selection is used for a column chart and the name of the function for a bar chart.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>This isn't relevant when a pie chart is selected.</p>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>Y-axis label</td>\n<td>\n<p>Enter the caption for the Y-axis of the chart. If you don't enter a caption for the Y-axis, the name of the function is used for a column chart and the name of the first <b>Group by</b> selection for a bar chart.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>This isn't relevant when a pie chart is selected.</p>\n</div>\n</div>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"Details_tab\">Details tab</h2>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Created on</td>\n<td>The creation time of the report.</td>\n</tr>\n<tr>\n<td>Created by</td>\n<td>The user who created the report.</td>\n</tr>\n<tr>\n<td>Last edited on</td>\n<td>The time the report was last edited.</td>\n</tr>\n<tr>\n<td>Last edited by</td>\n<td>The user who last edited the report.</td>\n</tr>\n<tr>\n<td>Calculated every</td>\n<td>\n<p>The frequency of report recalculation. Select a value from the drop-down list.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>This option is only relevant in analytic reports.</li>\n<li>The calculation frequency affects the quota usage. You can reduce the frequency to reduce your quota usage.</li>\n<li>For non-admin users, the recalculation frequency is limited to once a day or a lower frequency (a calculation period of one day or longer).</li>\n</ul>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>Access</td>\n<td>\n<ul>\n<li>Select <b>Public</b> to make your report available to other users on this tenant.\n\t\t\t\t<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>This option is available only for users with the <b>Create public reports</b> role permission.</p>\n</div>\n</div>\n</li>\n<li>Select <b>Private</b> if the report is for your use only.</li>\n<li>Select <b>Group</b> to make your reports available only to specified user groups. After you select <b>Group</b>, a mandatory field named <b>Audience</b> is displayed, allowing you to specify one or more groups with which you want to share the report.  \n\t\t\t\t<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>This option is available only for users with the <b>Create group reports</b> role permissions.</p>\n</div>\n</div>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>Enter a description for the report. It's helpful for other users to understand the purpose and objectives of this report. The description is displayed in the report properties in the <span class=\"SAW_VariablesSidebar\">right pane</span> of the Reports page when that report is displayed.</td>\n</tr>\n<tr>\n<td>Row limit</td>\n<td>\n<p>The number of rows displayed in an operational report when no grouping option or function is selected. Select a value from the drop-down list.</p>\n<p>For more information on reports with no grouping options or functions, see <a href=\"/doc/423/26.1/reportscalculatedfields#Reportguidelines\" title=\"SMAX:25.1/ReportsCalculatedFields\">Report guidelines</a>.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>This option is only relevant in operational and operational raw data reports.</p>\n</div>\n</div>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/pplroles\" title=\"SMAX:25.1/pplRoles\">Roles</a></li>\n<li><a href=\"/doc/423/26.1/reportslist\" title=\"SMAX:25.1/ReportsList\">Reports list pane</a></li>\n<li><a href=\"/doc/423/26.1/reprtscenterpane\" title=\"SMAX:25.1/ReprtsCenterPane\">Reports center pane</a></li>\n<li><a href=\"/doc/423/26.1/wokwithreport\" title=\"SMAX:25.1/WokWithReport\">How to work with reports</a></li>\n<li><a href=\"/doc/423/26.1/reportscalculatedfields\" title=\"SMAX:25.1/ReportsCalculatedFields\">How to use duration based calculated fields in reports</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}