{
  "title": "Resources for a resource pool",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>You can associate the following types of resources with a resource pool. You can also set capacity for the resources listed in the following table:</p>\n<table>\n<tbody>\n<tr>\n<th>Resource</th>\n<th>Unit of Measurement</th>\n</tr>\n<tr>\n<td>CPU</td>\n<td>Number of CPUs</td>\n</tr>\n<tr>\n<td>IPv4 Address</td>\n<td>Number of IP version 4 addresses</td>\n</tr>\n<tr>\n<td>IPv6 Address</td>\n<td>Number of IP version 6 addresses</td>\n</tr>\n<tr>\n<td>License</td>\n<td>Number of license keys</td>\n</tr>\n<tr>\n<td>Memory</td>\n<td>Megabytes (MB) of memory</td>\n</tr>\n<tr>\n<td>Physical Server</td>\n<td>Number of physical servers</td>\n</tr>\n<tr>\n<td>Power</td>\n<td>Kilowatts (KW) of power</td>\n</tr>\n<tr>\n<td>Storage</td>\n<td>Gigabytes (GB) of disk storage</td>\n</tr>\n<tr>\n<td>Subnet</td>\n<td>Number of IPv4 or IPv6 subnets</td>\n</tr>\n<tr>\n<td>VLAN</td>\n<td>Number of virtual LAN identifiers</td>\n</tr>\n<tr>\n<td>Virtual Server</td>\n<td>Number of virtual servers</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"Tasks\">Tasks</h2>\n<ul>\n<li><b>View resources for a resource pool</b> - See the list of resources, as well as availability and capacity.</li>\n<li><b>Add a resource to a resource pool</b> - Click <b>Add</b>. Provide the information listed in the following table.</li>\n<li><b>Edit a resource</b> - Click the gear icon and select <b>Edit</b>. See the following table for the items you can edit.</li>\n<li><b>Delete a resource from a resource pool</b> - Click the gear icon for the resource and select <b>Delete</b>.You can't delete a resource that is currently in use —that is, a resource that has a <b>Current Utilization</b> value other than zero (0).</li>\n</ul>\n<table>\n<tbody>\n<tr>\n<th width=\"50%\">Item</th>\n<th width=\"50%\">Description</th>\n</tr>\n<tr>\n<td>Resource Type</td>\n<td>Select a resource type to be included in this resource pool. Each resource type can be added to a resource pool one time; after a resource type is added to a pool, then it no longer appears in the drop-down list. Note that you can't edit this value after the resource has been created.</td>\n</tr>\n<tr>\n<td>Resource Availability</td>\n<td>\n<p>Select one of the following:</p>\n<p><b>Available</b> - Resource is available for selection during provisioning of a service.</p>\n<p><b>Unavailable</b> - Resource isn't available for selection during provisioning of a service.</p>\n<p><b>Unlimited</b> - Resource is available for use with no restrictions on the number of allocations of this resource.</p>\n</td>\n</tr>\n<tr>\n<td>Total Available</td>\n<td>\n<p>Type a whole number to indicate the maximum capacity of this resource as provided by the provider.</p>\n<p>You can't set this value if <b>Resource Availability</b> is set to <b>Unlimited</b>.</p>\n</td>\n</tr>\n<tr>\n<td>Current Utilization</td>\n<td>\n<p>Type a whole number to indicate the current utilization of this resource. This value is automatically adjusted when allocations occur, but you can also set this value manually if desired. You can't set this value higher than the value specified for <b>Total Available</b>.</p>\n<p>If the Current Utilization for a resource isn't zero (0), you will not be able to delete this resource or its associated resource pool.</p>\n<p>Also, you can't edit this value when a new resource is initially created; however, you can edit it for an existing resource.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}