{
  "title": "Provider resource pools",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Resource pools create an association between resources that can be provisioned by a provider and subscriptions. You can create a resource pool on a provider to represent a pool of resources associated with that provider. For example, you can create a resource pool on a <span class=\"ProductNamesvCenter\">VMware vCenter</span> resource provider that corresponds to a VMware cluster. You can also model an <span class=\"ProductNamesIO\">infrastructure orchestration</span> resource pool (a pool of CPU, memory, storage, and networking) as a resource pool. You can decide which provider concepts, if any, you wish to model as resource pools; the resource pool concept may not be applicable to all provider types.</p>\n<p>When you model resources on a provider in resource pools, you should model them in one of the two fashions described below:</p>\n<ul>\n<li>A single resource pool on a resource provider that models all resources that can be allocated on this provider</li>\n<li>Multiple resource pools on a resource provider, each of which models its own portion of the total available resources on the provider.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Tasks\">Tasks</h2>\n<ul>\n<li><b>View resource pools for the selected provider</b> - See the list of resource pools and their descriptions. Disabled resource pools are indicated by the <b>Disabled</b> label and will not participate in resource allocation processing for new subscriptions.</li>\n<li><b>Create a resource pool</b> - Click <b>Create</b>. Provide the information listed in the following table.</li>\n<li><b>See more information about a resource pool</b> - Click the resource pool whose information you want to view.</li>\n</ul>\n<table>\n<tbody>\n<tr>\n<th width=\"50%\">Item</th>\n<th width=\"50%\">Description</th>\n</tr>\n<tr>\n<td>Display Name</td>\n<td>The name you provide for the resource pool.</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>The description you provide for the resource pool.</td>\n</tr>\n<tr>\n<td>Known By Provider As</td>\n<td>The name this resource pool is known by in the associated resource provider. For example, if this resource pool corresponds to a <span class=\"ProductNamesvCenter\">VMware vCenter</span> cluster, this value would be the exact cluster name configured in <span class=\"ProductNamesvCenter\">VMware vCenter</span>.</td>\n</tr>\n<tr>\n<td>Resource Synchronization Action</td>\n<td>\n<p>An action that updates the resources in the resource pool by communicating with the associated resource provider.</p>\n<p>The <b>Last Synchronized</b> field in the <b>Overview</b> tab of the resource pool indicates the last time (local client time) a resource synchronization action on a resource pool completed successfully.</p>\n</td>\n</tr>\n<tr>\n<td>Enabled</td>\n<td>The availability is either <b>Enabled</b> or <b>Disabled</b>. When <b>Disabled</b>, the resource pool will not be available for allocation of resources for new subscriptions, but disabling a resource pool will have no effect on existing subscriptions.</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"Best_practices\">Best practices</h2>\n<p>In the <b>Overview</b> tab of the resource pool property sheet, hover your cursor over the <b>Resource Synchronization Action</b> value to see the full path of the selected process definition in <span class=\"ProductNamesOO\">Operations Orchestration</span></p>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}