{
  "title": "Retroactive changes",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>In certain special cases, you may implement an urgent change without submitting a request for change first. We strongly recommend that you enforce the Change Management processes for standard, normal, and emergency changes, and avoid running into this situation as much as possible. However, in the event that such a change has already happened, the system allows you to create a retroactive change, which is also known as a potentially unauthorized change or unplanned change. </p>\n<p>Creating a retroactive change record allows you to not only keep a record of the change implementation details but also perform a post-implementation review. According to the review result, you may close the change, or create another change record for further remediation, or even for rolling back the implemented change.   </p>\n<p>The Standard, Normal, and Emergency change forms have a <strong>Retroactive</strong> check box, which flags a retroactive change. If you turn on this flag for a change record, the following behavior applies:</p>\n<ul>\n<li>The <strong>Actual start</strong> and <strong>Actual end</strong> fields are mandatory</li>\n<li>The <strong>Retroactive justification</strong> field becomes available and is optional</li>\n<li>The system allows the change to go through a simplified workflow that consists of only the following phases: Log, Evaluate, Review, and Close.</li>\n</ul>\n<h2>Create a retroactive change manually</h2>\n<p>The steps are basically the same as those for planned changes. For details, see <a href=\"/doc/423/26.1/addchange\">Create a change record</a>. The only difference is that for retroactive changes, you need to perform the following steps:</p>\n<ul>\n<li>Select the <strong>Retroactive</strong> check box</li>\n<li>Complete the <strong>Actual start</strong> and <strong>Actual end</strong> fields, and optionally complete the <strong>Retroactive justification</strong> field.</li>\n</ul>\n<div class=\"Admonition_Note\"><span class=\"autonumber\">Notes</span>\n<ul>\n<li>Duplicating an existing change will copy the values of the <strong>Retroactive</strong> and <strong>Retroactive justification</strong> fields to the new change.</li>\n<li>Task and Approval Plans are copied from the Change Model and appear in the Change record, but should not be activated for the skipped phases. You can document the change implementation details in the Description field. </li>\n</ul>\n</div>\n<h2>Create retroactive changes automatically</h2>\n<p>For <strong>Device</strong> and <strong>System Element</strong> record types, you can set up business rules to automatically create retroactive changes. </p>\n<h3>Enable retroactive change detection</h3>\n<p>In Studio, select <strong>Device</strong> or <strong>System Element</strong>, on the <strong>SACM setting</strong> tab, select to enable the <strong>Detect retroactive changes</strong> checkbox. Then, the <strong>Managed attributes</strong> field appears, move the CI attributes you want to monitor from the <strong>Available</strong> box to the <strong>Selected</strong> box. If an attribute is listed in the <strong>Selected</strong> box and its attribute value is changed for any <strong>Device</strong> or <strong>System Element</strong>, after the corresponding business rule is executed, a retroactive change record will be created and associated with the <strong>Device</strong>/<strong>System Element </strong>in a specific time interval. </p>\n<div class=\"Admonition_Note\"><span class=\"autonumber\">Note</span> If any Many2Many association is selected in <strong>SACM setting</strong>, the associated business rule can only be defined in <strong>Before adding relationship</strong> and <strong>Before removing relationship</strong> process events. For all other selected fields in <strong>SACM setting</strong>, the associated business rule can be defined in all available process events.</div>\n<h3>Create a business rule</h3>\n<p>In Studio, select <strong>Device</strong> or <strong>System Element</strong>, on the <strong>Processes and Rules</strong> tab, add a <strong>Handle retroactive change by creating related record</strong> rule in one of the following events:</p>\n<ul>\n<li>Leaving</li>\n<li>Entering</li>\n<li>Before change</li>\n<li>After change</li>\n<li>Before adding relationship</li>\n<li>Before removing relationship</li>\n<li>Before deleting</li>\n</ul>\n<p>For <strong>relationship type</strong>, select <strong>Device affected by change</strong> or <strong>System element affected by change</strong>. For <strong>field values</strong>, select the fields you want to set for the retroactive change record to be created. For example, you can set <strong>Change model = Retroactive change</strong>. Specifically, the following fields are required when a retroactive change ticket is created, some of them will be automatically set by Service Management,and the rest should be set either in the business rule or in the change model:</p>\n<ul>\n<li><strong>Title</strong> - Automatically set by Service Management,you don't have to set it in the business rule/change model.</li>\n<li><strong>Description</strong> - Automatically set by Service Management,you don't have to set it in the business rule/change model.</li>\n<li><strong>Reason for Change</strong> - Must be set in the business rule/change model.</li>\n<li><strong>Service</strong> - Must be set in the business rule.</li>\n<li><strong>Change Model</strong> - Must be set in the business rule.</li>\n<li><strong>Justification</strong> - Must be set in the business rule/change model.</li>\n<li><strong>Retroactive (flag)</strong> - We highly recommend that you set it in the change model.</li>\n<li><strong>Actual Start/Actual End</strong> - This field is required if the <strong>Retroactive </strong>flag is true, it will be automatically set by Service Management,you don't have to set it in the business rule/change model.</li>\n</ul>\n<p>When this is executed, if the value of a managed attribute you selected in the <strong>SACM setting</strong> tab is changed for any <strong>Device</strong> or <strong>System Element</strong>, a retroactive change will be created and associated with the <strong>Device</strong>/<strong>System Element </strong>in a specific time interval.</p>\n<div class=\"Admonition_Note\"><span class=\"autonumber\">Note</span>\n<ul>\n<li>If the <strong>Description</strong> is not set in the business rule, CI's ID/Display Label will be added in the <strong>Description</strong> field and you can click it and drill down to the CI. Timestamp information is also available. </li>\n<li>The <strong>Reported by</strong> field is mandatory for a Change, therefore, if the business rule does not set the <strong>Reported by</strong> field, it will be set to <strong>Tenant, Internal Integration</strong>.</li>\n<li>No retroactive change will be automatically created if there is already one regular change (retro flag == false) linked to the current CI.</li>\n<li>If there are multiple attribute changes for one CI in one schedule interval, there will be only one retroactive change created to track all those changes for this CI.</li>\n</ul>\n</div>\n<h3>Make a schedule to create retroactive changes</h3>\n<p>In Application Settings, set a time interval for <strong>Schedule interval to automatically create retro-changes</strong>.</p>\n<p>This value is a time interval in minutes. At the beginning of each interval period, retroactive changes are automatically created based on the modifications to service and CI attributes. The minimal value is 30 minutes.</p>\n<h2>Edit a retroactive change</h2>\n<p>After the creation of a retroactive change, you can update the record with more details. For details, see <a href=\"/doc/423/26.1/editchange\">Edit a change record</a>.</p>\n<h2>Retroactive change workflow</h2>\n<p>Once created, a retroactive change is in the Evaluate phase. Unlike planned changes, which must go through a comprehensive set of phases (see <a href=\"/doc/423/26.1/changewflw\">Change workflow</a>), a retroactive change can directly move to the Review phase, and then the Close phase. For a retroactive change, the phase transitions from Evaluate to Review and from Review to Close are all manual transitions.</p>\n<p>To manually move a retroactive change from the Evaluate phase to the Review phase, click the down arrow next to <strong>Plan</strong> on the upper right corner of the workflow screen, and then select <strong>Review</strong>. </p>\n<div class=\"Admonition_Note\"><span class=\"autonumber\">Note</span> You can't move the change to the Abandon phase. If you select <strong>Abandon</strong>, an error occurs after you click <strong>Save</strong>. This is because only a change that's not implemented is classified as <b>Abandoned</b>, and a retroactive change is an implemented change.  </div>\n<p><a class=\"image\" href=\"/file/images/e/e3/SMA_202108_retroactive_change_workflow2.png\" title=\"/file/images/e/e3/SMA_202108_retroactive_change_workflow2.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/e/e3/SMA_202108_retroactive_change_workflow2.png\" height=\"100\" hspace=\"0\" src=\"../../../images/SMA_202108_retroactive_change_workflow2_743ed880.png\" style=\"width:212px;height:100px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"212\"/> </a></p>\n<table>\n<tbody>\n<tr>\n<th>Phase</th>\n<th>Transition</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Review</td>\n<td>Manual</td>\n<td>\n<p>The relevant manager reviews the result of the change, and decides whether to create a change model and whether to create another remedial change. The analyst also sets the completion code. The change is manually transitioned to the <b>Close</b> phase.</p>\n<p><b>Next phase:</b> <b>Close</b></p>\n</td>\n</tr>\n<tr>\n<td>Close</td>\n<td>None</td>\n<td>The change is closed. </td>\n</tr>\n</tbody>\n</table>\n<h2>Excluded from Change Analytics reports</h2>\n<p>When generating its statistical reports, <a href=\"/doc/423/26.1/changeanalytics\">Change Analytics</a> ignores retroactive changes.</p>\n<h2>Out-of-the-box reports on retroactive changes</h2>\n<p>The Reports module offers two out-of-the-box reports on retroactive changes, which are also widgets of the \"Change overview\" dashboard:</p>\n<ul>\n<li>Retroactive changes creation over time</li>\n<li>Retroactive changes ratio by month</li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}