{
  "title": "Retrieve survey responses manually",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>By default, the system retrieves survey responses for the previous day and reflects the results in survey reports and Hot Topic Analytics for surveys. It takes up to two days for the system to show survey response data in report charts. One day to add user response data to the report calculation data list, and another day to generate analytical reports. To reduce this duration, a <strong>Retrieve survey responses </strong>button is available so that you can immediately retrieve and add user response data to the report calculation data list.</p>\n<div class=\"Admonition_Note\"><span class=\"autonumber\">Note</span> After you manually retrieve user response data, you still need to wait another day to see newly retrieved user responses in report charts. </div>\n<p>To manually retrieve survey responses, follow these steps:</p>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Build &gt; Survey</b>. Service Management displays the available surveys.</li>\n<li>Click the record identifier in the <b>ID</b> column to display the selected record.</li>\n<li>On the main toolbar, click <b>Retrieve</b> <b>survey responses</b>.</li>\n<li>Select the start date and the end date, and then click <b>Retrieve</b>. The system immediately retrieves your survey response data to a queue for report calculation.<br/>\n\tA scheduler runs on a daily basis to regenerate analytical survey reports based on the response data in the report calculation queue. This means it takes at most one more day for the system to refresh the survey reports and hot topic map to reflect the updated survey responses. </li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/conductsurvey\" title=\"SMAX:25.1/ConductSurvey\">How to conduct a survey</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}