{
  "title": "Roles and permissions",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div></div>\n<p>Service Management has built-in roles that are based on industry best practice recommendations. Large companies might have several people assigned to the same role. Smaller organizations might have multiple roles assigned to one person. Maintaining a role-based view of the organization makes sure that you adhere to the best practice model no matter who is assigned to the role or how you divide the responsibilities associated with the role. For example, if your company is large, you may have separate process designers and process owners assigned to each module. A smaller company might assign both roles to one person for each module.</p>\n<p>Roles have certain permissions that enable you to complete your daily work. Roles are assigned by application area. For example, an Incident Coordinator, Change Coordinator, and Problem Coordinator are similar roles with similar rights within the Incident, Change, and Problem Management applications.</p>\n<h2 class=\"mw-headline\" id=\"Permissions\">Permissions</h2>\n<p>Permissions are controls within applications. When assigned, they enable you to complete certain Service Management tasks, such as adding update information to a record. Permissions are an administrative strategy to control access to records and limit the number of people who can view, create, update, or delete records. Permissions to view particular data domains limit your ability to view only records that are tagged with those domains. For more information, see <a href=\"/doc/423/26.1/datadomainseg\" title=\"SMAX:25.1/DataDomainSeg\">Data domain segmentation</a>.</p>\n<p>If you aren't familiar with the permissions assigned to you or your role, contact your tenant administrator.</p>\n<p>If you aren't familiar with your assigned role, contact your tenant administrator.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> A license is required to log in to Service Management. For more information, see <a href=\"/doc/423/26.1/userslicenses\" title=\"SMAX:25.1/UsersLicenses\">How to assign licenses to users</a>.</p>\n</div>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/servicemgmtoverview\" title=\"SMAX:25.1/ServiceMgmtOverview\">Service Management overview</a></li>\n<li><a href=\"/doc/423/26.1/filters\" title=\"SMAX:25.1/Filters\">Filters</a></li>\n<li><a href=\"/doc/423/26.1/views\" title=\"SMAX:25.1/Views\">Views</a></li>\n<li><a href=\"/doc/423/26.1/userinterface\" title=\"SMAX:25.1/UserInterface\">Service Management user interface</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}