{
  "title": "Roll back OO Workflow Designer",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>This topic provides instructions to roll back Operations Orchestration (OO) Workflow Designer after its upgrade.</p>\n<h2>Overview of rollback</h2>\n<p>You can roll back an upgraded OO Workflow Designer to the earlier version using the rollback script provided as part of the upgrade package. This restores OO Workflow Designer to the state it was before the upgrade without losing database data.</p>\n<p>The rollback also restores OO Workflow Designer to the previous version, including patches, but it can only restore to the latest version. </p>\n<h2>Prerequisites</h2>\n<ul>\n<li>Make sure that the previous version of OO Workflow Designer has started successfully at least once. Otherwise, you may not be able to roll back the upgrade or might result in faulty rollback if you decide to do so.</li>\n<li>Before starting the rollback process, ensure to close the files and logs of OO.</li>\n<li>Make sure to have the backup of the component under <strong><code>&lt;installation&gt;/upgrade/&lt;new-version&gt;/backup/&lt;component&gt;</code></strong></li>\n<li>Make sure the installed version is the same as the upgrade script’s <code><strong>&lt;new-version&gt;</strong></code>.</li>\n</ul>\n<h2>Unsupported rollback scenarios</h2>\n<ul>\n<li>You can't perform rollback twice. You can only roll back the last upgrade successfully. Attempting the rollback twice will make the system unusable.</li>\n<li>Rollback isn't supported for OO Workflow Designer installed in IdM mode. The current workaround is to back up the IdM database before the upgrade and manually restore it after rollback.</li>\n</ul>\n<h2>Rollback precautions</h2>\n<ul>\n<li>If you roll back OO Workflow Designer, the script rolls back the database schema changes and preserves data that you added after the upgrade. However, sometimes you may still lose the data due to schema changes.</li>\n<li>If you have made any changes to the file system since the upgrade, you will lose those changes, including changes to configuration files and log files.</li>\n</ul>\n<h2>Rollback procedure</h2>\n<p>To roll back to an earlier version of OO Workflow Designer:</p>\n<ol>\n<li>Navigate to <strong><code>&lt;Install_Directory&gt;\\Operations Orchestration Designer\\upgrade\\&lt;Latest_version&gt;\\bin</code></strong></li>\n<li>Open a command line as an administrator. </li>\n<li>Run the following rollback script. You can find the script in the upgrade package.\n\t<pre><code>rollback.bat</code></pre>\n<ol start=\"1\">\n<li>\n<p>(Optional) If required, use the following command line options:</p>\n<table>\n<caption>Rollback commands</caption>\n<tbody>\n<tr>\n<td><code>-f,--forcestart</code></td>\n<td>Force starts the rollback. This command rolls back the installation, without prompting.</td>\n</tr>\n<tr>\n<td><code>-h,--help</code></td>\n<td>Display help on the available parameters.</td>\n</tr>\n<tr>\n<td><code>-n,--norestart</code></td>\n<td>Doesn't restart OO Workflow Designer after the rollback.</td>\n</tr>\n</tbody>\n</table>\n</li>\n</ol>\n</li>\n<li>When prompted to confirm the rollback, type in <b>y</b>. The rollback process begins and the previous version of OO Workflow Designer displays.</li>\n<li>The rollback script uses the same <code><b>upgrade.log</b></code> file as the upgrade script.</li>\n</ol>\n<h2>Post rollback task</h2>\n<p>After the rollback, it's advised to move or delete the backup directory (created at <code><b>&lt;installation&gt;/upgrade/&lt;new-version&gt;/backup</b></code>). Otherwise, if you perform the upgrade again later, no fresh backup will be created. So, any file changes you might have made since the rollback won't be backed up.</p>\n<h2 class=\"mw-headline\" id=\"Roll_back_when_your_company_does_not_allow_changing_the_database_schema\">Rollback when your company doesn't allow changing the database schema</h2>\n<p>If your company doesn't allow the Operations Orchestration application to change the database schema, the rollback procedure is different. You will need to use the <code><b>generate-sql(.bat)</b></code> script with the <code>–r</code> option, which generates a <code><b>rollback.sql</b></code> file in the unzipped upgrade folder.</p>\n<ol>\n<li>\n<p>Open a command line and run the <code><b>generate-sql(.bat)</b></code> script with the <code>-r</code> option.</p>\n<p>The command line options for <code><b>generate-sql(.bat)</b></code> are:</p>\n<table>\n<caption>Rollback commands</caption>\n<tbody>\n<tr>\n<td><code>-h,--help</code></td>\n<td>Display help on the available parameters.</td>\n</tr>\n<tr>\n<td><code>-r,--rollback</code></td>\n<td>Generate the SQL for rollback. Use only after you have upgraded the database.</td>\n</tr>\n</tbody>\n</table>\n<p>For example:</p>\n<div class=\"example\">\n<pre>generate-sql -r </pre>\n</div>\n<p>The <code><b>rollback.sql</b></code> file gets created in the unzipped <code><b>&lt;installation&gt;/upgrade/&lt;new-version&gt;</b></code> folder.</p>\n</li>\n<li>Stop OO Workflow Designer service.</li>\n<li>Apply the database changes by running <code><b>rollback.sql</b></code> against the database with the required credentials.</li>\n<li>Rollback OO Workflow Designer using <code><b>rollback(.bat)</b></code><b> </b>script. OO Workflow Designer restarts automatically after the rollback.</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}