{
  "title": "Routing definitions",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Service Management provides an automatic routing solution for routing records to the correct groups based on the information contained in the record. The Routing Definitions module enables you to create and edit a visual routing definition which is easy to read and maintain.</p>\n<p>The routing definition appears as a tree diagram with four rows, known as lanes. The top lane includes only the root node of the definition. In the lower lanes, you can add nodes defining a path to follow when routing records to a specific group.</p>\n<p>The routing definitions are designed to be used in connection with the <b>Set field based on routing definition</b> business rule. The rule enables you to assign a value to a group field for a record based on the path defined in the selected routing definition.</p>\n<p>Alternatively, you can use a routing definition in connection with the <b>Define suggested values based on routing definition</b> business rule. The rule enables you to specify the values that appear in the drop-down list for a selected group field for a record, based on the path defined in the selected routing definition. For more information on business rules, see <a href=\"/doc/423/26.1/embizrules\" title=\"SMAX:25.1/emBizRules\">Studio business rules</a>.</p>\n<p>Routing definitions aren't supported in the Dev2Prod functionality. Any routing definitions defined in your development environment must be manually redefined in your production environment.</p>\n<h2 class=\"mw-headline\" id=\"Create_a_routing_definition\">Create a routing definition</h2>\n<ol>\n<li>\n<p>From the <span class=\"SAW_VariablesMain_menu\">main menu</span>, select <b>Administration &gt; Configuration &gt; Routing Definitions</b>.</p>\n</li>\n<li>\n<p>In the <b>Routing Definitions</b> pane on the left, click <a class=\"image\" href=\"/file/images/c/cc/2018.08_Helpcenter/Resources/Images/Icons/NewIcon.png\" title=\"/file/images/c/cc/2018.08_Helpcenter/Resources/Images/Icons/NewIcon.png\"> <img alt=\"New\" decoding=\"async\" height=\"18\" src=\"../../../images/NewIcon_7074e789.png\" width=\"17\"/> </a><b>New</b>.</p>\n</li>\n<li>\n<p>Enter a name and a description and click <b>Launch editor</b>. The Routing definition editor opens. The root node appears at the top of the routing definition.</p>\n</li>\n<li>Click the root node and click the <b>Edit</b> <a class=\"image\" href=\"/file/images/f/f0/2018.08_Helpcenter/Resources/Images/Icons/EditIcon.png\" title=\"/file/images/f/f0/2018.08_Helpcenter/Resources/Images/Icons/EditIcon.png\"> <img alt=\"EditIcon.png\" decoding=\"async\" height=\"21\" src=\"../../../images/EditIcon_ad95cc14.png\" width=\"24\"/> </a> button. In the dialog box, select a default group.</li>\n<li>Optionally, click in the <b>Additional suggested groups</b> box and select additional groups. The additional groups are relevant for the Define suggested values feature.</li>\n<li>Click the root node again and click the <b>Add</b> <a class=\"image\" href=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\" title=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\"> <img alt=\"New icon\" decoding=\"async\" height=\"22\" src=\"../../../images/PlusIcon_8ed60e27.png\" width=\"24\"/> </a> button.</li>\n<li>\n<p>In the <b>Route by</b> dialog box, select the routing option for the next lane of the definition. The available options are:</p>\n<ul>\n<li>Organizations</li>\n<li>Actual services</li>\n<li>\n<p>Locations</p>\n</li>\n</ul>\n<p>The selected routing option of the lane appears on the left side of the lane, vertically.</p>\n<p>Based on your selection, select an option and a group. For example, if you select <b>Organizations</b> for the lane routing option, you could select <b>Human Resources</b> as the organization and <b>Administrative services</b> as the group. This will route changes, incidents, and problems related to Human Resources to the Administrative services group. You can also click in the <b>Additional suggested groups</b> box and select additional groups.</p>\n<p>Click <b>Update</b> to update the routing definition with your selection.</p>\n</li>\n<li>\n<p>Optionally, click the <b>Add</b> <a class=\"image\" href=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\" title=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\"> <img alt=\"New icon\" decoding=\"async\" height=\"22\" src=\"../../../images/PlusIcon_8ed60e27.png\" width=\"24\"/> </a> button on the Service desk node again and add an additional option of the same type to the same lane.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> You can only add options of the same type to a single lane. Once you select an organization, for example, you can only add additional organization to that lane.</p>\n</div>\n</li>\n<li>Click the node you added to the second lane and click the <b>Add</b> <a class=\"image\" href=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\" title=\"/file/images/6/64/2018.08_Helpcenter/Resources/Images/Icons/PlusIcon.png\"> <img alt=\"New icon\" decoding=\"async\" height=\"22\" src=\"../../../images/PlusIcon_8ed60e27.png\" width=\"24\"/> </a> button.</li>\n<li>\n<p>In the <b>Route by</b> dialog box, select the routing option for the next lane of the definition. You can select the same option as the previous lane, or a different one.</p>\n<p>Based on your selection, select an option and a group. Using the above example, if you click the <b>Human Resources</b> node and select <b>Actual Services</b> as the option for the next lane, you could then select <b>Communications</b> as the actual service and <b>Communication services</b> as the group. This will route changes, incidents, and problems related to Human Resources and connected with the Communications actual service to the Communication services group.</p>\n<p>Click <b>Update</b> to update the routing definition with your selection.</p>\n</li>\n<li>Click <b>Save</b>.</li>\n</ol>\n<p>When the routing definition is applied to a record type using a business rule, Service Management attempts to route the record to the correct group or apply the correct suggested values according to the routing definition's path. If the record doesn't match any of the nodes in the last lane, it reverts to the previous lane. If there is no match in that lane, it reverts to the root node as the default group.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span>  </p>\n<ul>\n<li>Up to three lanes are available for a routing definition. You can't extend the path beyond the bottom lane.</li>\n<li>When you click a node, the editor collapses the other paths in the routing definition, for clarity. A small arrow <a class=\"image\" href=\"/file/images/d/de/2018.08_Helpcenter/Resources/Images/EM/RoutingDefArrow.png\" title=\"/file/images/d/de/2018.08_Helpcenter/Resources/Images/EM/RoutingDefArrow.png\"> <img alt=\"RoutingDefArrow.png\" decoding=\"async\" height=\"19\" src=\"../../../images/RoutingDefArrow_6ee45529.png\" width=\"31\"/> </a> is displayed under the nodes with hidden nodes beneath them. Click the root node to expose the entire routing definition.</li>\n<li>The routing definition changes take effect as soon as Service Management refreshes the settings cache. You might experience a delay of up to an hour before the cache is refreshed.</li>\n</ul>\n</div>\n<h2 class=\"mw-headline\" id=\"Routing_definition_use_case_-_setting_a_field_value\">Routing definition use case - setting a field value</h2>\n<p>The following use case demonstrates how a routing definition is applied to set a group field value using a business rule in a real world example:</p>\n<p>The administrator has defined the <b>User based</b> routing definition, which has a Service desk root node and two other lanes. The first lane is defined by organization; there are two organizations: <b>Internal Sales</b> and <b>Cool Cake</b>. The next lane is defined based on location; there are two locations under Internal Sales and four under Cool Cake.</p>\n<p><a class=\"image\" href=\"/file/images/7/7f/2018.08_Helpcenter/Resources/Images/EM/UserBasedRoutingDfn.png\" title=\"/file/images/7/7f/2018.08_Helpcenter/Resources/Images/EM/UserBasedRoutingDfn.png\"> <img alt=\"UserBasedRoutingDfn.png\" class=\"z_migration_tba_PDF\" decoding=\"async\" height=\"629\" src=\"../../../images/UserBasedRoutingDfn_c8a63620.png\" width=\"1573\"/> </a></p>\n<p>The administrator also defined a business rule in the Request workflow to set the value of the <b>Help desk group</b> field based on this routing definition.</p>\n<p><a class=\"image\" href=\"/file/images/5/5d/2018.08_Helpcenter/Resources/Images/EM/RoutingDefRule.png\" title=\"/file/images/5/5d/2018.08_Helpcenter/Resources/Images/EM/RoutingDefRule.png\"> <img alt=\"RoutingDefRule.png\" class=\"z_migration_tba_PDF\" decoding=\"async\" height=\"94\" src=\"../../../images/RoutingDefRule_95b65e66.png\" width=\"938\"/> </a></p>\n<p>According to the rule's condition, the rule will apply to requests when no group is assigned to the Help desk group field and no actual service is assigned.</p>\n<p>The rule defines the parameters for the definition. There is one parameter for each lane. The parameters are entered as Expression Language phrases which return an ID value.</p>\n<p>The following expression returns the ID for the user's organization:</p>\n<div class=\"example\">\n<p>${entity.RequestedForPerson.PersonToGroup[GroupType='Organizational'].Id}</p>\n</div>\n<p>The following expression returns the ID for the user's location:</p>\n<div class=\"example\">\n<p>${entity.RequestedForPerson.Location.Id}</p>\n</div>\n<p>For more information on the Expression Language, see <a href=\"/doc/423/26.1/explang\" title=\"SMAX:25.1/ExpLang\">Expression Language</a>.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> The reference to the organization, location, or actual service must be done using the ID value.</p>\n</div>\n<p>When the rule runs, it routes the requests to the appropriate Help desk group according to the User based routing definition. For example, consider the requests submitted by the following employees:</p>\n<ul>\n<li>John, who works for Cool Cake in Europe. The request is routed to the Field support group.</li>\n<li>Pete, who works for the R&amp;D organization in North America. The request is routed to the Service desk. Because no R&amp;D group is defined in the routing definition, it goes to the root node by default.</li>\n<li>Frank, who works for the Internal Sales organization in South America. The request is routed to the Problem analysts team group. South America isn't defined under Internal Sales in the routing definition, so the request defaults to the Internal Sales node in the Organizations lane.</li>\n</ul>\n<p>If you update an employee's information, the Help desk group field updates accordingly.</p>\n<h2 class=\"mw-headline\" id=\"Routing_definition_use_case_-_defining_suggested_values\">Routing definition use case - defining suggested values</h2>\n<p>The following use case demonstrates how to use a routing definition to define suggested values for a group field:</p>\n<p>The administrator defines the <b>User based</b> routing definition as in the previous example. In this case, he defines the following business rule in the Request workflow to define suggested values for the <b>Help desk group</b> field based on this routing definition.</p>\n<p><a class=\"image\" href=\"/file/images/e/ef/UpdateRoutingDefRule.png\" title=\"/file/images/e/ef/UpdateRoutingDefRule.png\"> <img alt=\"UpdateRoutingDefRule.png\" decoding=\"async\" height=\"87\" src=\"../../../images/UpdateRoutingDefRule_8b5cf556.png\" width=\"1285\"/> </a></p>\n<p>According to the rule's condition, the rule will apply to requests when no actual service is assigned.</p>\n<p>The rule defines the header title to be <b>Suggested for user</b>. This will be the name of the subsection of the drop-down list where the suggested values will appear.</p>\n<p>The rule defines the parameters for the definition. There is one parameter for each lane. The parameters are entered as Expression Language phrases which return an ID value.</p>\n<p>The following expression returns the ID for the user's organization:</p>\n<div class=\"example\">\n<p>${entity.RequestedForPerson.PersonToGroup[GroupType='Organizational'].Id}</p>\n</div>\n<p>The following expression returns the ID for the user's location:</p>\n<div class=\"example\">\n<p>${entity.RequestedForPerson.Location.Id}</p>\n</div>\n<p>For more information on the Expression Language, see <a href=\"/doc/423/26.1/explang\" title=\"SMAX:25.1/ExpLang\">Expression Language</a>.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> The reference to the organization, location, or actual service must be done using the ID value.</p>\n</div>\n<p>When the rule runs, it assigns the default group and additional suggested groups for the Help desk group field according to the User based routing definition. For example, consider the requests submitted by the following employees:</p>\n<ul>\n<li>\n<p>John, who works for Cool Cake in Europe. The default group is the Field support group and the additional suggested groups are Application services and Customer service.</p>\n<p><a class=\"image\" href=\"/file/images/7/7b/2018.08_Helpcenter/Resources/Images/EM/RoutingDefAddGroups1.png\" title=\"/file/images/7/7b/2018.08_Helpcenter/Resources/Images/EM/RoutingDefAddGroups1.png\"> <img alt=\"RoutingDefAddGroups1.png\" decoding=\"async\" height=\"227\" src=\"../../../images/RoutingDefAddGroups1_ee26f98e.png\" width=\"308\"/> </a></p>\n<p>The additional values will appear in the drop-down list for the Help desk field in the <b>Suggested for user</b> subsection.</p>\n</li>\n<li>\n<p>Pete, who works for the R&amp;D organization in North America. Because no R&amp;D group is defined in the routing definition, it goes to the root node by default. The default group is the Service desk and the additional suggested groups are Customer service and Escalation team.</p>\n<p><a class=\"image\" href=\"/file/images/2/2b/2018.08_Helpcenter/Resources/Images/EM/RoutingDefAddGroups2.png\" title=\"/file/images/2/2b/2018.08_Helpcenter/Resources/Images/EM/RoutingDefAddGroups2.png\"> <img alt=\"RoutingDefAddGroups2.png\" decoding=\"async\" height=\"200\" src=\"../../../images/RoutingDefAddGroups2_acc14d60.png\" width=\"306\"/> </a></p>\n<p>The additional values will appear in the drop-down list for the Help desk field in the <b>Suggested for user</b> subsection.</p>\n</li>\n</ul>\n<p>If you update an employee's information, the Help desk group field suggested values update accordingly.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span>  </p>\n<ul>\n<li>The routing definitions aren't specific to a particular record type. They can be applied to any record type.</li>\n<li>No out-of-the-box routing definitions are provided.</li>\n</ul>\n</div>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/smgmtadmin\" title=\"SMAX:25.1/SMgmtAdmin\">Service Management Administration</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}