{
  "title": "SACM Overview",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>\n<div>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-tip-icon\"></div>\n<div class=\"admonition-content admonition-tip-content\">\n<div>\n<div>\n<p><br/>\nIn this section, Glenn will define the services that his IT department provides as part of the service portfolio, and the high level components that make up those services in the Service Asset and Configuration Management (SACM) module. SACM maintains information about the configuration items (and their relationships) required to deliver an IT service. Providing the service definitions he will support is also the first step in defining the service portfolio within Service Management.</p>\n<p>These definitions will continue to fill in the overall Service Management data model.</p>\n<div><a class=\"image\" href=\"/file/images/0/0d/SACM.gif\" title=\"/file/images/0/0d/SACM.gif\"> <img alt=\"SACM.gif\" src=\"../../../images/SACM_7eb122ca.gif\" style=\"height:441px; width:124px\"/> </a></div>\n<p>By the end of this section Glenn will:</p>\n<ul>\n<li>Work with IT to create a list of all business services provided to the consumers/clients</li>\n<li>Create the service definitions within the service portfolio</li>\n<li>Define each instance as an actual service in Service Asset and Configuration Management (SACM) module</li>\n<li>Define the service components and system elements for the actual services in SACM</li>\n</ul>\n</div>\n</div>\n</div>\n</div>\n<h2>Providing Services</h2>\n<p>One of the first differences I noticed about Service Management compared to other options out there was that it was designed it around services. Our IT department provides and maintains these services for the end users, so it makes sense for us to focus the solution on them.</p>\n<p>So one of the first things I need to do is to define the services our IT department provides to our customers.  Why start here? Well, without specifically calling out the services we need support we could see a ton of problems. We might get calls or emails about things we have no control over. Or we might get requests relating to our products, but for things we simply can't do. Defining our services limits our responsibilities to the consumers and it refines the focus of our team as providers. By clearly specifying what we provide, we can accurately and succinctly define our processes around these services. This will result in a much higher (and faster) return on the investment we are putting into our new service desk applications.</p>\n<p>The bottom line here is that regardless of what processes you are thinking of implementing at the start of your project, define your services first. Everything else revolves around these definitions.</p>\n<p>Service Management is service driven. Therefore these definitions will have a big impact on how our end users and agents will interact. The service catalog was designed around services (as the name would suggest). You can think about this as the menu where end users come to “consume” our services. For our agents, everything from assigning the right team for a task to knowing who to notify in emergencies resolves around services. So if the users are ordering from a menu, the agents will be in the kitchen working to provide these services to the end users. We’ll also be able to report by service, so we can see which services generate the most load on the service desk in terms of the number of questions asked, requests, and issues.</p>\n<p>And remember, as our portfolio changes and we take on more responsibilities we can add to our service definitions. We want to be agile, so we need to expect and even embrace change.</p>\n<p>Ok, let's get started then. The ITIL process documentation defines an IT Service as \"a service provided to one or more customers by an IT service provider\". Okay… Well, that makes us the IT service provider, and in this case, our customers are the employees of the company.</p>\n<p>Based on that we have many services we need to define in the system. Let’s start with one of the most used services we provide, Email. The service we are providing to the consumer is the ability to send and receive an email with their company address. So I'll add a service definition for that in the service portfolio. Once I do, I need to move the service into the “operate\" step of the workflow since it's an existing service.</p>\n<p>Now that I've defined the high-level service definition, I want to get started on defining what makes up each implementation of the Email service. Service Management allows me to define this in different stages:</p>\n<ul>\n<li>Actual service – The instance of a service in our environment. You might only have one instance of a service in the environment, or there might be multiple implementations. For our Email service, we have two separate systems we use to support multiple locations.</li>\n<li>Service component – One or more components required to support an actual service</li>\n<li>System element – One or more elements required to support a service component</li>\n</ul>\n<div>\n<div><a class=\"image\" href=\"/file/images/6/6a/3.1-ServiceDefinition.png\" title=\"/file/images/6/6a/3.1-ServiceDefinition.png\"> <img alt=\"3.1-ServiceDefinition.png\" src=\"../../../images/3.1-ServiceDefinition_3db983d6.png\" style=\"height:262px; width:975px\"/> </a></div>\n</div>\n<p><br/>\nI know enough to put together the high-level components and elements by myself. There is an additional level of definition below the system element which comprises the actual devices that make up the components and elements. It will be important to go back and define those devices, but I can get started with what I know right now. In fact, I could just define my actual services to get started, but I'll put in everything I know about the system right now.</p>\n<p>We have two Email services in operation right now; one in North America and another that covers our EMEA region. Each of these is a unique instance of the Email service (making each of them an “actual service”), so I'll define each one separately.</p>\n<p>The components of each are identical, but we named them in a way that specifies which actual service they belong to. When I am entering these into Service Management, I'll relate each piece to the correct actual service. In other words, I'll first create the “North America Email“ actual service under the “Email Service” service definition. Then I'll create each of its service components from that actual service as related CIs (configuration items).</p>\n<p>Finally, I'll create the system elements for each service component, again as related CIs. In this way, I'll create two separate actual services, each with their own hierarchy of supporting components and elements underneath. This will give our IT department a clear definition of what makes up the service we are supporting. We can think of this as the internal representation of our service.</p>\n<p>Here's a quick sketch of what makes up our two services:</p>\n<p><br/>\n<strong>North America Email Service</strong></p>\n<div>\n<div><a class=\"image\" href=\"/file/images/e/e5/3.2-ActualService_NA.png\" title=\"/file/images/e/e5/3.2-ActualService_NA.png\"> <img alt=\"3.2-ActualService NA.png\" src=\"../../../images/3.2-ActualService_NA_f0573ff3.png\" style=\"height:262px; width:975px\"/> </a></div>\n</div>\n<p><br/>\n<strong>EMEA Email Service</strong></p>\n<div>\n<div><a class=\"image\" href=\"/file/images/2/24/3.3-ActualService_EMEA.png\" title=\"/file/images/2/24/3.3-ActualService_EMEA.png\"> <img alt=\"3.3-ActualService EMEA.png\" src=\"../../../images/3.3-ActualService_EMEA_339a529b.png\" style=\"height:291px; width:975px\"/> </a></div>\n</div>\n<p>As you can see, the structures of the services are identical. The difference in the two services is that each component is now a unique item or collection of items. While the service definition is an abstraction, the actual services contain specific components and elements.</p>\n<p>In reality, each of the components and elements is composed of multiple virtual machines running on multiple physical machines. In the future, we want every bit of this level of granularity to be part of our SACM database, but this will be enough to get us started.Hey, that's not bad for a start, is it? I've defined the internal services that my team will provide for our customers. And created a high-level configuration of each of the actual services we currently have in production. That seems like enough work to deserve a coffee break.</p>\n<p>Actually, before I have that coffee, let's look at another important service we provide to our users: Service Management. We have two actual services to define: the IT Service Desk and the HR Help Desk. Our HR team is using Service Management to manage their requests, while the IT department is using Service Manager. Our service structure looks like:</p>\n<div><a class=\"image\" href=\"/file/images/5/59/keyC_sm_services.png\" title=\"/file/images/5/59/keyC_sm_services.png\"> <img alt=\"keyC_sm_services\" border=\"0\" file=\"/mediawiki/images/5/59/keyC_sm_services.png\" height=\"312\" hspace=\"0\" src=\"../../../images/keyC_sm_services_d66f5603.png\" style=\"width:604px;height:312px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"604\"/> </a></div>\n<p>You can see that even though both services perform the same overall function (providing Service Management functions), they have different components defined that support them. At a high level — the service levels — they are the same. But as we dig deeper into the pieces that make them run, we see differences in the software used and the computers that run them.</p>\n<p>Okay, now I definitely need that coffee. Why don't you review service definitions and think about how you would map your own service infrastructure, and I'll be back in a short while to talk about the service catalog.</p>\n<p>While you are waiting, you can always check out the online help for more information about the <a href=\"/doc/423/26.1/serviceportfoliomgmt\" title=\"Service Portfolio\">Service Portfolio</a> or <a href=\"/doc/423/26.1/sacm\" title=\"SACM\">SACM</a>.</p>\n</div>\n<!-- NewPP limit reportCached time: 20200216124518Cache expiry: 86400Dynamic content: falseCPU time usage: 0.024 secondsReal time usage: 0.118 secondsPreprocessor visited node count: 12/1000000Preprocessor generated node count: 34/1000000Post‐expand include size: 7857/2097152 bytesTemplate argument size: 0/2097152 bytesHighest expansion depth: 2/40Expensive parser function count: 0/100Unstrip recursion depth: 0/20Unstrip post‐expand size: 0/5000000 bytes--><!--Transclusion expansion time report (%,ms,calls,template)100.00%    0.000      1 -total--></div>\n<div></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}