{
  "title": "Configurations",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\">\n<p>The Configurations tab in Suite Administration enables you to configure suite-level settings.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-important-icon\"></div>\n<div class=\"admonition-content admonition-important-content\">\n<p>The suite takes several minutes to restart after you change the configurations.</p>\n</div>\n</div>\n<h2 class=\"mw-headline\" id=\"Security_tab\">Security tab</h2>\n<p>The Security tab enables you to configure Lightweight Single Sign-On (LW-SSO) and IdM settings. After installation, the Security tab contains out-of-the-box values for these settings. We recommend that you reconfigure them with your own values after installation.</p>\n<h3 class=\"mw-headline\" id=\"Lightweight_SSO_configuration\">Lightweight SSO configuration</h3>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-important-icon\"></div>\n<div class=\"admonition-content admonition-important-content\">The LW-SSO token approach is deprecated. We recommend that you change your LW-SSO to the Access Token approach at your earliest convenience. However, if you use SMA-SM, continue with the LW-SSO token approach as the Access Token approach isn't supported by Service Manager at the moment.</div>\n</div>\n<p>Lightweight Single Sign-On (LW-SSO) is a solution that enables a user to log in to one application and gain access to other applications without being prompted for login credentials. The applications that participate in LW-SSO trust the initial authentication and require no re-authentication when the user is moving from one application to another. LW-SSO shares between the applications a token that is signed with the same encryption key that must be configured in each application. With LW-SSO, once users are logged in to the suite, they can access their authorized suite capabilities without re-login.</p>\n<p>To configure LW-SSO in the suite, complete the following settings.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">You must configure the LW-SSO settings in Suite Administration. Don't configure the LW-SSO settings in IdM Admin Portal.</div>\n</div>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Domain</td>\n<td>\n<p>Enter the external access host FQDN or the parent domain of your suite installation. For example, if the FQDN of the external access host is <strong>a.b.c.com</strong>, enter the FQDN (<strong>a.b.c.com</strong>) directly or enter the immediate parent domain (<strong>b.c.com</strong>), but don't enter <strong>c.com</strong>.</p>\n<p>If you use FQDN, the FQDN must be at least a third-level domain. In other words, the second-level domain such as <b>example.com</b> isn't supported.</p>\n<p>If you use the parent domain of your suite installation, the parent domain can be the second-level domain (such as <b>example.com</b>) if your suite installation is a third-level domain.</p>\n<p><strong>Important</strong>: For SMA-SM (Service Manager tenants) and Universal Discovery and CMDB (UD/UCMDB), using the full external access host FQDN as the LW-SSO domain isn't supported. Instead, use the parent domain of your suite installation.</p>\n</td>\n</tr>\n<tr>\n<td>SSO cookie name</td>\n<td>\n<p>Default value: LWSSO_COOKIE_KEY</p>\n<p>You can customize the SSO cookie name.</p>\n<p><strong>Important</strong>: For SMA-SM (Service Manager tenants), Native SACM, and UD/UCMDB, changing the default SSO cookie name isn't supported. You must use LWSSO_COOKIE_KEY.</p>\n</td>\n</tr>\n<tr>\n<td>Encryption key</td>\n<td>\n<p>A string used for encrypting single sign-on tokens.</p>\n<p>The minimum length is 32 characters (letters and numbers). Do not use special characters. </p>\n<p>For best security, we highly recommend that you modify the Encryption key in all environments (test, development, and especially production).</p>\n</td>\n</tr>\n<tr>\n<td>Token expiration period (minutes)</td>\n<td>Defines how long (in minutes) an LW-SSO token is valid for. When the specified time has elapsed, the LW-SSO token is no longer valid, and a re-login is required. The value range is 11-1440.\n\t\t\t<p><b>Note: </b>The LW-SSO expiration period must be no less than the Access Token expiration period. However, if the former is longer than the latter, user sessions won't time out when the access token expires and the LW-SSO token doesn't. As best practice, set them to the same value. See <span style=\"background-color: transparent;\"><a href=\"/doc/423/26.1/timeout\" title=\"Session timeout configuration\">Session timeout configuration</a>. </span></p>\n</td>\n</tr>\n</tbody>\n</table>\n<p><strong>Note</strong>:</p>\n<ul>\n<li>If there are token conflicts between applications that participate in LW-SSO:\n\t<ul>\n<li>Use FQDN as the Domain if the FQDNs of these applications are different.</li>\n<li>Change the SSO cookie name if the FQDNs of these applications are the same.</li>\n</ul>\n</li>\n<li>For SMA-SM, if you create multiple Service Manager tenants and you want to enable LW-SSO across these instances, all external Service Manager systems must be in the same domain as the suite installation and the value of <b>initString</b> in all external Service Manager systems must be the same as the value of <b>Encryption Key</b> defined in Suite Administration.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"IdM_configuration\">IdM configuration</h3>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">You must configure the IdM signing key in Suite Administration. Do not configure the IdM signing key in IdM Admin Portal.</div>\n</div>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Signing key</td>\n<td>\n<p>This is a key for signing IdM tokens when you configure SAML for an \"SM integration\" tenant. The key must be at least 32 characters long and contain both letters and numbers.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 class=\"mw-headline\" id=\"IdM_configuration\">Access Token configuration</h3>\n<p>Instead of using LW-SSO, we recommend that you use the Access Token approach to enable single sign-on among applications and integrations for better security.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-important-icon\"></div>\n<div class=\"admonition-content admonition-important-content\">The LW-SSO token approach is deprecated. We recommend that you change your LW-SSO to the Access Token approach at your earliest convenience. However, if you use SMA-SM, continue with the LW-SSO token approach as the Access Token approach isn't supported by Service Manager at the moment.</div>\n</div>\n<p>To configure the Access Token, complete the following settings.</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Token expiration period (minutes)</td>\n<td>Defines how long (in minutes) the access token is valid for. When the specified time has elapsed, the token is no longer valid, and a re-login is required. The value range is 11-1440.\n\t\t\t<p>The expiration period should be identical to (recommended) or shorter than the expiration period in the Lightweight SSO configuration.</p>\n<p>Default value: 60</p>\n<p><strong>Note: </strong>The LW-SSO expiration period must be no less than the Access Token expiration period. However, if the former is longer than the latter, user sessions won't time out when the access token expires and the LW-SSO token doesn't. As best practice, set them to the same value. See <span style=\"background-color: transparent;\"><a href=\"/doc/423/26.1/timeout\" title=\"Session timeout configuration\">Session timeout configuration</a>.</span></p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"Email_service_tab\">Email service tab</h2>\n<p>The email service enables the system to send email notifications to any mail server that supports Simple Mail Transfer Protocol (SMTP) or Exchange Web Services (EWS). Configuring the email service is mandatory before you can use email related features such as email notifications and surveys. </p>\n<p>Select EWS if you use Microsoft Exchange services. To use the EWS-based Microsoft Exchange email service that uses OAuth 2.0 authentication, you must have registered an application and configured it appropriately for authentication. Please use OAuth 2.0 ROPC if you have configured for delegated authentication and use OAuth 2.0 client credentials for app-only authentication. You may refer to the <a href=\"https://docs.microsoft.com/en-us/exchange/client-developer/exchange-web-services/how-to-authenticate-an-ews-application-by-using-oauth\" title=\"Microsoft documentation\">Microsoft documentation</a> for detailed guidance. Take note of the Application (client) ID, client secret, and Directory (tenant) ID created during the process. You need to enter the information on this form. </p>\n<div class=\"admonition\">\n<div class=\"admonition-content admonition-note-content\">\n<p>If a tenant has mail configurations defined in the tenant details in Suite Administration, the tenant uses its specific mail configurations.   </p>\n</div>\n</div>\n<p>To configure the suite-level email service:</p>\n<ol>\n<li>Configure the following settings.\n\t<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Mail server host</td>\n<td>Enter the name of the mail server host that is used for sending email notifications. It can be the IP address, machine name, or DNS name of the mail server.</td>\n</tr>\n<tr>\n<td>Mail from</td>\n<td>\n<p>Enter the email address identified as the email sender. </p>\n<p><strong>Note:</strong> The following three types of top-level domains (TLDs) are accepted in this field:</p>\n<ul>\n<li>Infrastructure TLDs (.arpa, etc.)</li>\n<li>Generic TLDs (.com, .org, etc.) </li>\n<li>Country code TLDs (.us, .uk, .cn, etc.)</li>\n</ul>\n<p>Non-TLDs (for example, .local) and new Generic TLDs are not accepted in this field. </p>\n</td>\n</tr>\n<tr>\n<td>Authentication required</td>\n<td>\n<ul>\n<li>If the mail server requires authentication, turn on this switch and enter the user name and password.</li>\n<li>If the mail server doesn't require authentication, turn off this switch.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>User name</td>\n<td>Required only if authentication is required. Enter the user name of the account used for mail server authentication.</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>In the <strong>Mail protocol</strong> field, select <strong>SMTP</strong> or <strong>EWS</strong> as the mail server type.</li>\n<li>Configure the EWS or SMTP settings. See the \"EWS settings\" or \"SMTP settings\" section below. </li>\n<li>Click <b>Test connection</b> to verify the server connectivity, if the mail server can be connected successfully, click <b>Save</b>.</li>\n</ol>\n<h3>SMTP settings</h3>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Password</td>\n<td>Required only if authentication is required. Enter the password of the account used for mail server authentication.</td>\n</tr>\n<tr>\n<td>\n<p>SMTP server port</p>\n</td>\n<td>Enter the communications port that the SMTP mail server uses.</td>\n</tr>\n<tr>\n<td>\n<p>Certificate</p>\n</td>\n<td>\n<p>Select a certificate used by the SMTP server.</p>\n<ul>\n<li>Enable TLS</li>\n<li>Enable SSL</li>\n<li>Plain</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-important-icon\"></div>\n<div class=\"admonition-content admonition-important-content\">\n<p><b>Enable TLS</b> is strongly recommended. By selecting <b>Enable SSL</b> or <b>Plain</b> instead of <b>Enable TLS</b>, you are disabling or bypassing security features, thereby exposing the system to increased security risks. By using this option, you understand and agree to assume all associated risks and hold <code>OpenText</code> harmless for the same.</p>\n<p>In case the certificate is changed to <b>Enable SSL</b> or <b>Plain</b>, <code>OpenText</code> encourages the customer to add relevant protection measures to protect against risks associated with the selected certificate, which isn't provided by <code>OpenText</code>. By not implementing relevant protection measures you may be exposing the system to increased security risks. You understand and agree to assume all associated risks and hold <code>OpenText</code> harmless for the same. It remains at all times the Customer's sole responsibility to assess its own regulatory and business requirements. <code>OpenText</code> doesn't represent or warrant that its products comply with any specific legal or regulatory standards applicable to Customer in conducting Customer's business.</p>\n</div>\n</div>\n<p>If the certificate of your SMTP server isn't in the trust store, you need to:</p>\n<ol>\n<li>\n<p>On the NFS server, upload the certificate to the <code><i>&lt;</i>config-volume<i>&gt;</i>/certificate/source</code> folder.</p>\n<p>For example: <code>/var/vols/itom/itsma/config-volume/certificate/source</code>.</p>\n</li>\n<li>\n<p>On the control plane node, restart the <b>itom-bo-config pod </b>and<b> itom-xruntime-platform</b> pods.</p>\n<p>For example:</p>\n<pre>kubectl get pods -n itsma1 | grep itom-xruntime-platform\nitom-xruntime-platform-755f55d699-rg7kk             2/2       Running   0          1h\nitom-xruntime-platform-offline-7859f49f78-5qn28     2/2       Running   0          1h\nkubectl delete pod -n itsma1 itom-xruntime-platform-755f55d699-rg7kk\nkubectl delete pod -n itsma1 itom-xruntime-platform-offline-7859f49f78-5qn28</pre>\n</li>\n</ol>\n</td>\n</tr>\n</tbody>\n</table>\n<h3>EWS settings</h3>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>\n<p>Authentication method</p>\n</td>\n<td>\n<p>Select <strong>Basic </strong>or <strong>NTLM</strong> for Exchange on-premises servers.</p>\n<p>Select <strong>OAuth 2.0 ROPC</strong> or <strong>OAuth 2.0</strong> <strong>client credentials</strong> for Exchange Online.</p>\n<ul>\n<li>Basic</li>\n<li>NTLM</li>\n<li>\n<div class=\"transcontent stn-begin--OAuthROPC\"> </div> \n\t\t\t\t\n\t\t\t\tOAuth 2.0 ROPC: select this method if you have configured for delegated authentication.\n\n\t\t\t\t\n\t\t\t\t <div class=\"transcontent stn-end--OAuthROPC\"> </div>\n</li>\n<li>\n<div class=\"transcontent stn-begin--OAuthClient\"> </div> \n\t\t\t\t\n\t\t\t\tOAuth 2.0 client credentials: select this method if you have configured for app-only authentication.\n\n\t\t\t\t\n\t\t\t\t <div class=\"transcontent stn-end--OAuthClient\"> </div>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>Domain </p>\n<p>(for NTLM authentication only)</p>\n</td>\n<td>Enter the domain of the account used for mail server authentication.</td>\n</tr>\n<tr>\n<td>\n<p>Application (client) ID</p>\n<p>(for OAuth 2.0 authentication only)</p>\n</td>\n<td>Enter the value of Application (client) ID.</td>\n</tr>\n<tr>\n<td>\n<p>Client secret</p>\n<p>(for OAuth 2.0 authentication only)</p>\n</td>\n<td>Enter the value of client secret.</td>\n</tr>\n<tr>\n<td>\n<p>Service path</p>\n</td>\n<td>Enter the EWS service path (for example, <code>EWS/Exchange.asmx</code>) for the full EWS service URL. The full EWS service URL consists of <b>Mail server host</b> and <b>Service path</b>.</td>\n</tr>\n<tr>\n<td>\n<p>Version</p>\n</td>\n<td>\n<div class=\"transcontent stn-begin--ExchangeVer\"> </div> \n\t\t\t\n\t\t\tSelect the version of Exchange Server. If you are unable to find a match, select the latest version prior to the version of your Exchange Server.\n\n\t\t\t\n\t\t\t <div class=\"transcontent stn-end--ExchangeVer\"> </div>\n</td>\n</tr>\n<tr>\n<td>\n<p>Directory (tenant) ID</p>\n</td>\n<td>Enter the value of Directory (tenant) ID.</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\" id=\"CMS_Settings_tab\">Proxy Settings tab</h2>\n<p class=\"mw-headline\"><span style='color: rgb(51, 51, 51); font-family: Roboto, \"Apple Color Emoji\", \"Segoe UI Emoji\", \"Segoe UI Symbol\"; font-size: 16px;'>If the suite needs to use a proxy server to connect to the internet, configure a proxy server on this tab. </span></p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\"> Currently, the new Software Asset Management (SAM) solution, integration solutions based on the Integration Studio, and Cloud Management Platform (CMP) FinOps are using the proxy settings specified here. </div>\n</div>\n<p>To configure a proxy server, follow these steps:</p>\n<ol>\n<li>Click the <strong>CONFIGURATION </strong>tab on the main menu, and then click <strong>Proxy Settings</strong>.</li>\n<li>On the page that appears, set the following fields:\n\t<ul>\n<li><strong>Proxy host</strong>: the hostname of the proxy server you configured.</li>\n<li><strong>Proxy port</strong>: the port number of the proxy server.</li>\n<li>(Optional) <strong>Proxy username</strong> and <strong>Proxy password</strong>: the username and password of the proxy server. </li>\n</ul>\n</li>\n<li>Click <strong>SAVE</strong>.</li>\n</ol>\n<p>To clean up the proxy settings, remove all field values and save the changes. </p>\n<h2 class=\"mw-headline\">Smart Analytics tab</h2>\n<p>Click <b>Go to Smart Analytics</b>, you can add content groups and check Smart Analytics components status. For more information, see <a href=\"/doc/423/26.1/smartaadmin\" title=\"SMAX:25.1/SmartAAdmin\">Administer Smart Analytics</a>.</p>\n<h2 class=\"mw-headline\" id=\"IDOL_index_tab\">IDOL index tab</h2>\n<p>Service Management uses an IDOL (Intelligent Data Operating Layer) based search. IDOL indexes new information at regular intervals to ensure that new searches return up-to-date results. This tab enables you to set the intervals for Service Management to send updating index requests to the IDOL server, IDOL server processes the requests based on the IDOL system setting.</p>\n<h2 class=\"mw-headline\" id=\"License_expiration_notification_tab\">License expiration notification tab</h2>\n<p>This tab enables you to define when to send license expiration notifications to the tenant admin. </p>\n<h2 id=\"Crawling_upgrade_tab_(SMAX_tenants_only)\"><span class=\"mw-headline\" id=\"Crawling_upgrade_tab_.28SMAX_tenants_only.29\">Crawling upgrade tab (SMAX tenants only)</span></h2>\n<div class=\"transcontent stn-begin--crawling_upgrade\"> </div>\n<p>The crawling upgrade feature enables you to implement various database modifications after a patch or version update or perform data migration from a legacy field to a new field after a version update. This feature is designed to resolve the following issues:</p>\n<ul>\n<li>The suite's patch update mechanism isn't capable of implementing database modifications such as creating new tables, updating table structures, and creating indexes.</li>\n<li>The suite's version update mechanism is capable of performing content update including data migration (for example, from a legacy field to a new field), however, this kind of data migration may be time-consuming and hence increase system downtime and cause a higher risk of failure.</li>\n</ul>\n<p>The crawling upgrade feature is designed to perform these kinds of database modifications and content update.</p>\n<p>The <strong>Crawling upgrade</strong> tab displays the crawling upgrade status of all tenants with a backend type of <strong>SMAX </strong>(\"SMAX tenants\"). The <strong>Data upgrade version</strong> field shows the crawling upgrade version of each tenant. </p>\n<h3 class=\"mw-headline\" id=\"When_to_run_a_crawling_upgrade\">When to run a crawling upgrade</h3>\n<p>After running a patch update or version update, you can run a crawling upgrade at runtime (that is, when your suite system is up and running). Although a crawling upgrade will not cause additional system downtime, we still recommend you run the crawling upgrade during non-working hours or non-peak hours considering the performance impact it may have.   <br/>\n <br/>\n<b>Note</b>: Not every patch update or version update needs a crawling upgrade. Read the specific patch release notes or version update documentation to see if a crawling upgrade is required.</p>\n<h3 class=\"mw-headline\" id=\"How_to_run_a_crawling_upgrade\">How to run a crawling upgrade</h3>\n<p>The suite has system-defined tenants (referred to as \"platform\"), which are different than those you create after the suite installation (\"your own tenants\"). Your own tenants have a dependency on the platform, so you must upgrade the platform first before upgrading your own tenants. There are two buttons on the <b>Crawling upgrade</b> tab:</p>\n<ul>\n<li><b>START BATCH UPGRADE</b>:<br/>\n\tIf you want to upgrade all tenants (including the platform and your own tenants) in one go, press this button.</li>\n<li><b>START PLATFORM UPGRADE</b>:<br/>\n\tIn a production environment, you may have different types of tenants, such as DEV tenants and Production tenants. You may want to run the crawling upgrade on the DEV tenants first to verify the process, and then run it on the Production tenants. In this case, you need to press this button to upgrade the platform first. Once the platform upgrade is complete, you can press a <b>START UPGRADE</b> button that appears for each of your own tenants to upgrade them one by one.<br/>\n\tNote that after the platform upgrade, you can also press the <b>START BATCH UPGRADE</b> button to upgrade your own tenants all at once.</li>\n</ul>\n<p>If no crawling upgrade is needed for your environment (for example, if your environment is a new installation of the current release), these two buttons are disabled (greyed out).</p>\n<p>To view the details of each crawling upgrade, click <b>Details</b> next to each upgrade button. The details page shows the following information about the upgrade steps:</p>\n<ul>\n<li><b>Task name</b>: Name of the upgrade step.</li>\n<li><b>Upgrade time</b>: date/time when the upgrade step is completed.</li>\n<li><b>Upgrade details</b>: detailed description of the upgrade step.</li>\n<li><b>Upgrade status</b>: status of the upgrade step.</li>\n<li><b>Comments</b>: comments about the upgrade step.</li>\n</ul>\n<p>Once a tenant upgrade has started, information about the tenant's upgrade status and upgrade duration (hh:mm:ss) is updated on the screen. The upgrade status can be any of the following values:</p>\n<ul>\n<li><b>Complete</b>: the crawling upgrade was successfully completed. </li>\n<li><b>No Upgrade Needed</b>: this tenant doesn't need to be upgraded. </li>\n<li><b>Pending Upgrade</b>: this tenant is pending the crawling upgrade. </li>\n<li><b>In Progress</b>: the crawling upgrade for the tenant is still in progress. </li>\n<li><b>Failed</b>: the crawling upgrade for the tenant failed.</li>\n</ul>\n<div class=\"transcontent stn-end--crawling_upgrade\"> </div>\n<h2>Authorization migration tab</h2>\n<p>Use this tab to replicate the following authorization data between IdM and the tenant:</p>\n<ul>\n<li>Groups</li>\n<li>Roles</li>\n<li>Relationships between groups and roles</li>\n<li>Relationships between groups and users</li>\n<li>Relationships between users and roles</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\"><br/>\nThe following data will <em>not </em>be copied from Service Management to IdM during authorization migration:\n\n<ul>\n<li>Users</li>\n<li>Permissions and their relationship with roles.</li>\n<li>Relationships between contacts and groups/roles.</li>\n<li>Groups that are not assigned roles and member users. Only groups that have roles assigned (called \"authorized group\") are migrated.</li>\n<li>Groups whose user principal name contains special characters, including space, carriage return, and these characters: @;:=&amp;&lt;&gt;#{}|`^~%'?\\\"/[].</li>\n<li>The Self-Service Portal User, Self-Service Restricted Portal User, and Guest roles and their relationships with users and groups.</li>\n</ul>\n<p>The following data will <em>not </em>be copied from IdM to Service Management during authorization migration:</p>\n<ul>\n<li>Users</li>\n<li>Permissions and their relationship with roles.</li>\n<li>Roles whose Application field is not one of the following: <strong>SMAX</strong>, <strong>DND</strong>, <strong>OO</strong>, <strong>CGRO</strong>, <strong>AUDIT</strong>, <strong>CONTENTSTORE</strong>, and <strong>CMDB</strong>.</li>\n<li>The user-group and user-role relationships for users whose groups were synchronized from LDAP as per a group rule.</li>\n</ul>\n</div>\n</div>\n<h3>Why and when should I perform authorization migration?</h3>\n<p>In versions earlier than <code>2022.05</code>, authorization data (groups, roles, and relationships between roles, groups, and users) for additional capabilities such as DND, CMP FinOps, Content Store, Operations Orchestration, and UD/UCMDB was stored only in IdM, not in Service Management. On the other hand, authorization data for Service Management was stored only in Service Management, not in IdM.</p>\n<p>Starting from version <code>2022.05</code>, converged authorization is available so that authorization data for Service Management and these additional capabilities is stored in both IdM and Service Management. This centralized storage of authorization data has the following benefits:</p>\n<ul>\n<li>It enables the tenant admin to manage authorization data for Service Management and these additional capabilities from the agent interface, without the need to access the IdM Admin Portal.</li>\n<li>It aggregates authorization data for all services to IdM, which is the single source of truth for authorization and authentication data.</li>\n</ul>\n<p>If you have one or more of these additional capabilities deployed in your environment and have upgraded to version <code>2022.05</code>, you have the option to perform the one-time authorization data migration so that both IdM and the agent interface store the same complete set of authorization data. </p>\n<h3>Simulating migration</h3>\n<p>Performing a simulation before the actual migration gives you some idea of the migration duration so that you can plan the migration in an appropriate maintenance window.</p>\n<p>Select a tenant and then click <strong>Simulate</strong> to start the simulation process. Click <strong>Refresh </strong>to see the latest Job status. Click the Tenant Id to open the Job details page and view the projected number of records the migration will process.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\"><br/>\nThe actual authorization data to be migrated might be different from the projected data. To get an accurate estimation of the migration duration, the simulation should be performed as close to the actual migration as possible.</div>\n</div>\n<h3>Performing migration</h3>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\"><br/>\nIt is recommended to perform a simulation before migrating authorization data.</div>\n</div>\n<p>Select a tenant for which to migrate authorization data and then click <strong>Migrate </strong>to start the migration process. Click <strong>Refresh </strong>to see the latest Job status. </p>\n<h3>Notes for migration and simulation processes</h3>\n<ul>\n<li>You can only run a migration or migration simulation job for one tenant at a time.</li>\n<li>You can click the Tenant Id to go to the job details page, where you can view the status of each individual task and the projected and actual number of migrated records. You can also start the migration or simulation for the particular tenant from this page.</li>\n<li>You can cancel (stop) an ongoing job, for example, to avoid harming system performance when the migration job is not completed within the maintenance window. Note that canceling a migration does not roll back data already migrated.</li>\n</ul>\n<h3>Field mapping for migrated roles</h3>\n<p>When replicating roles from IdM to the agent interface, the system uses the following field mappings.</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<thead>\n<tr>\n<th scope=\"col\">IdM role </th>\n<th scope=\"col\">Agent interface role</th>\n<th scope=\"col\">Note</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Display name</td>\n<td> Name</td>\n<td>Roles for additional capabilities or applications will have their role names prepended with [ &lt;application&gt; ]. For example, an IdM role \"Demo\" whose application is DND will be displayed as \"[ DND ] Demo\" in the Agent Portal.<br/>\n\t\t\tSuch roles will be displayed after Service Management roles in the roles list, and users can't assign permissions to them.</td>\n</tr>\n<tr>\n<td>Name</td>\n<td>Code</td>\n<td></td>\n</tr>\n</tbody>\n</table>\n<p>When replicating roles from the agent interface to IdM, the system uses the following field mappings.</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\">\n<thead>\n<tr>\n<th scope=\"col\">Agent interface role</th>\n<th scope=\"col\">IdM role</th>\n<th scope=\"col\">Note</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Name</td>\n<td>Display name</td>\n<td></td>\n</tr>\n<tr>\n<td>Code</td>\n<td>Name</td>\n<td>\n<p>At the initial migration, roles in the agent interface have no Code value. In this case, the system maps the role name instead to the role name in IdM, with the following conversion of special characters if any: </p>\n<ul>\n<li>Converting space to a hyphen</li>\n<li>Converting other special characters (carriage return and <strong>@;:=&amp;&lt;&gt;#{}|`^~%'?\\\"/[]</strong>) to an underscore</li>\n</ul>\n<p>For example, a role named <strong>Asset&amp;Configuration Administrator</strong> in the agent interface becomes a role in IdM with the following field values:</p>\n<ul>\n<li>Display name: <strong>Asset&amp;Configuration Administrator</strong></li>\n<li>Name: <strong>Asset_Configuration-Administrator</strong></li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<p>Some Service Management roles have a slightly different name after being migrated to IdM (see the table below). </p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<thead>\n<tr>\n<th scope=\"col\">Service Management role name</th>\n<th scope=\"col\">IdM display name after migration </th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>CMP Agent</td>\n<td>CMPAgent</td>\n</tr>\n<tr>\n<td>Favorite Views Owner</td>\n<td>FavoritesAdminRole</td>\n</tr>\n<tr>\n<td>MT Administrator</td>\n<td>MTAdministrator</td>\n</tr>\n<tr>\n<td>MT Agent</td>\n<td>MTAgent</td>\n</tr>\n<tr>\n<td>Strong Identity Validation Bypass</td>\n<td>Reauthentication Bypass</td>\n</tr>\n<tr>\n<td>Tenant Admin Role</td>\n<td>tenantAdmin</td>\n</tr>\n</tbody>\n</table>\n<h2>Credential store tab</h2>\n<p>The credential store offers a centralized and<strong> </strong>secure solution for managing the credentials of IdM instances. It enables different applications to retrieve tokens through APIs without the need to handle complex logic.</p>\n<p><strong>Note: </strong>The <strong>Credential store</strong> feature doesn't work for mixed mode (SMA-SM) deployments.</p>\n<p>To create a credential, follow these steps:</p>\n<ol>\n<li>Click <strong>New</strong>.</li>\n<li>In the <strong>Credential</strong> dialog box, specify these fields:\n\t<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<thead>\n<tr>\n<th scope=\"col\">Field</th>\n<th scope=\"col\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Name</td>\n<td>The display name of the required credential you want to create for the external IdM.</td>\n</tr>\n<tr>\n<td>Tenant</td>\n<td>\n<p>The tenant ID, which is required when you add capabilities after installing the suite.</p>\n<p>The tenant you select must be active.</p>\n</td>\n</tr>\n<tr>\n<td>IdM endpoint</td>\n<td>The endpoint of the external IdM that you want to connect, in the format of <code>https://&lt;Host&gt;:&lt;Port&gt;</code>. For example, <a aria-label=\"Link https://odl.saas.opentext.com.\" href=\"https://odl.saas.opentext.com.\" rel=\"noreferrer noopener\" target=\"_blank\" title=\"https://odl.saas.opentext.com./\">https://odl.saas.opentext.com.</a><url></url></td>\n</tr>\n<tr>\n<td>Organization</td>\n<td>The organization of the external IdM.</td>\n</tr>\n<tr>\n<td>User name</td>\n<td>The name of a user in the tenant of the external IdM.</td>\n</tr>\n<tr>\n<td>Security type</td>\n<td>The security type. You can select either <strong>PASSWORD</strong> or <strong>VAULT</strong>.</td>\n</tr>\n<tr>\n<td>Password</td>\n<td>The password of the user. Enter the password if you selected <strong>PASSWORD</strong> as the security type.</td>\n</tr>\n<tr>\n<td>Vault</td>\n<td>The vault key. Enter the vault key if you selected <strong>VAULT</strong> as the security type.</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>Click <strong>Test connection</strong>. If the action fails, check if the field values are correct.</li>\n<li>Click <strong>Save</strong>. It will generate a UUID for this credential. You can use this UUID to connect to the external IdM.</li>\n</ol>\n<p>You can only create or delete one credential at a time.</p>\n<h2 id=\"SmartVAMemoryConfig\">Virtual agent tab</h2>\n<p>If you want to enhance the responsiveness of the smart virtual agent for some languages in some tenants, you can turn on the \"Enable cache configuration\" option, and then add those tenant-language combinations by clicking <strong>Add</strong> on the toolbar.</p>\n<p>Notes:</p>\n<ul>\n<li>Before you add a tenant-language combination, make sure you have performed virtual agent training for that tenant, and you have entered training sentences in that language. The training data models are generated only after the training, so a combination is not valid before training is performed for the corresponding tenant.</li>\n<li>Clicking <strong>Save</strong> below the primary models list not only saves the primary models you added but also immediately loads the configured models to the memory. Therefore, check the Loaded value in the primary models list <em>after</em> you click the <strong>Save</strong> button.</li>\n<li>Possible reasons for a configured primary model not being loaded (with value <code>N</code> in the Loaded column) include: you haven't performed training for that tenant, there's no training sentence defined in that language, the model size is too large to be loaded in the remaining memory for primary models and the reserved memory, and so on.</li>\n<li>\n<p>If your deployment includes tenants that have training sentences defined in Chinese, you need to increase the default reserved memory size. See <a href=\"/doc/423/26.1/smartvahwconsumptionusagetuning#ChgReserved\" title=\"How to change reserved memory size\">How to change reserved memory size</a>.</p>\n</li>\n<li>\n<p>The Estimated model size column displays the correct value only if you have performed training for the tenant.</p>\n</li>\n<li>After you delete or inactivate a tenant, you must click <strong>Save</strong> to make the system release the models for the tenant from memory.</li>\n</ul>\n<p>To effectively configure this, you need to understand how the smart virtual agent functionality uses hardware resources. See <a href=\"/doc/423/26.1/smartvahwconsumptionusagetuning\" title=\"Hardware resource consumption for smart virtual agent\">Hardware resource consumption for smart virtual agent</a>.</p>\n<p><span style=\"color: rgb(0, 115, 231); font-family: Roboto, sans-serif; font-size: 24px;\">Related topics</span></p>\n<ul>\n<li><a href=\"/doc/423/26.1/tenantmgmt\" title=\"Tenants\">Tenants</a></li>\n<li><a href=\"/doc/423/26.1/accountsmgmt\" title=\"Accounts\">Accounts</a></li>\n<li><a href=\"/doc/423/26.1/usersmanagement\" title=\"Users\">Users</a></li>\n<li><a href=\"/doc/423/26.1/licensepools\" title=\"License pools\">License pools</a></li>\n<li><a href=\"/doc/423/26.1/licensesmgmt\" title=\"Licenses\">Licenses</a></li>\n<li><a href=\"/doc/423/26.1/assignlicense\" title=\"Assignments\">Assignments</a></li>\n<li><a href=\"/doc/423/26.1/operationhistory\" title=\"Operation history\">Operation history</a></li>\n</ul>\n</div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}