{
  "title": "How license consumption is calculated",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>This section describes how SAM calculates license consumption for on-premises products.</p>\n<h2 class=\"mw-headline\" id=\"Calculation_process_for_on-premises_products\">Calculation process for on-premises products</h2>\n<p>After you trigger a license compliance calculation job for on-premises products, SAM processes the job in the following steps.</p>\n<p><a class=\"image\" href=\"/file/images/2/21/LicenseConsumpProcess21.08.PNG\" title=\"/file/images/2/21/LicenseConsumpProcess21.08.PNG\"> <img border=\"0\" src=\"../../../images/LicenseConsumpProcess21.08_6f08e3e8.png\"/> </a></p>\n<h3 class=\"mw-headline\" id=\"Step_1:_Parse_job_parameters\">Step 1: Parse job parameters</h3>\n<p>The SAM job executor parses parameters in the job context record, such as the product you want to calculate and the data source you want to use. SAM automatically generates these job parameters based on your operations on the UI.</p>\n<h3 class=\"mw-headline\" id=\"Step_2:_Fetch_license_data\">Step 2: Fetch license data</h3>\n<p>SAM retrieves license data based on the parsed parameters and uses the retrieved data to build an in-memory license pool.</p>\n<h3 class=\"mw-headline\" id=\"Step_3:_Fetch_CI_data_from_CMS\">Step 3: Fetch CI data from UD/UCMDB</h3>\n<p>Based on the parsed parameters, SAM retrieves CI data from UD/UCMDB through an API.</p>\n<h3 class=\"mw-headline\" id=\"Step_4:_Organize_CI_and_configuration_data\">Step 4: Organize CI and configuration data</h3>\n<p>SAM organizes the retrieved CI data by calculation unit, and then passes the organized CI and configuration data as input context.</p>\n<h3 class=\"mw-headline\" id=\"Step_5:_Calculate_license_consumption_of_physical_devices\">Step 5: Calculate license consumption on calculation units</h3>\n<p>When calculating the license consumption:</p>\n<ol>\n<li>SAM finds proper license rules based on the product compatibility matrix and license availability in the license pool, and then prepares the calculation context.</li>\n<li>SAM uses the discovered license rules to calculate license consumption based on the calculation context.</li>\n<li>If only one consumption result is generated, SAM uses this result for consumption aggregation. If many consumption results are generated based on different license rules, SAM uses the result calculated based on the default license rule for consumption aggregation.</li>\n</ol>\n<h3 class=\"mw-headline\" id=\"Step_6:_Reserve_licenses\">Step 6: Reserve licenses</h3>\n<p>When licenses are sufficient, SAM reserves the licenses for allocation and generates a compliance result for each calculation unit. Currently, SAM allocates reserved licenses in a random way. </p>\n<h3 class=\"mw-headline\" id=\"Step_7:_Generate_compliance_results\">Step 7: Generate compliance results</h3>\n<p>SAM aggregates the compliance result of each calculation unit and creates a company-level compliance report.</p>\n<h2 class=\"mw-headline\" id=\"Major_process_activities\">Major process activities</h2>\n<p>This section describes the major activities in the license consumption calculation process. The process works for both license consumption calculation jobs and license rule testing jobs.</p>\n<p>Differences between calculating license consumption and testing license rules:</p>\n<ul>\n<li>For license rule testing jobs, SAM will skip license reservations.</li>\n<li>The compliance results of these two types of jobs have different tags. This prevents the testing result from affecting the compliance report.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Fetch_CI_data_from_CMS\">Fetch CI data from UD/UCMDB</h3>\n<p>SAM retrieves three types of CI data:</p>\n<ul>\n<li>Software instances defined in the compliance calculation job. In CMS, <b>InstalledSoftware</b> is the CI type of these instances.</li>\n<li>Devices installed with the software. A device can be a virtual machine or a physical machine.</li>\n<li>Physical devices that host virtual machines installed with the software instances.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Organize_CI_data_and_corresponding_configurations\">Organize CI data and corresponding configurations</h3>\n<p>SAM organizes the retrieved CI data by calculation unit.</p>\n<h3 class=\"mw-headline\" id=\"Calculate_license_consumption_of_physical_devices\">Calculate license consumption on calculation unit</h3>\n<p>For most products, you can use the license of a later product version for instances of a prior version. This is known as “License Downgrade Rights.” For OOTB content such as the SQL Server and Windows Server, SAM has a built-in downgrade matrix. This matrix provides information on product downgrade compatibility between supported versions. Generally, a newly released SAM version covers the latest versions of the product.</p>\n<p><b>Notes:</b></p>\n<ul>\n<li>For potential purchasing purposes, SAM has added the latest versions to the downgrade matrix for calculating license consumption.</li>\n<li>\n<p>Starting from 2021.02, you can view and maintain the downgrade matrix by yourself. Starting from 2021.05, the upgrade matrix is available and can be customized.</p>\n</li>\n</ul>\n<p>Besides the “License Downgrade Rights,” SAM also allows linking a product version to many license rules. When looking for proper license rules for a product version, SAM considers the latest versions in the downgrade matrix (if applicable) and the versions in the license pool as “candidates.” Finding an applicable license rule in the candidate list is essential in the calculation process.</p>\n<h4 class=\"mw-headline\" id=\"Find_proper_license_rule_and_prepare_calculation_context\">Find proper license rules and prepare calculation context</h4>\n<p>To find an applicable license rule for the software versions in the input context, SAM compares the versions of the software instances with the versions in the candidate list one by one:</p>\n<ul>\n<li>If the version of a software instance exists in the candidate list, SAM takes this version to the “To be processed” version list in the memory.</li>\n<li>\n<p>If the version of a software instance doesn't exist in the candidate list, SAM searches the downgrade matrix (if applicable) to find a higher compatible version.</p>\n</li>\n</ul>\n<p>After finishing comparing the versions of all instances, SAM sorts the versions in the “To be processed” version list in ascending order, and then starts from the lowest version for licensing. Because a version can link to many license rules, only the license rules that have the same license metric as the existing licenses are used for calculation. If a re-calculation is needed, SAM selects the next higher version and uses the corresponding license rule. For more information about re-calculation, see the <em>Reserve licenses</em> section below.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note </span></p>\n<p>Different versions of instances may run on the same device directly, or on VMs hosted by a device. According to the licensing guide of the corresponding publisher, these instances may be licensed by different license metrics. This means the license consumption may be calculated based on more than one license rules. In this case, SAM requires that the license rules for calculating license consumption use the same license metric.</p>\n<p><b>Example:</b> You have a SQL Server 2012 Standard edition and a SQL Server 2016 Enterprise edition installed separately on two VMs that are hosted by the same device. You can use the SQL Server 2012 Standard license to entitle the SQL Server 2012 Standard instance and use the SQL Server 2016 Enterprise license to entitle the SQL Server 2016 Enterprise instance. The SQL Server 2012 Standard instance is licensed with the \"Per core\" or \"Server+CAL\" metric. The SQL Server 2016 Enterprise instance is licensed with the \"Per core\" metric. In this case, only the license rule with the \"Per core\" metric is used for calculation.</p>\n</div>\n<p>After the license rules are determined, SAM checks the license metric of each rules. Based on this metric, SAM re-organizes CI data by device, operating system environment (OSE), or instance, and then passes the re-organized CI data into the license rule as script context.</p>\n<h4 class=\"mw-headline\" id=\"Calculate_license_consumption_by_using_the_license_rule\">Calculate license consumption by using the license rule</h4>\n<p>The SAM script engine runs the selected license rule and calculates license consumption based on the script context.</p>\n<p>If you re-organize the CI data by OSE or instance, SAM automatically aggregates the calculated license consumption points of the OSEs.</p>\n<h4>Choose one consumption result for aggregation</h4>\n<p>Because many license rules can be linked to a version, you might get different results generated by those license rules. SAM chooses only one result for consumption aggregation, and the other results are stored in the SAM database for compliance analysis. The mechanism for choosing the final result is as follows:</p>\n<ul>\n<li>If only one result is generated, SAM marks this result for aggregation.</li>\n<li>If many results are generated, SAM marks the result that's generated based on the default license rule for aggregation.</li>\n<li>If many results are generated and none of them is generated based on the default license rule, SAM reports an error in the log.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Reserve_licenses\"><span id=\"Reserve_licenses\">Reserve licenses</span></h3>\n<p>SAM supports reserving licenses for calculation units. After the consumption results are generated, all calculation units queue up for license reservation. SAM searches the license pool for available license assets and assigns these assets to the corresponding calculation unit. In most scenarios, devices in data centers host more VMs and need the licenses most. For this reason, the licenses are first reserved for the device that hosts the largest number of VMs installed with the software instance.</p>\n<p>If no license assets exist, SAM skips this step. The reservation action occurs only when the calculation on all devices is complete.</p>\n<p>This figure shows the process of license reservation.</p>\n<p><a class=\"image\" href=\"/file/images/2/2e/LicenseReserveProcess.PNG\" title=\"/file/images/2/2e/LicenseReserveProcess.PNG\"> <img src=\"../../../images/LicenseReserveProcess_159b449f.png\"/> </a></p>\n<p>The license reservation status falls into two categories:</p>\n<ul>\n<li><b>Reserved:</b> If the licenses in the license pool are enough for all software instances on a calculation unit, SAM assigns the related license assets to the unit and marks the calculation unit as “Reserved.”</li>\n<li>\n<p><b>Unreserved:</b> If the licenses are insufficient, SAM marks the calculation unit as “Unreserved” and places it into the unreserved unit queue. After the license assets are reserved for all devices in the waiting queue, SAM re-calculates the consumption for calculation units in the unreserved queue. Each time a re-calculation is performed on a given unit, SAM applies an unused license rule to a higher compatible version in the license pool. This generates the consumption results and helps reserve licenses.</p>\n</li>\n</ul>\n<p>If the reservation still fails with all algorithms being tried, SAM stops the re-calculation. The calculation unit is marked as \"Uncompliant.\" This status indicates that you need to purchase a specific number of licenses. The number of consumed points is the number of licenses to be purchased.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note </span>Many consumption results might be generated based on different license rules, and only one of them is marked for aggregation. SAM reserves the same number of licenses as this consumption result.</p>\n</div>\n<p>After finishing a reservation, SAM starts to get the compliance result of the next calculation unit for license reservation regardless of the earlier reservation result.</p>\n<p>You can view the number of reserved license points from the <strong>Points allocated</strong> field on the <a href=\"/doc/423/26.1/samcompliance\">Compliance</a> page. To view detailed information on reserved license assets, go to <a href=\"/doc/423/26.1/samanalysis\">Analysis</a> &gt; <strong>Consumption</strong> tab &gt; <b>Allocated Licenses </b>field.</p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}