{
  "title": "Products",
  "content": "<div class=\"mw-parser-output\">\n<p>With the Products page, you can manage two types of products in SAM: on-premises products and SaaS products.</p>\n<p>The main difference between these product types lies in how SAM collects the required data for license compliance calculation:</p>\n<ul>\n<li>For SaaS products, SAM collects required data through integrations.</li>\n<li>For on-premises products, SAM can manage two categories of products: products discovered from your IT infrastructure by UCMDB and synced to SAM for management (called \"discovered products\"), and products that are manually created and whose compliance calculation is done based on data retrieved through integrations (called \"integrated products\").</li>\n</ul>\n<p>Click the tabs at the top of the page to switch between the product types.</p>\n<h2 class=\"mw-headline\" id=\"On-premises_products\">On-premises products</h2>\n<h3>Product details</h3>\n<p>The following describes the fields on the Details page of a product.</p>\n<h4>General tab</h4>\n<p><strong>Details</strong></p>\n<p>This section provides detailed information about the selected product.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>These fields only apply to discovered products: <strong>Auto-built compatibility matrix</strong>, <strong>Production environment</strong>, <strong>Number of instances</strong>, <strong>Last synced at</strong>.</div></div></div>\n<ul>\n<li><strong>Name</strong>: The name of the product.</li>\n<li><strong>Code</strong>: The unique string that indicates a product.</li>\n<li><strong>Publisher</strong>: The publisher of the product.</li>\n<li><strong>Commercial model</strong>: Specifies whether a product is commercial, freeware, or has an unknown license type. For details, see the <em>About updating the commercial model</em> section below.</li>\n<li><strong>Managed product</strong>: Indicates whether the product exists in the production environment or is a managed product. For out-of-the-box products, this option will be automatically selected when the product is detected. Additionally, all commercial products are considered managed by default. Even if you manually deselect this field, it will be automatically re-selected during the next product family synchronization. Note that only the managed products are displayed in the <strong>SAM Home</strong> and <strong>Compliance Dashboard</strong>.</li>\n<li><strong>Auto-built compatibility matrix</strong>: Indicates whether the newly discovered product versions are automatically linked to the existing compatibility matrix.</li>\n<li><strong>Production environment</strong>: Indicates whether the product exists in your production environment.</li>\n<li><strong>Number of instances</strong>: The number of product instances installed in your environment.</li>\n<li><strong>Last synced at</strong>: The time when the product family is synchronized from UCMDB.</li>\n</ul>\n<p><strong>Product version list</strong></p>\n<p>This section lists all product versions. Currently, only the <strong>Release date</strong> and <strong>Commercial model</strong> fields are editable.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>These fields only apply to discovered products: <strong>Production environment</strong>, <strong>Number of instances</strong>.</div></div></div>\n<ul>\n<li><strong>Name</strong>: The name of the product version.</li>\n<li><strong>Version</strong>: The product version.</li>\n<li><strong>Edition</strong>: The product edition.</li>\n<li><strong>Commercial model</strong>: Specifies whether a product version is commercial, freeware, or has an unknown license type. For details, see the <em>About updating the commercial model</em> section below.</li>\n<li><strong>Release date</strong>: The release date of the product version.</li>\n<li><strong>Production environment</strong>: indicates whether the product is available in the UCMDB environment. The product might not be available in the environment for the following reasons:\n\t<ul>\n<li>The product version is OOTB content, but doesn't exist in the UCMDB system.</li>\n<li>The product version existed before, but has disappeared.</li>\n</ul>\n</li>\n<li><strong>Number of instances</strong>: The number of product version instances installed in your environment.</li>\n</ul>\n<p>You can delete product versions. This will delete relevant data (including product version compliance data) and remove the version from the license compatibility matrix. Review the license compatibility matrix after deleting a product version, and if necessary, make adjustment accordingly.</p>\n<p><strong>Imported product list</strong></p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>This section is empty for integrated products.</div></div></div>\n<p>This section lists the products that are imported from UCMDB and further normalized by SAM. See <a href=\"/doc/423/26.1/samconfigurations\" title=\"Configurations\">Configurations</a>.</p>\n<ul>\n<li><strong>Publisher</strong>: The publisher of the imported product version.</li>\n<li><strong>Product</strong>: The name of the imported product.</li>\n<li><strong>Version</strong>: The imported product version.</li>\n<li><strong>Version number</strong>: The imported product version number.</li>\n<li><strong>End of support date</strong>: The date when the publisher stops the technical support.</li>\n<li><strong>Extended end of support date</strong>: The date when the publisher stops the extended technical support.</li>\n<li><strong>Production environment</strong>: Indicates whether the imported product version exists in your production environment.</li>\n<li><strong>Number of instances</strong>: The number of imported product version instances installed in your environment.</li>\n<li><strong>Commercial model</strong>: Specifies whether a product version is commercial, freeware, or has an unknown license type.</li>\n</ul>\n<h4>Compliance calculation settings tab</h4>\n<p>This tab lets you choose and configure your compliance calculation mechanism: <strong>License rules</strong> or <strong>Integrations</strong>.</p>\n<p>If you select <strong>License rules</strong>, configure the following settings:</p>\n<ul>\n<li><strong>Default license rule across versions: </strong>Select a product-level license rule. SAM uses the default rule for compliance calculation if you don't specify one for a non-freeware product version.</li>\n<li><strong>License rules for product version</strong>: This section lists the license rules for the product's different versions. No license rule configuration is required for freeware product versions. However, if you choose to configure a license rule, SAM will use the specified rule for compliance calculation. Click any product version to change the settings.<br/>\n<strong>Note</strong>: When you configure license rules, if the <strong>Person</strong> calculation unit is configured for a product version, you can only select the same calculation unit for the other product versions. Otherwise, an error message appears. To change the calculation unit configurations, go to the <a href=\"/doc/423/26.1/samlicensemetrics\" title=\"License Metrics\">License Metrics</a> page.</li>\n<li><strong>Support cluster scenarios</strong>: Select this checkbox for products that support application-level clusters. See <a href=\"/doc/423/26.1/samsoftwaretitles\" title=\"Supported software titles\">Supported software titles</a> for the products that support this. Select <strong>Virtual machine live migration</strong> as needed. See the vendor licensing guide.</li>\n<li><strong>Organization compliance scope</strong>: By default, <strong>Global scope</strong> is selected, and SAM performs the compliance calculations globally. If you have maintained <a href=\"/doc/423/26.1/samconfigurations#Organization_compliance_scopes\" title=\"Organization compliance scopes\">Organization compliance scopes</a>, you may select the following options:\n\t<ul>\n<li><b>Global scope and organization scope</b>: SAM performs the compliance calculations for both global scope and organization scopes.</li>\n<li><b>Organization scope</b>: SAM performs the compliance calculations for organization scopes only.</li>\n</ul>\n</li>\n<li><strong>Product compliance scope</strong>: This setting allows you to <a href=\"/doc/423/26.1/bpforproductscope\" title=\"Create compliance reports based on product compliance scopes\">create compliance reports based on product compliance scopes</a>. SAM calculates product compliance based on the <strong>Organization compliance scope</strong> field if you've configured it above.</li>\n<li><strong>Properties: </strong>This section displays the properties of some products that may influence the workflow of license compliance calculation. For details, refer to the descriptions.</li>\n</ul>\n<p>For more information, see the <em>Configure license rules for a product</em> section below.</p>\n<p>If you select <strong>Integrations</strong>, select the integration and scenario for importing license consumption data in the corresponding fields. See <a href=\"/doc/423/26.1/integratesamithonpremprod\" title=\"Set up integration with on-premises products for license compliance calculation\">Set up integration with on-premises products for license compliance calculation</a>.</p>\n<h4>Deployment tab</h4>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>This tab only applies to discovered products.</div></div></div>\n<p>Lists the software deployment information retrieved from UCMDB in real-time.</p>\n<p>In the column picker, you can select attributes from the UCMDB <strong>Node</strong> and <strong>Running Software</strong>/<strong>Installed Software</strong> CI types.</p>\n<p>Note that if you export data by using one of the export actions, the system directly retrieves data from UCMDB and the export process might take some time if you export a large amount of data.</p>\n<h4>Exempted devices tab</h4>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>This tab only applies to discovered products.</div></div></div>\n<p>The exempted devices will be excluded from licensing, on which the installations will not consume licenses. However, you can view the consumption details in <strong>Analysis</strong>.</p>\n<ul>\n<li><strong>Name</strong>: Name attribute value of the device.</li>\n<li><strong>DiscoveredModel</strong>: The discovered model of the device.</li>\n<li><strong>DiscoveredOsName</strong>: The discovered OS name of the device.</li>\n<li><strong>Node Is Virtual</strong>: The device is virtual rather than physical.</li>\n</ul>\n<p>See the <em>Exempt devices from license consumption calculation</em> section below.</p>\n<h4>License compatibility matrix tab</h4>\n<p>You can add upgrade or downgrade relationships for required products through license downgrade or upgrade. See the <em>Maintain license compatibility matrix</em> section below.</p>\n<h4>License tab</h4>\n<p>Lists the licenses used by the product. To view this information, make sure you have configured the <b>License metric</b> and <b>Product version</b> fields on the <b>License Models</b> page. For details, see <a href=\"/doc/423/26.1/sameditlicensemodel\" title=\"Edit a license model\">Edit a license model</a>.</p>\n<p>SAM only shows licenses in the <b>Prepare</b>, <b>Pool</b>, or <b>Receive</b> phases in Service Management.</p>\n<ul>\n<li><strong>Id</strong>: The identifier of the license.</li>\n<li><strong>Display label</strong>: External (common) name of the software.</li>\n<li><strong>License model.License metric</strong>: The license metric of the license.</li>\n<li><strong>Total entitlements:</strong> Total number of rights to use your software derives from the license agreement.</li>\n<li><strong>Quantity</strong>: The number of related licenses.</li>\n<li><strong>Support upgrades when available</strong>: When the option is checked, the license will be auto-upgraded to a new version available during the effective service period of the maintenance contract</li>\n<li><strong>Default maintenance contract</strong>: The name of the default maintenance contract for the license.</li>\n<li><strong>Default maintenance contract.Effective from</strong>: The date when the default maintenance contract of the license comes into effect.</li>\n<li><strong>Default maintenance contract.Expires on: </strong>The date when the default maintenance contract of the license expires.</li>\n</ul>\n<h4>Report history tab</h4>\n<p>Logs the compliance reports archived.</p>\n<ul>\n<li><strong>Report time</strong>: The time when SAM generates the report.</li>\n<li><strong>Compliant</strong>: The compliance status of the product.</li>\n<li><strong>Name</strong>: The report name. You can click the link to view the report in PDF format.</li>\n</ul>\n<h3>Add/delete a product</h3>\n<p>To add a new product, follow the steps below:</p>\n<ol>\n<li>Click the <strong>New </strong>button.</li>\n<li>A dialogue box will appear, asking you to set values for the following fields:\n\t<ul>\n<li><strong>Publisher</strong>: If the publisher name already exists in the system, you can directly select it from the drop-down menu. If the publisher name doesn't exist, you need to <a href=\"/doc/423/26.1/createvendor\" title=\"create vendor\">create a company record</a> in Service Management.</li>\n<li><strong>Product</strong>: Enter a unique product name.</li>\n<li><strong>Commercial model</strong>: Specify whether the product is <strong>Commercial</strong>, <strong>Freeware</strong>, or <strong>Unknown</strong>. The default value is <strong>Commercial</strong>.</li>\n<li><strong>Managed product</strong>: Specify whether you want to manage this product. By default, this option is selected.</li>\n</ul>\n</li>\n<li>Click <strong>Save</strong>.</li>\n</ol>\n<p>To remove a product, perform the following steps:</p>\n<ol>\n<li>Go to the product list and select the record you want to delete.</li>\n<li>Click the <strong>Delete </strong>button.</li>\n<li>After confirming your decision to delete the product, click the<strong> OK</strong> button and the system will now remove the selected product and all its related data.</li>\n</ol>\n<h3>Synchronize the product family</h3>\n<p>To synchronize the product family, follow these steps:</p>\n<ol>\n<li>\n<p>Run the required discovery job.<br/>\n\tTo discover versions of installed software in UCMDB, run the <b>Inventory Discovery by Scanner</b> job. Otherwise, you may find that all versions of installed software appear as <b>&lt;Unknown&gt;</b> in the product list. For more information about this job, see the <a href=\"/doc/407/25.4/inventoryscanner\" title=\"Universal Discovery Content Pack:24.2/InventoryScanner\">Inventory by Scanner Discovery</a> section in the Universal Discovery Content Pack online documentation.</p>\n<p>For more information on Oracle LMS products, see <a href=\"/doc/423/26.1/bpfororaclelms\" title=\"SMAX:Main/BPforOracleLMS\">Create compliance reports for Oracle LMS-managed products</a>.</p>\n</li>\n<li>Go to the <b>On-premises</b> tab in SAM, click <b>Sync product from UCMDB</b> to manually synchronize a list of installed software titles based on the installed software CIs in UCMDB.</li>\n<li>Click the notification icon in the upper-right corner to view the message.</li>\n<li>\n<p>Click <b>Refresh </b>to view the imported products.</p>\n<p>The product family synchronization process runs at the back end. The time needed to complete this process depends on the number of machines in the UCMDB system. When the synchronization is complete, you will receive a notification message. By default, SAM synchronizes the product family at midnight every day. For more information about the configuration item types (CITs) and attributes synchronized from UCMDB, see <a href=\"/doc/423/26.1/sambestpracticesmax#CITs_and_attributes\" title=\"CITs and attributes\">CITs and attributes</a>.</p>\n</li>\n</ol>\n<h4>About updating the commercial model</h4>\n<p>Synchronizing the product family allows SAM to retrieve the commercial model information for the product versions. Based on this information, SAM will then generate the product's commercial model. Later, you may change this information for specific products or product versions.</p>\n<p>If there's a discrepancy between the commercial model information of a product version retrieved from UD/UCMDB and the one in SAM, SAM prioritizes in the <strong>Commercial</strong> &gt; <strong>Freeware </strong>&gt; <b>Unknown</b> order during the synchronization. Specifically:</p>\n<ul>\n<li>If the commercial model of a product version is Commercial on either UD/UCMDB or SAM, SAM will set it as Commercial.</li>\n<li>If the commercial model on one end is Freeware and the other is Unknown, SAM will set it as Freeware.</li>\n</ul>\n<p>When generating a product's overall commercial model information, SAM uses this logic:</p>\n<ul>\n<li><strong>Unknown</strong>: If all product versions are marked as Unknown, or some are Unknown and others are Freeware.</li>\n<li><strong>Commercial</strong>: If at least one product version is marked as Commercial.</li>\n<li><strong>Freeware</strong>: If all product versions are marked as Freeware.</li>\n</ul>\n<h4>About updating the Managed product setting for commercial products</h4>\n<p>All commercial products are automatically classified as managed products. Even if you manually deselect this field, it will be automatically re-selected during the next product family synchronization.</p>\n<h3>Synchronize the infrastructure information</h3>\n<p>To synchronize the infrastructure information, follow these steps:</p>\n<ol>\n<li>Go to the <b>On-premises</b> tab in SAM, click <b>Sync </b><strong>infrastructure </strong><b>from UCMDB </b> to manually synchronize the following information in UCMDB.<br/>\n\tIBM virtualization technology:<br/>\n\t  - IBM Processor Pool<br/>\n\t  - IBM LPar Profile</li>\n<li>Click the notification icon in the upper-right corner to view the message.</li>\n<li>\n<p>The infrastructure synchronization process runs at the back end. The time needed to complete this process depends on the number of machines in the UCMDB system. When the synchronization is complete, you will receive a notification message.</p>\n<p>By default, SAM synchronizes the infrastructure information at midnight every day.</p>\n<p>For more information about the configuration item types (CITs) and attributes synchronized from UCMDB, see <a href=\"/doc/423/26.1/sambestpracticesmax#CITs_and_attributes\" title=\"CITs and attributes\">CITs and attributes</a>.</p>\n</li>\n</ol>\n<h3 id=\"Link_a_license_rule_to_a_product_version\">Configure license rules for a product (discovered products only)</h3>\n<p>Before a compliance calculation, you need to configure a license rule for the product. The configuration can either be made at the product level or the product version level. If you configure both a default license rule at the product level and license rules at the product version level, SAM gives priority to the license rules configured separately for the specific product version when calculating license compliance. </p>\n<p>For products whose license rules are the same across product versions, you can simply configure a license rule at the product level. In this way, you don't need to link license rules for each product version.</p>\n<p>To configure a default license rule for the product, follow these steps: </p>\n<ol>\n<li>On the <b>On-premises</b> tab, click a product name.\n\n\t<p>This takes you to the <b>General</b> tab where you can view the product details and a product version list.</p>\n</li>\n<li>\n<p>In the navigation pane on the left, click <b>Compliance calculation settings</b>.</p>\n</li>\n<li>Select a license rule in the <strong>Default license rule across versions</strong> field.</li>\n<li>Click <strong>Save </strong>to update the settings.</li>\n</ol>\n<p>For products that have multiple license rules, you might need to link different license rules to different product versions. No license rule configuration is required for freeware product versions. However, if you choose to configure a license rule, SAM will use the specified rule for compliance calculation. The license rules must meet any of the following criteria:</p>\n<ul>\n<li>The product version exists in the UCMDB system.</li>\n<li>The product version is the latest version of the product.</li>\n</ul>\n<p>To configure license rules for a product version, follow these steps:</p>\n<ol>\n<li>Go to the <b>Compliance calculation settings </b>tab.</li>\n<li>In the <b>License rules for product versions</b> section, click any product version.</li>\n<li>In the dialog box that appears, view the default rule that you have configured and the other license rules available.<br/>\n\tLicense rules that meet either of the following requirements are available:\n\t<ul>\n<li>The publisher of the license rule is \"Generic.\"</li>\n<li>The publisher of the license rule is the same as the publisher of the selected product. </li>\n</ul>\n</li>\n<li>\n<p>Select one or more license rules as needed, and then click <strong>OK</strong>.</p>\n<ul>\n<li><b>One license rule:</b><br/>\n\t\tBy default, you only need to set one license rule. If you configure one rule, this rule becomes the default license rule for the product. The license compliance status of the product that you see on the <a href=\"/doc/423/26.1/samcompliance\" title=\"Compliance\">Compliance</a> page comes from the calculation result based on the default rule.</li>\n<li><b>Multiple license rules:</b><br/>\n\t\tSome products have special versions that can be entitled by using different license metrics. For example, you can entitle the SQL Server 2012 Enterprise edition with a core-based license or server/CAL license. For such versions, you can apply multiple license rules. For user-based license rules, all rules you apply must be user-based license rules. SAM calculates license consumption for each selected rule, and allocates licenses from the license pool based on the license metrics.<br/>\n\t\tNote that you can't assign multiple rules with the same metric to one product version. If you find a new product or product version in your environment, check if it's possible to reuse an existing rule. For details on this, see the publisher's licensing guide. If you apply an existing license rule to a new product, make sure you save the changes.<br/>\n\t\tSelect one license rule from the <strong>Preferred license rule</strong><b> </b>drop-down list as your desired default rule for the unlicensed devices.</li>\n</ul>\n</li>\n<li>Click <strong>Save </strong>to update the settings.</li>\n</ol>\n<p>You also need to configure the <strong>Properties</strong> for some products that may influence the workflow of license compliance calculation in some way. For details, refer to the property descriptions.</p>\n<h3 class=\"mw-headline\">Exempt devices from license consumption calculation (discovered products only)</h3>\n<p>This feature allows you to exempt devices from license counts. The exempted devices will be excluded from licensing, on which the installations will not consume licenses. However, you can view the consumption details in <strong>Analysis</strong>.</p>\n<h4>View the exempted devices</h4>\n<p>To view the details of exempted devices, you can follow the steps:</p>\n<ol>\n<li>On the <b>On-premises</b> tab, click a product name.</li>\n<li>In the navigation pane on the left, click <b>Exempted devices</b>. The <strong>Exempted device list </strong>displays the devices being excluded from license counts. \n\t<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div><br/>\n\tThe newly customized UCMDB fields of Node CI will not be automatically displayed in the filter of the <strong>Exempted device list</strong> of product details. You need to navigate to the <strong>Configurations &gt;</strong> <strong>Queries </strong>to choose the <strong>Node</strong> record type and check if the custom fields are introduced into the <strong>Attributes</strong> list. However, you don't need to choose the custom fields in query customization. </div></div></div>\n</li>\n</ol>\n<h4>Add/remove an exempted device</h4>\n<p>To add an exempted device for a product:</p>\n<ol>\n<li> Click  <a class=\"image\" href=\"\"> <img align=\"bottom\" alt=\"exempted device\" border=\"0\" file=\"/mediawiki/images/e/e0/exempted_device.png\" hspace=\"0\" src=\"../../../images/exempted_device_a5463163.png\" style=\"width: 13px; height: 14px; margin: 0px; vertical-align: bottom; border: 0px solid black;\" vspace=\"0\"/> </a> .</li>\n<li>In the pop-up window, select the devices you want to exclude from license calculation. To quickly locate the wanted devices, you can use the filter  <a class=\"image\" href=\"\"> <img align=\"bottom\" alt=\"filter9\" border=\"0\" file=\"/mediawiki/images/8/82/filter9.png\" hspace=\"0\" src=\"../../../images/filter9_f0869057.png\" style=\"width: 10px; height: 13px; margin: 0px; vertical-align: bottom; border: 0px solid black;\" vspace=\"0\"/> </a>  or the search box.<br/>\n\tNote that in most cases only when the devices are deployed, you can exempt them.</li>\n<li>To view the deployment information, go to the <strong>Deployment</strong> tab.</li>\n</ol>\n<p>To remove the devices from the exempted list, click the <strong>Remove</strong> button after you check the devices.</p>\n<p>After you finish the settings, click <strong>Save</strong>.</p>\n<h4>Check the license consumption status of the exempted devices</h4>\n<p>After configuring the exempted devices, you can trigger the license calculation by clicking <b> <a class=\"image\" href=\"\"> <img alt=\"calculate\" border=\"0\" file=\"/mediawiki/images/b/be/SAM2020.08_Calculate.PNG\" hspace=\"0\" src=\"../../../images/SAM2020.08_Calculate_ad66663d.png\" style=\"width:84px;height:27px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a> </b>. For detailed steps, see the <em>Calculate license consumption </em>section.</p>\n<p>On the product compliance page, the exempted devices will be displayed, but will be excluded from license counts. </p>\n<p>In addition, the <strong>description</strong> field will specify the exemption scenarios of the nodes in license consumption calculation:</p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Exemption scenario</th>\n<th scope=\"col\">Description</th>\n</tr>\n<tr>\n<td>Exempt the current node</td>\n<td>The current node is exempted from license counts.</td>\n</tr>\n<tr>\n<td>Exempt the nodes of the current host</td>\n<td>Nodes of the current host are exempted from license counts.</td>\n</tr>\n<tr>\n<td>Exempt the nodes of the current user</td>\n<td>Nodes of the current user are exempted from license counts.</td>\n</tr>\n<tr>\n<td>Exempt some nodes of a N/A user</td>\n<td>\n<p>Some nodes are exempted from license counts.</p>\n</td>\n</tr>\n</thead>\n</table>\n<h3>Maintain license compatibility matrix</h3>\n<p>The compatibility matrix refers to information defined by software vendors for specifying the product version downgrade capability among different versions and editions. You can also define the upgrade path for supporting available license upgrades under the maintenance contract and purchasing new licenses when they’re in shortage to cover the software installations. The compatibility matrix will be used during license consumption calculation.</p>\n<ol>\n<li>On the product details page, click <strong>License compatibility matrix</strong>. This by default displays the Downgrade tab with existing downgrade relationships between product versions and editions on the right.</li>\n<li>(Optional) For an overall view, press <strong>CTRL+A</strong> and drag the selected items to the desired place.</li>\n<li>(Optional) To zoom in and out, use the mouse wheel or the plus (+) and minus (-) signs in the lower-right corner of the canvas.</li>\n<li>Build the downgrade and upgrade paths as required. Note that freeware product versions have a separate upgrade or downgrade path. They can't be included in the same upgrade or downgrade path as commercial or unknown product versions.</li>\n</ol>\n<h4>Downgrade</h4>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>Downgrade doesn't apply to integrated products.</div></div></div>\n<h5>Add a downgrade relationship</h5>\n<ol>\n<li>Hover over a product, press and hold down the left mouse button, and then draw a line between the two versions or editions as needed.<br/>\n\tBy default, the compatibility type is <strong>Version downgrade</strong>. This option entitles you to install and run an earlier version of the product with the license of a higher product version.<br/>\n\tBelow are some tips for creating a downgrade relationship:\n\t<ul>\n<li>For version downgrade, it's recommended to establish a downgrade relationship between two adjacent versions.</li>\n<li>For edition downgrade, it's a best practice to stay within the same product version.</li>\n<li>You won't be able to draw a line between two products if a downgrade relationship already exists.<br/>\n<a class=\"image\" href=\"\"> <img alt=\"downgrade relation\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/6/64/downgrade_relationship.png\" hspace=\"0\" src=\"../../../images/downgrade_relationship_4ee75ed0.png\" style=\"height: 246px;\"/> </a><br/>\n\t\t </li>\n</ul>\n</li>\n<li>Decide the compatibility type:\n\t<ul>\n<li>If version downgrade is your desired compatibility type, go to the next step.</li>\n<li>If edition downgrade is your desired compatibility type, click the <strong>Version downgrade</strong> box, select <strong>Edit compatibility type</strong>, select <strong>Edition downgrade</strong>, and then click <strong>APPLY</strong>.<br/>\n\t\tIf you choose this option, the selected product edition will use the license of a higher edition, which is normally more expensive than the lower edition license.</li>\n</ul>\n</li>\n<li>Make sure the downgrade relationships of products don't create a closed cycle because you can't go back to a higher version after downgrading. </li>\n<li>Click <strong>Save</strong> in the upper-left corner.<br/>\n\tAfter you have made changes on the tab, an asterisk (*) appears next to the <strong>License compatibility matrix</strong> tab. If you leave this page without saving it, a dialog box appears asking you whether you want to save the changes.</li>\n</ol>\n<h5>Cancel a downgrade relationship</h5>\n<p>Right-click or press <strong>Esc</strong> to remove the unwanted downgrade relationship between two products.</p>\n<h5>Delete a downgrade relationship</h5>\n<ol>\n<li>Click the <strong>Version downgrade</strong> or <strong>Edition downgrade</strong> box.</li>\n<li>Select <strong>Delete relationship</strong>.</li>\n<li>Save the setting.</li>\n</ol>\n<h4>Upgrade</h4>\n<p>The upgrade relationship plays a role in upgrading to the highest-version licenses available as per maintenance contract and purchasing new licenses when the license stock is insufficient. </p>\n<ul>\n<li>The upgrade relationship includes both version and edition upgrades.\n\t<ul>\n<li>For version upgrade, the upgrade relationship helps you upgrade to the highest-version licenses when their release dates are covered by the effective period of your maintenance contract.<br/>\n\t\tWithout the upgrade relationship, when you have upgraded from lower-version licenses to higher ones, SAM can only calculate license shortage based on the lower-version licenses. However, after adding an upgrade relationship between higher-version and lower-version licenses, you can recalculate the number of licenses of the same edition you need to purchase for entitling the higher-version licenses.</li>\n<li>For edition upgrade, you can create the upgrade relationship between editions through purchasing upgrade licenses. </li>\n</ul>\n</li>\n</ul>\n<p>Currently, SAM doesn't support manually adding a product version to the product version list. The highest product version on the upgrade path is the highest version available in either your production environment or SAM's OOTB content.</p>\n<h5>Add an upgrade relationship</h5>\n<ol>\n<li>Hover over a product, press and hold down the left mouse button, and then draw a line between the two products as needed.<br/>\n\tBelow are some tips for creating an upgrade relationship:\n\t<ul>\n<li>For version upgrade, it's recommended to establish a upgrade relationship between two adjacent versions.</li>\n<li>For edition upgrade, it's a best practice to stay within the same product version.</li>\n<li>You won't be able to draw a line between two products if an upgrade relationship already exists.</li>\n</ul>\n</li>\n<li>Make sure the upgrade relationships of products don't create a closed cycle because you can't go back to an earlier version after upgrading. For each source version, you can only configure one version as the target version.</li>\n<li>Click <strong>Save</strong> in the upper-left corner.<br/>\n\tAfter you have made changes on the tab, an asterisk (*) appears next to the <strong>License compatibility matrix</strong> tab. If you leave this page without saving it, a dialog box appears asking you whether you want to save the changes.</li>\n</ol>\n<h5>Cancel an upgrade relationship</h5>\n<p>Right-click or press <strong>Esc</strong> to remove the unwanted upgrade relationship between two products.</p>\n<h5>Delete an upgrade relationship</h5>\n<ol>\n<li>Click the <strong>Version upgrade</strong> box or <strong>Edition upgrade</strong> box.</li>\n<li>Select <strong>Delete relationship</strong>.</li>\n<li>Save the setting.</li>\n</ol>\n<h4 class=\"mw-headline\">Automatically build the compatibility matrix</h4>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>This capability applies to discovered products only.</div></div></div>\n<p>SAM offers you the capability to have the product versions that are newly discovered upon a synchronization automatically linked to the current upgrade and downgrade matrix.</p>\n<p>You can navigate to <strong>Products </strong>&gt; <strong>On-premises</strong> &gt; <strong>General </strong>&gt; <strong>Details </strong>to view the setting. By default, this option is enabled.</p>\n<p>The following shows how this functionality works:</p>\n<ul>\n<li>This option only adds newly discovered product versions to the existing downgrade or upgrade matrix. It doesn't change the relationships of the current product versions.</li>\n<li>This option doesn't consider a downgrade or upgrade between different editions. For example, SAM keeps Pro and Standard editions separated in different paths.</li>\n<li>SAM will automatically build a separate compatibility matrix for freeware product versions. </li>\n<li>A newly discovered product version can only be linked to the top or bottom of the downgrade or upgrade path to which SAM assumes the closest.</li>\n<li>Currently, SAM only processes product versions composed of a dot (.) or space. For example, 7.5, 2019, 2020 Enterprise.<br/>\n\tIf a version number contains multiple parts, SAM will compare each part of them and then add it to the current matrix. If the version number only contains digits, SAM compares the digit number. If it isn't a digit, SAM considers it as a string for comparison. For example, SAM considers 8.0 a higher version than 7.6, 7.6 a higher version than 7.5, and 2021 Enterprise a higher version than 2020 Enterprise.</li>\n</ul>\n<p>If you want to manually maintain the downgrade and upgrade matrix for newly discovered product versions, you can disable this option by deselecting the <strong>Auto-built compatibility matrix</strong> checkbox.</p>\n<h3>Calculate license consumption</h3>\n<p>To calculate license consumption, follow these steps:</p>\n<ol>\n<li>Select a required product, and then click <b> <a class=\"image\" href=\"\"> <img alt=\"calculation\" border=\"0\" file=\"/mediawiki/images/b/be/SAM2020.08_Calculate.PNG\" hspace=\"0\" src=\"../../../images/SAM2020.08_Calculate_ad66663d.png\" style=\"width:84px;height:27px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a> </b>.</li>\n<li>\n<p>Go to the <b>Compliance</b> page and view the product compliance status.</p>\n<p>The calculation process runs in the background. You will receive a notification message to indicate the status of the calculation (success or failure).</p>\n</li>\n<li>\n<p>Click the notification icon in the upper-right corner of the SAM portal to view the message.</p>\n</li>\n</ol>\n<h3>Define a scheduler</h3>\n<p>Besides manually starting a job to calculate compliance, you can also define a scheduler for the product to run a calculation task periodically. The schedulers that you define are serial tasks in which no job starts until the running job has ended. Currently, up to 300 jobs can stay in a queue waiting to be processed. We recommend that you limit the queue size and arrange the calculation tasks in different time windows, separated by a relatively long interval of time (such as an hour). </p>\n<p>To create a scheduler, follow these steps:</p>\n<ol>\n<li>Click <b>Scheduler  <a class=\"image\" href=\"\"> <img alt=\"schedule\" border=\"0\" file=\"/mediawiki/images/f/f3/SAM2020.08_Schedule.PNG\" hspace=\"0\" src=\"../../../images/SAM2020.08_Schedule_8b4a59fd.png\" style=\"width:88px;height:26px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a> </b>.</li>\n<li>In the <b>Scheduler</b> dialog box that appears, set the following fields as needed:\n\t<table>\n<thead>\n<tr>\n<th scope=\"col\">Parameter</th>\n<th scope=\"col\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Run once</td>\n<td>Selecting this option indicates that you want to run the task only once.</td>\n</tr>\n<tr>\n<td>Start time</td>\n<td>Time when the scheduler starts to run. This field is required after you select <b>Run once</b>. </td>\n</tr>\n<tr>\n<td>End time</td>\n<td>Time when the scheduler stops to run. This field is optional. If you want to set an end time, note that it must be later than the start time and the current time.</td>\n</tr>\n<tr>\n<td>Cron expression</td>\n<td>Use this field to configure a periodic schedule. Examples:\n\t\t\t\t<ul>\n<li>To schedule a task every day at 22:00, set the field to <b>0 0 22 * * ?</b>.</li>\n<li>To schedule a task at noon on the first day of every month, set the field to <b>0 0 12 1 * ?</b>.</li>\n</ul>\n<p>For more information about <b>cron</b> expressions, see <a href=\"http://www.quartz-scheduler.org/documentation/quartz-2.3.0/tutorials/crontrigger.html\" title=\"cron trigger\">Cron Trigger Tutorial</a>.</p>\n<p>If you also set the <b>Start time</b> and <b>End time</b> fields, make sure you schedule a task within the start/end time range.</p>\n</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>Validate and save the settings.</li>\n</ol>\n<div>You can also bulk update scheduler for multiple products. To do this:</div>\n<ol>\n<li>Go to <strong>Products</strong> from the SAM Home page.</li>\n<li>Select multiple products from the list.</li>\n<li>Click <strong>More</strong> &gt; <strong>Scheduler</strong>. You can now set the required fields in the <b>Scheduler</b> dialog box.</li>\n</ol>\n<h3>Import product related data</h3>\n<ol>\n<li>On the toolbar, click <a class=\"image\" href=\"\"> <img alt=\"more 2\" border=\"0\" file=\"/mediawiki/images/8/87/SAM_More2.PNG\" hspace=\"0\" src=\"../../../images/SAM_More2_f9adc424.png\" style=\"width:84px;height:28px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a> , and then select <a class=\"image\" href=\"\"> <img alt=\"import product\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/0/09/import_product_data.png\" hspace=\"0\" src=\"../../../images/import_product_data_482673e5.png\" style=\"width:261px;height:25px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a>  from the drop-down list box.</li>\n<li>Select a GPG file you want to upload, and then click <strong>Open</strong>.<br/>\n\tIf you aren't uploading a GPG file or the file size exceeds 20 MB, the import task will fail.</li>\n<li>In the <strong>Import</strong> dialog box that appears, wait until the <strong>Status</strong> field changes from <strong>Running</strong> to <strong>Complete</strong>.</li>\n<li>Click<b> <a class=\"image\" href=\"\"> <img alt=\"SAM Refresh\" border=\"0\" file=\"/mediawiki/images/6/6e/SAM_Refresh.PNG\" hspace=\"0\" src=\"../../../images/SAM_Refresh_d8caca4e.png\" style=\"width:99px;height:32px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a> .</b><br/>\n\tYou will find that the product data you imported are displaying in the product list.\n\t<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<ul>\n<li>An import action won't delete data from the original product list.</li>\n<li>Because the <strong>Production environment</strong> field depends only on whether the product exists in your production environment, importing product data won't overwrite the original value of this field.</li>\n</ul>\n</div></div></div>\n</li>\n</ol>\n<h3>Export product related data</h3>\n<ol>\n<li>Select the products you want to export. Make sure that you select no more than 1,000 records.</li>\n<li>On the toolbar, click <a class=\"image\" href=\"\"> <img alt=\"sam more\" border=\"0\" file=\"/mediawiki/images/8/87/SAM_More2.PNG\" hspace=\"0\" src=\"../../../images/SAM_More2_f9adc424.png\" style=\"width:84px;height:28px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a> , and then select <a class=\"image\" href=\"\"> <img alt=\"export product related data\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/b/b3/export_product_related_data.png\" hspace=\"0\" src=\"../../../images/export_product_related_data_538b2761.png\" style=\"width:264px;height:26px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a>  from the drop-down list box.</li>\n<li>In the dialog box that appears, check if the selected items are the records you want to export, and then select the dependent data as needed.</li>\n<li>\n<p>Click <a class=\"image\" href=\"\"> <img alt=\"submit\" file=\"/mediawiki/images/b/b4/SAM_Submit.PNG\" src=\"../../../images/SAM_Submit_21c79a86.png\" style=\"width: 20px; height: 7px;\"/> </a> . <br/>\n\tA message appears at the top of the page, indicating that you have created an export task. Also, the <strong>Export </strong>dialog box will show you the export status and details.</p>\n</li>\n<li>Wait until the <strong>Status</strong> field changes from <strong>Running</strong> to <strong>Complete</strong>, and then save the GNU Privacy Guard (GPG) file. You can change the file name if needed.</li>\n</ol>\n<h3>Export license summary to CSV/XLS</h3>\n<ol>\n<li>On the toolbar, click <a class=\"image\" href=\"\"> <img alt=\"sam more 2\" border=\"0\" file=\"/mediawiki/images/8/87/SAM_More2.PNG\" hspace=\"0\" src=\"../../../images/SAM_More2_f9adc424.png\" style=\"width:84px;height:28px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a> , and then select  <a class=\"image\" href=\"\"> <img alt=\"export license summ\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/3/3d/export_licese_summ_CSV.png\" hspace=\"0\" src=\"../../../images/export_licese_summ_CSV_900021bb.png\" style=\"width:293px;height:31px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a> or  <a class=\"image\" href=\"\"> <img alt=\"export license summ xls\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/6/68/export_license_summ_XLS.png\" hspace=\"0\" src=\"../../../images/export_license_summ_XLS_32b49e12.png\" style=\"width:294px;height:31px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a>  from the drop-down list box.</li>\n<li>After you see a message showing the operation is successful, the license summary in a CSV or XLS file is downloaded to your device.</li>\n</ol>\n<h2>SaaS products</h2>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>Microsoft Office 365 is managed using a process different from other SaaS products. See <a href=\"/doc/423/26.1/manageoffice365withsam\" title=\"Manage Office 365 subscription with SAM\">Manage Office 365 subscription with SAM</a>.</div></div></div>\n<h3>Add/delete product</h3>\n<p>The process of adding or deleting a SaaS product is similar to that of an on-premises product. For more information, see the <em>Add/delete product</em> section above.</p>\n<h3>Configure the settings for a SaaS product</h3>\n<p>To be able to select integrations and scenarios in the <strong>Integration tasks</strong> section, you must have a role with the <strong>On-Premise Bridge/Integration Administrator </strong>permission.</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<thead>\n<tr>\n<th scope=\"col\">Section</th>\n<th scope=\"col\">Description</th>\n</tr>\n<tr>\n<td>Integration tasks</td>\n<td>\n<p>Select the <strong>Import licenses</strong>, <strong>Import license consumption</strong>, <strong>Import user entitlement </strong>integration scenarios. Select the integration scenarios that are applicable to the product. For example, if the product has only APIs that support the import licenses scenario, select only that scenario for the <strong>Import licenses</strong> task and leave the fields for other tasks empty.</p>\n<ul>\n<li><strong>Integration</strong>:  Select the <strong>Integration</strong> you configured in the Integration Studio. </li>\n<li><strong>Scenario</strong>: Select the corresponding scenario.</li>\n</ul>\n<p>For details on how to configure the integration scenarios, see <a href=\"/doc/423/26.1/integratesamwithsaasapplications\" title=\"Set up SaaS products for license compliance calculation\">Set up SaaS products for license compliance calculation</a>.<span id=\"cke_bm_3473C\" style=\"display: none;\"> </span></p>\n</td>\n</tr>\n<tr>\n<td>Organization compliance scope</td>\n<td>\n<p>By default, <strong>Global scope</strong> is selected, and SAM performs the compliance calculations globally.</p>\n<p>If you have maintained <a href=\"/doc/423/26.1/samconfigurations#Organization_compliance_scopes\" title=\"Organization compliance scopes\">Organization compliance scopes</a>, you may select the following options:</p>\n<ul>\n<li><b>Global scope and organization scope</b>: SAM performs the compliance calculations for both global scope and organization scopes.</li>\n<li><b>Organization scope</b>: SAM performs the compliance calculations for organization scopes only.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Properties</td>\n<td>\n<ul>\n<li><strong style=\"background-color: transparent;\">Identify inactive licenses by user's last login</strong><span style=\"background-color: transparent;\">: This parameter assesses the usage of your SaaS applications, helping identify instances of low license usage. The default value is set to 30 days, indicating that licenses will be deemed inactive and subject to reclamation if you haven't logged in within this timeframe.</span></li>\n<li><strong>Select the license metric for user subscriptions</strong>:<strong> </strong>SAM uses generic user subscription for SaaS products by default, but you can update it to the publisher-specific user subscription metric as needed.<br/>\n\t\t\t\t </li>\n</ul>\n</td>\n</tr>\n</thead>\n</table>\n<h3>Calculate license consumption</h3>\n<p>The process of calculating license consumption for a SaaS product is similar to that of an on-premises product. For more information, see the <em>Calculate license consumption</em> section above.</p>\n<h3 id=\"Define_a_scheduler\">Define a scheduler</h3>\n<p>The process of defining a scheduler for a SaaS product is similar to that of an on-premises product. For more information, see the <em>Define a scheduler</em> section above.</p>\n<h2>Related topics</h2>\n<p><a href=\"/doc/423/26.1/sambestpracticesmax\" title=\"SAM best practice\">SAM best practice</a></p>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}