{
  "title": "Schedule OO flows",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>This topic contains the instructions to schedule OO flows.</p>\n<h2>Overview</h2>\n<p>OO Scheduler allows you to control when to run your flows. You can specify a schedule to run for a specific flow and also set up recurring schedules for a task.</p>\n<p>For example, to check for the number of servers that are online, define a flow to check the IP address and then create a schedule to run that flow.</p>\n<h2>View Scheduler</h2>\n<p>The Schedules are displayed in a table under the <b>SCHEDULER</b> tab. The display of schedules depends on the permissions assigned for your role. Contact your administrator for help with permissions.</p>\n<ul>\n<li>If you your role has the <b>View Schedules</b> permission granted, then you'll be able to view the OO schedules and their details.</li>\n<li>If you your role has the <b>Manage Schedules</b> permission granted, then you'll be able to view and edit schedules.</li>\n</ul>\n<h2>Scheduler actions</h2>\n<p>The schedules display in a table. Click on the column header in the table to sort the schedules by that column.</p>\n<p>The menu bar has the following actions:</p>\n<p><a class=\"image\" href=\"/file/images/c/c3/OO2022.11_Scheduler.png\" title=\"/file/images/c/c3/OO2022.11_Scheduler.png\"> <img alt=\"\" border=\"0\" file=\"/mediawiki/images/c/c3/OO2022.11_Scheduler.png\" height=\"266\" hspace=\"0\" src=\"../../../images/OO2022.11_Scheduler_183c17b0.png\" style=\"width:556px;height:266px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"556\"/> </a></p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<thead>\n<tr>\n<th scope=\"col\">Action</th>\n<th scope=\"col\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Add</td>\n<td>Click to add a new schedule.</td>\n</tr>\n<tr>\n<td>Edit</td>\n<td>\n<p>Select a schedule to edit.</p>\n</td>\n</tr>\n<tr>\n<td>Delete</td>\n<td>Select one or more schedules to delete.</td>\n</tr>\n<tr>\n<td>Enable</td>\n<td>Select one or more disabled schedules to enable them.</td>\n</tr>\n<tr>\n<td>Disable</td>\n<td>Select one or more schedules to disable them.</td>\n</tr>\n<tr>\n<td>Refresh</td>\n<td>Click to refresh the schedules table.</td>\n</tr>\n<tr>\n<td>Search</td>\n<td>Click to search by keywords.</td>\n</tr>\n<tr>\n<td>Filter</td>\n<td>Click to filter schedules based on State, Next Run, and Previous Run. If no filters are added, click <strong>Add filter</strong> to add a filter.</td>\n</tr>\n<tr>\n<td>Select columns</td>\n<td>\n<p>Click to select columns to display in the table. Select/deselect these columns: State, Schedule Name, Flow Name, Flow Identifier, Next Run, Previous Run, and User.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"Create_a_schedule\">Create a schedule</h2>\n<p>Before you being, make sure you are logged in with a user account that's assigned a role with <b>View schedules</b> and <b>Manage schedules</b> permissions.</p>\n<p>To create a schedule:</p>\n<ol>\n<li>On the <strong>SCHEDULER</strong> tab, click  <a class=\"image\" href=\"/file/images/c/c7/OO_Scheduler_Create.PNG\" title=\"/file/images/c/c7/OO_Scheduler_Create.PNG\"> <img alt=\"\" border=\"1\" file=\"/mediawiki/images/c/c7/OO_Scheduler_Create.PNG\" height=\"25\" hspace=\"0\" src=\"../../../images/OO_Scheduler_Create_7ee2538f.png\" style=\"width:20px;height:25px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:1px solid black;\" vspace=\"0\" width=\"20\"/> </a>  in the menu bar to create a new schedule. A three step wizard to create a schedule appears requiring user inputs.</li>\n<li>In the default <strong>Select flow &amp; settings</strong> step, click <strong>Flow Path </strong>drop-down to view the <strong>Flow Library</strong> tree. Expand the tree node and select the flow, or type the flow name in the search field to filter and click <strong>SELECT</strong>.</li>\n<li>In the <strong>Name</strong> box, you can customize the name of the schedule per your choice. The flow name get added by default, but you can use a different name, for example, if you have multiple schedules using the same flow.</li>\n<li>Select the <b>Use empty value for prompts</b> checkbox, if you want the schedule to skip over prompts for inputs. For any prompt that has no value assigned, it will use blank, and the scheduled flow will run without stopping to prompt for values. However, note that if any of these are required inputs, the flow will fail. If you don't select this checkbox, the run gets stopped and prompts for inputs, even if they're not required inputs.</li>\n<li>Click <strong>NEXT</strong>. Notice the <strong>Select flow &amp; settings</strong> step gets check marked with success.</li>\n<li>On the <strong>Planning</strong> step, create a desired schedule plan, under the <strong>Start Date</strong> section, in the <strong>Select starting date</strong> box, click to open the calendar widget and then select the date and time for your schedule to start. The start time must be minimum 2 minutes later than the current time. The date and time defaults to the local timezone.</li>\n<li>Under the <strong>End date</strong> section, select:<br/>\n<strong>Never</strong>: Your schedule will run for ever.<br/>\n<strong>End after</strong>: Specify the number of occurrences after which the schedule ends. Default is 10 occurrences.<br/>\n<strong>End by</strong>: Click to open the calendar widget and then select the date and time for your schedule to end.</li>\n<li>In the <b>Recurrence pattern</b> section, select from one of the recurrence frequencies for the schedule: <strong>Minutely</strong>, <strong>Hourly</strong>, <b>Daily</b>, <b>Weekly</b>, <b>Monthly</b>, or <b>Yearly</b>.</li>\n<li>To run the flow on a minute basis, select <strong>Minutely</strong> and enter the duration. The value must be at least <b>1</b>. For example, if you entered 5, the schedule will run once every 5 minutes.</li>\n<li>To run the flow on a hourly basis, select <strong>Hourly</strong> and enter the duration. The value must be at least <b>1</b>. For example, if you entered 2, the schedule will run once every 2 hours.</li>\n<li>To run the flow on a daily basis, select <b>Daily</b> and <b>Every day</b> to run the flow once every day of the week. The flow run will start at the time set in the <b>Start time</b> field in the <b>Range of recurrence</b> section. Select <b>Every weekday </b>to run the flow once a day, on weekdays only. If the working week isn't Monday to Friday, use the <b>Weekly</b> option instead, and select the working days.</li>\n<li>To run the flow on a weekly basis, select <b>Weekly</b> and then select the days of the week on which you want the flow to run. If you select <b>Weekly</b>, you must select at least one day.</li>\n<li>To run the flow every month, select <b>Monthly</b> and select <b>Day</b>.</li>\n<li>To run the flow on a particular date in each month, select <b>Day</b> and select the date. For example, select <b>15</b> to run the flow on the fifteenth of every month.</li>\n<li>To run the flow once a month on a particular day of the week, select the day of the week, and whether it's the first, second, third, fourth, or last time that this day occurs in the month. For example, to run the schedule on the third Friday of each month, select <b>third</b>, then select <b>Friday</b>, and then select <b>1</b> month(s).</li>\n<li>To run the flow at intervals of several months, select a number of months. For example, to run a schedule once a quarter, on the first Monday of the quarter, select <b>first</b>, then select <b>Monday</b>, and then select <b>3</b> months.<br/>\n\tFor example, in a schedule starting on April 1, 2022, and ending on December 20, 2022, with a recurrence pattern of the third day of every 2 months, the flow will run on June 3, August 3, October 3, and December 3.</li>\n<li>To run the flow on the last day of the month, select <b>last</b> and then select <b>day</b> instead of a specific day of the week.</li>\n<li>To run the flow once a year, select <b>Yearly</b>.</li>\n<li>To run the flow on a particular date each year, select <b>Every</b> and then select the month and the date. For example, every July 4.</li>\n<li>To run the flow once a year on a particular month and on a particular day of the week, select the month, then select the day of the week, and whether it's the first, second, third, fourth, or last time that this day occurs in the month. For example, the second Monday of each November.</li>\n<li>In the <strong>Exclusion pattern </strong>section,<strong> </strong>you can choose to exclude the flows from running on scheduled calendar owing to reasons such as downtime, maintenance, etc. You can save only one type of exclusion even if you add multiple types of exclusion. As the exclusion type selection is by radio buttons, the last active radio button/exclusion type is saved. You can choose from the following exclusion patterns.</li>\n<li><strong>Date Time</strong>: Choose the date and the time on which you want to exclude the scheduled flow runs. For example, if you choose the <strong>Start time</strong> as <samp>2022/03/28</samp><code><samp> </samp></code><samp>20:00</samp> and <strong>End time </strong>as <samp><code>2022/03/29</code> <code>20:30</code></samp> and the click <strong>Add Exclusion</strong>, the scheduled flow won't run between <code>20:00</code> and <code>20:30</code> on the selected dates <samp><code>2022/03/28</code> </samp>and <code><samp>2022/03/29</samp></code>. It will however continue to run the flow on the originally set scheduled calendar. Use this exclusion for the scenarios such as downtime or maintenance.</li>\n<li><strong>Date</strong>:<b> </b>Select the date on which you don't want to run the scheduled flow. For example, if you select the date <code><samp>2022/03/28</samp></code> and click <strong>Add Exclusion</strong>, the scheduled flow won't run on that selected date. Use this exclusion for the scenarios such as holidays or similar occasions.</li>\n<li><strong>Time</strong>: Select the time on each day on which you don't want to run the scheduled flow. For example, if you select the time between <samp><code>20:00</code> and <code>21:30</code></samp> and then click <strong>Add Exclusion</strong>, the scheduled flow won't run on that selected times every day. Use this exclusion for the schedules set in minutes or hours every day.</li>\n<li>Click <strong>NEXT</strong>. Notice the <strong>Planning</strong> step gets check marked with success.</li>\n<li>On the <strong>Inputs</strong> step, configure the scheduled flow’s inputs or define custom ones.</li>\n<li>Specify the custom values for the existing flow input parameters. You can't delete the input parameters that are part of the flow.</li>\n<li>Add custom input parameters by clicking <strong>+ ADD INPUT</strong>.</li>\n<li>In the <strong>Name</strong> box, you can customize the name of the parameter per your choice.</li>\n<li>In the <strong>Value</strong> box, specify the custom input value. Click the <strong>x</strong> icon that appears when you hover your mouse pointer on the <strong>Name</strong> or <strong>Value</strong> field to delete the custom input parameter.<br/>\n\tIf the value you are entering is sensitive, for example a password, select the check box next to the lock icon to mask the value.<br/>\n\tClick the eye icon to toggle show and hide values.</li>\n<li>Add as many custom input parameters and specify value to them.</li>\n<li>Click <strong>FINISH</strong>. The schedule gets created and added to the schedules table under the <strong>SCHEDULER</strong> tab.</li>\n</ol>\n<h2>Edit a schedule</h2>\n<p>You can edit flow and settings, start date, end date, recurrence pattern, exclusion pattern, and custom values for the existing flow input parameters in a schedule.</p>\n<p>To edit a schedule:</p>\n<ol>\n<li>On the <strong>SCHEDULER</strong> tab, select a schedule from the schedules table and click <strong>Edit</strong> icon in the menu bar. </li>\n<li>In the <strong>Select flow &amp; settings</strong> step, edit <strong>Flow Path</strong> and <strong>Name</strong>. </li>\n<li>In the Planning step, <strong>Start Date</strong> section, edit the start date and time. By default, the start date automatically set to the next day.<br/>\n\tClick to open the calendar widget and then select the date and time for your schedule to start. The start time must be minimum 2 minutes later than the current time. The date and time defaults to the local timezone.</li>\n<li>In the <strong>End date</strong> section, edit the schedule end time.</li>\n<li>In the <strong>Recurrence pattern</strong> section, edit recurrence type and recurrence frequencies for the schedule.</li>\n<li>In the <strong>Exclusion pattern </strong>section, include or exclude the flows from running on scheduled calendar. Do note that warnings can appear on the past exclusions.</li>\n<li>In the <strong>Inputs</strong> step, edit the custom values for the existing flow input parameters.</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}