{
  "title": "Scriptlets",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p><br/>\nAn OO Scriptlet is a JavaScript (Rhino) script used for manipulating flow data.</p>\n<h2 class=\"mw-headline\" id=\"Coding_style\">Coding style</h2>\n<h3 class=\"mw-headline\" id=\"Long_scriptlets\">Long scriptlets</h3>\n<p>If possible, avoid long scriptlets. When trying to save a flow that contains scriptlets exceeding 64kb, an exception will occur. Usually, scriptlets should not contain complex logic. Use scriptlets for parsing strings as well (the following image shows an example).</p>\n<p><a class=\"image\" href=\"/file/images/e/e0/Content_Authoring_BP_33.jpg\" title=\"/file/images/e/e0/Content_Authoring_BP_33.jpg\"> <img alt=\"Content Authoring BP 33.jpg\" decoding=\"async\" height=\"139\" src=\"../../../images/Content_Authoring_BP_33_654fdf60.jpeg\" width=\"693\"/> </a></p>\n<h3 class=\"mw-headline\" id=\"Validate_scriptlets\">Validate scriptlets</h3>\n<p>When saving a flow that has a scriptlet, OO Studio automatically performs a scriptlet validation, checking the script for syntax errors. This validation can also be triggered manually by clicking the “Check Script” button from the Scriptlet tab.</p>\n<h3 class=\"mw-headline\" id=\"JavaScript_best_practices_and_sriptlets\">JavaScript best practices and sriptlets</h3>\n<p>It is recommended that you apply JavaScript best practices to OO scriptlets, as follows:</p>\n<ul>\n<li>In JavaScript, function or variable names must begin with a letter, an underscore (_), or a dollar sign ($). Subsequent characters can be letters, digits, underscores, or dollar signs.<br/>\n<b>Note</b><br/>\n\tIf the inputs of flows or steps are referenced in scriptlets, they should also follow these guidelines.<br/>\n\tExample: If an input name is “input.1”, it can’t be used in a scriptlet because it’s an invalid JavaScript variable name, even though it is a valid name for an OO input.</li>\n<li>Always use “var” when declaring scriptlet variables – Variables in JavaScript can have global or function scope, so prefixing the variable declaration with “var” is especially important in the function scope.</li>\n<li>Always use curly brackets when writing an <i>if/for/while</i> clauses even if the statement’s scope is composed of only one operation.</li>\n<li>Always use semicolons (;) at the end of each statement. Consider the following example that could lead to errors:<br/>\n\tx<br/>\n\t++<br/>\n\ty<br/>\n\tThis example is parsed as x; ++y; not as x++; y.</li>\n<li>Use brackets to ensure that operations are executed in the desired order.<br/>\n\tExamples: var a = null;<br/>\n\tvar b = \"a==null is: \" + a == null; // false<br/>\n<br/>\n\tvar a = null;<br/>\n\tvar b = \"a==null is: \" + (a == null); // a == null is: true</li>\n<li>Use the unary “+ “operator for addition, concatenation and converting a String to Number when used as a prefix. For more complex conversions, like conversions with radix, use parseInt() or parseFloat() functions.<br/>\n\tExamples: 1 + 2 + \"4\" + 1 + 2; // 3412<br/>\n\t1 + 2 + (+ \"4\") + 1 + 2; // 10<br/>\n\t1 + 2 + \"4\" + (1 + 2); // 343<br/>\n\tThe functions parseInt() or parseFloat() can also be used to convert a String to Number, but these functions can sometimes “guess” the result. For parseInt() the “radix” parameter should always be specified to avoid confusion and to obtain a number in the desired numeric base.<br/>\n\tExamples:<br/>\n\t+””; // 0<br/>\n\tparseInt(“”,10); // NaN<br/>\n\t+”45abc”; // NaN<br/>\n\t+parseInt(“45abc”); // 45<br/>\n\t+”2.3”; // 2.3<br/>\n\tparseInt(“2.3”); // 2<br/>\n\t+”2e3”; // 2000<br/>\n\tparseInt(“2e3”,10); // 2<br/>\n\tparseFloat(“2e3”); // 2000</li>\n<li>Avoid using “eval” – The eval() function provides a way to run arbitrary code at run time so the compiler can’t optimize it and might eventually introduce a potential security risk.</li>\n<li>Use {} instead of new Object() and [] of new Array().</li>\n<li>Avoid using the “with” statement because it has been deprecated for security reasons.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Exception_handling\">Exception handling</h3>\n<p>The exception handling is important whenever you aren’t in direct control of the inputs to the scriptlet. For example, if you are filtering the output of a REST call (that might fail) in a scriptlet you should protect the initial parsing of such inputs in a try/catch block as the REST call might fail and yield an odd or unexpected input.</p>\n<p>Another important exception usage is for providing meaningful error messages:</p>\n<p>“Invalid format for input ”jsonText”. The valid format is JSON.”</p>\n<p>The previous example is more intuitive for a non-programmer rather a Java-specific exception.</p>\n<p>How to handle exceptions:</p>\n<ul>\n<li>The try/catch/finally statement is the exception handling mechanism of the scriptlet:\n\t<ul>\n<li>The try statement allows you to test a block of code for errors</li>\n<li>The catch statement allows you to handle the error</li>\n<li>The finally statement enables you to execute code, after try and catch, regardless of the result. This statement is optional.</li>\n</ul>\n</li>\n</ul>\n<p>Example:</p>\n<pre>try {\nBlock of code to try\n}\ncatch(err) {\nBlock of code to handle errors\n}\nfinally {\nBlock of code to be executed regardless of the try / catch result\n}</pre>\n<ul>\n<li>The throw statement allows you to create custom errors. This statement shouldn’t be used to throw errors from a scriptlet and all the errors that are encountered in a scriptlet should be handled by the scriptlet itself.</li>\n<li>Always use the try/catch statement when writing code that is advanced or that uses Java classes.</li>\n<li>In cases where an error is encountered in the scriptlet, the error message should also be placed in the scriptletResult. At the step level, this could be defined as a result variable (for example, errorMsg) that uses this result. The reason is that the Primary Result is easy to see in logs and in debugging mode, compared to setting a variable in the scriptletContext (e.g. scriptletContext.put(\"errorMsg\", \"Some error text here\").</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Handling_scriptlets_in_OO\">Handling scriptlets in OO</h2>\n<p>Scriptlets can be used in following cases:</p>\n<ul>\n<li>On the Scriptlet tab of the operation, flow or step. In this case, the scriptlet runs after the execution of the operation, flow or step. Its main goal is to filter or run some logic on the operation/flow/step results. In case the scriptlet is set on an operation and on a step based on that operation, both scriptlets are executed in the following order: first the scriptlet declared on the operation and then the scriptlet declared at the flow step level.</li>\n<li>The scriptlet filter can be applied on flow results and step results. In this case, the scriptlet is used for filtering or manipulating results. The scriptlet filters should be used only if the task can’t be accomplished with a simpler (predefined) filter or set of filters.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"OO_special_objects_and_methods\">OO special objects and methods</h3>\n<p>The following table includes the most typical objects and methods used in OO scriptlets:</p>\n<table class=\"wikitable\">\n<tbody>\n<tr>\n<th>OO scriptlets objects and methods</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>scriptletContext.get(“myContextKey”)</td>\n<td>Gets the value associated with the context key myContextKey</td>\n</tr>\n<tr>\n<td>scriptletContext.put(\"LocalVariable\",\"LocalValue\")</td>\n<td>Puts data into the local context, so it will be available in the current flow, but not to its parent flow or other subflows</td>\n</tr>\n<tr>\n<td>scriptletContext.putGlobal(\"GlobalVariable\", \"GlobalValue\");</td>\n<td>Has the same function as scriptletContext.put(), but for the global context</td>\n</tr>\n<tr>\n<td>scriptletRawResult['resultName]</td>\n<td>Used for accessing the output from the operation</td>\n</tr>\n<tr>\n<td>scriptletResponse = \"success\"</td>\n<td>Used for setting the response of the operation (must match one of the responses from the Responses tab)</td>\n</tr>\n<tr>\n<td>scriptletResult = \"Your Result Here\"</td>\n<td>Used for setting the result of the operation</td>\n</tr>\n</tbody>\n</table>\n<p><b>Note</b> More advanced information about this topic can be found in the scriptlet template in OO. You can add the scriptlet template in a Scriptlet tab by clicking the “Insert Template” button.</p>\n<h3 class=\"mw-headline\" id=\"Scriptlet_capabilities\">Scriptlet capabilities</h3>\n<p>Scriptlets have direct access to inputs of the operation/flow/flow step through their name and a variable that is created for each input. Scriptlets can’t change input values; they can only read them.</p>\n<p>Scriptlets allow for the creation of local/global variables and can store values that can be used in other steps in the flow (through the scriptletContext):</p>\n<ul>\n<li>Local data is available only to the current flow (not subflows or a parent flow).</li>\n<li>Globally add or change system properties (through scriptletContext.putGlobal). The data is merged to the global parameters only after subflow execution is complete and when two subflows change the global parameters, the last flow to complete will override the value of the parameters.</li>\n<li>A scriptlet can be extended with classes from JDK, meaning that Java code can be used inside a scriptlet. For creating a Java object the fully qualified class name must be used.<br/>\n\tExample: var javaStringObject = new java.lang.String();</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Reusing_scriptlets\">Reusing scriptlets</h3>\n<p>Scriptlets that are designed to perform a simple and modular task can be reused.</p>\n<p>In out-of-the-box content, reusable scriptlets are saved in Configuration/Scriptlets. To use a scriptlet from Configuration/Scriptlets you can drag and drop it in a step’s scriptlet tab.</p>\n<p>More details about scriptlets can be found in Studio Guide, in “Managing Configuration items/Configuring Scriptlets” section.</p>\n<h3 class=\"mw-headline\" id=\"Handling_variables\">Handling variables</h3>\n<p>The inputs of the operation/flow/flow step are accessed through their names.</p>\n<p>The scriptletInput variable is defined only for a scriptlet filter and represents the data to be filtered. The scriptletInput and the scriptletResult variables are JavaScript strings, so the method or properties on these variables should be called accordingly.</p>\n<p>Example:</p>\n<pre>input1.length // JavaScript String length property</pre>\n<p>When using inputs or flow variables they should be accessed through the scriptletContext. These are Java specific Strings (of type Java.lang.String) so the methods on these variables should be called accordingly.</p>\n<p>Example:</p>\n<pre>var input1 = scriptletContext.get(\"input1\");\ninput1.length();\n</pre>\n<p>It is recommended that all the variables that come from outside of the script should be first validated. For example, if a non-existing variable is accessed by scriptletContext.get(), then the call will return a null value and if it’s accessed by its name directly, the scriptlet will fail at runtime.</p>\n<p>Example:</p>\n<pre>var input1 = scriptletContext.get(\"input1\");\nif (input1 != null &amp;&amp; input1.length() &gt; 0){...\n}\n</pre>\n<p><b>Note</b> null == undefined; null !== undefined; typeof(null) =&gt; Object typeof(undefined) =&gt; undefined</p>\n<p>To access these variables in an easy and reusable way, a simple function should be defined:</p>\n<p>Example:</p>\n<pre>function getValue(inputName) {\nvar inputValue = scriptletContext.get(inputName);\nif (inputValue != null &amp;&amp; inputValue.length() &gt; 0) {\nreturn inputValue;\n}\nreturn null;\n}\n</pre>\n<p>Then the function could easily be called for every input:</p>\n<p>Example:</p>\n<pre>var a = getValue(“input1”);</pre>\n<p>When assigning a value to a flow variable through the scriptletContext or setting the scriptletResult, the value will be converted to JavaScript string.</p>\n<p>It is recommended to always set the scriptletResponse and scriptletResult so that the primary result always has a defined value.</p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}