{
  "title": "Security questions and answers",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p><b>How can I generate a certificate request that can be signed by an external CA?</b></p>\n<p>Export the certificate request and send it to the external CA for signing.</p>\n<p><b>Which TCP/UDP ports does OO Workflow Designer use? What is the direction, user, and encryption? </b></p>\n<p>When you install OO Workflow Designer, you need to configure at least one available port for the OO Workflow Designer Server in the HTTP/HTTPS fields. The default provided values are 8080 and 8443, but you can change these. For more information about secure channels between OO Workflow Designer and the other components, see <i>\"Network and communication security\"</i> topic.</p>\n<p><b>How do I configure self-signed SSL certificates for OO Workflow Designer?</b></p>\n<p>During the installation of OO Workflow Designer, if you do not provide a certificate, a self-signed certificate is created by default. However, for security reasons, it is not recommended to use self-signed certificates. It's recommended to work with a certificate from a custom-root CA or from a well-known CA.</p>\n<p><b>How detailed are the logs, and how do I change the amount of logging?</b></p>\n<p>The logs can be set to different levels of granularity. The default level is INFO, but you can adjust this.</p>\n<p><b>How is sensitive information encrypted?</b></p>\n<p>See the topic <a href=\"/doc/423/26.1/encryptiondesigner\">Encryption</a> for answers.</p>\n<p><b>What authentication mechanism does OO Designer support?</b></p>\n<p>OO Workflow Designer supports IDM authentication.</p>\n<p><b>Can I limit the OO Workflow Designer user IP address?</b></p>\n<p>No, this is not supported at the moment.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/networksecuritydesigner\" title=\"SMAX:25.1/NetworkSecurityDesigner\">Network and communication security</a></li>\n<li><a href=\"/doc/423/26.1/logfilesdesigner\" title=\"SMAX:25.1/LogfilesDesigner\">Log files of OO Workflow Designer</a></li>\n<li><a href=\"/doc/423/26.1/encryptiondesigner\" title=\"SMAX:25.1/EncryptionDesigner\">Encryption in OO Workflow Designer</a></li>\n<li><a href=\"/doc/423/26.1/usersecuritydesigner\" title=\"SMAX:25.1/UserSecurityDesigner\">User management and authentication</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}