{
  "title": "Send records by email",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Agent users can send a record to specified users by email. </p>\n<h2>Send a record without attachments by email</h2>\n<p>As an example, use the procedure below to send a request by email: </p>\n<ol>\n<li>In the agent interface, go to the Request module, select a request from the list, and click <strong>More</strong> &gt; <strong>Send by email</strong>. Or, open a request record, and then click <strong>More</strong> &gt; <strong>Send by email </strong>on the record detail page.</li>\n<li>In the To, Cc, and Bcc fields, select the desired recipients. </li>\n<li>In the Message field, enter your message. \n\t<p>Note that for performance and security considerations, the default content type is plain text, not HTML. Even if you enter manual line breaks when entering your message, the email body doesn't contain line breaks. If you're using Outlook, which supports multiple email formats, including HTML and plain text. If the email is written in HTML format and contains the &lt;br&gt; or &lt;p&gt; tags, line breaks will be displayed in the email; however, if it is in plain text, no line breaks will be displayed. To display line breaks in the email, you can manually add HTML line break tags, as follows:<br/>\n\t </p>\n<pre><code>AAAA,&lt;br&gt;\n\nBBBB,&lt;br&gt;\n\nCCCC.&lt;br&gt;</code></pre>\n<p>The effect in the email is as follows:</p>\n<pre><code>AAAA,\n\nBBBB,\n\nCCCC.</code></pre>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-important-icon\"></div>\n<div class=\"admonition-content admonition-important-content\">There is a 30KB limit on the size of text in the Message field. If the size exceeds this limit, the system won't send the notification.</div>\n</div>\n</li>\n<li>Optionally, select the <strong>Send me a copy</strong> option.</li>\n<li>Click <strong>Send</strong>.</li>\n</ol>\n<h2>Send a record with attachments by email</h2>\n<p>The <strong>Send by email</strong> feature allows you to send Change, Purchase order, Request, and Incident records together with their attachments. This feature doesn't support sending attachments through email for other record types. </p>\n<p>When the record has non-encrypted attachments, the email template displays an<strong> Attachments</strong> field, and you can select all or partial attachments from this field to send with the email. </p>\n<p>If the total size of the selected attachments exceeds the maximum allowed value, an error occurs. Your system administrator defines this maximum allowed value in the <strong>Max total file size for email attachments</strong> tenant setting in the Suite Administration portal, and the default value is 5 MB. </p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}