{
  "title": "Services and the Service Catalog",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><h2>Introduction</h2>\n<p>Some customers new to Service Management (or ITIL v3 in general) are confused about what IT services are and what services they themselves support. ITIL defines it as \"a service provided to one or more customers by an IT service provider.\" In more simple terms, if an end user contacts the Service Desk with a request and the agent's answer is anything but \"we don't support that\", that request is somehow related to a supported IT Service.</p>\n<h2>What are Services?</h2>\n<p>Services that IT provides to end users are called Business Services. Examples could include collaboration services, email services, or mobile device support. Services that are used internally by IT are called Infrastructure Services. Some examples of these might include data storage or networking services. Some services can even be made up of other services.<br/>\nMore information on Services and how they are defined can be found here: <a href=\"/doc/423/26.1/sacmoverview\" title=\"SACM Overview\">SACM Overview</a><br/>\nFinding and defining the IT Services can be one of the most time-consuming parts of creating any Service Management implementation, but it can also create the most value. Knowing the entirety of what IT does (and doesn't) support is an invaluable piece of information. Once the high-level services are known, the creation of the Service Catalog can begin in earnest.</p>\n<h2>Designing the Service Catalog </h2>\n<p>The Service Catalog is separated into three sections:</p>\n<ul>\n<li>Service Categories</li>\n<li>Service Definitions</li>\n<li>Offerings</li>\n</ul>\n<p>Precise definitions and examples of each of these levels may be found here: <a href=\"/doc/423/26.1/servicecatalog\" title=\"The Service Catalog\">The Service Catalog</a><br/>\nWhen designing your Service Catalog, there are some high-level considerations that you should keep in mind. These include:</p>\n<ul>\n<li>Design for the End User</li>\n<li>Design for Search</li>\n<li>Design a Catalog, not an Entry Form</li>\n</ul>\n<h3>Design for the End User</h3>\n<p>When designing the Service Catalog, the most important design consideration is to create the catalog for the end user, not the agents. While the purpose of the Service Catalog is to reduce the load on the agents, this can only be accomplished if the end user is able to easily find what they are looking for. <br/>\nFor example, when browsing the Service Categories, the end user is much more likely to understand what's contained in a category named \"Phone and Mobile\" than one labeled \"Telecom\". </p>\n<h3>Design for Search</h3>\n<p>Along the same lines, when creating Offerings, the descriptions must contain the right information so the end user can find them when searching. Service Portal works best when the users simply search for what they are looking for help with. However, this only works if the Offerings contain all of the information the user might search for. When designing the Offerings, include as much information about them in the descriptions as possible.</p>\n<h3>Design a Catalog, not an Entry Form</h3>\n<p>When designing the catalog, an administrator may fall into the mindset that it's important to keep the number of Offerings to a minimum. To accomplish this, they will create a single Offering that can be used for a number of different actions. These end user must then select one or more options to complete their request, often without being certain of which selection to make.<br/>\nAn alternative approach is to create Offerings that are specific to a single type of request or task. While this will result in more Offerings to maintain, the system becomes more intuitive for the end user, leading to higher satisfaction and acceptance. Consider how the leading on-line services build their own catalogs. There isn't a single item (offering) for \"Book\" that makes the user select the type, author, and title from a list. Instead, each unique book has its own entry, categorization, and description. This also makes it easier for the end user to search for and find exactly what they are looking for.</p>\n<h2>Creating the Offering Description</h2>\n<p>One of the most important parts of the Service Catalog is the description of the provided offerings. The descriptions are the starting point of a customer's interaction with the Service Portal. It helps a customer to know:</p>\n<ul>\n<li>Whether this is the offering they are looking for</li>\n<li>What they can expect out of the offering</li>\n<li>What they need to prepare or have ready before making their request</li>\n</ul>\n<h3>What to include in the Offering description</h3>\n<p>When creating Offerings for the Service Catalog, consider including the below in the description:</p>\n<ul>\n<li>What does the offering provide?</li>\n<li>Who should request the offering and in what scenario? Who should not request the offering in a different scenario?</li>\n<li>If there are other offerings with similar names, explain the difference between them.</li>\n<li>Anything customers need to have prepared before requesting the offering.</li>\n<li>Any expected actions customers need to take after requesting the offering.</li>\n<li>If the delivery time is important for the customers, consider adding it to the description.</li>\n<li>Add a link to other documents with important information</li>\n</ul>\n<p>This isn't meant to be a mandatory list. Find the right balance between the information you would like to include and the length of the Offering description. Be sure to consider how the customer might search for the Offering, and include that information in the description.</p>\n<h2>Supplement the Service Catalog with Knowledge Articles </h2>\n<p>The Knowledge Articles in a Service Management system can be the Service Desk's best friend. Any customer issue that can be self-resolved using knowledge is one less issue that the Service Desk needs to address.</p>\n<h3>Do's and Don'ts for Knowledge Articles</h3>\n<p><strong><span style=\"color:#2ecc71;\">Do:</span></strong></p>\n<ul>\n<li>Focus on only one topic per article\n\t<ul>\n<li>Easy to read</li>\n<li>Easy to maintain</li>\n</ul>\n</li>\n<li>Consider starting with questions/issues customers may have or have had in the past</li>\n<li>Use bullets to list out important points</li>\n<li>Have articles reviewed by a technical writer whenever possible</li>\n<li>Add reference links to other related topics whenever applicable</li>\n</ul>\n<p><span style=\"color:#c0392b;\"><strong>Don't</strong>:</span></p>\n<ul>\n<li>Create long articles with multiple topics\n\t<ul>\n<li>Consumers may lose patience while reading them</li>\n</ul>\n</li>\n<li>Only focus on solving problems in the Service Desk -- recurring problems are a good indicator of the need for a related Knowledge Article</li>\n<li>Write Articles like a casual email, with no clear structure and long paragraphs</li>\n</ul>\n<h3>Using Naming Conventions and Models in Articles</h3>\n<p>In order to clearly and quickly get the point of a Knowledge Article across to a customer, consider using naming conventions when creating the title of the article. This will also increase the consistency of the articles overall.<br/>\nSome examples of naming conventions include:</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<tbody>\n<tr>\n<td><strong>For</strong></td>\n<td><strong>Suggested Naming Convention</strong></td>\n</tr>\n<tr>\n<td>Best Practices/Policies/FAQ</td>\n<td>XXXXX Best Practices/Policy/FAQ</td>\n</tr>\n<tr>\n<td>How-Tos</td>\n<td>\"How To...\" or us a verb phrase like \"Using ...\", \"Setting up...\"</td>\n</tr>\n<tr>\n<td>Knowledge tips</td>\n<td>Use the issue description as the title, eg: \"Slow connectivity...\", \"400 Bad Request Error\"</td>\n</tr>\n<tr>\n<td>Conceptual contents</td>\n<td>About..., General Introduction to...</td>\n</tr>\n</tbody>\n</table>\n<p>Additionally, using Models for each of these types (and any others you wish) will improve consistency among your Articles, resulting in improved user acceptance and use. For each of the \"types\", create a separate Model where the common content is predefined. For example, if you create a \"Frequently Asked Questions\" type, the content may have a \"Question\" and \"Answer\" section specified.<br/>\n<br/>\n<a class=\"image\" href=\"/file/images/pn_images/pn_image_5eded14a41cd52.32733637.png\" title=\"/file/images/pn_images/pn_image_5eded14a41cd52.32733637.png\"> <img alt=\"pn_image_5eded14a41cd52\" border=\"0\" file=\"Screen Shot 2020-06-08 at 5.00.48 PM.png\" height=\"275\" hspace=\"0\" src=\"../../../images/pn_image_5eded14a41cd52.32733637_85f33724.png\" style=\"width: 800px; height: 275px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<h3><br/>\nWriting User-friendly Articles: An Example</h3>\n<p>The following is a real example of a Knowledge Article before and after it was rewritten with the advice given above.<br/>\nArticle content before rewrite:</p>\n<div style=\"background:#eeeeee;border:1px solid #cccccc;padding:5px 10px;\">The Repository server allows only <font face=\"monospace\">&lt;your company name&gt;</font> networks. To access this server we should use the <font face=\"monospace\">&lt;your company name&gt;</font> intranet network. If you are on a public network, you need to connect to the Pulse VPN first to access this server. Servers located in all the Data Centers (including Trade and LabOPs) will be able to communicate to this repository server using respective Data Center Proxies. If you want to access this server from <font face=\"monospace\">&lt;your company name&gt;</font> office networks then no need to connect to any VPN.</div>\n<p>Article content after rewrite:</p>\n<div style=\"background:#eeeeee;border:1px solid #cccccc;padding:5px 10px;\"><strong>Access to the Repository server</strong><br/>\n<br/>\n- You can only access the repository server from <font face=\"monospace\">&lt;your company name&gt;</font> networks.<br/>\n- If you are in a public network, connect to Pulse VPN first<br/>\n<br/>\nNote: Servers located in all the Data Centers (including Trade and LabOPs) can communicate to this repository server using respective Data Center Proxies.</div>\n<p>The large block of text has been replaced with bullet points and a simple note, conveying the same information as the original in a way that's easily consumed by the customer.</p>\n<div></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}