{
  "title": "Service Level Management",
  "content": "<div class=\"mw-parser-output\">\n<div>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-tip-icon\"></div><div class=\"admonition-content admonition-tip-content\"><div>\n<p>In this chapter, Glenn will look at the service level management area of Service Management. Service level management (SLM) allows you to measure the quality of service delivery by defining service level agreements with your customers to deliver their required services within pre-defined objectives. Service Management allows the organization to measure both customer focused and internal focused objectives.</p>\n<p>The service level targets created in these agreements are reflected in the requests, incidents, changes, tasks, problems, and custom records created in the system, allowing agents to better prioritize their workload by tackling the issues that will breach a target first.</p>\nService level data may be collected and reported upon to allow you to change existing service level targets with your customers or highlight trouble areas where you may need more resources or need to make changes in the current process.\n\n<div><a class=\"image\" href=\"\"> <img alt=\"slm_get_started_overview_1\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/b/b4/slm_get_started_overview_1.png\" hspace=\"0\" src=\"../../../images/slm_get_started_overview_1_d83de0a3.png\" style=\"width: 800px; height: 645px; margin: 0px; border: 0px solid black;\" vspace=\"0\"/> </a></div>\n</div></div></div>\n</div>\n<h2><a id=\"Service-Levels\" name=\"Service-Levels\" title=\"Service Levels\"></a><a id=\"Service_Levels\" name=\"Service_Levels\" title=\"Service Levels\"></a>Service Levels</h2>\n<p>There are tools to take requests, incidents, changes, tasks, problems, and custom records. What we don’t have yet is a way to let our agents know which ones they should work on first. Similarly, we have no way to quantify the quality of our service delivery to our End users. No one will believe us if we just say we’re doing a good job, we need a way of measuring the level of service we are providing, which we can then use to drive the correct prioritizing of the agent’s work.</p>\n<p>We can measure the quality of our service delivery by defining service level agreements with our customers (our end users’ management in our case) to deliver their required services within pre-defined objectives. These agreements will allow us to set measurable objectives for providing our services and how long it should take to handle issues that the users run into with those services. </p>\n<p>Service level management is the process used to define, monitor, and adjust these service level agreements with our customers. Specifically, this process allows to:</p>\n<ul>\n<li>Set measurable objectives for all IT services.</li>\n<li>Create a relationship with the customer that fosters communication.</li>\n<li>Ensure that the customer understands the level of service to be provided.</li>\n<li>Monitor the quality of the delivered services.</li>\n<li>Improve service quality when necessary.</li>\n</ul>\n<p>Service Management allows us to define these objectives in our end user facing processes (encompassing requests, incidents, changes, tasks, problems, and custom records).</p>\n<h2><a id=\"Agreements\" name=\"Agreements\" title=\"Agreements\"></a>Agreements</h2>\n<p>There are two types of agreements tracked within Service Management, <strong>Service Level Agreements</strong> (SLAs) and <strong>Operational Level Agreements</strong> (OLAs).</p>\n<p>The service level agreement is an agreement between ourselves (as the IT service provider) and a customer. The operational level agreement is an agreement between the IT service provider (again us) and another part of our own organization. The functional difference between the two is found in the targets they define. SLAs define the expected time to move between specific steps of a workflow, while OLAs define the maximum time any one group should take to work on a specific record.</p>\n<p>The agreements can cover one of two areas:</p>\n<ul>\n<li><strong>Service Agreements</strong> - Define response criteria for service requests.</li>\n<li><strong>Support and Case Agreements</strong> - Define response criteria for support requests, case requests, incidents, changes, tasks, problems, and custom records.</li>\n<li><strong>Human Resource Agreements</strong> - Define response criteria for human resource management service requests.</li>\n</ul>\n<h3><a id=\"Service-Agreements\" name=\"Service-Agreements\" title=\"Service Agreements\"></a><a id=\"Service_Agreements\" name=\"Service_Agreements\" title=\"Service Agreements\"></a>Service Agreements</h3>\n<p>Our service agreements specify the targets that our IT department should strive for when handling service requests. When we define these agreements, we need to specify the specific service offerings they cover. We can specify multiple offerings in a single service agreement, as long as they all have the same targets. In fact, to get started we can create a single service agreement to define the desired response times for all our services. Later, we can go back and create new service agreements to define specific targets for specific services.</p>\n<p>For each type of agreement, there are multiple target types we can measure. For service level agreements we can define the following targets:</p>\n<ul>\n<li><strong>Approval</strong> - The time it should take between creating the request and getting the required approvals completed.</li>\n<li><strong>Fulfillment</strong> - The time it should take between the approval of the request and the actual fulfillment.</li>\n<li>In operational level agreements, there is a single target type to measure:</li>\n<li> \n\t<ul>\n<li><strong>Time in group</strong> - The time the service request remains assigned to a specific group.</li>\n</ul>\n</li>\n</ul>\n<p>Each of these types can have a different target based on the priority field set in the service request. So the most critical requests need to be completed quicker than the low priority ones under the same agreement.</p>\n<p>Because each service agreement can encompass many service offerings, as we are building our service catalog it would be a good idea to come up with some kind of grouping that represents some discrete “shirt sizes” of time we expect the fulfillment of each offering to take. In that way, we can create a service agreement for each “shirt size”.  For example, something that fit in the “small” size. might have a much shorter target than those in the “extra large” size. This way we can have targets for all of our offerings with no need to create a separate agreement for each one.</p>\n<h3><a id=\"Support-and-Case-Agreements\" name=\"Support-and-Case-Agreements\" title=\"Support and Case Agreements\"></a><a id=\"Support_Agreements\" name=\"Support_Agreements\" title=\"Support Agreements\"></a>Support and Case Agreements</h3>\n<p>Support and Case Agreements are concerned with the targets our It department has with the customer regarding support requests, case requests, incidents, changes, tasks, problems, and custom records. These agreements are defined for issues with specific services, and each agreement can specify targets for multiple services.</p>\n<p>For Support and Case Agreements, there are again multiple target types that are measured. Each is slightly different based on which record type is being used. For all these record types, we have the following target types:</p>\n<ul>\n<li><strong>Initial review </strong>- The time it should take between logging the request and moving it to the 'Fulfillment' step.</li>\n<li><strong>Chat request response</strong> - The time it should take for an agent to respond to an end user’s chat request</li>\n<li><strong>Resolution</strong> - The time it should take between the 'Fulfillment' step and the 'Validation' step</li>\n<li><strong>Approval</strong> - Defines how long it takes for the record to be approved.</li>\n<li><strong>Fulfillment </strong>- Defines how long it takes for the record to be fulfilled.</li>\n<li><strong>Classification </strong>- Defines how long it takes for the Change record to be classified.</li>\n<li><strong>Planning </strong>- Defines how long it takes for the Change record to be planned.</li>\n<li><strong>Deployment </strong>- Defines how long it takes for the Change record to be deployed.</li>\n<li><strong>Validation </strong>- Defines how long it takes for the Change record to be validated.</li>\n<li><strong>Completion </strong>- Defines how long it takes for the Task record to be completed.</li>\n<li>In operational level agreements, there is again a single target type to measure:\n\t<ul>\n<li><strong>Time in group</strong> — The time the support or case request is assigned to a specific group</li>\n</ul>\n</li>\n</ul>\n<p><span style=\"color: rgb(0, 115, 231); font-family: Roboto, sans-serif; font-size: 24px;\">Service Level Target Sets</span></p>\n<p>To define the targets for the different agreement types, we will need to create what Service Management calls target sets. These sets allow us to create reusable definitions that can be referenced in multiple agreements, reducing the overall amount of work we need to do.</p>\n<p>Each target set specifies the agreement type it may be used for and the record type (requests, incidents, changes, tasks, problems, and custom records) it may be associated with. In addition, we need to specify the work schedule (we’ll get to those in a minute) and the time zone that should be used for the target calculations.</p>\n<p>We need to specify the actual targets for each of the target types. We can define a single target for a type (such as the Resolution type), or we can define a separate target for the type based on the associated record's priority. So we might set one day as the resolution target for a critical priority incident, but a 7-day target for a low priority incident. Oh, and it isn’t necessary to set a target for every priority. So if we don’t want to measure low priority incidents for a certain agreement, we can do that.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"10.1-TargetSets.png\" border=\"0\" file=\"/mediawiki/images/a/a5/10.1-TargetSets.png\" hspace=\"0\" src=\"../../../images/10.1-TargetSets_5189479f.png\" style=\"width: 800px; height: 448px; margin: 0px; border: 0px solid black;\" vspace=\"0\"/> </a></div>\n<h2><a id=\"Time-Periods\" name=\"Time-Periods\" title=\"Time Periods\"></a><a id=\"Time_Periods\" name=\"Time_Periods\" title=\"Time Periods\"></a>Time Periods</h2>\n<p>To set a specific work schedule for a target set (so we only count the time we are “working” against the service targets), we first need to define it. We do this by creating a time period of a specific type (work schedule).</p>\n<p>The time period definition contains all of the scheduling information needed to determine when someone using this schedule is working. Time periods are very flexible regarding start and end times, one time events (extra working hours), and holidays.</p>\n<p>Service agreements use work Schedules to only count time against a target during actual working hours. If the service target specifies that it's only valid during an eight to five shift, then any time spent outside of those hours will not count against the target. This is why it's important that we also specify the time zone in the target definition. 8 a.m. in San Diego isn't the same as 8 a.m. in Shanghai (as I found out the hard way in my last job).</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"10.2-timePeriods.png\" border=\"0\" file=\"/mediawiki/images/4/4a/10.2-timePeriods.png\" hspace=\"0\" src=\"../../../images/10.2-timePeriods_58884eb1.png\" style=\"width: 800px; height: 447px; margin: 0px; border: 0px solid black;\" vspace=\"0\"/> </a></div>\n<h2><a id=\"Service-Agreements-in-Action\" name=\"Service-Agreements-in-Action\" title=\"Service Agreements in Action\"></a><a id=\"Service_Agreements_in_Action\" name=\"Service_Agreements_in_Action\" title=\"Service Agreements in Action\"></a>Service Agreements in Action</h2>\n<p>So we’ve spent a good deal of time going over how to define our service agreements, but if you're like me then you'd probably like to see examples of a service agreement in action. Let’s go through some hypothetical scenarios and see how the agreements work in the processes they support.</p>\n<h3><a id=\"Example-1-Incident\" name=\"Example-1-Incident\" title=\"Example #1: Incident\"></a><a id=\"Example_#1:_Incident\" name=\"Example_#1:_Incident\" title=\"Example #1: Incident\"></a>Example #1: Incident</h3>\n<p>In this scenario, an Incident was created by one of our monitoring systems at exactly 8 a.m. (how convenient). One server that supports our Email service went down (possibly because the boss kicked it again)!</p>\n<p>We have a Support and Case Agreement defined for the Email service, which has a specific service level target set for use with Incidents. This incident had a priority of critical assigned to it by our monitoring system, so we are assigning the following targets for each type:</p>\n<ul>\n<li>Initial review (for critical priority) has a target of 10 minutes</li>\n<li>Resolution (for critical priority) has a target of 60 minutes</li>\n</ul>\n<p>There is no work schedule defined (which equates to 24x7 service), and the time zone is set to America/Los_Angeles. Even though there is no work schedule, we want to define the correct time zone to handle date switch overs such as Daylight Saving Time.</p>\n<p>When we look at the incident itself, we can see how the service agreement is being used by looking at the 'Targets' tab. From here we can see everything we need regarding the agreements, including:</p>\n<ul>\n<li>A summary of each service level target type (initial review &amp; resolution) comprising\n\t<ul>\n<li>The current status of each target (Active, Breached, or Achieved)</li>\n<li>The Target date which needs to be met in order to achieve each target</li>\n<li>The Elapsed duration of each specific type (how much time has already been used)</li>\n<li>The target duration of each type (the total time allowed)</li>\n<li>The date at which the target was achieved (if we met the target)</li>\n</ul>\n</li>\n<li>The next target time that will occur for this Incident</li>\n<li>The overall status of the incident regarding the targets (active, breached, or achieved)</li>\n</ul>\n<p>At the top of the Incident is an indicator of how long until the next target time, or how far in the past it was if we missed it. So now if we pulled the ticket up just after it was opened we would see the target date for Initial review is 8:10 a.m. and the target for resolution is 9:00 a.m.</p>\n<p>For each target type, the system will send alert messages to the assigned group (or groups) when 50%, 75%, and 90% of the target time has passed. Here, everyone was too busy watching cat videos on the Internet an no one categorized and assigned the ticket in time. Even though the service desk received an email at 8:05, 8:07 (and 30 seconds), and 8:09.</p>\n<p>At 8:10, because the Incident had not yet been categorized, the Initial review target was breached. The system will email the assigned group (or groups) with this information, and mark the overall status of the incident as breached (if any targets are breached then the incident has breached the service agreement).</p>\n<p>However, the incident is still out there and we have another target to meet. The next target time of the incident will now reflect the resolution target of 9:00 a.m. Again, reminder emails will be sent out at 8:30 (50%), 8:45 (75%), and 8:54 (90%). Our crack team finds the issue and resolves the incident at 8:50 a.m. (so the third email reminder was never sent). Now if we look at the targets we see that the resolution target has a status of 'Achieved' and the achievement date is today at 8:50.</p>\n<p>We notice that the overall status is still 'Breached'”, as again if any target is breached the overall status of the Incident will also be 'Breached'.</p>\n<h3><a id=\"Example-2-Service-Request\" name=\"Example-2-Service-Request\" title=\"Example #2: Service Request\"></a><a id=\"Example_#2:_Service_Request\" name=\"Example_#2:_Service_Request\" title=\"Example #2: Service Request\"></a>Example #2: Service Request</h3>\n<p>In this scenario, an end user requested the 'New Sharepoint Site' offering from the Service Portal. This offering is linked to a Service agreement which has an associated target set. The targets are set as follows:</p>\n<ul>\n<li>Approval (all priorities) has a target of 2 hours</li>\n<li>Fulfillment (all priorities) has a target of 4 hours</li>\n</ul>\n<p>Let’s say the request is made at 9:00 a.m. The approval target is now set at 11:00 a.m. The fulfillment target, however, isn't set to anything yet. Why? Well, the Fulfillment target is measured by the time the approval has been completed and the end of the 'Fulfillment' step. Since the request has not completed the 'Approval' step yet, the timer has not started.</p>\n<p>While we are waiting for the approval to happen, one thing to note is that there are automatically generated reminders sent to the approvers already, so no extra notifications are sent by the SLA processing.</p>\n<p>The Approval is completed at 10:00 a.m., so we have achieved the approval target. Now the fulfillment target starts, and we have four hours (until 2:00 p.m.) to get it completed. For the fulfillment target, we have the reminders sent at 12:00 noon (50%), 1:00 p.m. (75%) and 1:36 p.m. (90%) to the assigned group.</p>\n<p>The fulfillment is completed at 1:30 p.m., so the fulfillment target is also achieved. This means the overall status of the incident will also be 'Achieved'.</p>\n<h2><a id=\"Prioritizing-Work-using-Service-Targets\" name=\"Prioritizing-Work-using-Service-Targets\" title=\"Prioritizing Work using Service Targets\"></a><a id=\"Prioritizing_Work_using_Service_Targets\" name=\"Prioritizing_Work_using_Service_Targets\" title=\"Prioritizing Work using Service Targets\"></a>Prioritizing Work using Service Targets</h2>\n<p>One of the most useful things that our agreements give us is a method for our agents to prioritize their work. Instead of relying on the priority, instructing our agents to use the next SLT target time field results in better handling of their work queues. They simply need to work on the item with the next SLT target time that will expire the quickest.</p>\n<p>Why is this better than using priority? Well, let’s say there we have a few incidents out there for each priority (critical, high, medium, and low). If we only work on the highest priority first, and new incidents are coming in, some of which are critical or high priority, then the medium and low priority incidents may never get worked on (or at least not for a long time). And don’t forget that not all high priority Incidents are equal! If our Payroll service is down, it's much more important than our Room Reservation service (at least to me it is) — leading to different targets between the two services.</p>\n<p>If we teach our agents to look at the next SLT target time, a medium priority incident that has been open for a few days will work its way to the top of the list so that the agent will work on it before we breach the service agreement.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"10.3-Prioritizing.png\" border=\"0\" file=\"/mediawiki/images/9/92/10.3-Prioritizing.png\" hspace=\"0\" src=\"../../../images/10.3-Prioritizing_7b567dd1.png\" style=\"width: 800px; height: 463px; margin: 0px; border: 0px solid black;\" vspace=\"0\"/> </a></div>\n<h2><a id=\"Reporting-on-Service-Targets\" name=\"Reporting-on-Service-Targets\" title=\"Reporting on Service Targets\"></a><a id=\"Reporting_on_Service_Targets\" name=\"Reporting_on_Service_Targets\" title=\"Reporting on Service Targets\"></a>Reporting on Service Targets</h2>\n<p>It will be very important for us to report on how we are performing against our service agreements. Service Management stores all the data we need to determine what kind of job we are doing against each one.</p>\n<p>One thing we need to think about as we design our reports is what we are measuring in each one. Are we looking at how we are doing in a specific area, such as incidents or requests? Or are we looking at a specific type of target (the approvals target type in a request for example)?</p>\n<p>The reason this is important is that we will report against a different data set depending on the answer to that question. If we want to see all the incidents that have breached any service target, we will report against the incident table. If instead, we want to see how many approval target type breaches we have; I need to report against the actual service level target data.</p>\n<p>So as long as we know what we are trying to measure we can select the correct record type to report against. This way we can get all the information we need into our reports and/or dashboards.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"10.4-Reports.png\" border=\"0\" file=\"/mediawiki/images/5/57/10.4-Reports.png\" hspace=\"0\" src=\"../../../images/10.4-Reports_a83fc609.png\" style=\"width: 767.401px; height: 800px; margin: 0px; border: 0px solid black;\" vspace=\"0\"/> </a></div>\n<h2><a id=\"Timing-and-Caching\" name=\"Timing-and-Caching\" title=\"Timing and Caching\"></a><a id=\"Timing_and_Caching\" name=\"Timing_and_Caching\" title=\"Timing and Caching\"></a>Timing and Caching</h2>\n<p>It probably won't surprise you, but there is a ton of processing going on behind the scenes to calculate all the service level targets and related actions for all the requests, incidents, changes, tasks, problems, and custom records being opened. Service Management has to perform complex calculations which included time periods (and time zones) every time someone creates or updates a request, incident, change, task, problem, or custom record.</p>\n<p>To optimize performance, Service Management performs the calculations in small batches in the background so that the end users and agents aren't negatively affected. The small side-effect of this is that the calculations might not be visible to the agents for up to a minute. So we need to let our agents know that if they don't see a target time in a record they recently created or updated, they need to give it a few seconds and it will appear.</p>\n<p>One other area that the optimization work affects is in changing the actual service level targets. To keep performance at its peak, the internal caching mechanisms used may not take the new values into consideration for a few minutes. In fact, the system will warn us of this when we change the targets. It's possible to override this behavior if necessary, but we need to make sure we only do this when we have to.</p>\n<!-- NewPP limit reportCached time: 20200216153459Cache expiry: 86400Dynamic content: falseCPU time usage: 0.040 secondsReal time usage: 0.188 secondsPreprocessor visited node count: 23/1000000Preprocessor generated node count: 56/1000000Post‐expand include size: 18049/2097152 bytesTemplate argument size: 0/2097152 bytesHighest expansion depth: 2/40Expensive parser function count: 0/100Unstrip recursion depth: 0/20Unstrip post‐expand size: 0/5000000 bytes--><!--Transclusion expansion time report (%,ms,calls,template)100.00%    0.000      1 -total--></div>",
  "modifiedon": "2025-10-24 08:51:12"
}