{
  "title": "Set up the browser language for OO Workflow Designer",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The Operations Orchestration (OO) Workflow Designer language support is according to the set browser language. If the specific language isn't supported, OO Workflow Designer appears in English.</p>\n<p>You must set up your browser for foreign language support and make sure that the added language is the first in the list.</p>\n<h2 id=\"Change_the_language_preferences_on_Internet_Explorer\">Change the language preferences on Internet Explorer</h2>\n<ol>\n<li>Go to <b>Tools</b> &gt; <b>Internet Options</b> &gt; <b>General</b> (tab) &gt; <b>Languages</b> &gt; <b>Language</b> preference.</li>\n<li>Select the required language. Make sure the primary language is the first on the list.</li>\n</ol>\n<h2 id=\"Change_the_language_preferences_on_Firefox\">Change the language preferences on Firefox</h2>\n<ol>\n<li>Go to <b>Tools</b> &gt; <b>Options</b>, <b>Content</b> (tab) &gt; <b>Languages</b> &gt; <b>Choose</b> (button).</li>\n<li>Select the required language.</li>\n</ol>\n<h2 id=\"Change_the_language_preferences_on_Google_Chrome\">Change the language preferences on Google Chrome</h2>\n<ol>\n<li>Click the <b>Customize and control Google Chrome</b> button, and then select <b>Settings</b> &gt; <b>Show advanced settings</b>.</li>\n<li>In the <b>Languages</b> section, click <b>Language and input settings</b>.</li>\n<li>\n<p>Click <b>Add</b>, and select the required language.</p>\n<p>You can add languages to this from a predefined set, and Chrome will send all the languages you choose with the <code>Accept-Language</code> header in the order in which you arrange them.</p>\n</li>\n</ol>\n<h2 id=\"Change_the_language_preferences_on_Safari\">Change the language preferences on Safari</h2>\n<p>In Windows, you can't change the language sent by Safari. The language sent with the <code>Accept-Language</code> header is according to your system settings. It's also possible to change the Microsoft SQL collation language or the <b>central-wrapper.conf</b> language for content.</p>\n<h2 id=\"Related_topics\">Related topics</h2>\n<ul>\n<li>For more information to change the language for content in OO Workflow Designer, see <a href=\"/doc/423/26.1/changelanguageood\" title=\"SMAX:25.1/ChangeLanguageOOD\">Set up language for OO Workflow Designer</a> topic.</li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}