{
  "title": "Set up an automatic reservation",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The following steps are an example of how, in outline, you can set up a reservation for your organization to deal with a request for a new PC. By using the example as a framework, you can set up reservations to deal with devices, infrastructure &amp; peripheral assets, and enterprise assets managed within Service Management.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>The following content uses examples in the Service Management sample data. For more information about the sample data, see <a href=\"/doc/423/26.1/sampledata\" title=\"SMAX:25.1/SampleData\">Sample data</a>.</li>\n<li>The reservation business rule currently doesn't handle quantity. When reserving a consumable asset with a quantity greater than one, all enterprise assets will be reserved. </li>\n</ul>\n</div>\n</div>\n<p>To set up an automatic reservation:</p>\n<ol>\n<li>\n<p>From the main menu, select <b>Plan &gt; Service Catalog &gt; Offerings</b>.</p>\n</li>\n<li>\n<p>Filter the records to display only <b>Service offerings</b> with the <b>Service definition</b> of <b>PC Lifecycle</b>.</p>\n</li>\n<li>\n<p>Select the <b>(DEMO) Request a new PC</b> offering record.</p>\n</li>\n<li>\n<p>Click <b>Details</b> on the toolbar. The record is displayed.</p>\n</li>\n<li>\n<p>Note the following in the <b>Offering details</b> section of the <b>General</b> tab:</p>\n<ol>\n<li>\n<p><b>Display label</b>. This is the text which Service Management displays as a title when it suggests the offering to the user in the Service Portal.</p>\n</li>\n<li>\n<p><b>Status</b>. This must be Active for the reservation to work.</p>\n</li>\n<li>\n<p><b>Offered asset model</b>. This is the asset model of the PC.</p>\n</li>\n</ol>\n<p>For more information about offerings, see <a href=\"/doc/423/26.1/createofferings\" title=\"SMAX:25.1/CreateOfferings\">How to create an offering</a>.</p>\n</li>\n<li>\n<p>Click the <b>Task Plan</b> tab.</p>\n</li>\n<li>\n<p>In the <b>Approve</b> part, there is a task requiring managerial approval if the PC ordered is High Performance. In the sample data, the asset model isn't High Performance, so the approval automatically completes without manual intervention.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>This task isn't necessary for reservation. The task is documented as it's part of the sample data, not because it's required.</p>\n</div>\n</div>\n</li>\n<li>\n<p>In the <b>Fulfill</b> part, the complete set of reservation tasks is displayed.</p>\n</li>\n<li>\n<p>The reservation business rule - <b>Reserve asset</b> - is part of the sample data task plan.</p>\n<p>This business rule looks at the assets in stock with the requested asset model defined in the request. The stockroom of the asset can deliver assets to the location specified in the business rule. In this case, it determines the location for delivery as the one defined in the request, failing which the location of the requestor.</p>\n<p>The configurable parameters are:</p>\n<ul>\n<li>\n<p><b>asset model</b> - the asset model defining the asset for reservation</p>\n</li>\n<li>\n<p><b>location</b> - the delivery location the stockroom can serve</p>\n</li>\n<li><b>phaseId</b> - the phase of the asset; normally <b>In stock</b></li>\n<li>\n<p><b>Stockroom entry date</b> - in which order to reserve PC; two options are available:</p>\n<ul>\n<li><b>Earliest</b>: the first in-stock asset should be reserved first</li>\n<li><b>Latest</b>: the last in-stock asset should be reserved first</li>\n</ul>\n</li>\n<li>\n<p><b>Validate warranty end date</b> - whether to validate the warranty end date; two options are available:</p>\n<ul>\n<li><b>Yes</b>: reserve assets that are under warranty only</li>\n<li><b>No</b>: ignore the warranty information; reserve all assets that are under warranty, out of warranty, and without warranty</li>\n</ul>\n</li>\n</ul>\n<p>Using the sample data, these parameters are configured as:</p>\n<ul>\n<li>\n<p><b>asset model</b> - HP EliteBook Folio 9470m</p>\n</li>\n<li>\n<p><b>location</b> - the business rule uses delivery location as its first choice, and if that's not specified it defaults to the user's location; user, in this case, being the person named in the <b>Requested for</b> field</p>\n</li>\n<li><b>phaseId</b> - <b>In stock</b></li>\n<li><b>Stockroom entry date</b> - <b>Earliest</b></li>\n<li><b>Validate warranty end date</b> - <b>No</b></li>\n</ul>\n<p>To add the reservation business rule to a new task plan:</p>\n<ol>\n<li>\n<p>Click <b>Add</b>, then <b>Automated task</b>.</p>\n</li>\n<li>\n<p>In the <b>New automatic task</b> dialog box, <b>Business rule</b> section, click Set rule.</p>\n</li>\n<li>\n<p>Select <b>Reserve asset</b>.</p>\n<p>For more information, see<a href=\"/doc/423/26.1/taskplans\" title=\"SMAX:25.1/Taskplans\">Task plans</a>.</p>\n</li>\n</ol>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">\n<p>The reservation business rule is available only for requests and task plans.</p>\n</div>\n</div>\n</li>\n</ol>\n<p>When a user submits a request utilizing this offering, the task plan is triggered. This automatically finds the matched device (in this case) and reserves it for the user.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/createmanreservation\" title=\"SMAX:25.1/CreateManReservation\">How to create a manual reservation</a></li>\n<li><a href=\"/doc/423/26.1/testreservations\" title=\"SMAX:25.1/TestReservations\">How to test the automatic reservation</a></li>\n<li><a href=\"/doc/423/26.1/reservations\" title=\"SMAX:25.1/Reservations\">Reservations</a></li>\n<li><a href=\"/doc/423/26.1/reservationswflw\" title=\"SMAX:25.1/ReservationsWflw\">Reservations workflow</a></li>\n<li><a href=\"/doc/423/26.1/viewclosereservation\" title=\"SMAX:25.1/ViewCloseReservation\">How to cancel or close a reservation</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}