{
  "title": "Set up configuration items for a content pack",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>After deploying a content pack to the Operations Orchestration Central (OO Central) server, the user with the permission <strong>oo_cpManage</strong> may need to configure the content of this content pack to adjust it to the environment. This includes setting up the:</p>\n<ul>\n<li>\n<p><b>System accounts</b> - Often, content packs come with system accounts configured. For example, if you are deploying a content pack for an Oracle database, it will include Oracle user accounts. You will need to create Central user names and map them to the system accounts in the content pack.</p>\n</li>\n<li><b>System properties</b> - Often, content packs come with system properties configured. You may want to override these properties in OO Central.\n\t<p>In the OO Central UI, you can edit system accounts and system properties that are in a content pack created using the OO Workflow Designer and OO Studio.</p>\n</li>\n<li><b>Group aliases</b> - If the content pack includes operations that are assigned to group aliases, rather than actual worker groups, you will need to map these group aliases to actual worker groups. If a group name and alias name are the same, these are mapped automatically by default.</li>\n</ul>\n<p>To access the configuration items, click the <b>Content Management</b> &gt; <b>Configuration Items</b> tab.</p>\n<p>The <b>Configuration Items</b> tab is only visible if you are assigned a role with the <b>Manage Configuration Items</b> or <b>View Configuration Items</b> permission. You will only be able to edit the items if you have a role with the <b>Manage Configuration Items</b> permission.</p>\n<h2 id=\"Assigning_permissions_to_system_account_and_system_properties\">Assigning permissions to system account and system properties</h2>\n<p>Use role permissions to control who can view the system accounts and the system properties of a flow. This feature is useful if you are deploying flows on multiple departments and you want to hide this information from some users.</p>\n<p>The <b>View and Run</b> permission to System Accounts and the <b>View and Run</b> permission to System Properties give users access to:</p>\n<ul>\n<li>view the system accounts/system properties available under <b>Content Management</b> &gt; <b>Configuration Items</b>.</li>\n</ul>\n<p>You can assign permissions for multiple system accounts and system properties at once, by assigning permissions to folders.</p>\n<p>If you don't specify the permissions, the system account and system property inherit the permissions from its nearest parent.</p>\n<p>When you move a system account or a system property with attached permissions, these permissions remain configured. If not, they inherit the permissions from their nearest parent in the new location.</p>\n<h2 id=\"View_information_about_configuration_items\">View information about configuration items</h2>\n<p>The configuration items are displayed in a tree, with icons representing the different types of items.</p>\n<p>Next to the <b>Configuration</b> tree, two columns display the values of the items:</p>\n<ul>\n<li>The <b>Deployed Value</b> column displays the original value of the configuration item from a deployed content pack.</li>\n<li>The <b>Central Value</b> column displays the new value if the original value was overridden in Central.</li>\n</ul>\n<p>When you select an item in the <b>Configuration</b> tree, information about that item appears in the information pane to the right.</p>\n<p>This information includes the ID of the item, the path to the location where the item gets stored in the content pack, a description, information about the content pack, and more.</p>\n<p>For system accounts and system properties, permissions are also displayed. By default, only roles with permissions are displayed. However, you can select the <b>Show all roles</b> check box to display all the roles, including those that don't have permissions for the account.</p>\n<p><b>Deployed Values and Central Values</b></p>\n<p>If you override the value of a configuration item in Central, the <b>Deployed</b> value and the <b>Central</b> value are connected. If you move or rename a configuration item in Studio and deploy it again, the <b>Central</b> value is also moved or renamed.</p>\n<p>If a configuration item gets deleted during deployment, the <b>Central</b> value isn't deleted from the database. It's saved and marked in gray in the OO Central UI. This helps you to avoid losing data. When you deploy the configuration item again, it's connected to the saved <b>Central</b> value.</p>\n<p>A deployed content pack may include system properties with no <b>Deployed</b> value (for example, if it was created using the <b>Set–System-Property</b> operation in OO Studio). You can give these system properties their first value in Central.</p>\n<p><b>Path Uniqueness for Configuration Items</b></p>\n<p>Configuration items must be unique. If you deploy a configuration item in a folder containing a configuration item with the same name, it will either overwrite that item (if they have the same UUID) or fail deployment (if it has a different UUID). However, it's possible to have two configuration items with the same name if they're located in different folders.</p>\n<p>There are limitations to the way that Central enforces path uniqueness:</p>\n<ul>\n<li>OO Central enforces path uniqueness for certain item types only–namely, flows and the specific configuration item types that are supported by the REST API <b>/v1/config-items</b>.</li>\n<li>Paths are case-sensitive in OO Central. This means that OO Central may not detect a conflict between <strong>my item</strong> and <strong>My Item</strong>, for example.</li>\n</ul>\n<p><b>System Accounts in Resumed Flows</b></p>\n<p>When you resume a flow, OO Central fetches the system account configuration from the current system. So if a system account was changed between the time the flow was started and the time it was resumed, OO takes the new system account value.</p>\n<h2 id=\"Display_configuration_items_in_a_content_pack\">Display configuration items in a content pack</h2>\n<ol>\n<li>Click the <b>Content Management</b> button to display the Content Management workspace.</li>\n<li>Select <b>Configuration Items</b>.</li>\n<li>In the Configuration Items tree, expand the folders to look for the item that you need.</li>\n<li>\n<p>(Optional) Enter part or all the configuration item path in the <b>Filter By</b> text box to filter the items.</p>\n<p>For example, if you enter \"network\", only items that contain the word \"network\" or which are located in a path with a folder containing the word \"network\" are displayed. The search isn't case-sensitive.</p>\n</li>\n<li>Select a configuration item or folder and view the information displayed in the pane to the right.</li>\n<li>If required, use the scroll bar to scroll down and view the contents of the <b>Description</b> section.</li>\n<li>\n<p>If required, use the sliders at the edges of the information pane to adjust the width and height of the pane.</p>\n<p><a class=\"image\" href=\"https://staging.docs.microfocus.com/file/images/7/76/24.2_pane_slider.png\" title=\"https://staging.docs.microfocus.com/file/images/7/76/24.2_pane_slider.png\"> <img alt=\"24.2_pane_slider.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/7/76/24.2_pane_slider.png\" height=\"22\" hspace=\"0\" src=\"../../../images/24.2_pane_slider_d2e5bc97.png\" style=\"width:209px;height:22px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"209\"/> </a></p>\n</li>\n<li>For system account and system properties, you can also view the roles that are assigned <b>View and Run</b> permission for the selected folder, account, or property By default, only roles with permissions are displayed. However, you can select the <b>Show all roles</b> check box to display all the roles, including those that don't have permissions for the account or property. To add <b>View and Run</b> permission for a system account or folder, click the <b>Edit</b> <a class=\"image\" href=\"/file/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\" title=\"/file/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\"> <img alt=\"but edit.png\" border=\"0\" data-file-height=\"27\" data-file-width=\"30\" file=\"https://staging.docs.microfocus.com/mediawiki/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\" height=\"20\" hspace=\"0\" src=\"../../../images/but_edit_c8c8b078.png\" style=\"width:22px;height:20px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"22\"/> </a> button.</li>\n</ol>\n<h2 id=\"Add_configuration_items_to_a_content_pack\">Add configuration items to a content pack</h2>\n<p>It'sn't possible to add configuration items to a content pack in OO Central. These should be created in OO Workflow Designer or OO Studio and deployed to OO Central.</p>\n<h2 id=\"Edit_a_system_account_in_a_content_pack\">Edit a system account in a content pack</h2>\n<p>In the OO Central UI, you can edit the <em>system accounts</em> that were created in an OO Workflow Designer or OO Studio content pack.</p>\n<ol>\n<li>Navigate to <b>Content Management &gt; CONFIGURATION ITEMS</b>.</li>\n<li>\n<p>Select the <i>system account</i> that you want to edit, and then click the <b>Edit</b> <a class=\"image\" href=\"/file/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\" title=\"/file/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\"> <img alt=\"but edit.png\" border=\"0\" data-file-height=\"27\" data-file-width=\"30\" file=\"https://staging.docs.microfocus.com/mediawiki/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\" height=\"20\" hspace=\"0\" src=\"../../../images/but_edit_c8c8b078.png\" style=\"width:22px;height:20px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"22\"/> </a> button. The <b>Edit System Account</b> dialog box opens.</p>\n<p>This dialog box will vary depending on the permissions of the currently logged-in user. For example, if the logged-in user isn't entitled to assign permissions, the <b>Permissions</b> section isn't shown in the dialog box.</p>\n<p>The <b>Deployed User Name</b> box displays the system account user name as it appears in the content pack, as defined in Studio.</p>\n</li>\n<li>In the <b>User Name</b> box, enter the Central value for the system account user name. This user name will be mapped to the system account from the content pack, overriding the deployed user name. The user name doesn't have to be identical to the deployed user name.</li>\n<li>In the <b>Password</b> box, enter a password for the user. If the <b>Include system account passwords</b> check box was selected when this content pack was created in Studio, the password is automatically loaded into the <b>Password</b> box.</li>\n<li>Enter the password a second time in the <b>Confirm Password</b> box.</li>\n<li>\n<p>In the <b>Permissions</b> section, select the check box under <b>View and Run</b> for all the roles for which you want to assign permission for this system account.</p>\n<p>Only users with <b>View and Run</b> permission on a system account will be able to view it in the Configuration Items tree or to run or resume flows and operations that use this system account.</p>\n</li>\n<li>Click <b>Save</b>.</li>\n</ol>\n<h2 id=\"Edit_permissions_for_a_system_account_folder\">Edit permissions for a system account folder</h2>\n<p>You can assign permissions to a system account folder, which assigns those permissions to all the system accounts in that folder.</p>\n<ol>\n<li>Click the <b>Content Management</b> button to display the Content Management workspace.</li>\n<li>Select the <b>CONFIGURATION ITEMS</b> tab<b>.</b></li>\n<li>Select a folder in the <strong>Configuration Items</strong> tree, and then click the <b>Edit</b> <a class=\"image\" href=\"/file/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\" title=\"/file/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\"> <img alt=\"but edit.png\" border=\"0\" data-file-height=\"27\" data-file-width=\"30\" file=\"https://staging.docs.microfocus.com/mediawiki/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\" height=\"20\" hspace=\"0\" src=\"../../../images/but_edit_c8c8b078.png\" style=\"width:22px;height:20px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"22\"/> </a> button.</li>\n<li>\n<p>In the <b>Permissions</b> section, select the check box under <b>View and Run</b> for all the roles for which you want to assign permission for the system accounts in this folder.</p>\n<p>Only users with <b>View and Run</b> permission on these system accounts will be able to view them in the Configuration Items tree or to run flows and operations that use these system accounts.</p>\n</li>\n<li>\n<p>Select the <b>Apply to Children</b> check box to apply these changes to all the system accounts in the folder.</p>\n<ul>\n<li>Select <b>All Roles</b> to apply the changes to all roles, including those that haven't been modified.</li>\n<li>Select <b>Modified Roles</b> to apply the changes only to roles that have been modified.</li>\n</ul>\n</li>\n<li>Click <b>Save</b>.</li>\n</ol>\n<h2 id=\"Edit_a_system_property_in_a_content_pack\">Edit a system property in a content pack</h2>\n<p>If a system property was created via API, it's not possible to edit it in the Central UI. You can only edit it via API.</p>\n<p>In the Central UI, you can edit system properties that were created in a Studio content pack.</p>\n<ol>\n<li>Click the <b>Content Management</b> button to display the Content Management workspace.</li>\n<li>Select <b>CONFIGURATION ITEMS</b>.</li>\n<li>\n<p>Select the system property that you want to edit and click the <b>Edit</b> <a class=\"image\" href=\"/file/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\" title=\"/file/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\"> <img alt=\"but edit.png\" border=\"0\" data-file-height=\"27\" data-file-width=\"30\" file=\"https://staging.docs.microfocus.com/mediawiki/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\" height=\"22\" hspace=\"0\" src=\"../../../images/but_edit_c8c8b078.png\" style=\"width:24px;height:22px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"24\"/> </a> button.</p>\n<p>The <b>System Property Details</b> dialog box opens. The information on this dialog box varies depending on the permissions of the currently logged-in user. For example, if the logged-in user isn't entitled to assign permissions, the <b>Permissions</b> section isn't shown in the dialog box.</p>\n<p><a class=\"image\" href=\"https://staging.docs.microfocus.com/file/images/e/e0/24.2_System_Property_details_box.png\" title=\"https://staging.docs.microfocus.com/file/images/e/e0/24.2_System_Property_details_box.png\"> <img alt=\"24.2_System_Property_details_box.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/e/e0/24.2_System_Property_details_box.png\" height=\"327\" hspace=\"0\" src=\"../../../images/24.2_System_Property_details_box_c2f50d91.png\" style=\"width:350px;height:327px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"350\"/> </a></p>\n</li>\n<li>In the <b>Override Value</b> box, enter a new value for the system property.</li>\n<li>\n<p>In the <b>Permissions</b> section, select the check box under <b>View and Run</b> for all the roles for which you want to assign permission for the system properties in this folder.</p>\n<p>Only users with <b>View and Run</b> permission on these system properties will be able to view them in the <strong>Configuration Items</strong> tree or to run flows and operations that use these system properties.</p>\n</li>\n<li>Click <b>Save</b>.</li>\n</ol>\n<h2 id=\"Assign_a_worker_group_to_a_worker_group_alias\">Assign a worker group to a worker group alias</h2>\n<ol>\n<li>Click the <b>Content Management</b> button to display the Content Management workspace.</li>\n<li>Select <b>CONFIGURATION ITEMS</b>.</li>\n<li>\n<p>Select the worker group alias that you want to edit and click the <b>Edit</b> <a class=\"image\" href=\"/file/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\" title=\"/file/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\"> <img alt=\"but edit.png\" border=\"0\" data-file-height=\"27\" data-file-width=\"30\" file=\"https://staging.docs.microfocus.com/mediawiki/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\" height=\"22\" hspace=\"0\" src=\"../../../images/but_edit_c8c8b078.png\" style=\"width:24px;height:22px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"24\"/> </a>  button.</p>\n<p>The <strong>Group Alias Details</strong> dialog box opens.</p>\n<p><a class=\"image\" href=\"https://staging.docs.microfocus.com/file/images/7/70/24.2_Group_Alias_Details_box.png\" title=\"https://staging.docs.microfocus.com/file/images/7/70/24.2_Group_Alias_Details_box.png\"> <img alt=\"24.2_Group_Alias_Details_box.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/7/70/24.2_Group_Alias_Details_box.png\" height=\"127\" hspace=\"0\" src=\"../../../images/24.2_Group_Alias_Details_box_2210e488.png\" style=\"width:350px;height:127px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"350\"/> </a></p>\n<p>The <b>Alias Name</b> box displays the name of the alias that was used in the operations.</p>\n</li>\n<li>From the <b>Worker Group Name</b> list, select the worker group to which you want to map this group alias.</li>\n<li>Click <b>Save</b>. If you want to map the group alias to a group that doesn't exist yet, go to <b>System Configuration</b> &gt; <b>Topology</b> &gt; <b>Workers</b>,<b> </b>create a new group, and then return to this task to do the mapping.</li>\n</ol>\n<h2 id=\"Revert_configuration_items_to_their_original_value\">Revert configuration items to their original value</h2>\n<p>If someone has changed the value of a configuration item that was in the content pack at the time of deployment, you can revert it to the original value.</p>\n<ol>\n<li>Select the item and click the <b>Revert</b> <a class=\"image\" href=\"/file/images/1/1c/2018.02/Resources/Images/Central/but_reset.png\" title=\"/file/images/1/1c/2018.02/Resources/Images/Central/but_reset.png\"> <img alt=\"but reset.png\" border=\"1\" data-file-height=\"31\" data-file-width=\"27\" file=\"https://staging.docs.microfocus.com/mediawiki/images/1/1c/2018.02/Resources/Images/Central/but_reset.png\" height=\"22\" hspace=\"0\" src=\"../../../images/but_reset_77d2dd8f.png\" style=\"width:19px;height:22px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:1px solid black;\" vspace=\"0\" width=\"19\"/> </a> button.</li>\n<li>Click <b>Yes</b> in the confirmation dialog box.</li>\n</ol>\n<h2 id=\"Delete_configuration_items_in_a_content_pack\">Delete configuration items in a content pack</h2>\n<p>It's possible to delete configuration items that have an OO Central value but not a Deployed value. </p>\n<p>It isn't possible to delete a configuration item that's part of a content pack that's currently deployed to OO Central.</p>\n<ol>\n<li>Click the <b>Content Management</b> button to display the Content Management workspace.</li>\n<li>Select <b>Configuration Items</b>.</li>\n<li>Select the configuration item that you want to delete and click the <b>Delete</b> <a class=\"image\" href=\"https://staging.docs.microfocus.com/file/images/6/6c/24.1.1_DeleteRAS.png\" title=\"https://staging.docs.microfocus.com/file/images/6/6c/24.1.1_DeleteRAS.png\"> <img alt=\"24.1.1_DeleteRAS.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/6/6c/24.1.1_DeleteRAS.png\" height=\"20\" hspace=\"0\" src=\"../../../images/24.1.1_DeleteRAS_91e818fd.png\" style=\"width:20px;height:20px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"20\"/> </a>  button.</li>\n<li>Click <b>Yes</b> in the confirmation dialog box.</li>\n</ol>\n<h2 id=\"Reference_material\">Reference material</h2>\n<h3 id=\"Configuration_Items_tree\">Configuration Items tree</h3>\n<table>\n<tbody>\n<tr>\n<th>GUI item</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Name</td>\n<td>Displays the name of the configuration item as it appears in the content pack.</td>\n</tr>\n<tr>\n<td>Deployed Value</td>\n<td>Displays the original value as deployed to Central.</td>\n</tr>\n<tr>\n<td>Central Value</td>\n<td>Displays the new value, which overrides the original value.</td>\n</tr>\n<tr>\n<td>\n<p>Edit <span style=\"background-color: transparent;\">button </span> <a class=\"image\" href=\"/file/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\" title=\"/file/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\"> <img alt=\"but edit.png\" border=\"0\" data-file-height=\"27\" data-file-width=\"30\" file=\"https://staging.docs.microfocus.com/mediawiki/images/2/2b/2018.02/Resources/Images/Central/but_edit.png\" height=\"22\" hspace=\"0\" src=\"../../../images/but_edit_c8c8b078.png\" style=\"width:24px;height:22px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"24\"/> </a></p>\n</td>\n<td>Depending on which configuration item is selected, opens the relevant dialog box so that you can edit the configuration item.</td>\n</tr>\n<tr>\n<td>Revert button</td>\n<td>Reverts the selected configuration item to its original deployed value, which was overridden in Central.</td>\n</tr>\n<tr>\n<td>Delete button  <a class=\"image\" href=\"https://staging.docs.microfocus.com/file/images/6/6c/24.1.1_DeleteRAS.png\" title=\"https://staging.docs.microfocus.com/file/images/6/6c/24.1.1_DeleteRAS.png\"> <img alt=\"24.1.1_DeleteRAS.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/6/6c/24.1.1_DeleteRAS.png\" height=\"20\" hspace=\"0\" src=\"../../../images/24.1.1_DeleteRAS_91e818fd.png\" style=\"width:20px;height:20px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"20\"/> </a></td>\n<td>\n<p>Deletes the selected configuration item.</p>\n<p>It's possible to delete configuration items that have a <b>Central</b> value but not a <b>Deployed</b> value.</p>\n<p>It isn't possible to delete a configuration item that's part of a content pack that's deployed to Central.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"Edit_System_Account_dialog_box\">Edit System Account dialog box</h3>\n<p>The <strong>Edit System Account</strong> dialog box will vary depending on the permissions of the currently logged-in user. For example, if the logged-in user isn't entitled to assign permissions, the <em>Permissions</em> section isn't shown in the dialog box.</p>\n<table>\n<tbody>\n<tr>\n<th>GUI item</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Path</td>\n<td>Displays the path where the system account is located.</td>\n</tr>\n<tr>\n<td>Deployed User Name</td>\n<td>Displays the user name of the system account, as defined in the content pack.</td>\n</tr>\n<tr>\n<td>User Name</td>\n<td>Enter the Central value for the system account user name. This user name will be mapped to the system account from the content pack, overriding the deployed user name.</td>\n</tr>\n<tr>\n<td>Password</td>\n<td>\n<p>Enter the password for the user name. If the <b>Include system account passwords</b> check box was selected when this content pack was created in OO Workflow Designer or OO Studio, the password is automatically loaded into the <b>Password</b> box. You can change this value.</p>\n</td>\n</tr>\n<tr>\n<td>Confirm Password</td>\n<td>Enter the password a second time, for confirmation.</td>\n</tr>\n<tr>\n<td>View and Run</td>\n<td>\n<p>Select the check box under <b>View and Run</b> for all the roles for which you want to assign permission for this system account.</p>\n<p>Only users with <b>View and Run</b> permission on a system account will be able to view it in the Configuration Items tree or to run flows and operations that use this system account.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"Edit_System_Account_dialog_box_-_Folder\">Edit System Account dialog box - Folder</h3>\n<table>\n<tbody>\n<tr>\n<th>GUI item</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>View and Run</td>\n<td>\n<p>Select the check box under <b>View and Run</b> for all the roles for which you want to assign permission for the system accounts in this folder.</p>\n<p>Only users with <b>View and Run</b> permission on these system accounts will be able to view them in the Configuration Items tree or to run flows and operations that use these system accounts.</p>\n</td>\n</tr>\n<tr>\n<td>Apply to Children: All Roles</td>\n<td>Select the <b>Apply to Children</b> check box and the <b>All Roles</b> option to apply these changes to all the system accounts in the folder, for all roles, including those that haven't been modified.</td>\n</tr>\n<tr>\n<td>Apply to Children: Modified Roles</td>\n<td>Select the <b>Apply to Children</b> check box and the <b>Modified Roles</b> option to apply these changes to all the system accounts in the folder, but only for roles that have been modified.</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"System_Property_Details_dialog_box\">System Property Details dialog box</h3>\n<table>\n<tbody>\n<tr>\n<th>GUI item</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Name</td>\n<td>Displays the name of the system property, as defined in the content pack.</td>\n</tr>\n<tr>\n<td>Deployed Value</td>\n<td>If the system property had an original value in the deployed content pack, displays that value.</td>\n</tr>\n<tr>\n<td>Override Value</td>\n<td>Enter a value for the system property. If the system property had an original value in the deployed content pack, this value will override it.</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"Group_Alias_Details_dialog_box\">Group Alias Details dialog box</h3>\n<table>\n<tbody>\n<tr>\n<th>GUI item</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Alias Name</td>\n<td>Displays the name of the group alias as it appears in the content pack.</td>\n</tr>\n<tr>\n<td>Worker Group Name</td>\n<td>Select the worker group to which you want to map this group alias.</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"Related_topics\">Related topics</h2>\n<ul>\n<li>For an overview of promoting content pack, see <a href=\"/doc/423/26.1/promotecpsteps\" title=\"SMAX:25.1/PromoteCPSteps\">Overview of promoting content pack</a>.</li>\n<li>To deploy and manage content packs, see <a href=\"/doc/423/26.1/deploymanageoocp\" title=\"SMAX:25.1/DeployManageCP\">Deploy and manage content packs</a>.</li>\n<li>To manage a flow library, see <a href=\"/doc/423/26.1/manageooflowlibrary\" title=\"SMAX:25.1/ManageFlowLibrary\">Manage the flow library</a>.</li>\n<li>For more information about creating worker groups, see <a href=\"/doc/423/26.1/setupooworkers\" title=\"SMAX:25.1/SetupWorkers\">Set up topology for workers and RASes</a>.</li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}