{
  "title": "How to set up automatic synchronization with UCMDB through OPB",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>In automatic synchronization mode, you need to create an endpoint in Service Management and start the synchronization process, and then the agent pulls data from UCMDB to Service Management automatically. In this mode, you have little control of the synchronization process and schedule.</p>\n<ol>\n<li>After the endpoint is created, click <b>Sync Now</b>.<br/>\n\tAn integration point named <b>ucmdb_&lt;TENANT ID&gt;</b> is automatically created in UCMDB. The latest data in the staging area is synchronized to Service Management. The data is pushed to the staging area by a push job which runs according to the scheduler in UCMDB, the default for which is set at every hour. <br/>\n\tIn UCMDB, the push adapter that's deployed has a name of <b>&lt;Tenant ID&gt;_SACMPushAdapter</b> and the integration point that's created has a name of <b>&lt;Endpoint name&gt;_&lt;Tenant ID&gt;</b>.<br/>\n\tFor subsequent, on-demand, synchronizations:\n\t<ul>\n<li>To get the latest changed UCMDB data,  run a delta synchronization job in UCMDB to push the changed data to the staging area, and then click <b>Sync Now</b> to synchronize the latest data in the staging area to Service Management.</li>\n<li>To get all latest UCMDB data, click <b>Request Full Sync</b> to trigger a full synchronization job in UCMDB and push the data to the staging area, and then click <b>Sync Now</b> to synchronize the latest data in the staging area to Service Management.<br/>\n\t\tYou can see a record of the data pushed in the <b>fcmdb.push.all.log</b> file in the <b>&lt;DataFlowProbe&gt;\\runtime\\log</b> folder.</li>\n</ul>\n</li>\n<li>View broken relationships.<br/>\n\tA broken relationship occurs when the relationship was synchronized before data about one or both of its ends was available. The relationship is automatically synchronized to Service Management, once the missing data arrives.<br/>\n\tTo view the broken relationships from your synchronization, follow these steps:\n\t<ol>\n<li>On the <b>Endpoints</b> tab, select the endpoint used in your synchronization.</li>\n<li>Click <b>More &gt; View broken relationships</b>. The table displays the broken relationships.</li>\n<li>If you don't expect a relationship to be synchronized, you can dismiss it. Select the relationships to dismiss and click <b>Dismiss from list</b>.</li>\n<li>To view details about a broken relationship, click the <b>Show details</b> link in the <b>Details</b> column.</li>\n</ol>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Error_on_first_synchronization_from_Service_Management\">Error on first synchronization from Service Management</h2>\n<p>For troubleshooting information, see <a href=\"/doc/423/26.1/troubleshooterrorsyncucmdb\" title=\"SMAX:25.1/TroubleshootErrorSyncUCMDB\">Error on first synchronization from Service Management</a>.</p>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}