{
  "title": "Suite Administration for shared service providers",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Shared service providers can use Suite Administration to set up a multi-tenant (MT) environment to manage their business units' and clients' request and incident records in one user interface via an MT console. Each business unit and client can use its own tenant while the MT console displays all data together in one consolidated view.</p>\n<h2 class=\"mw-headline\" id=\"Set_up_MT_environment\">Set up MT environment</h2>\n<p>To set up the MT environment, complete the following tasks as a <b>suite admin</b> user or a <b>shared service admin</b> user:</p>\n<h3 class=\"mw-headline\" id=\"Prepare_provider_tenants\">Prepare provider tenants</h3>\n<p>Prepare a provider tenant with these steps:</p>\n<ol>\n<li>Create an account of <b>Shared service type</b> being <b>Provider</b>. This account hosts the shared service admin users and agents.</li>\n<li>Add users to the provider account. Four roles are available for users, among which:\n\t<ul>\n<li><b>Shared service admin</b> users are assigned with <b>MT Administrator</b> role in Service Management automatically.</li>\n<li><b>Shared service agents</b> are assigned with <b>MT Agent</b> role in Service Management automatically.</li>\n</ul>\n</li>\n<li>Create a provider tenant under the created provider account, and then assign a license and deploy the tenant.</li>\n</ol>\n<h3 class=\"mw-headline\" id=\"Prepare_managed_tenants\">Prepare managed tenants</h3>\n<p>Prepare a managed tenant with these steps:</p>\n<ol>\n<li>Create an account of <b>Shared service type</b> being <b>Managed</b>.</li>\n<li>Add users to the managed account.</li>\n<li>Create a managed tenant under the created managed account, and then assign a license and deploy the tenant.</li>\n</ol>\n<h3 class=\"mw-headline\" id=\"Add_managed_tenants_to_provider_tenants\">Add managed tenants to provider tenants</h3>\n<p>After the provider tenant and managed tenant are created and deployed, go back to the provider tenant, click <b>Shared service </b>tab, and add managed tenant and shared service users to the provider tenant.<br/>\n<br/>\n<b>Note</b> Updates of the managed tenants and shared service users in <b>Suite Administration</b> are synchronized to <b>Service Management</b> in one direction.</p>\n<ul>\n<li>In the <b>Managed tenant</b> panel, click <b>Add</b> to add a managed tenant.<br/>\n<br/>\n\tTo remove a selected managed tenant, click the right arrow on the tenant and then click <b>Remove</b>.<br/>\n\t </li>\n<li>In the <b>User access</b> panel, click <b>Add</b> to add users with shared service admin and shared service agent roles to access the data of the selected managed tenant.\n\t<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> If the shared service admin and shared service agent need to access Suite Administration, the suite admin must first create an Access Control List (ACL) to grant data access to a shared service user before the shared service agent can be assigned to a managed tenant. For more information, see <a href=\"/doc/423/26.1/accesscontrol\" title=\"SMAX:25.1/AccessControl\">Access control</a>.</p>\n</div>\n<p>Two types of data are accessible for users: Incident and Request. The users having access to Incident data are assigned with <b>Incident Manager</b> role in Service Management automatically. The users having access to Request data are assigned with <b>Service Request Manager</b> role in Service Management automatically.<br/>\n<br/>\n\tTo edit the permission granted to a user, click the down arrow on the user and then click <b>Grant permission</b>.</p>\n<p>To remove a selected user, click the down arrow on the user and then click <b>Remove</b>.</p>\n</li>\n</ul>\n<p>Now the MT environment configuration is done and the MT Console is ready for use. For detailed instructions on how to use MT Console, see <a href=\"/doc/423/26.1/mtconsole\" title=\"SMAX:25.1/MTConsole\">MT console for shared providers</a>.</p>\n<h2 class=\"mw-headline\" id=\"Roles_and_permissions_for_provider_and_managed_tenants\">Roles and permissions for provider and managed tenants</h2>\n<p>Any shared service users accessing records in managed tenants are added as users with appropriate roles in the managed tenants automatically.</p>\n<table>\n<tbody>\n<tr>\n<th>Service Management tenant </th>\n<th>Roles in Service Management</th>\n<th>Applied to</th>\n</tr>\n<tr>\n<td rowspan=\"2\">Provider tenant</td>\n<td><b>MT Administrator</b></td>\n<td>Admin only. Users with this role can add MT agent to the managed tenants.</td>\n</tr>\n<tr>\n<td><b>MT Agent</b></td>\n<td>All users who access managed tenant records.</td>\n</tr>\n<tr>\n<td rowspan=\"2\">Managed tenant</td>\n<td><b>Service Request Manager</b> (recommended)</td>\n<td>\n<p>All users who access request data of this managed tenant.</p>\n<p>If this role isn't assigned, then applicable view and/or edit permissions on requests and all related record types (such as person, group, service) must be assigned to these users.</p>\n</td>\n</tr>\n<tr>\n<td><b>Incident Manager</b> (recommended)</td>\n<td>\n<p>All users who access incident data of this managed tenant.</p>\n<p>If this role isn't assigned, then applicable view and/or edit permissions on incidents and all related record types (such as person, group, service) must be assigned to these users.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"mw-headline\">Limitations</h2>\n<p>In multi-tenant (MT) environments, when you have two tabs for two different tenants open in the same browser and log in with the same shared service user, if you operate a request for tenant A and then go to the other tab for tenant B, when you:</p>\n<ul>\n<li>Open a link of tenant B in a new window</li>\n<li>Open a link of tenant B from the bookmark</li>\n<li>Open a link of tenant B from the UI components other than the grid, for example, from the preview card when you hover over a field</li>\n<li>Open a link that goes to an external system, for example, to HCMX </li>\n</ul>\n<p>The tenant ID in the URL changes to the ID of tenant A and the <code>Page not found</code> error occurs. In such cases, you need to manually change the ID back to the tenant ID of tenant B in the URL.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/createaccount\" title=\"SMAX:25.1/CreateAccount\">Create an account</a></li>\n<li><a href=\"/doc/423/26.1/createuser\" title=\"SMAX:25.1/CreateUser\">Create a user</a></li>\n<li><a href=\"/doc/423/26.1/createtenant\" title=\"SMAX:25.1/CreateTenant\">Create and edit a tenant</a></li>\n<li><a href=\"/doc/423/26.1/accesscontrol\" title=\"SMAX:25.1/AccessControl\">Access control</a></li>\n<li><a href=\"/doc/423/26.1/mtconsole\" title=\"SMAX:25.1/MTConsole\">MT console for shared providers</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}