{
  "title": "Service Level Management elements",
  "content": "<div class=\"mw-parser-output\">\n<div></div>\n<p>This chapter gives an overview about the different elements used in the SLM module to successfully create and maintain the various agreements.</p>\n<h2 class=\"mw-headline\" id=\"Agreements\"><a id=\"Agreements\" name=\"Agreements\" title=\"Agreements\"></a>Agreements</h2>\n<p>Agreements (Service, Support, and HR) come in two types. A Service Level Agreement (SLA) is an external document that describes the agreed level of service between service providers and customers. It defines service goals and responsibilities for Configuration Items (CIs). An Operational Level Agreement (OLA) is an internal document that describes the level of service among the departments within an organization.</p>\n<h2 class=\"mw-headline\" id=\"Service_Level_Target_Set\"><a id=\"Service_Level_Target_Set\" name=\"Service_Level_Target_Set\" title=\"Service Level Target Set\"></a>Service Level Target Set</h2>\n<p>A Service Level Target is a measurable commitment to provide service. A Service Level Agreement or Operational Level Agreement describes the details of the commitment. A Service Level Target set is described by the type of target and associated Service Management module. The following table explains the available target types, which can be used within a Service Level Target.</p>\n<table>\n<tbody>\n<tr>\n<th>Target type</th>\n<th>Description</th>\n<th>Designed for record types</th>\n</tr>\n<tr>\n<td>Initial review</td>\n<td>Defines how much time can elapse before the Service Desk categorizes and assigns a record to an individual or a group.</td>\n<td>Incidents, Support Requests, Case Requests, and HR Requests</td>\n</tr>\n<tr>\n<td>Resolution</td>\n<td>Describes how long the Service Desk has to resolve the record.</td>\n<td>Incidents, Problems, Support Requests, Case Requests, and HR Requests</td>\n</tr>\n<tr>\n<td>Chat request response</td>\n<td>Defines how much time can elapse from the time a chat request is initiated until an agent responds to the request. This target type is relevant for request records only.</td>\n<td>Requests</td>\n</tr>\n<tr>\n<td>Approval</td>\n<td>Defines how long it takes for the record to be approved.</td>\n<td>Service Requests</td>\n</tr>\n<tr>\n<td>Fulfillment</td>\n<td>Defines how long it takes for the record to be fulfilled.</td>\n<td>Service Requests and HR Requests</td>\n</tr>\n<tr>\n<td>Classification</td>\n<td>Defines how long it takes for the Change record to be classified.</td>\n<td>Changes and Problems</td>\n</tr>\n<tr>\n<td>Planning</td>\n<td>Defines how long it takes for the Change record to be planned.</td>\n<td>Changes</td>\n</tr>\n<tr>\n<td>Deployment</td>\n<td>Defines how long it takes for the Change record to be deployed.</td>\n<td>Changes</td>\n</tr>\n<tr>\n<td>Validation</td>\n<td>Defines how long it takes for the Change record to be validated.</td>\n<td>Changes and Problems</td>\n</tr>\n<tr>\n<td>Completion</td>\n<td>Defines how long it takes for the Task record to be completed.</td>\n<td>Tasks</td>\n</tr>\n<tr>\n<td>Time in Group</td>\n<td>Defines how long the record can be in the Assignment group.</td>\n<td>Incidents, Requests, Tasks, Problems, and Changes</td>\n</tr>\n</tbody>\n</table>\n<p><strong>Note:</strong></p>\n<ul>\n<li>For the customized record types created in Studio, you can select the available target types as required.</li>\n<li>The <strong>Designed for these record types</strong> column lists the record types for which a certain OOTB target type is designed. However, they can be used for any record types where appropriate.  </li>\n<li>You can also create custom target types through the <a href=\"/doc/423/26.1/addsltset#Manage_custom_target_types\" title=\"Target type list\">Target type list</a>.</li>\n<li>For target sets that aren't created through the user interface, make sure the target type of the corresponding target set module is correct. Especially, it must be Time in Group for OLA.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Service_Level_Target_Definitions\"><a id=\"Service_Level_Target_Definitions\" name=\"Service_Level_Target_Definitions\" title=\"Service Level Target Definitions\"></a>Service Level Target Definitions</h2>\n<p>A Service Level Target Definition (SLTD) is a sub-element of a Service Level target set. This element gives the possibility to define for each Target type the agreed response time to support the linked SLA or OLA.</p>\n<p>By default, there are four priorities for each target type: Critical, High, Medium and Low. Apart from these four, you can also define customized priorities through <strong>Lists</strong> &gt; <strong>SawPriority</strong>.</p>\n<p>Before editing the SLTD records, you can:</p>\n<ul>\n<li>Group the targets of all the priorities into a single target for definition</li>\n<li>Split the target type into separate targets with different priority for definition</li>\n</ul>\n<p><strong>Note:</strong></p>\n<ul>\n<li>There is no default priority for a target definition, if the priority of a record is empty, the target status will be displayed as <strong>Not defined</strong>.</li>\n<li>If you remove the priority field value for a custom record type in SLT settings, these records' target type will be displayed as <strong>Not defined</strong>.</li>\n<li>If the priority field is not configured for a custom record type in SLT settings:\n\t<ul>\n<li>When you create a record of this type and then add the priority field, the record’s target type is displayed as <strong>Not defined</strong>.</li>\n<li>If you want to start the SLT calculation, you can configure a business rule in Studio to set a default value for the priority field. </li>\n</ul>\n</li>\n</ul>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}