{
  "title": "Service Level Target status and history",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>You can measure service availability with performance objectives, or <i>targets</i>. If you agree on availability standards, and the organization fails to meet them, the performance targets are <i>breached</i>. A breach occurs when a reasonable amount of time to complete the objective is defined, but the record has not moved to the next state when that amount of time has passed.</div>\n<h2 class=\"mw-headline\" id=\"Service_Level_Target_status\">Service Level Target status</h2>\n<p>The Service Level Targets section of any record with a linked target shows a table of achievement and status data.</p>\n<p><b>Next target time</b>. This field shows a value as long as there is a target with an <b>Active</b> status.</p>\n<p><b>Example:</b> If a Service Level Target with <b>Active</b> status passes the target date, its status changes to <b>Breached</b>. The <b>Next target time</b> isn't updated.</p>\n<p><b>Example</b>: If a Service Level Target with Active Status is suspended, the <b>Next target time</b> changes to one of the following values:</p>\n<ul>\n<li>The next target date that's active.</li>\n<li>Blank if there are no other targets.</li>\n</ul>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Name</td>\n<td>The related Service Level Target definition</td>\n</tr>\n<tr>\n<td>Status</td>\n<td>\n<p>The current status of the Service Level Target.</p>\n<ul>\n<li>\n<p><b>Not defined</b>: No target definition or default Service Level Agreement was defined.</p>\n</li>\n<li>\n<p><b>Not started</b>: A target was defined but the workflow has not triggered the start target rule yet.<br/>\n<b style=\"background-color: transparent;\">Example:</b><span style=\"background-color: transparent;\"> A Chat request target was defined, but the user has not yet submitted a chat request.</span></p>\n</li>\n<li>\n<p><b>Active</b>. The allowable time interval for the target has not yet expired.<br/>\n<b style=\"background-color: transparent;\">Example:</b><span style=\"background-color: transparent;\"> The current incident isn't categorized but two hours remain before the Initial Review target is breached.</span></p>\n</li>\n<li>\n<p><b>Suspended</b>: The Service Desk Agent suspends an active target type to stop the calculation time.<br/>\n<b style=\"background-color: transparent;\">Example:</b><span style=\"background-color: transparent;\"> The Service Desk Agent requests more information from the customer. He suspends the incident until he receives a response. This action suspends Service Level Target calculations until the incident becomes active again. The </span><b style=\"background-color: transparent;\">Next target time</b><span style=\"background-color: transparent;\"> is blank until the record is active.</span></p>\n</li>\n<li>\n<p><b>Achieved</b>. An achieved target met the stated objectives of the target definition.<br/>\n<b style=\"background-color: transparent;\">Example:</b><span style=\"background-color: transparent;\"> The Initial Review target states that all incidents will be categorized within two hours of the time an issue is reported. The current incident moved from Categorize to Assign 45 minutes after it was logged. The target objective was met.</span></p>\n</li>\n<li>\n<p><b>Breached</b>. The target time expired before the objective was met. Service Management uses an internal clock to measure the next target and uses the information to determine target status.<br/>\n\t\t\t\tEven though a target is breached, the Service Level Target calculation is active until there is a business rule in the workflow to stop the internal calculation. The clock continues to measure elapsed time from when the Start SLT rule began the calculation.<br/>\n<b>Example:</b> The current incident was not reviewed before the allowable initial review time expired, but the clock is still calculating elapsed time.</p>\n</li>\n<li>\n<p><b>Failed</b>: The workflow was completed and the target time expired before either objective was met. All calculations stopped.<br/>\n<b>Example:</b> The current incident was not reviewed before the allowable initial review time expired. When it was assigned later, the initial review calculation stopped.</p>\n</li>\n</ul>\n<p>If there is no active target, this field is blank. If the priority is not set, the status is Not Defined.</p>\n</td>\n</tr>\n<tr>\n<td>Overall status</td>\n<td>\n<p>The <strong>Overall status</strong> aggregates the individual SLT statuses. Specifically, the <strong>Overall status</strong> is determined by the pattern below. </p>\n<ul>\n<li>If any of the statuses is \"Failed,\" the <strong>Overall status</strong> is \"Failed.\"</li>\n<li>If the above is not true and any of the statuses is \"Breached\", the <strong>Overall status</strong> is \"Breached.\"</li>\n<li>If none of the above are true and any of the statuses is \"Active,\" the <strong>Overall status</strong> is \"Active.\"</li>\n<li>If none of the above are true and any of the statuses is \"Suspended,\" the <strong>Overall status</strong> is \"Suspended.\"</li>\n<li>If none of the above are true and any of the statuses is \"Achieved,\" the <strong>Overall status</strong> is \"Achieved.\"</li>\n<li>If none of the above are true, the <strong>Overall status</strong> is empty.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Target Date / Achievement Date</td>\n<td>\n<p>The related dates.</p>\n<p>The target date is cleared when the record reaches <b>Suspended</b>, <b>Achieved</b>, or <b>Failed</b> status.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p>The Service Level Target statuses are illustrated as follows. All status and date values are recalculated once a minute.</p>\n<p><a class=\"image\" href=\"https://staging.docs.microfocus.com/file/images/b/b2/SltReOpenRecord.png\" title=\"https://staging.docs.microfocus.com/file/images/b/b2/SltReOpenRecord.png\"> <img alt=\"SltReOpenRecord.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/b/b2/SltReOpenRecord.png\" height=\"268\" hspace=\"0\" src=\"../../../images/SltReOpenRecord_6d405cce.png\" style=\"width: 800px; height: 268px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></p>\n<p><span style=\"color: rgb(0, 115, 231); font-family: Roboto, sans-serif; font-size: 24px;\">Service Level Target history</span></p>\n<p>You can click the <b>Show SLT history</b> button in the SLTs tab to open the SLT history dialog box, which displays all SLT operations and statuses recorded for all of the targets.</p>\n<p>The following table displays the operations types displayed in the history, along with the use-cases for each operation:</p>\n<table>\n<tbody>\n<tr>\n<th>Operation type</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Started</td>\n<td>\n<p>The duration is started as a result of the SLT operation rule. By default, it can be one of the following causes:</p>\n<ul>\n<li>A new ticket was opened (the workflow runs automatically)</li>\n<li>A ticket was resumed after suspension</li>\n<li>The service or priority of a ticket was changed</li>\n<li>A request ticket was changed from a service request to a support request</li>\n<li>A chat request was submitted</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Started by work schedule</td>\n<td>The duration is started according to the defined work schedule.</td>\n</tr>\n<tr>\n<td>Suspended</td>\n<td>The duration is suspended as a result of the SLT operation rule. By default, it can be a manual or automatic change in the target status.</td>\n</tr>\n<tr>\n<td>Paused by work schedule</td>\n<td>The duration is paused according to the defined work schedule.</td>\n</tr>\n<tr>\n<td>Stopped</td>\n<td>The duration is ended as a result of the SLT operation rule.</td>\n</tr>\n<tr>\n<td>Reconfigured</td>\n<td>The target is reconfigured due to manual changes made to the duration, time zone, or work schedule of the target definition.</td>\n</tr>\n<tr>\n<td>Ticket updated</td>\n<td>The ticket is updated due to manual changes made to the Impact field or the Data Domain field.</td>\n</tr>\n</tbody>\n</table>\n<p>The table in the SLT history dialog box may aggregate operations that occurred within one minute into a single operation. Only the last operation of the aggregated operations appears in the list.</p>\n<p><strong>Note:</strong> After you switch the process, for example, from Support Request to Service Request, the target type data of the previous agreement will be saved in the history instead of being displayed in the targets table.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/slmlearnmore\" title=\"SMAX:25.1/slmLearnMore\">Learn more about Service Level Management</a></li>\n<li><a href=\"/doc/423/26.1/slmitilprocess\" title=\"SMAX:25.1/slmITILProcess\">Service Level Management ITIL process</a></li>\n<li><a href=\"/doc/423/26.1/sltduration\" title=\"SMAX:25.1/SLTduration\">Service Level Target duration</a></li>\n<li><a href=\"/doc/423/26.1/sltcalculations\" title=\"SMAX:25.1/SLTcalculations\">Service Level Target calculations</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}