{
  "title": "Collecting Environment Information",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><h2 id=\"Collect_customer_Service_Manager_environment_information\">Collecting existing Service Manager environment information</h2>\n<p>A thorough investigation of the existing Service Manager environment and workflows improve the overall Evolving to Service Management experience. It is important to remember that this is an evolution and not a copy of the existing product. Understanding both the current processes as well as the new ones in Service Management is essential in the transformation to the new application.</p>\n<p>The following checklist will guide the administrator in gathering the environmental, configuration, integration, and other data that will help determine the best path to the new Service Management installation.</p>\n<h3></h3>\n<h3><strong>☐ </strong><strong>Collect Service Manager details</strong></h3>\n<blockquote>\n<p><strong>Service Manager version information:</strong></p>\n<ul>\n<li>What are the Runtime Environment and Application versions?</li>\n<li>Is the current SM implementation using Process Designer? This is important, as it will trigger different paths during the data migration.</li>\n</ul>\n<p><strong>Modules in use:</strong></p>\n<ul>\n<li>Which modules are in use? How are they used? Are any used in unexpected or non-standard ways?</li>\n</ul>\n<p><strong>Level of customization:</strong></p>\n<ul>\n<li>How much tailoring has been performed? Evolution planning will differ based on how far the current implementation has digressed from out-of-the-box (OOB) Service Manager.\n\t<ul>\n<li>If the system is close to OOB:\n\t\t<ul>\n<li>Focus on differences in the Service Manager and Service Management flows and what customizations absolutely must move to Service Management.</li>\n</ul>\n</li>\n<li>If the system is far away from OOB:\n\t\t<ul>\n<li>Determine whether a best practice OOB implementation in Service Management is acceptable and/or necessary. If additional configuration is required to implement necessary requirements, determine the possible effects to the project cost, timeline, and future upgrades.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p><strong>Service Manager Instances:</strong><br/>\nTypical Service Manager environments are split into DEV, TEST and Production systems. Investigate the current development lifecycle and highlight possible differences in the development lifecycle when using Service Management. The Service Management Dev2Prod/Package Manager utility may involve changes in the current process. Information on the Dev2Prod utility may be found here: <a href=\"/doc/423/26.1/dev2prod\" rel=\"noreferrer\" target=\"_blank\" title=\"Dev2Prod Utility\">Dev2Prod Utility</a><br/>\n<br/>\n<strong>Used/Supported Languages:</strong><br/>\nIdentify which languages are actively used in Service Manager and ensure they exist in the Service Management supported language list. In case a language is not currently supported, proactively determine available options (and the amount of work needed to add a new language to Service Management if necessary).</p>\n</blockquote>\n<h3><strong>☐ </strong><strong>Review data/transaction volume and peak usage</strong></h3>\n<blockquote>\n<p>Collect information on all SM data volumes to properly size the future Service Management instance. It is important to understand the following details about the existing Service Manager system:</p>\n<ul>\n<li>number of concurrent users during different times of the day; incl. Peak Usage numbers</li>\n<li>number of Requests / Incidents / Changes etc. per month</li>\n<li>total number of Requests / Incidents / Changes etc.</li>\n<li>average attachment size and number of attachments</li>\n<li>the systems current Service / CI details (numbers, levels)</li>\n</ul>\n<p>Further details will help determine the best strategy for migrating the Service Manager master data:</p>\n<ul>\n<li>How many categories (across all levels) exist in the system?</li>\n<li>How many groups?</li>\n<li>How many contacts?</li>\n<li>How many locations and departments?</li>\n</ul>\n<p>If there are high numbers in any of these areas, review each individually to determine if cleanup prior moving them to Service Management would benefit the migration effort.</p>\n</blockquote>\n<h3><strong>☐ </strong><strong>Review license type and count</strong></h3>\n<blockquote>\n<p>Ensure the system has the correct license to move to Service Management. A classic Service Manager license will not entitle use of Service Management. For more information, contact your corresponding Sales Representative.</p>\n</blockquote>\n<h3><strong>☐ </strong><strong>Plan the infrastructure setup</strong></h3>\n<blockquote>\n<p>It is important to capture the current infrastructure setup and discover any potential differences in the infrastructure setup when moving to Service Management. <br/>\n<br/>\nImportant areas to investigate include:</p>\n<ul>\n<li>database requirements (Service Management only supports PostGresSQL)</li>\n<li>Operating systems requirements (Windows is currently not supported)</li>\n<li>high availability requrirements</li>\n<li>disaster recovery requirements</li>\n<li>latency requirements</li>\n<li>local / regional / global distributions</li>\n<li>on-premise or SaaS implementation</li>\n</ul>\n</blockquote>\n<h3><strong>☐ </strong><strong>Review Interfaces and Integrations</strong></h3>\n<blockquote>\n<p>Existing interfaces/integrations with Service Manager that must continue to work with Service Management need to be identified. Due to specific differences between how Service Manager and Service Management handle integrations, special attention is needed when investigating these areas.</p>\n<p>It is recommended to document all <code>OpenText</code> owned integrations and verify these integrations are also available with Service Management. These integrations may include but are not limited to:</p>\n<ul>\n<li>OMi</li>\n<li>UCMDB</li>\n<li>OO</li>\n</ul>\n<p>As a second step, document all other integrations and identify what method is used to integrate these 3rd party products with Service Management. Possible methods include:</p>\n<ul>\n<li>Web Service Integration</li>\n<li>Connect IT</li>\n<li>LDAP Integration</li>\n<li>SCAUTO</li>\n</ul>\n<p>Depending on these findings, the decision on how to implement these integrations in Service Management must be made. Some differences in how Service Management implements integrations may help guide these decisions. These differences include:</p>\n<ul>\n<li>SCAUTO is not supported</li>\n<li>Service Management Web Service API only uses REST (no SOAP support)</li>\n</ul>\n</blockquote>\n<h3><strong>☐ </strong><strong>Review custom documentation</strong></h3>\n<blockquote>\n<p>Examine all current custom documentation to gather information on current processes, system setup, and ways of working.<br/>\n<br/>\nReviewing the documentation will help to identify differences in the current processes in Service Manager compared to Service Management. Based on any differences discovered, determine how to modify processes where necessary to better fit the Service Management workflows. Identify any custom documentation that must be rewritten for the move to Service Management</p>\n</blockquote>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}