{
  "title": "Core Data and the SMA Evolution Toolkit",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>This document describes the utilites you can use to move data from Service Manager (SM) to Service Management. </p>\n<p>While the scope of transactional data such as Incidents, Changes, and Problems moved from Service Manager (SM) to Service Management should be minimal, you must import most of the core data to Service Management. Core data serves as the backbone of service management solutions and has a direct impact on any connected reporting solution. For example, the information stored in the core data tables in Service Management include:</p>\n<ul>\n<li>People</li>\n<li>Locations</li>\n<li>Groups</li>\n<li>Vendors</li>\n</ul>\n<p>For details on the core data tables, see <a href=\"/doc/423/26.1/coredata\" title=\"Key Concepts\">Key Concepts</a> guide.</p>\n<h2>Import core data using integration studio</h2>\n<p>The integration studio capability in Service Management offers the convenience of pre-configured scenarios<em> </em>to help you import core data from SM to Service Management directly. To know more about the scenarios and how to use it, see <a href=\"/doc/423/26.1/importsmdataintosmax#Configure_the_scenarios\" title=\"Configure scenarios\">Configure scenarios</a>. To know what data is imported and how fields are mapped, see <a href=\"/doc/423/26.1/importsmdataintosmax#Supported_objects_or_record_types\" title=\"Supported Objects and Data types\">Supported Objects and Data types</a>. For more details about the integration studio, see <a href=\"/doc/423/26.1/importsmdataintosmax\" title=\"Integration Studio\">Integration Studio—Service Manager to Service Management data import</a> .</p>\n<p><span style=\"color: rgb(22, 22, 22); font-size: clamp(1.59375rem, 18.7895px + 1.39803vw, 2.125rem);\">Other import methods</span></p>\n<p>In addition to the integration studio, Service Management supports importing data in CSV format directly into a table.  For more complex imports, you can use the Service Management REST API. For supported APIs. see <a href=\"/doc/423/26.1/develop\" title=\"Service Management APIs\">Service Management APIs</a>.</p>\n<h2>SM and Service Management data model considerations</h2>\n<p>There are some differences in the tables across the two products. You must understand the differences before importing data from SM into Service Management. The following sections describes the key differences in the core data tables across the products.</p>\n<p>SM does not use the full functionality of a relational database system. Relations between tables are managed internally in the SM application layer. The <strong>foreign key</strong> concept of the RDBMS is not used in the SM database. Each record is managed individually in the corresponding entity. The consequence is that<strong> referential integrity</strong> checks are not performed by the RDBMS. However, SM's internal validation rules ensure that the links between records are correctly checked. </p>\n<p>The Service Management data model is completely relational. Each record in an entity has a unique ID. Cross entity references are built via this unique ID. However, Service Management does not force referential integrity at the database level.</p>\n<p>As a result, the following has to be considered when importing records from SM to Service Management.</p>\n<ul>\n<li>To ensure the re-conciliation is working properly when updating records, the SM unique key must be preserved in Service Management when importing data. For example, the email address of a user is a unique key so it must be preserved. When a user record is imported, the solution import the record must check if that user already exists and accordingly create or update the record.</li>\n<li>Similarly, when using cross entity references, the solution to create the reference must first check if the ID of the parent record exists in Service Management before creating the reference. For example, when linking a location to a parent location, the solution must first query the ID of the parent location before creating a reference to it.</li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}