{
  "title": "Knowledge",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><h2>Knowledge Articles</h2>\n<p>Knowledge is more centrally featured in Service Management than other service management tools. For end users, Knowledge Articles are an integral part of the Service Catalog, giving answers and direction without the need to directly address a service desk agent. For the agents, the Articles are integrated directly into their UI, showing possible solutions to a user's issue without having to leave the screen they are working on.</p>\n<p>The existing knowledge in Service Manager is a critical piece of the Evolving to Service Management process. Bringing this asset into The Service Management system is extremely important, and tools have been created to assist in this process. Before this process is performed, it is suggested to review the existing Knowledge Documents to determine if any do not belong in the new system. In order to move the documents from Service Manager to Service Management, follow the two steps listed below:</p>\n<h3><strong>☐ </strong><strong>Export knowledge documents from Service Manager</strong></h3>\n<blockquote>\n<article data-recording-id=\"3320418821\">\n<article data-recording-id=\"3320418830\">\n<p>Knowledge articles from Service Manager may be exported and packaged to prepare them for importing into Service Management using utilities created for this purpose. These utilities and instructions on how to use them may be found here:</p>\n<p><a href=\"/doc/423/26.1/exportarticlessm\" title=\"Export knowledge articles from Service Manager\">Export knowledge articles from Service Manager</a></p>\n</article>\n</article>\n</blockquote>\n<h3><strong>☐ </strong><strong>Import knowledge documents into Service Management</strong></h3>\n<blockquote>\n<article data-recording-id=\"3320418821\">\n<article data-recording-id=\"3320418830\">\n<p>For the import phase, please see:</p>\n<p><a href=\"/doc/423/26.1/importarticles\" title=\"Import knowledge article packages\">Import knowledge article packages</a></p>\n<ul>\n</ul>\n</article>\n</article>\n</blockquote>\n<h2>Creating Knowledge from transactional records</h2>\n<p>It is strongly recommended that transactional records from Service Manager (Incidents, Changes, etc.) are not moved to the new Service Management system. In order to keep any important information from these records that might help solve or speed in the resolution of future transactions, subject matter experts should example these records and create Knowledge from them (either in Service Manager before knowledge is moved or directly in Service Management). This will allow the information to be used in the future without adding complexity to the Service Management Evolution process.</p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}