{
  "title": "Fail to match intents if inputs are similar-looking characters in different languages",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The smart virtual agent fails to match the intent if the characters in training sentences are similar-looking in different languages.</p>\n<h2>Cause</h2>\n<p>The NLU models are trained based on different languages. Therefore, for one intent, if user defines Japanese and Chinese as languages for training sentences, the virtual agent will have one model for Japanese and one for Chinese. When interacting with the virtual agent, it needs to identify the language of input, and then use the corresponding model to identify the intent.</p>\n<p>But the language detection function may not always be accurate, especially when dealing with similar-looking languages, such as Chinese and Japanese which have words in common. For example, the input \"自宅住所\" could be Chinese words or Japanese kanji.</p>\n<p>Perform the following steps to determine the issue:</p>\n<ol>\n<li>After the portal user sends the input, open the <strong>sanic_access.log</strong> file under nlu log folder (for example, <code>/var/vols/itom/itsma/logging-volume/va/nlu/</code>)</li>\n<li>Check if there is any log as \"POST http://127.0.0.1:8080/nlu/projects/555500001-zh/parse\", <strong>555500001</strong> is the tenant id, <strong>zh</strong> is the detected language. This log means that the virtual agent detects input as Chinese and tries to apply the Chinese language model.</li>\n</ol>\n<h2>Solution</h2>\n<p>To detect the correct language, the user needs to augment the input data with more Japanese-specific words, such as <strong>katakana</strong>.</p>\n<p>Please note that the automatic learning function also depends on language detection, therefore the post-processing is necessary.<br/>\n </p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}