{
  "title": "Smart ticket",
  "content": "<div class=\"mw-parser-output\">\n<div></div>\n<p>Smart Analytics can intelligently populate fields defined in smart ticket tasks. To customize the smart ticket settings, log in to Agent Interface and navigate to <b>Administration</b> &gt; <b>Configuration</b> &gt; <b>AI Studio</b> &gt;<b> Smart Ticket</b>.</p>\n<h2 class=\"mw-headline\" id=\"Create_a_smart_ticket_configuration_task\">Create a smart ticket task</h2>\n<p>To create a smart ticket task, follow these steps:</p>\n<ol>\n<li>Click <b>New</b>.</li>\n<li>\n<p>In the dialog box that opens, specify the following fields:</p>\n<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Module name</td>\n<td>\n<p>Select <b>Request</b> from the drop-down list.</p>\n</td>\n</tr>\n<tr>\n<td>Predicted field</td>\n<td>\n<p>Select a predicted field from the drop-down list. The available values are <b>Offering</b>, <b>Service</b>, <b>Category</b>, and <b>Assignment group</b>.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>\n<p>If you select <b>Assignment group</b> as the predicted field and want the system to automatically fill a value for the <strong>Assignment Group</strong> field in a smart ticket, you must tailor the corresponding form and business rules, see the <i>Tailor form and business rules for Assignment Group prediction </i>section.</p>\n</div></div></div>\n</td>\n</tr>\n<tr>\n<td>Training sample query</td>\n<td>(Optional) Specify a sample data query, through which you can decide what kind of data you want to use as sample data to teach Smart Analytics to build intelligence out of your large data volume. By default, the system uses all HR Request, Service Request, or Support Request data as training samples.\n\t\t\t\t<p>For example, if you set a query as <code>MATCH{Close}:PHASEID</code>, the system only uses the closed requests as sample data. In this example, <code>PHASEID</code> is the IDOL field name and <code>Close</code> is one of its values.</p>\n<p>You can also add multiple conditions to one query, for example, if you set a query as <code>MATCH{SupportRequest}:ESS-DOCUMENT-TYPE AND MATCH{Close}:PHASEID</code>, the system only uses the closed support requests as sample data. For more information about how to write a query, see <a class=\"external text\" href=\"https://www.microfocus.com/documentation/idol/IDOL_12_4/Content_12.4_Documentation/Help/index.html#Actions/Query/ActionParameters/FieldText.htm\" rel=\"nofollow\" target=\"1\" title=\"FieldText\">FieldText</a> in IDOL documentation.</p>\n</td>\n</tr>\n<tr>\n<td>Predicted field query</td>\n<td>\n<p>(Optional) Specify a query, through which you can decide what kind of value that Smart Analytics learns for <strong>Predicted field</strong>. For example, if you select <b>Offering</b> in <strong>Predicted field</strong>, you can use this query to define which offering items will be learned by training the sample data. The system automatically fills the offering items for a new request according to its issue description. The syntax of this query is the same as the training sample query. For example:</p>\n<p>If you set this query to <code>NOTMATCH{Inactive}:STATUS</code>, the system will only learn from the active offerings.</p>\n<p>If you set this query to <code>MATCH{12419, 12295}:ENTITYID</code>, the system will only learn from offerings of ID 12419 and 12295.</p>\n<p>If you set this query to <code>MATCH{SupportOffering}:ESS-DOCUMENT-TYPE AND NOTMATCH{Inactive}:STATUS</code>, the system will only learn from those active support offerings.</p>\n</td>\n</tr>\n<tr>\n<td>Content fields</td>\n<td>This field is automatically filled with the value <strong>description</strong>.</td>\n</tr>\n<tr>\n<td>Entitlement fields</td>\n<td>\n<p>Specify the fields, through which Smart Analytics can automatically fill the predicted field according to the requestor's permission definitions.</p>\n<p>In this release, the system automatically defines the entitlement fields according to the <strong>Predicted field</strong> settings.</p>\n</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>Click <b>Save</b>.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Edit_a_smart_ticket_configuration_task\">Edit a smart ticket task</h2>\n<p>To edit a smart ticket configuration task, follow these steps:</p>\n<ol>\n<li>Click the task name, and then review the general information of the task.\n\t<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>The <strong>Active</strong> field indicates whether a trained model is available for the auto-assignment of a task. After the training is complete, the field will be selected, indicating its readiness for auto-assignment.</div></div></div>\n</li>\n<li>\n<p>Click the <b>Configurations</b> tab to update the settings.</p>\n<p>You can modify the following settings to optimize the accuracy of auto-suggestion. These settings are tradeoffs between training time and accuracy, which means higher accuracy is achieved at the cost of longer training time. This table provides some best practices for these optimization configurations. </p>\n<table>\n<tbody>\n<tr>\n<th>Setting</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Training samples per predicted field</td>\n<td>\n<p>The maximum number of records to be used as the training samples for each value of <strong>Predicted field</strong>.</p>\n<p>Default: <strong>200</strong></p>\n</td>\n</tr>\n<tr>\n<td>Test data coverage</td>\n<td>\n<p>The percentage of records out of the total source data that are used to test the trained system.</p>\n<p>Default: <strong>5</strong></p>\n</td>\n</tr>\n<tr>\n<td>Source data coverage</td>\n<td>\n<p>The percentage of records out of the total source data that a predicted value can cover. The system will analyze the distribution of the existing records, arrange predicted value by request amount in descending order, and then calculate accumulations. The smart ticket will automatically fill <strong>Predicted field </strong>value from the top till the accumulation reaches the defined <strong>Source data coverage</strong> value.</p>\n<p>A higher percentage means higher accuracy, but there is a threshold point. When the training source data percentage exceeds the threshold, the margin contribution will be lowered remarkably. The out-of-the-box value for this configuration is <strong>90%</strong>, which is the best number tested in the lab.</p>\n<p>Default: <strong>90</strong></p>\n</td>\n</tr>\n<tr>\n<td>Prediction threshold</td>\n<td>\n<div>The minimum confidence percentage a model must achieve to return a valid prediction for the target field.</div>\n<div>Default: <b>30%</b></div>\n</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>To verify if your query is correct, click <strong>Test training query </strong>for <strong>Training sample query,</strong><b> </b>and <strong>Test predict query </strong>for <strong>Predicted field query</strong>.</li>\n<li>Click <b>Save</b> to save your changes.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Perform_training_and_testing\">Perform training and testing</h2>\n<p>To perform training for a smart ticket task, follow these steps:</p>\n<ol>\n<li>Select the check box before a smart ticket task, or click the smart ticket task name.</li>\n<li>Click <b>Train</b> to start training this auto-classification.</li>\n<li>Click <b>Refresh</b> to view the latest training status. When the training is done, click <b>Test</b>.</li>\n<li>When the testing is finished, check the status in the smart ticket task list. Or, click the smart ticket task name to view an estimated accuracy result for this auto-classification in the <strong>Testing result</strong> field. For example:\n\t<pre>First hit count: 7; correct rate: 50.00%\nSecond hit count: 0; correct rate: 50.00%\nThird hit count: 1; correct rate: 57.14%\nMissed count: 6; missed rate: 42.86%\n\"***************** Total samples: 14 ****************** </pre>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Remove_a_smart_ticket_configuration_task\">Remove a smart ticket task</h2>\n<p>To remove a smart ticket task, select the check box before the smart ticket task and then click <b>Delete</b>.</p>\n<h2 class=\"mw-headline\" id=\"Tailor_form_and_business_rules_for_Assignment_Group_prediction\">Tailor form and business rules for Assignment Group prediction</h2>\n<p>If you choose <strong>Assignment Group</strong> as the predicted field and want the system to automatically populate the <strong>Assignment Group</strong> field in a smart ticket, you must customize the corresponding form and business rules by following these steps:</p>\n<ol>\n<li>In Agent Interface, select <b>Administration</b> &gt; <b>Configuration</b> &gt; <b>Studio</b>.</li>\n<li>Select <b>Request</b> from the record type drop-down list, and then click the <b>Forms</b> tab to access the form editor.</li>\n<li>Select the <b>withoutResolution</b> form from the drop-down list, and then click <b>Add field</b>. The system opens the <b>Select fields</b> dialog box.</li>\n<li>Select <b>Assignment group</b>, and then click <b>ADD</b>. Close the <b>Select fields</b> dialog box, and then click <b>Save</b>.</li>\n<li>Click the <b>Processes and Rules</b> tab and expand the <b>After change</b> rule.</li>\n<li>Scroll down to locate the <b>Resets Assignment group and Assignee when Current assignment field is set to Incident or to Unassigned</b> rule. Click the <code>AssignedToGroup:${null}</code> link, click <b>Remove</b> in the pop-up window, and then click <b>Save</b>.</li>\n<li>Locate the <b>If current assignment is set to Expert group, set Assignment group and Assignee as the Expert group and Expert assignee</b> rule, and then remove the <code>AssignedToGroup: ${entity.ExpertGroup}</code> expression.</li>\n<li>Locate the <b>If Current assignment is set to Service desk, set Assignment group and Assignee as the Service desk group and Service desk assignee</b> rule, and then update the rule as follows:\n\t<pre>If ${entity.CurrentAssignment == 'ServiceDesk'}\nSet AssignedToPerson: ${entity.OwnedByPerson}</pre>\n</li>\n<li>Click <b>Add</b>, select <b>\"If...Then\" rule</b>, select <b>Set field</b>, and then click <b>OK</b> to add a new rule. Update the rule as follows:\n\t<pre>If ${entity.CurrentAssignment == 'ExpertGroup' &amp;&amp; entity.AssignedToGroup == null}\nSet Assignment group to ${entity.ExpertGroup}</pre>\n</li>\n<li>Click <b>Add</b>, select <b>\"If...Then\" rule</b>, select <b>Set field</b>, and then click <b>OK</b> to add a new rule. Update the rule as follows:\n\t<pre>If ${entity.CurrentAssignment == 'ServiceDesk' &amp;&amp; entity.AssignedToGroup == null}\nSet Assignment group to ${entity.ServiceDeskGroup}</pre>\n</li>\n<li>Click <b>Save</b> to save your changes.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/essoverview\" title=\"SMAX:25.1/essOverview\">Service Portal</a></li>\n<li><a href=\"/doc/423/26.1/serviceportaladm\" title=\"SMAX:25.1/ServicePortalAdm\">Service Portal Administration</a></li>\n<li><a href=\"/doc/423/26.1/editform\" title=\"SMAX:25.1/EditForm\">How to edit a form</a></li>\n<li><a href=\"/doc/423/26.1/spuserqaauthorization\" title=\"SMAX:25.1/SPUserQAAuthorization\">How to authorize knowledge handling in the Service Portal</a></li>\n<li><a href=\"/doc/423/26.1/searchbehaviors\" title=\"Search behaviors\">Search behaviors</a></li>\n</ul>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}