{
  "title": "Service Management data access control tools",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>OpenText Service Management uses the following tools to restrict user access to data records: </div>\n<ul>\n<li><strong>Role-based access control</strong>: by defining role permissions for record types, you can allow users to access only the records of selected record types. For details, see <a href=\"/doc/423/26.1/pplroles\" title=\"Roles\">Roles</a>.</li>\n<li><strong>Domain-based access control</strong>: by defining a list of data domains and assigning data records to different domains, you can allow users to access only data records that belong to their data domains. For details, see <a href=\"/doc/423/26.1/datadomainseg\" title=\"Data domain segmentation\">Data domain segmentation</a>. </li>\n<li><strong>Person-based access control</strong>: By enabling Record Level Access Control (RLAC) in Studio for record types, you can implement more granular data access control for agent users, in the context of the current user. For details, see <a href=\"/doc/423/26.1/rlacsettings\" title=\"Record level access control\">Record level access control</a>. </li>\n<li><strong>Entitlement rules</strong>: by defining entitlement rules in offerings, knowledge articles, service definitions, and categories, you make these records in the Service Portal available only to relevant audiences in specified locations, and belonging to specified user groups. For details, see <a href=\"/doc/423/26.1/addediterules\" title=\"Manage entitlement rules\">Manage entitlement rules</a>.</li>\n</ul>\n<p>These tools work together to implement data access control in the system. The Role-based tool implements data access control at the record type level (the highest level), and the other mechanisms implement more granular data access control.</p>\n<p>The following sections compare the other three tools and how they take effect in certain typical use cases. </p>\n<h2>Comparison of the tools</h2>\n<p>The following sections summarize their differences. </p>\n<h3 id=\"Data_domain_assignments_and_entitlement_rules\">Data domain assignments and entitlement rules</h3>\n<p>Data domain assignments aren't the same as entitlement rules.</p>\n<ul>\n<li>Entitlement rules restrict offerings, knowledge articles, service definitions, service catalog categories, and custom themes in the Service Portal to limited audiences in specified locations, and belonging to specified user groups; entitlement rules apply only to these record types (including articles and offerings) in the Service Portal, and also apply to fields related to the Service Portal, such as the Catalog offering field in Request records.</li>\n<li>Data domain assignments, on the other hand, restrict access to specific records in a user's view in the agent interface. </li>\n</ul>\n<p><b>Note: </b>Data domain segmentation has no effect on the offerings that an agent has permission to view. Agents can view all active offerings, but can only request offerings for users entitled to them. </p>\n<p>As an example, the following figure illustrates the difference between data domain segmentation and entitlement rules. </p>\n<div><a class=\"image\" href=\"/file/images/b/b1/2018.08_Helpcenter/Resources/Images/DS/DS_entitlement.png\" title=\"/file/images/b/b1/2018.08_Helpcenter/Resources/Images/DS/DS_entitlement.png\"> <img alt=\"DS entitlement.png\" data-file-height=\"540\" data-file-width=\"960\" height=\"540\" src=\"../../../images/DS_entitlement_0ee1bb2f.png\" width=\"960\"/> </a></div>\n<h3><span style=\"color: rgb(22, 22, 22); font-size: clamp(1.3125rem, 15.4737px + 1.15132vw, 1.75rem);\">Data domain segmentation and RLAC</span></h3>\n<p>Both RLAC and domain segmentation can control agent user access to records. You can use them in different scenarios:</p>\n<ul>\n<li><a href=\"/doc/423/26.1/datadomainseg\" title=\"Data domain segmentation\">Data domain segmentation</a>: Restricts the visibility of specific records and actions (such as tasks and approvals) to specific people, roles, or groups. It is focused on data isolation. For example, you can use domain segmentation to restrict access to HR data to only the HR department and IT data to the IT department. </li>\n<li>RLAC: Allows you to implement more granular access control. For example, you can use RLAC to allow users to access their own records and focus on their own tasks.   </li>\n</ul>\n<p lang=\"EN-US\" xml:lang=\"EN-US\">If you enable both RLAC and data domain segmentation, both take effect. </p>\n<h2 lang=\"EN-US\" xml:lang=\"EN-US\">Record types that have no impact on Service Portal</h2>\n<p>Data domain segmentation and RLAC configurations also take effect in Service Portal, except for the following record types: </p>\n<ul>\n<li>Article/News</li>\n<li>Asset model</li>\n<li>Category</li>\n<li>Service definition</li>\n<li>Offering</li>\n<li>Idea</li>\n<li>Service level target</li>\n<li>Record category</li>\n<li>Request</li>\n</ul>\n<h2>Certain typical use cases</h2>\n<p>The following are certain typical use cases that need your attention. </p>\n<h3>Browse and search in Service Portal</h3>\n<p>When Service Portal users browse the service catalog and search knowledge articles, news, and ideas, only entitlement rules take effect. </p>\n<h3>Access customized tabs in Service Portal</h3>\n<p>Each customized tab has two-tier data access control:</p>\n<ul>\n<li>The Roles field controls what roles this tab is visible to.</li>\n<li>Data domain segmentation and RLAC configurations if any, control what data records the current user can access from the tab.</li>\n</ul>\n<p><strong>Customized tab configuration in the Agent Interface</strong></p>\n<div><a class=\"image\" href=\"/file/images/general/ESM_customized_tab_access.png\" title=\"/file/images/general/ESM_customized_tab_access.png\"> <img alt=\"Customized tab\" height=\"479\" src=\"../../../images/ESM_customized_tab_access_f41ee966.png\" width=\"846\"/> </a></div>\n<div>In this example, users can see the customized tab in Service Portal as long as they have the Request Approver or Service Request Agent role. However, the data domain segmentation and RLAC configuration for Request determine which requests they can see from this tab.</div>\n<div><a class=\"image\" href=\"/file/images/general/ESM_customized_tab_name_portal.png\" title=\"/file/images/general/ESM_customized_tab_name_portal.png\"> <img alt=\"Customized tab in portal\" height=\"269\" src=\"../../../images/ESM_customized_tab_name_portal_58dd8bf1.png\" width=\"933\"/> </a></div>\n<h3>Access custom fields on the request form in Service Portal</h3>\n<p>If the tenant admin has customized the request form by adding custom fields, data domain segmentation and RLAC configurations control whether the current user can access data in the custom fields in Service Portal.  </p>\n<h3>Access offering user options in Service Portal</h3>\n<p>Whether a user can access the user options of an offering is controlled by the data domain and RLAC configurations for Offering. </p>\n<h3>Work with Hot Topic Analytics and Change Analytics</h3>\n<p>When presenting the analytics maps to the current user, the system doesn't consider data domain segmentation or RLAC configurations. </p>\n<p><strong>Change Analytics map</strong></p>\n<div><a class=\"image\" href=\"/file/images/general/ESM_change_analytics.png\" title=\"/file/images/general/ESM_change_analytics.png\"> <img alt=\"Change Analytics\" height=\"779\" src=\"../../../images/ESM_change_analytics_ebd19f73.png\" width=\"997\"/> </a></div>\n<div><strong>Hot Topic Analytics map for incidents</strong></div>\n<div><strong><a class=\"image\" href=\"/file/images/general/ESM_hot_topic_analytics.png\" title=\"/file/images/general/ESM_hot_topic_analytics.png\"> <img alt=\"Hot Topic Analytics for Incidents\" height=\"633\" src=\"../../../images/ESM_hot_topic_analytics_0b4e9a80.png\" width=\"1837\"/> </a> </strong></div>\n<div><span style=\"font-size: 14px;\">However, when the current user attempts to drill down to specific records, data domain segmentation or RLAC configurations take effect. For example, if the RLAC configuration doesn't allow the current user to view a record, the user receives an error when trying to drill down to that record. </span></div>\n<h3>Run business rules</h3>\n<p>When running business rules, the system ignores data domain segmentation and RLAC configurations. </p>\n<p>The following figure shows an example, where the rule sets the Assignee of an Incident record to its Service owner. When retrieving the Owner value from the Service record, the system doesn't check the current user's access permission to the Service record. </p>\n<div><a class=\"image\" href=\"/file/images/general/ESM_incident_rule.png\" title=\"/file/images/general/ESM_incident_rule.png\"> <img alt=\"Incident business rule example\" height=\"197\" src=\"../../../images/ESM_incident_rule_0504b813.png\" width=\"1121\"/> </a></div>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}