{
  "title": "Service Request Management roles and permissions",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>There are specific roles associated with Service Request Management. Service Management uses role-based <a href=\"/doc/423/26.1/rolespermissions\" title=\"SMAX:25.1/RolesPermissions\">permissions</a> to enable you to complete a task that's appropriate to your role. The tenant administrator manages and assigns these permissions.</p>\n<p>By default, the following roles are assigned to Service Request Management. These roles support request tracking and process ownership.</p>\n<table>\n<tbody>\n<tr>\n<th>Role</th>\n<th>Responsibilities</th>\n</tr>\n<tr>\n<td>Service Request Agent</td>\n<td>\n<ul>\n<li>Provide first-level support through taking calls.</li>\n<li>Handle service requests using the request fulfillment processes.</li>\n<li>Classify, fulfill, and close the service requests.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Service Request Coordinator</td>\n<td>\n<ul>\n<li>Act as an escalation point agent when difficult or controversial calls are received.</li>\n<li>Assist analysts in providing first-line support when workloads are high, or where additional experience is required.</li>\n<li>Review and acknowledge service requests to help desk group.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Service Request Manager</td>\n<td>\n<ul>\n<li>Manage the overall help desk activities.</li>\n<li>Take overall responsibility for service request handling on the Service Desk.</li>\n<li>Act as a further escalation point for the coordinators.</li>\n<li>Report to senior managers on any issue that could significantly impact the business.</li>\n<li>Ensure that staffing and skill levels are maintained throughout operational hours by managing shift staffing schedules, and so on.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Service Request Process Owner</td>\n<td>\n<ul>\n<li>Be responsible for ensuring the process is being performed according to the agreed and documented process and is meeting the aims of the process definition.</li>\n<li>Design, document, publicize, and continuously improve the request process.</li>\n<li>Define the Key Performance Indicators (KPIs) to evaluate the effectiveness and efficiency of the request process.</li>\n<li>Review KPIs and take the required action following the analysis.</li>\n<li>Address any issues with the running of the process.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Service Request Task Assignee</td>\n<td>\n<ul>\n<li>Perform the day-to-day operational activities.</li>\n<li>Perform assigned tasks.</li>\n<li>Handle console operations, i.e. monitoring the status of specific systems, job queues, and so on.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Request Approver</td>\n<td>Review the submitted request and decide whether to approve or deny it.</td>\n</tr>\n</tbody>\n</table>\n<p>Review the individual permission assignments for each role in <b>Administration &gt; Master Data &gt; People &gt; Roles</b>.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/pplroles\" title=\"SMAX:25.1/pplRoles\">Roles</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}