{
  "title": "Service Request Management workflow",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>A workflow is an end-to-end process from the service request creation to the service request closure. The building blocks of the workflow are <i>metaphases</i>, <i>phases</i> and <i>transitions</i>. Service Management displays a graphic view of the workflow where you can see the current phase and the transitions that connect the current phase to all other phases.</p>\n<p>The Service Request Management process workflow includes all necessary steps to create and implement service requests, including any necessary escalations or reassignments. If an incident is created from the request on the request entity page, the request is automatically transitioned from the First line support phase to the Escalate phase.</p>\n<p>Service Request Management workflows contain <i>metaphases</i> and <i>phases</i> that lead to closure. When you update a record, the record can <i>transition</i> from one phase to the next automatically, if certain conditions are met. In certain phases, you can also advance manually to the next phase in the <span class=\"SAW_VariablesWorkflow\">workflow</span> snapshot.</p>\n<p>Example: a transition can depend on the value in a field in the record. The transition from the Fulfillment metaphase to the Validation metaphase occurs when a solution and completion code are provided together for the service request.</p>\n<p>The Service Management service request workflow reflects ITILv3 process recommendations. </p>\n<ol>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/srmkpis\" title=\"SMAX:25.1/srmKPIs\">Service Request Management KPIs</a></li>\n<li><a href=\"/doc/423/26.1/srmnotifications\" title=\"SMAX:25.1/srmNotifications\">Service request notification rules</a></li>\n<li><a href=\"/doc/423/26.1/servicewflw\" title=\"SMAX:25.1/ServiceWflw\">Service Request workflow</a></li>\n<li><a href=\"/doc/423/26.1/supportwflw\" title=\"SMAX:25.1/SupportWflw\">Support Request workflow</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}