{
  "title": "Studio tutorial (part 1)",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Using the Studio functionality in Service Management, customers and partners can develop new applications inside the product. With the available tools, a variety of useful functionality may be created.</p>\n<p>In this tutorial, you will create a Training application that will allow instructors to define the available courses, schedule specific classes, and track the students in these classes (and even grade their performance).</p>\n<p>The tutorial itself will be split into multiple parts. In part one, you will design and implement the needed record types for the application and the roles needed to control them. The components built in this section will be new to the system and completely self-contained.</p>\n<p>Part two of the tutorial will expand our application to allow end users to sign up for specific classes using the Service Catalog.</p>\n<h2 id=\"Designing_the_Training_Application\">Designing the Training Application</h2>\n<p>One of the most important steps in creating our application comes before you make the actual configuration changes. Designing the application up front allows you to verify that the desired functionality will be added correctly and points out any holes or missing elements as well. Doing a thorough job of planning the application is also important as some types of cannot be removed from the system once they have been added.</p>\n<h3 id=\"List_high-level_functionality\">List high-level functionality</h3>\n<p>Your first design activity will be to define the high-level functionality you want to include in your application. In part one of the tutorial, you will focus on the instructors that will create and maintain the training courses as well as grading the students. The functional requirements will therefore focus on the activities of the instructor.</p>\n<p>In the application, we will want to:</p>\n<ul>\n<li>Allow the instructor to define a course, including a name and a description</li>\n<li>Allow the instructor to create a class for a course, which will specify:\n\t<ul>\n<li>When the class starts and ends</li>\n<li>The maximum number of students allowed to register</li>\n<li>Where the class will be held</li>\n<li>Who will be leading the class</li>\n</ul>\n</li>\n<li>Allow the instructor to sign up students for a specific class</li>\n<li>Allow the instructor to give each student a grade for a class</li>\n<li>Allow an instructor to retire a course, so no more classes can be scheduled</li>\n</ul>\n<h3 id=\"Create_an_Entity_Model_Diagram\">Create an Entity Model Diagram</h3>\n<p>An entity model diagram gives a clear picture of what new record types are needed as well as the relationships between them. It also shows where any new relations to existing record types are needed.</p>\n<p>For this application, there are clearly two new record types that are needed: courses and classes. A single course may have several related classes. You will also need a relation between the class and the location for the class, as well as to the instructor (which will be to the person record type).</p>\n<p>Additionally, you’ll need to relate each class to multiple students. Since the students are also represented in the person entity, you have a choice regarding how to handle that relation. You could simply create a many-to-many relationship between the class and the person table. However, one of the requirements is to allow the instructor to grade each student. Therefore, you’ll need to create a new record type to represent your students and define relationships to allow one class and one person for each record.</p>\n<div><a class=\"image\" href=\"/file/images/d/d2/studio_tutorial1_1.png\" title=\"/file/images/d/d2/studio_tutorial1_1.png\"> <img alt=\"studio tutorial1 1.png\" data-file-height=\"295\" data-file-width=\"750\" height=\"295\" src=\"../../../images/studio_tutorial1_1_a5dd8388.png\" width=\"750\"/> </a></div>\n<p>The above entity relation diagram shows the new record types in the filled boxes, and existing record types in the empty boxes. It also shows each of the relations that you will need to define to build the data structure for the application.</p>\n<h3 id=\"Plan_the_Menu_Structure\">Plan the Menu Structure</h3>\n<p>The final piece of planning we need to address is how our new application will fit into the existing menu structure that exists in Service Management.</p>\n<p>The main menu is separated into several sections. The first three sections align to the lifecycle of a business service:</p>\n<ul>\n<li><b>Plan</b> - contains applications focused on the planning and overall definitions of services</li>\n<li><b>Build</b> - contains applications focused on the building and maintenance of the services</li>\n<li><b>Run</b> - contains applications focused on the day to day operations and support of the services</li>\n</ul>\n<p>Alternatively, there is the <b>Master Data</b> section under the Administration section of the menu. This section is primarily used for supporting data that is shared between applications.</p>\n<p>In many cases, an application may span multiple steps in the service lifecycle or may have both lifecycle and supporting data included inside of it. While it may not fit perfectly into one section, you need to pick the best fit for the overall functionality of our application.</p>\n<p>In this case, put the new Training application into the <b>Run</b> section of the menu.</p>\n<h2 id=\"Implementation\">Implementation</h2>\n<h3 id=\"Add_the_Training_Application\">Add the Training Application</h3>\n<p>The first step is to define the application in the system. Do this by creating it within the existing menu structure. As decided in the application planning, you’ll put it in the <b>Run</b> section of the menu. To do this, first access the <b>Studio</b> option from the Administration section of the main menu. From there, select the <b>Menu</b> option from the menu header.</p>\n<div><a class=\"image\" href=\"/file/images/f/f0/StudioTutorial1_2.png\" title=\"/file/images/f/f0/StudioTutorial1_2.png\"> <img alt=\"StudioTutorial1_2.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/f/f0/StudioTutorial1_2.png\" height=\"314\" hspace=\"0\" src=\"../../../images/StudioTutorial1_2_5c347126.png\" style=\"width: 800px; height: 314px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<p>Select <b>Run</b> from the Category list, then select the <b>Add</b> button in the Application section. The system will then ask for some information about our new application. The Application name can’t be changed after the application is created, so be sure to enter “Training” – the system will automatically add a “_c” to the name in order to mark it as a custom application. This Application name is the internal name of the application. The two Multilingual labels are what the users see (in the proper language) and may be changed later.</p>\n<div><a class=\"image\" href=\"/file/images/thumb/a/aa/studio_tutorial1_3.png/500px-studio_tutorial1_3.png\" title=\"/file/images/thumb/a/aa/studio_tutorial1_3.png/500px-studio_tutorial1_3.png\"> <img alt=\"studio tutorial1 3.png\" data-file-height=\"662\" data-file-width=\"974\" height=\"340\" src=\"../../../images/500px-studio_tutorial1_3_c9f14aab.png\" width=\"500\"/> </a></div>\n<p>One quick note: custom applications will always be inserted in the menu after the out-of-the-box applications. When the “Insert after” option says, “Add first”, it means our application will be the first one listed after the out of the box ones.</p>\n<h3 id=\"Create_the_New_Record_Types\">Create the New Record Types</h3>\n<h4 id=\"Create_the_Course_record_type\">Create the Course record type</h4>\n<p>Next, select your new Training application and then choose to Add a new record type from the next column.</p>\n<div><a class=\"image\" href=\"/file/images/thumb/7/72/studio_tutorial1_4.png/500px-studio_tutorial1_4.png\" title=\"/file/images/thumb/7/72/studio_tutorial1_4.png/500px-studio_tutorial1_4.png\"> <img alt=\"studio tutorial1 4.png\" data-file-height=\"999\" data-file-width=\"974\" height=\"513\" src=\"../../../images/500px-studio_tutorial1_4_b1aefbb0.png\" width=\"500\"/> </a></div>\n<p>When creating a new record type, you have three options around how to define the primary key. Using \"No primary key\" will have the system use its own \"Id\" field as the primary key, and the numeric value in the \"Id\" field is automatically generated by the system for every new record. This will allow someone to change how the course is displayed to end-users (via the DisplayLabel field) without affecting any defined links.</p>\n<p>After adding the Course record type, you can click on it in the record type list to go to the Studio record type editor.</p>\n<h4 id=\"Add_Fields_to_the_Course_record_type\">Add Fields to the Course record type</h4>\n<p>Once in the editor, select the <b>Fields</b> tab. You can see that a number of fields were automatically added to our new record type. These fields are added to any new record type added to the system. Note that any field that you add will automatically receive the \"_c\" suffix, so that your created fields will never conflict with fields added to the base product.</p>\n<p>Add a new field to contain a description of the course:</p>\n<ul>\n<li>Name: Description_c (remember that the system will add the suffix automatically)</li>\n<li>Multilingual label: Description</li>\n<li>Logical type: LARGE_TEXT</li>\n</ul>\n<p>Next, change the Multilingual label of the DisplayLabel field to “Course Name&amp;rdquo;.</p>\n<div><a class=\"image\" href=\"/file/images/a/a4/StudioTutorial1_5.png\" title=\"/file/images/a/a4/StudioTutorial1_5.png\"> <img alt=\"StudioTutorial1_5.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/a/a4/StudioTutorial1_5.png\" height=\"418\" hspace=\"0\" src=\"../../../images/StudioTutorial1_5_777f97de.png\" style=\"width: 800px; height: 418px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<p>Once the modifications are complete, be sure to save your changes.</p>\n<h4 id=\"Create_the_Class_Record_Type\">Create the Class Record Type</h4>\n<p>Create the <b>Class</b> record type by adding a new record type to the Training application in the Studio menu option the same way you did for the Course record type.</p>\n<div><a class=\"image\" href=\"/file/images/thumb/0/03/studio_tutorial1_6.png/500px-studio_tutorial1_6.png\" title=\"/file/images/thumb/0/03/studio_tutorial1_6.png/500px-studio_tutorial1_6.png\"> <img alt=\"studio tutorial1 6.png\" data-file-height=\"1004\" data-file-width=\"974\" height=\"515\" src=\"../../../images/500px-studio_tutorial1_6_5ab2ec9b.png\" width=\"500\"/> </a></div>\n<p>Once in the Fields editor, add the following fields needed for the high-level functionality defined above (remember that an _c will automatically be added to each field name):</p>\n<table>\n<tbody>\n<tr>\n<th>Field Name</th>\n<th>Multilingual label</th>\n<th>Logical type</th>\n</tr>\n<tr>\n<td>ClassEndDate</td>\n<td>End date</td>\n<td>DATE_TIME</td>\n</tr>\n<tr>\n<td>ClassSize</td>\n<td>Class size</td>\n<td>INTEGER</td>\n</tr>\n<tr>\n<td>ClassStartDate</td>\n<td>Start date</td>\n<td>DATE_TIME</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>Description</td>\n<td>LARGE_TEXT</td>\n</tr>\n</tbody>\n</table>\n<p>In addition, you need to add a few entity links for the course, instructor, and location information:</p>\n<table>\n<tbody>\n<tr>\n<th>Field Name</th>\n<th>Multilingual label</th>\n<th>Logical type</th>\n<th>Reference to</th>\n</tr>\n<tr>\n<td>Course</td>\n<td>Course</td>\n<td>ENTITY_LINK</td>\n<td>Course</td>\n</tr>\n<tr>\n<td>Instructor</td>\n<td>Instructor</td>\n<td>ENTITY_LINK</td>\n<td>Person</td>\n</tr>\n<tr>\n<td>Location</td>\n<td>Location</td>\n<td>ENTITY_LINK</td>\n<td>Location</td>\n</tr>\n</tbody>\n</table>\n<p>Once all of the information has been added, be sure to save your changes.</p>\n<h4 id=\"Create_the_Grade_List\">Create the Grade List</h4>\n<p>Before creating the <b>Student</b> record type, you need to create a new List that contains the possible grades that a student can get in a class. To keep this simple, you can just add two entries: pass and fail. Feel free to add different entries if you like.</p>\n<p>To add the list, navigate to the Administration section in the main menu and select Lists. Select the New button and fill in the information for our new list.</p>\n<div><a class=\"image\" href=\"/file/images/thumb/3/32/studio_tutorial1_7.png/450px-studio_tutorial1_7.png\" title=\"/file/images/thumb/3/32/studio_tutorial1_7.png/450px-studio_tutorial1_7.png\"> <img alt=\"studio tutorial1 7.png\" data-file-height=\"449\" data-file-width=\"974\" height=\"207\" src=\"../../../images/450px-studio_tutorial1_7_727e26c2.png\" width=\"450\"/> </a></div>\n<p>Now create the two entries, pass and fail.</p>\n<div><a class=\"image\" href=\"/file/images/thumb/1/1d/studio_tutorial1_8.png/800px-studio_tutorial1_8.png\" title=\"/file/images/thumb/1/1d/studio_tutorial1_8.png/800px-studio_tutorial1_8.png\"> <img alt=\"studio tutorial1 8.png\" data-file-height=\"352\" data-file-width=\"974\" height=\"289\" src=\"../../../images/800px-studio_tutorial1_8_26b654d2.png\" width=\"800\"/> </a></div>\n<p>Save the new list and move on to the students.</p>\n<h4 id=\"Create_the_Student_Record_Type\">Create the Student Record Type</h4>\n<p>Create the <b>Student</b> record type the same way you did for the Course and Class record types. Again, do not select a primary key. The primary key for the Student record type will be the system generated id.</p>\n<div><a class=\"image\" href=\"/file/images/thumb/f/f4/studio_tutorial1_9.png/450px-studio_tutorial1_9.png\" title=\"/file/images/thumb/f/f4/studio_tutorial1_9.png/450px-studio_tutorial1_9.png\"> <img alt=\"studio tutorial1 9.png\" data-file-height=\"991\" data-file-width=\"974\" height=\"458\" src=\"../../../images/450px-studio_tutorial1_9_fdeee2d0.png\" width=\"450\"/> </a></div>\n<p>Add a field to store the student's grade, using the list you previously built. The logical type for a field using a List is \"ENUM\", which is short for enumeration (a fancy word for a list). The list you built is specified in the \"Reference to\" field.</p>\n<table>\n<tbody>\n<tr>\n<th>Field Name</th>\n<th>Multilingual label</th>\n<th>Logical type</th>\n<th>Reference to</th>\n</tr>\n<tr>\n<td>Grade</td>\n<td>Grade</td>\n<td>ENUM</td>\n<td>Grades</td>\n</tr>\n</tbody>\n</table>\n<p>Then add the entity links for the Class and the Student (which links to the Person record type).</p>\n<table>\n<tbody>\n<tr>\n<th>Field Name</th>\n<th>Multilingual label</th>\n<th>Logical type</th>\n<th>Reference to</th>\n</tr>\n<tr>\n<td>Class</td>\n<td>Class</td>\n<td>ENTITY_LINK</td>\n<td>Class</td>\n</tr>\n<tr>\n<td>Student</td>\n<td>Student</td>\n<td>ENTITY_LINK</td>\n<td>Person</td>\n</tr>\n</tbody>\n</table>\n<p>Both of those fields should be required. Once you’re done, make sure you save your changes.</p>\n<h3 id=\"Add_Forms_for_the_New_Record_Types\">Add Forms for the New Record Types</h3>\n<p>There are three forms that you need to add for every new record type:</p>\n<ul>\n<li>New form – used when creating a new record</li>\n<li>Full form – used when viewing/updating an existing record</li>\n<li>Preview form – used when viewing record details next to the record list</li>\n</ul>\n<h4 id=\"Course_Forms\">Course Forms</h4>\n<p>For the new and preview forms, add a “Course Details” section that contains the Course name, and Description fields (you may need to add a new section before you add the fields). In the full form, add a 1:M Grid component to display the Classes that have been created for this course.</p>\n<div><a class=\"image\" href=\"/file/images/c/c4/StudioTutorial1_21.png\" title=\"/file/images/c/c4/StudioTutorial1_21.png\"> <img alt=\"StudioTutorial1_21.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/c/c4/StudioTutorial1_21.png\" height=\"268\" hspace=\"0\" src=\"../../../images/StudioTutorial1_21_314f29d7.png\" style=\"width:800px;height:268px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h4 id=\"Class_Forms\">Class Forms</h4>\n<p>Create the three Class forms to display the fields you added as you see fit. On the full form, add a 1:M Grid component to display the Students for that class.</p>\n<div><a class=\"image\" href=\"/file/images/4/46/StudioTutorial1_11.png\" title=\"/file/images/4/46/StudioTutorial1_11.png\"> <img alt=\"StudioTutorial1_11.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/4/46/StudioTutorial1_11.png\" height=\"390\" hspace=\"0\" src=\"../../../images/StudioTutorial1_11_589a8aa0.png\" style=\"width:800px;height:390px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h4 id=\"Student_Forms\">Student Forms</h4>\n<p>Again, create the three forms needed for the Student record type. On the new form, add the Class and Student fields at a minimum. For the preview and full forms, also add the Display Label and Grade fields.</p>\n<div><a class=\"image\" href=\"/file/images/e/ef/studio_tutorial1_12.png\" title=\"/file/images/e/ef/studio_tutorial1_12.png\"> <img alt=\"studio tutorial1 12.png\" border=\"0\" data-file-height=\"224\" data-file-width=\"974\" file=\"https://staging.docs.microfocus.com/mediawiki/images/e/ef/studio_tutorial1_12.png\" height=\"184\" hspace=\"0\" src=\"../../../images/studio_tutorial1_12_87478d5b.png\" style=\"width: 800px; height: 184px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h2 id=\"Creating_Process_and_Rules_(Workflow)\">Creating Process and Rules (Workflow)</h2>\n<p>In this tutorial, you will be adding a minimal workflow using the process and rules functionality of Studio. Feel free to spruce up your application by adding additional rules and/or processes as you see fit.</p>\n<h3 id=\"Adding_Course_Workflow\">Adding Course Workflow</h3>\n<p>The record workflow is made up of one or more phases which are contained in one or more metaphases. You can think of the metaphases as high-level “steps” that every record has to go through.</p>\n<p>Once you define the metaphases for a record type, they may not be changed. In this case, you will be creating one phase for each metaphase (a very basic but common situation).</p>\n<p>Create a “Normal” workflow with an initial phase of “New.” Then define three metaphases: Planning, Offered, and Retired.</p>\n<div><a class=\"image\" href=\"/file/images/f/fb/SMAX_new_custom_application_workflow.png\" title=\"/file/images/f/fb/SMAX_new_custom_application_workflow.png\"> <img alt=\"SMAX_new_custom_application_workflow.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/f/fb/SMAX_new_custom_application_workflow.png\" height=\"397\" hspace=\"0\" src=\"../../../images/SMAX_new_custom_application_workflow_7b4af610.png\" style=\"width:800px;height:397px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<p>Now create a phase in the Offered metaphase that comes after New named “Available.” Finally, add a phase after that in the Retired metaphase also named “Retired”. <b>Note</b>: you can name the phases and metaphases differently if you like, but you need to make note of the names used here for reference later in the tutorial.</p>\n<h3 id=\"Adding_Course_Rules\">Adding Course Rules</h3>\n<p>The only rule you need to add for the Course record type is a validation rule to make the Description field required. Add this rule to the “Normal” workflow node, in the Before Change section. Remember that the Course Name is already required due to the data model definitions.</p>\n<div><a class=\"image\" href=\"/file/images/1/15/StudioTutorial1_14.png\" title=\"/file/images/1/15/StudioTutorial1_14.png\"> <img alt=\"Course Rules\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/1/15/StudioTutorial1_14.png\" height=\"413\" hspace=\"0\" src=\"../../../images/StudioTutorial1_14_57061d11.png\" style=\"width:800px;height:413px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h3 id=\"Adding_Class_Workflow\">Adding Class Workflow</h3>\n<p>Create a workflow for the Class record type similar to the Course record type.</p>\n<p>Create a “Normal” workflow with an initial phase of “New.” Then define three metaphases: Planning, Offered, and Completed.</p>\n<div><a class=\"image\" href=\"/file/images/e/ed/studio_tutorial1_15.png\" title=\"/file/images/e/ed/studio_tutorial1_15.png\"> <img alt=\"studio tutorial1 15.png\" border=\"0\" data-file-height=\"502\" data-file-width=\"974\" file=\"https://staging.docs.microfocus.com/mediawiki/images/e/ed/studio_tutorial1_15.png\" height=\"412\" hspace=\"0\" src=\"../../../images/studio_tutorial1_15_1e132876.png\" style=\"width: 800px; height: 412px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<p>Create a phase named “Enrollment” in the Offered metaphase, and a “Done” in the Completed metaphase (each linked to the previous phase).</p>\n<h3 id=\"Adding_Class_Rules\">Adding Class Rules</h3>\n<p>First, add a validation rule on the \"Normal\" process to make Description required. This will apply to all phases of the workflow.</p>\n<div><a class=\"image\" href=\"/file/images/9/92/StudioTutorial1_16.png\" title=\"/file/images/9/92/StudioTutorial1_16.png\"> <img alt=\"class rules\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/9/92/StudioTutorial1_16.png\" height=\"413\" hspace=\"0\" src=\"../../../images/StudioTutorial1_16_165672b1.png\" style=\"width:800px;height:413px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<p>Next, add rules to the “New -&gt; Enrollment” transition to make the following fields required:</p>\n<ul>\n<li>Start Date</li>\n<li>End Date</li>\n<li>Instructor</li>\n<li>Location</li>\n</ul>\n<h3 id=\"Adding_Student_Workflow\">Adding Student Workflow</h3>\n<p>The Student record type will have a very simple workflow named “Student” for this tutorial. Simply add a single “Student” metaphase with a single “Student” phase within it.</p>\n<div><a class=\"image\" href=\"/file/images/b/b6/studio_tutorial1_17.png\" title=\"/file/images/b/b6/studio_tutorial1_17.png\"> <img alt=\"studio tutorial1 17.png\" data-file-height=\"422\" data-file-width=\"974\" height=\"422\" src=\"../../../images/studio_tutorial1_17_de325be6.png\" width=\"974\"/> </a></div>\n<p>For this section of the tutorial, you won’t need to add any rules to the Student table.</p>\n<h2 id=\"Activating_the_New_Record_Types\">Activating the New Record Types</h2>\n<p>The next step is to activate each of the three new record types. From the Studio Menu section, click on the section containing the record type name (but don’t click on the name itself). From the drop-down menu that appears, select the “Activate” option. Complete this for each of the three new record types.</p>\n<h2 id=\"Creating_a_Role_for_the_Training_Application\">Creating a Role for the Training Application</h2>\n<p>The easiest way to grant access to the new application is to create one or more Roles for specific types of access. You will create two roles. One for Students and one for Instructors.</p>\n<p>Navigate to the Roles by selecting <strong>Administration</strong> &gt; <strong>People</strong> from the main menu. Then select <strong>Roles</strong> from the header menu. From here, select the <strong>Add</strong> button (on the top left section of the screen).</p>\n<p>First, create the <strong>Instructor</strong> role. Next, Give this role the <strong>Log into the application</strong> permission, and full permissions on the three new record types (<strong>Course</strong>, <strong>Class</strong>, and <strong>Student</strong>).</p>\n<div><a class=\"image\" href=\"/file/images/a/a4/StudioTutorial1_18b.png\" title=\"/file/images/a/a4/StudioTutorial1_18b.png\"> <img alt=\"StudioTutorial1_18b.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/a/a4/StudioTutorial1_18b.png\" height=\"60\" hspace=\"0\" src=\"../../../images/StudioTutorial1_18b_c5d1ff17.png\" style=\"width:723px;height:60px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"723\"/> </a></div>\n<div><a class=\"image\" href=\"/file/images/b/b8/StudioTutorial1_18.png\" title=\"/file/images/b/b8/StudioTutorial1_18.png\"> <img alt=\"role for training application\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/b/b8/StudioTutorial1_18.png\" height=\"130\" hspace=\"0\" src=\"../../../images/StudioTutorial1_18_445ff5d8.png\" style=\"width:728px;height:130px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"728\"/> </a></div>\n<p>Next, create a Role for the Students. This Role only needs the ability to View the Student records.</p>\n<p>Once the Roles are created, add the Instructor Role to any Person that will act as an instructor and the Student Role to any potential student.</p>\n<h2 id=\"Adding_Functionality\">Adding Functionality</h2>\n<p>While you now have a working application where an Instructor can add Courses, Classes, and Students, there are areas that you can easily improve by adding some simple rules. A few ideas are listed here, but feel free to add your own functionality and/or rules to make your application better.</p>\n<h3 id=\"Setting_the_Student_Display_Label_field\">Setting the Student Display Label field</h3>\n<p>When displaying the list of students in a specific class, the system uses the Student’s Display Label field. Instead of forcing the Instructor to fill it in every time, create a business rule that automatically sets the field to a combination of the Student’s name and the Class ID.</p>\n<p>In the Student workflow, on the “Student” phase (although it could be at any level), add a business rule to the “Before change” section and select “If…Then” by using the “Set field” template.</p>\n<p>The condition should only run the rule if the Display Label field is blank: ${entity.DisplayLabel == null}</p>\n<p>The rule should set the “Display label” as a combination of the student’s name and the class ID: ${concat(entity.Student_c.Name, ': ', entity.Class_c.DisplayLabel)}</p>\n<div><a class=\"image\" href=\"/file/images/d/d1/StudioTutorial1_19.png\" title=\"/file/images/d/d1/StudioTutorial1_19.png\"> <img alt=\"Student display label\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/d/d1/StudioTutorial1_19.png\" height=\"415\" hspace=\"0\" src=\"../../../images/StudioTutorial1_19_9819b297.png\" style=\"width:800px;height:415px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h3 id=\"Only_Allow_Classes_for_Available_Courses\">Only Allow Classes for Available Courses</h3>\n<p>Currently, an instructor can add a Class to any Course. You can easily modify this to only allow them to add Classes to “Available” Courses (courses that have been moved to the “Available” phase in the workflow) with a business rule.</p>\n<p>In the Class workflow, click on the “Normal” process. Add a new “Simple” business rule to the “Rendering Forms” section that uses the “Define suggested values for entity link based on filter” template.</p>\n<p>In the rule, set the <b>field</b> to “Course”, the <b>title</b> to “Available courses”, and change the <b>filter</b> from “all records” to use <b>PhaseId IN ${‘Available_c’}</b>.</p>\n<div><a class=\"image\" href=\"/file/images/5/54/StudioTutorial1_20.png\" title=\"/file/images/5/54/StudioTutorial1_20.png\"> <img alt=\"only allow classes for courses\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/5/54/StudioTutorial1_20.png\" height=\"411\" hspace=\"0\" src=\"../../../images/StudioTutorial1_20_5a6ad0f2.png\" style=\"width:800px;height:411px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h3 id=\"Other_Functionality\">Other Functionality</h3>\n<p>Take some time to experiment by adding additional functionality to the application. Some examples of possible functionality to implement include:</p>\n<ul>\n<li>Don’t allow a class to move to the “Done” phase of the workflow until all the students in the class have a grade.</li>\n<li>Send a notification out to a Student when they receive a grade (including the grade)</li>\n</ul>\n<h2 id=\"Next_Steps\">Next Steps</h2>\n<p>At this point, you have a functional Training application. The instructor can create courses, specific classes, and students to those classes. They can also give the student’s grades for each class. However, it seems unfair that the poor instructors have to do all the work. It would be much better if the students could sign themselves up for a class, wouldn’t it? And I’m sure there are some things you can add to make it easier for the instructor to assign grades as well.</p>\n<p>In Part 2 of this tutorial, you’ll learn how to take advantage of the existing Service Catalog to give end users the ability to sign up for classes and use advanced functionality to extend the functionality for our instructors.</p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}