{
  "title": "Studio best practices",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The Studio functionality in Service Management has been enhanced to allow the creation of custom record types and applications. These custom components may be exported and moved between Service Management systems. Therefore, when building custom applications, it is important to consider how they will interact with the out-of-the-box applications.</p>\n<h2 id=\"Before_you_start\">Before you start</h2>\n<p>Taking the time to plan and design your custom application is the most important step in the process. Mapping out your process before you begin may highlight issues or conflicts that you did not anticipate. Furthermore, some of the customizations available can not be removed from the system once they have been created.</p>\n<p>Take the time to design the application. Don't rush into the implementation until you can at least answer the following questions:</p>\n<ul>\n<li>What does the complete data model look like? What relationships will you need to define (especially 1-to-many and many-to-many links)? Are links to any existing applications or existing applications to new data types needed? When designing the data model, be aware that:\n\t<ul>\n<li>Key names cannot be changed</li>\n<li>Many 2 many relations cannot be deleted</li>\n</ul>\n</li>\n<li>How will you define the primary key for each entity (keep in mind it cannot be changed once created)</li>\n<li>How will you define the workflow meta phases for each new entity (keep in mind they cannot be changed once created)</li>\n<li>Do you need to activate <strong>Enable a custom entity link between two out-of-the-box record types</strong> under <b>Administration -&gt; Application settings</b>?</li>\n<li>Do you need to activate <strong>Enable a custom association between two out-of-the-box record types</strong> under <b>Administration -&gt; Application settings</b>?</li>\n<li>Do you need to activate <strong>Enable index field configuration for global search</strong> under <b>Administration -&gt; Application settings</b>?</li>\n</ul>\n<p>To prepare your custom applications for a future export, there are a few actions you should perform when creating the application:</p>\n<ul>\n<li>Document required modifications in out-of-the-box modules, so if you were to make changes to the Incident application to support your custom application, better document these changes so that you can verify after importing your application. </li>\n<li>Add documentation and instructions to your application whenever possible. Be sure to add meaningful descriptions to rules, tooltips to fields, and use a consistent naming scheme as you develop.</li>\n</ul>\n<h2 id=\"Naming_conventions\">Naming conventions</h2>\n<p>To avoid conflicts with applications developed by other customers/partners and to make it clear to others what you've changed as part of your custom application, you should adopt a naming convention. This will allow your customizations to stand out in such a way that it is apparent which changes were made to your app.</p>\n<p>Every application, object, or attribute in the system should use a unique and consistent prefix in their \"internal name.\" This prefix could be the initials of your organization or any prefix that you prefer. This will allow administrators of the system to distinguish between objects with similar names that were added by separate applications. This way, even if two different partners developed an application with the same name (but different functionality), you can see which attributes belong to each by their prefix.</p>\n<p><b>Using a prefix for an application name:</b></p>\n<div><a class=\"image\" href=\"/file/images/1/12/SMAX_new_custom_application.png\" title=\"/file/images/1/12/SMAX_new_custom_application.png\"> <img alt=\"SMAX_new_custom_application\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/1/12/SMAX_new_custom_application.png\" height=\"359\" hspace=\"0\" src=\"../../../images/SMAX_new_custom_application_b2a716d1.png\" style=\"width:520px;height:359px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"520\"/> </a></div>\n<p><b>Using a prefix for attributes:</b></p>\n<p><a class=\"image\" href=\"/file/images/2/24/SMAX_custom_application_new_field.png\" title=\"/file/images/2/24/SMAX_custom_application_new_field.png\"> <img alt=\"SMAX_custom_application_new_field\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/2/24/SMAX_custom_application_new_field.png\" height=\"164\" hspace=\"0\" src=\"../../../images/SMAX_custom_application_new_field_cbc9973a.png\" style=\"width: 800px; height: 164px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a>   </p>\n<h2 id=\"Creating_your_application\">Creating your application</h2>\n<p>Each section of your application will bring different questions about how you wish to implement your design. This section contains a number of these questions, as well as suggestions, for different parts of your custom application. Use these tips to guide you in your application implementation.</p>\n<h3 id=\"Menu\">Menu</h3>\n<p>The menu structure determines the location of your application in the main menu, as well as how the components of the application will be displayed after it is selected.</p>\n<p>The main menu is separated into several sections. The first three sections align to the lifecycle of a business service.</p>\n<ul>\n<li><b>Plan</b> - contains applications focused on the planning and overall definitions of services</li>\n<li><b>Build</b> - contains applications focused on the building and maintenance of the services</li>\n<li><b>Run</b> - contains applications focused on the day to day operations and support of the services</li>\n</ul>\n<p>Alternatively, there is the <b>Master Data</b> section under the Administration section of the menu. This section is primarily used for supporting data that is shared between applications.</p>\n<p>Your application may actually span multiple steps in the service lifecycle, or may have both lifecycle and supporting data included inside of it. While it may not fit perfectly into one section, you should assign it to the section that best fits the overall functionality of your application.</p>\n<h3 id=\"Primary_key_decision\">Primary key decision</h3>\n<p>Assigning a primary key will mark a specific field as being both required and unique. The type of primary key to use depends on the type of record you plan to create. When selection, you should use:</p>\n<ul>\n<li><b>Use 'Display Label' field</b> as primary key for supporting data where each record should have a unique name (like Assignment Groups)</li>\n<li><b>No primary key</b> for entities with transactional data like Incidents, where the internal ID is the primary key (like Incidents or Changes)</li>\n<li><b>Create new field</b> as primary key for certain supporting data tables where we want to ensure Display Labels can change, but still need a immutable unique value in another field</li>\n</ul>\n<h3 id=\"Attributes\">Attributes</h3>\n<p>When creating new attributes on a record type, if you are creating a field that exists in other tables, be sure to use the same name and field type in your new application to ensure consistency. Some examples of common fields (and their labels) include:</p>\n<ul>\n<li>Description -&gt; Description</li>\n<li>AssignedPerson -&gt; Assignee</li>\n<li>AssignedGroup -&gt; Assignment group</li>\n</ul>\n<h3 id=\"Form_design\">Form design</h3>\n<p>Each new record type has three forms for you to design.</p>\n<ol>\n<li><b>Full</b> - The form used when viewing/updating an existing record</li>\n<li><b>New</b> - The form used when creating a new record</li>\n<li><b>Preview</b> - The form used when previewing a record (from a list of records)</li>\n</ol>\n<p>When designing these forms, there are a few things to consider:</p>\n<ul>\n<li>The new form should contain the minimal set of fields needed to easily create a new record. Additional information can be added using the Full form.</li>\n<li>The preview form summarizes the important details of a record to show on the preview panel in the grid view.</li>\n<li>When defining a form, first create the containing section and give a clear internal name. Otherwise, you may run into errors.</li>\n<li>The label of each field should start with an upper case letter.</li>\n<li>It is helpful to enter the tooltip and placeholder information for all new fields. Tooltips are displayed when you mouse over a field, while placeholders are shown directly inside the field while the field is empty.</li>\n</ul>\n<h3 id=\"Workflows\">Workflows</h3>\n<p>When creating workflows for new record types:</p>\n<ul>\n<li>If the entity only contains <b>supporting data</b>, it is acceptable to have a simple workflow consisting of one meta-phase (step) that contains a single phase. However, the data in this entity requires some type of lifecycle, then we suggest at least 2 meta-phases (steps) with at least one phase in each. This allows for a clear separation between active and inactive records.</li>\n</ul>\n<ul>\n<li>When an entity contains transactional data, such as travel expenses or visitor registration records, we recommend three meta-phases (steps) to better visualize the status of the record in the UI. For example to better differentiate in the UI between New, In Progress, and Closed records.</li>\n</ul>\n<h4 id=\"Examples\">Examples</h4>\n<p>4 Meta-phases (record in 3rd)</p>\n<div><a class=\"image\" href=\"/file/images/c/cf/studio_bp_3.png\" title=\"/file/images/c/cf/studio_bp_3.png\"> <img alt=\"studio bp 3.png\" data-file-height=\"45\" data-file-width=\"241\" height=\"45\" src=\"../../../images/studio_bp_3_13be7e9c.png\" width=\"241\"/> </a></div>\n<p>3 Meta-phases (record in 1st)</p>\n<div><a class=\"image\" href=\"/file/images/4/47/studio_bp_4.png\" title=\"/file/images/4/47/studio_bp_4.png\"> <img alt=\"studio bp 4.png\" data-file-height=\"45\" data-file-width=\"164\" height=\"45\" src=\"../../../images/studio_bp_4_0d7c5e14.png\" width=\"164\"/> </a></div>\n<p>Be sure to give the meta-phases a descriptive name. Think of the meta-phases as the high-level steps that the record will pass through. It is very important to keep in mind that the number of the meta-phases cannot be changed after the record type has been created, so be sure to plan them out carefully.</p>\n<h3 id=\"Rules\">Rules</h3>\n<p>When creating rules or updating out-of-the-box rules on out-of-the-box entity types, ensure each rule has a meaningful description. This will make finding and identifying them easier, especially when out-of-the-box workflows have been modified.</p>\n<h3 id=\"Lists\">Lists</h3>\n<p>It is recommended that you create your own lists for your new application so that they will be independent from other shared or custom lists.  </p>\n<h2 id=\"Cross_module_modifications\">Cross module modifications</h2>\n<p>If your new application has interactions with existing or other new applications, the packaging of the application (when available) becomes more complex. Whenever possible, it is recommended to build your application as independently as possible for easier packaging and deployment.</p>\n<p>When modifications to out-of-the-box applications (or other custom applications) are required:</p>\n<ul>\n<li>Document all required modifications to the other applications so that other users can implement the cross-module changes manually. See the \"Template for manual changes\" section below for examples of this type of documentation.</li>\n<li>Create multiple packages with the package manager. One package for the new application and one additional package for each modified out-of-the-box module. This allows other users to decide whether they want to import the modifications to the OOB modules or implement them manual</li>\n</ul>\n<h2 id=\"Template_for_manual_changes\">Template for manual changes</h2>\n<p>The following section gives examples for how manual changes may be documented. This will allow an administrator to easily make the required changes during implementation.</p>\n<p>The attached document may be used as a template for documenting your manual changes, especially modifications to the out-of-the-box modules. It is recommended to use a separate copy of the template for each entity (either by copying the template multiple times within the document or creating a separate document for each entity).</p>\n<p><b>Note:</b> For fields that have multiple definitions due to using multiple languages, copy the data in question and label it with the language. For example you might have fields for:</p>\n<ul>\n<li><b>Display Name (English):</b> English display name</li>\n<li><b>Display Name (Spanish):</b> Nombre para mostrar en español</li>\n</ul>\n<h3 id=\"Entity_Definition\">Entity Definition</h3>\n<p>Document all new attributes and attribute changes to the entity.</p>\n<table>\n<tbody>\n<tr>\n<th>Attribute</th>\n<th>Label</th>\n<th>Flags</th>\n<th>Field Type</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>LastPull</td>\n<td>Last Pull Date</td>\n<td>Readonly</td>\n<td>Date_Time</td>\n<td>The last time the contents were pulled from the repository</td>\n</tr>\n<tr>\n<td>Output</td>\n<td>Output</td>\n<td>Readonly</td>\n<td>Medium_Text</td>\n<td>The output generated by the action</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"Forms\">Forms</h3>\n<table>\n<tbody>\n<tr>\n<th>Name</th>\n<th>In Section</th>\n<th>Section Flags</th>\n<th>Width</th>\n<th>Index</th>\n<th>New Line?</th>\n<th>Comments</th>\n</tr>\n<tr>\n<td>General</td>\n<td>&lt;section&gt;</td>\n<td>Expanded</td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Action</td>\n<td>General</td>\n<td></td>\n<td>Medium</td>\n<td>1</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Output</td>\n<td>General</td>\n<td></td>\n<td>Medium</td>\n<td>2</td>\n<td>Yes</td>\n<td></td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"Workflow\">Workflow</h3>\n<p>A good practice here is to paste an image of the Workflow to the document so that it can be seen visually.</p>\n<h4 id=\"Meta-Phases_(steps)\">Meta-Phases (steps)</h4>\n<ul>\n<li>Initial</li>\n<li>Running</li>\n<li>Done</li>\n</ul>\n<h4 id=\"Phases\">Phases</h4>\n<table>\n<tbody>\n<tr>\n<th>Phase Name</th>\n<th>Display Name</th>\n<th>Metaphase</th>\n<th>Instructions</th>\n<th>Transitions To</th>\n</tr>\n<tr>\n<td>new</td>\n<td>New</td>\n<td>Initial</td>\n<td></td>\n<td>In Process</td>\n</tr>\n<tr>\n<td>inProcess</td>\n<td>In Process</td>\n<td>Running</td>\n<td></td>\n<td>Suspended\n\t\t\t<p>Complete</p>\n</td>\n</tr>\n<tr>\n<td>suspended</td>\n<td>Suspended</td>\n<td>Running</td>\n<td></td>\n<td>In Process</td>\n</tr>\n<tr>\n<td>complete</td>\n<td>Complete</td>\n<td>Done</td>\n<td></td>\n<td></td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"Rules\">Rules</h3>\n<p>Document each rule separately. If possible, add a screenshot of each rule to your document. Example:</p>\n<p><b>Location:</b></p>\n<p>Assigned Meta-Phase / Before Change</p>\n<p><b>Description:</b></p>\n<p>Create an Incident in SAP Solution Manager when the ticket is assigned to an Expert Group where the group is associated with an external system.</p>\n<p><b>Rule Type:</b></p>\n<p>Execute Rest</p>\n<p><b>Condition:</b></p>\n<p><i>${(entity.PhaseId =='InitialSupport' || entity.PhaseId =='Escalate') &amp;&amp; entity.CurrentAssignment=='ExpertGroup' &amp;&amp; entity.ExpertGroup.BelongsToExternalSystem.SystemId=='<b>&lt;External System ID&gt;</b>' &amp;&amp; entity.ExternalProcessReference == null &amp;&amp; entity.ExpertGroup.BelongsToExternalSystem.AuthorizedUser != entity.LastUpdatedByPerson &amp;&amp; current_update.Output_c.IsChanged==false}</i></p>\n<p><b>Parameters:</b></p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\"><b>Parameter</b></th>\n<th scope=\"col\"><b>Value</b></th>\n<th scope=\"col\"><b>Comment</b></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Agent</td>\n<td>&lt;your agent&gt;</td>\n<td>See Step 1</td>\n</tr>\n<tr>\n<td>Endpoint</td>\n<td>&lt;your OO REST endpoint&gt;</td>\n<td>See Step 2</td>\n</tr>\n<tr>\n<td>Credentials</td>\n<td>&lt;your credentials&gt;</td>\n<td>See Step 2 - The same credentials as configured in the end point</td>\n</tr>\n<tr>\n<td>HTTP Method</td>\n<td>POST</td>\n<td></td>\n</tr>\n<tr>\n<td>Uri Suffix</td>\n<td>/executions</td>\n<td>The URL to execute OO flows via REST calls</td>\n</tr>\n<tr>\n<td>Payload type</td>\n<td>JSON</td>\n<td></td>\n</tr>\n<tr>\n<td>Body</td>\n<td>${concat('{\"flowUuid\":\"<b>&lt;FlowID&gt;</b>\", \"runName\": \"SMAX to SAP Solution Manager Create - Incident ID: ',entity.Id,'\", \"logLevel\": \"STANDARD\", \"inputs\":{\"ExternalSystem\": \"',entity.ExpertGroup.BelongsToExternalSystem.SystemId,'\",\"TenantID\": \"<b>&lt;TenantID&gt;</b>\",\"SMAXIncidentID\": \"',entity.Id,'\", \"Title\": \"',substring(substitute(entity.DisplayLabel,'\"','\\\"'),0,min(39, length(entity.DisplayLabel))),'\", \"Description\": \"',substitute(entity.Description,'\"','\\\"'),'\", \"Priority\": \"',entity.Priority,'\"}}')}</td>\n<td>The payload to send to OO to start the flow and pass the required input parameters.\n\t\t\t<p><b>Required parameters:</b></p>\n<p><i>FlowID</i> -&gt; the OO flow id in your environment to create the Incidents in SAP</p>\n<p><i>TenantID</i> -&gt; The tenantID of your tenant.</p>\n</td>\n</tr>\n<tr>\n<td>Headers</td>\n<td>Accept: application/json\n\t\t\t<p>Content-type: application/json</p>\n</td>\n<td>The required headers for the OO flow execution.</td>\n</tr>\n<tr>\n<td>Result</td>\n<td>Select the “<i>Output</i>” field</td>\n<td>Select the \"output\" field created in Step 5 section \"Attributes\".</td>\n</tr>\n</tbody>\n</table>\n<div><a class=\"image\" href=\"/file/images/7/72/studio_bp_5.png\" title=\"/file/images/7/72/studio_bp_5.png\"> <img alt=\"studio bp 5.png\" data-file-height=\"368\" data-file-width=\"906\" height=\"368\" src=\"../../../images/studio_bp_5_10d23332.png\" width=\"906\"/> </a></div>\n<h3 id=\"Notifications\">Notifications</h3>\n<p>Email notification templates include a large block of text as the message. It is recommended to both document this in text (for easy copy &amp; paste) as well as include a screenshot of the notification.</p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Property</th>\n<th scope=\"col\">Value</th>\n<th scope=\"col\">Comments</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Name</td>\n<td>myNotificationTemplate</td>\n<td></td>\n</tr>\n<tr>\n<td>Display Name</td>\n<td>My Notification Template</td>\n<td></td>\n</tr>\n<tr>\n<td>Description</td>\n<td>Notification template for sending my information</td>\n<td></td>\n</tr>\n<tr>\n<td>Enabled</td>\n<td>true</td>\n<td></td>\n</tr>\n<tr>\n<td>Use Group email</td>\n<td>false</td>\n<td></td>\n</tr>\n<tr>\n<td>From email</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>From name</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Subject</td>\n<td>${:entity.Type} ${:entity.Id}: ${:entity.Name}</td>\n<td></td>\n</tr>\n<tr>\n<td>Body</td>\n<td>\n<pre>Hi ${:current_recipient.FirstName}   \n\n\n${:entity.Type} ${:entity.Id}: ${:entity.Name}\n\n\n${:entity.Type} details\t\nName:\t${:entity.Name}\nDisplay label:\t${:entity.DisplayLabel}\nParent:\t${:entity.ParentLocation.Name}\nType:\t${:entity.LocationType}\n\n\n&lt;%=create_view_record_link(/admin/locations/details/${:entity.Id})%&gt;\n</pre>\n</td>\n<td></td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"Approval_Definitions\">Approval Definitions</h3>\n<p>For each Approval, you must document each node of the overall plan. Again, including a screenshot of the Approval Plan will be helpful to the administrator who installs your application.</p>\n<p>Example:</p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Approval Plan</th>\n<th scope=\"col\">My Approval Plan</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Description</td>\n<td>The approval plan for my new application</td>\n</tr>\n<tr>\n<td>Node: Start</td>\n<td>\n<p><strong>Type:</strong> Start Node</p>\n<p><strong>Exits to:</strong> Service has owner</p>\n</td>\n</tr>\n<tr>\n<td>Node: Service Has owner</td>\n<td>\n<p><strong>Type:</strong> Decision: Yes/No</p>\n<p><strong>Title:</strong> Service has owner</p>\n<p><strong>in case of:</strong> ${entity.AffectsActualService.OwnedByPerson !=null}</p>\n<p><strong>Output values:</strong> Yes (to 'Service Owner')<br/>\n\t\t\t                        No (to 'ECAB Group is empty)</p>\n</td>\n</tr>\n<tr>\n<td>Node: Service Owner</td>\n<td>\n<p><strong>Type:</strong> Approval</p>\n<p><strong>Title:</strong> Service Owner</p>\n<p><strong>Strategy:</strong> All must approve</p>\n<p><strong>Approver1:</strong> ${entity.AffectsActualService.OwnedByPerson}</p>\n<p><strong>Condition1:</strong> true</p>\n<p><strong>Exits to:</strong> ECAB Group is empty</p>\n</td>\n</tr>\n<tr>\n<td>Node: ECAB Group is Empty</td>\n<td>\n<p><strong>Type:</strong> Decision: Yes/No</p>\n<p><strong>Title:</strong> ECAB Group is empty</p>\n<p><strong>in case of:</strong> ${is_group_empty('ECAB_Group')}</p>\n<p><strong>Output values:</strong> Yes (to 'Finish')<br/>\n\t\t\t                        No (to 'ECAB Group')</p>\n</td>\n</tr>\n<tr>\n<td>Node: ECAB Group</td>\n<td>\n<p><strong>Type:</strong> Approval</p>\n<p><strong>Strategy:</strong> All must approve</p>\n<p><strong>Approver1:</strong> ${group_by_upn('ECAB_Group')}</p>\n<p><strong>Condition1:</strong> true</p>\n<p><strong>Exits to:</strong> Finish</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"Custom_Actions\">Custom Actions</h3>\n<p>Document each custom action so that it can be replicated on a new system.</p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Name</th>\n<th scope=\"col\">Display name</th>\n<th scope=\"col\">URL</th>\n<th scope=\"col\">Enable<br/>\n\t\t\tworkflow</th>\n<th scope=\"col\">Icon</th>\n<th scope=\"col\">Position in<br/>\n\t\t\trecord page</th>\n<th scope=\"col\">Group in<br/>\n\t\t\trecord page</th>\n<th scope=\"col\">Position in<br/>\n\t\t\tgrid page</th>\n<th scope=\"col\">Group in<br/>\n\t\t\tgrid page</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>MyAction</td>\n<td>My Action</td>\n<td>www.myaction.com</td>\n<td>false</td>\n<td>(no icon)</td>\n<td>Do not show</td>\n<td></td>\n<td>Show as secondary</td>\n<td></td>\n</tr>\n<tr>\n<td>NextAction</td>\n<td>Next Action</td>\n<td>www.nextaction.com</td>\n<td>false</td>\n<td>(no icon)</td>\n<td>Show as primary</td>\n<td></td>\n<td>Do not show</td>\n<td></td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"SLT_Settings\">SLT Settings</h3>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Enable</th>\n<th scope=\"col\">true</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Service Field</td>\n<td>Service</td>\n</tr>\n<tr>\n<td>Priority Field</td>\n<td>Priority</td>\n</tr>\n<tr>\n<td>Group Field</td>\n<td>AssignedGroup</td>\n</tr>\n<tr>\n<td>Customer Field</td>\n<td>Owner</td>\n</tr>\n</tbody>\n</table>\n<h3>Global search</h3>\n<p>You can enable global search for the custom record type and add index fields for global search. For details, see <a href=\"/doc/423/26.1/saglobalsearch\" title=\"Global search\">Global search</a>.</p>\n<div><a class=\"image\" href=\"/file/images/e/e9/SMAX_custom_application_global_search.png\" title=\"/file/images/e/e9/SMAX_custom_application_global_search.png\"> <img alt=\"SMAX_custom_application_global_search\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/e/e9/SMAX_custom_application_global_search.png\" height=\"176\" hspace=\"0\" src=\"../../../images/SMAX_custom_application_global_search_4e0242f9.png\" style=\"width: 800px; height: 176px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h3 id=\"Lists\">Lists</h3>\n<p>List Name: CourseGrade_c</p>\n<p>Display name (English): Grade</p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Icon</th>\n<th scope=\"col\">Name</th>\n<th scope=\"col\">Display name</th>\n<th scope=\"col\">Active</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>(check mark)</td>\n<td>Pass_c</td>\n<td>Pass</td>\n<td>true</td>\n</tr>\n<tr>\n<td>(X mark)</td>\n<td>Fail_c</td>\n<td>Fail</td>\n<td>true</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"Cross-record_settings\">Cross-record settings</h3>\n<p>Currently, the only cross-record setting involves notifications. Use the same notification template defined earlier in this document.</p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Property</th>\n<th scope=\"col\">Value</th>\n<th scope=\"col\">Comments</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Name</td>\n<td>myNotificationTemplate</td>\n<td></td>\n</tr>\n<tr>\n<td>Display Name</td>\n<td>My Notification Template</td>\n<td></td>\n</tr>\n<tr>\n<td>Description</td>\n<td>Notification template for sending my information</td>\n<td></td>\n</tr>\n<tr>\n<td>Enabled</td>\n<td>true</td>\n<td></td>\n</tr>\n<tr>\n<td>Use Group email</td>\n<td>false</td>\n<td></td>\n</tr>\n<tr>\n<td>From email</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>From name</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td>Subject</td>\n<td>${:entity.Type} ${:entity.Id}: ${:entity.Name}</td>\n<td></td>\n</tr>\n<tr>\n<td>Body</td>\n<td>\n<pre>Hi ${:current_recipient.FirstName}   \n\n\n${:entity.Type} ${:entity.Id}: ${:entity.Name}\n\n\n${:entity.Type} details\nName:\t${:entity.Name}\nDisplay label:\t${:entity.DisplayLabel}\nParent:\t${:entity.ParentLocation.Name}\nType:\t${:entity.LocationType}\n\n\n&lt;%=create_view_record_link(/admin/locations/details/${:entity.Id})%&gt;\n</pre>\n</td>\n<td></td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"Roles\">Roles</h3>\n<p>Clearly define permissions for any new role. Keep \"minimal permission\" security practices.</p>\n<p><b>Role Name</b>: New Application User</p>\n<p><b>Record type permissions</b></p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Name</th>\n<th scope=\"col\">Create</th>\n<th scope=\"col\">View</th>\n<th scope=\"col\">Update</th>\n<th scope=\"col\">Delete</th>\n<th scope=\"col\">Admin</th>\n<th scope=\"col\">Comments</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>NewApp</td>\n<td>true</td>\n<td>true</td>\n<td>true</td>\n<td>true</td>\n<td></td>\n<td></td>\n</tr>\n</tbody>\n</table>\n<p><b>Resource permissions</b></p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">Name</th>\n<th scope=\"col\">Create</th>\n<th scope=\"col\">View</th>\n<th scope=\"col\">Update</th>\n<th scope=\"col\">Delete</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>SurveyResult</td>\n<td>true</td>\n<td>true</td>\n<td>true</td>\n<td>true</td>\n</tr>\n</tbody>\n</table>\n<p><b>All other permissions</b></p>\n<table>\n<tbody>\n<tr>\n<td>General</td>\n<td>Log into the application, Permission to create public favorite views</td>\n</tr>\n<tr>\n<td>Reports &amp; Views</td>\n<td>Permission to create and view reports and favorites</td>\n</tr>\n<tr>\n<td>Security</td>\n<td>Permission to clear encrypted data</td>\n</tr>\n<tr>\n<td>Knowledge Management</td>\n<td></td>\n</tr>\n<tr>\n<td>Questions &amp; Answers</td>\n<td></td>\n</tr>\n<tr>\n<td>Live Support</td>\n<td></td>\n</tr>\n<tr>\n<td>On-Call Schedule</td>\n<td></td>\n</tr>\n<tr>\n<td>Change Management</td>\n<td></td>\n</tr>\n<tr>\n<td>Self-service portal administration</td>\n<td></td>\n</tr>\n<tr>\n<td>Approvals</td>\n<td></td>\n</tr>\n<tr>\n<td>SACM</td>\n<td></td>\n</tr>\n<tr>\n<td>On-Premises Bridge/Integration</td>\n<td></td>\n</tr>\n<tr>\n<td>Analysis</td>\n<td></td>\n</tr>\n<tr>\n<td>Tasks</td>\n<td></td>\n</tr>\n<tr>\n<td>Administration menu visibility</td>\n<td></td>\n</tr>\n</tbody>\n</table>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}