{
  "title": "Suite upgrade getting stuck due to PostgreSQL VACUUM",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The suite upgrade is getting stuck, and you can find \"localhost-startStop-1\" from the jstack log. To check the jstack log:</p>\n<ol>\n<li>Run the following commands on a control plane node or the bastion node:\n\t<pre><code>kubectl exec -it itom-xruntime-platform-xxxxxxxxxxxxxx -n &lt;namespace&gt; -c itom-xruntime-platform /bin/bash\nps -ef |grep java\njstack {JAVA_PID} &gt; /tmp/dump.log</code></pre>\n</li>\n<li>Copy the /tmp/thread.log file to the NFS server, and then search for \"localhost-startStop-1\" in the log file.</li>\n</ol>\n<p>Additionally, if you run the following sql, you will see several sqls are blocked by the PostgreSQL VACUUM job:</p>\n<pre><code>select pid, pg_blocking_pids(pid) as blocked_by, query as blocked_query\nfrom pg_stat_activity\nwhere pg_blocking_pids(pid)::text != '{}';\n</code></pre>\n<h2>Cause</h2>\n<p>A daily PostgreSQL VACUUM job is running during the upgrade. When a tenant has a large amount of garbage data in the suite database, this job has a big impact on the system performance. As a result, the platform pod can't get ready and the suite upgrade process gets stuck. </p>\n<h2>Solution</h2>\n<p>Stop the daily PostgreSQL VACUUM job for relevant tenants (tenants that may have a large amount of garbage data) and then continue with the suite upgrade. </p>\n<ol>\n<li>Log in to the Suite Administration as suite-admin: https:&lt;External Access Host&gt;/bo. </li>\n<li>Click Tenants and open the tenant, go to the <strong>Application settings</strong> tab, and turn off the <strong>Enable daily VACUUM</strong> option. Repeat this step for other tenants. </li>\n<li>Check that the itom-xruntime-platform pod is ready.</li>\n<li>Continue with the suite upgrade.</li>\n<li>After the suite upgrade is completed, turn on the <strong>Enable daily VACUUM</strong> option for these tenants.</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}