{
  "title": "Smart virtual agent fails to perform training because the CPU doesn't support AVX",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Smart virtual agent fails to perform the training, and the log of the startup NLU pod resembles the snapshot below:</p>\n<div><a class=\"image\" href=\"/file/images/f/fd/AVXnosupport.png\" title=\"/file/images/f/fd/AVXnosupport.png\"> <img alt=\"AVXnosupport\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/f/fd/AVXnosupport.png\" height=\"153\" hspace=\"0\" src=\"../../../images/AVXnosupport_c9edaa6e.png\" style=\"width: 800px; height: 153px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h2>Cause</h2>\n<p>The CPU on the Kubernetes cluster worker node that runs the virtual agent NLU pod doesn't support AVX instructions.</p>\n<p>The virtual agent relies on the TensorFlow library to provide Natural Language Understanding (NLU) capabilities, and the current version of TensorFlow installed via pip uses the AVX instruction set at compile time. This instruction set is only supported on CPUs from the second generation of Intel Core CPUs (codename: Sandy Bridge) and newer, which means that CPUs before 2011 are not supported.</p>\n<p>To avoid blocking the entire suite installation or upgrade process, the virtual agent NLU pod checks if your CPU supports AVX instructions during startup and decides whether to start the real NLU engine or a mock server.</p>\n<p>To determine if your hardware supports AVX instructions, follow these steps: </p>\n<ol>\n<li>Use kubectl to enter the running NLU pod:\n\t<pre>kubectl exec -it virtual-agent-nlu-xxxxxxxxxx-xxxx -c virtual-agent-nlu -n &lt;namespace&gt; bash</pre>\n</li>\n<li>In the pod shell, run the following command to check the AVX status:\n\t<pre>cat /proc/cpuinfo | grep avx </pre>\n</li>\n<li>If the command returns no results, it means your current CPU does not support AVX instructions.</li>\n</ol>\n<h2>Solution</h2>\n<p>TensorFlow is the core of the virtual agent NLU pod, you need to change the current hardware to support AVX instructions to enable the NLU engine. For more information, see <a href=\"/doc/423/26.1/smartvahwconsumptionusagetuning\" title=\"Hardware resource consumption for smart virtual agent\">Hardware resource consumption for smart virtual agent</a>.</p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}