{
  "title": "Surveys",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>The survey management module enables Service Management to send surveys to end users and consume the data collected by these surveys. In this topic, we will follow Glenn as he investigates how to create and schedule a survey and investigate the results.</p>\n<p>Surveys may be connected to any other record type in the system, such as incidents, changes, or requests, or can be stand-alone. These surveys allow the IT department to gather input from the consumers on how they are performing, how they can improve, what new services they could offer, or any other questions they might have.</p>\n<p>Once an end user completes a survey, Service Management gives Glenn the ability to analyze both the structured and unstructured data that was gathered. This allows him to see problem areas and create plans to improve them.</p>\n<div><a class=\"image\" href=\"/file/images/f/f6/Survey_data_model.gif\" title=\"/file/images/f/f6/Survey_data_model.gif\"> <img alt=\"Survey data model.gif\" border=\"0\" file=\"/mediawiki/images/f/f6/Survey_data_model.gif\" height=\"730\" hspace=\"0\" src=\"../../../images/Survey_data_model_0571d99f.gif\" style=\"width:461px;height:730px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"461\"/> </a></div>\n<h2>Surveys</h2>\n<p>At this point, Service Management is allowing us to do some pretty important things. We are tracking the services we provide to our consumers, taking requests from our end users, and resolving any incidents that affect our services. But how are we doing, at least in the eyes of our end users? Well, why don’t we ask them?</p>\n<p>We can do this by creating and sending out surveys to our end users. Service Management provides all of the tools we need to not only create these surveys but also to analyze the results we get back. This will allow us to gather the information we need to continually improve our services and our ability to support them.</p>\n<h3>Creating a survey</h3>\n<p>The process of creating a survey is as simple as figuring out what questions to ask and when to ask them. That might sound like an over-simplification, but with Service Management, it’s really that easy. Okay, there may be a few other things we need to do, but it's easy. Let’s take a look at exactly what we need to do.</p>\n<p>First, we need to create a new survey. From the list we get to by selecting 'Survey' from the main menu, we select the 'New' option. Now we need to name our new survey with both an internal and external name — external being what the end user will see when they are filling out the survey. We can also add instructions to show the user when they are taking the survey. At this point, we may want to specify the dates that this survey will be active, or we can leave it open-ended.</p>\n<h3>Adding questions</h3>\n<p>Now we can add the actual questions we want the end users to answer. There are several types of questions we can use, including:</p>\n<ul>\n<li>Primary survey rating — An overall rating that can have anywhere from 2-5 selections to choose from. Each selection can have a unique image associated with it (smiley faces anyone?).</li>\n<li>Rating — Additional ratings that may have from 2-6 selections to choose from.</li>\n<li>Rating Group — Multiple questions that all have the same 2-6 selections to choose from.</li>\n<li>Text — A question that enables the end user to type in a response. They can type in multiple lines of text.</li>\n<li>Short Text — Again a question that allows the end user to type in a response, but only a single line of text.</li>\n<li>Radio — A question that allows the end user to select a response from a list of pre-defined selections</li>\n<li>Number — A question that allows the end user to select a numerical response. We can set a minimum and maximum value that the user may select.</li>\n</ul>\n<p>Each question will have a title visible to the user, and a report label — a short, descriptive label that will appear in the reports.</p>\n<p>If we want to see how the survey will look to our end users, we can use the 'Preview' option on the survey. This can be useful to get a feel for how much work we are asking the end user to do — if we make the survey too long or appear like a lot of work, our end users may not bother to fill it in.</p>\n<div><a class=\"image\" href=\"/file/images/5/50/11.4-surveyPreview.png\" title=\"/file/images/5/50/11.4-surveyPreview.png\"> <img alt=\"11.4-surveyPreview.png\" border=\"0\" file=\"/mediawiki/images/5/50/11.4-surveyPreview.png\" height=\"715\" hspace=\"0\" src=\"../../../images/11.4-surveyPreview_8689b095.png\" style=\"width: 800px; height: 715px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h3>Setting up reports</h3>\n<p>After our end users answer our questions, we need to investigate the results to see how we did and decide where we can improve. Setting up the reports is simple, but we need to plan out what reports we need ahead of time.</p>\n<p>The first thing we need to do is determine what type of record (if any) we want related to this survey. It might be requests, incidents, or any other type of records in the system. Once we set this on our survey, we can specify what fields from that record we want to use in our reports. For example, if we are setting up a survey for incidents, we might want the service, category, and urgency fields to be available in our reports. The survey definition will give us a list of all the available fields and we need to select which ones we will need.</p>\n<p>We can also use information from the end user who's taking the survey in our reports. Again, we need to specify the attributes of the end user we want to use in our reports (such as location and company). Alternatively, we can specify that this is an anonymous survey and no information about the end user will be kept.</p>\n<p>Next, we need to create the actual reports. Service Management gives us the option to create a simple report for each question we created that shows how many users selected each option, all at the push of a single button. After that, we can create more reports that slice and dice the result data any way we want to — as long as we specify a field in the survey definition, we can use it in our reports.</p>\n<h2>Survey workflow</h2>\n<p>Once we create the survey, it moves through its own workflow just like the other record types we’ve looked at so far. The workflow is straightforward and comprises four distinct steps.</p>\n<div><a class=\"image\" href=\"/file/images/6/67/11.1-SurveyWorkflow.png\" title=\"/file/images/6/67/11.1-SurveyWorkflow.png\"> <img alt=\"11.1-SurveyWorkflow.png\" border=\"0\" file=\"/mediawiki/images/6/67/11.1-SurveyWorkflow.png\" height=\"282\" hspace=\"0\" src=\"../../../images/11.1-SurveyWorkflow_9e6e966e.png\" style=\"width: 800px; height: 282px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h3>Creation</h3>\n<p>This step contains the 'Create' phase and is used to create the initial survey record. Here we can create the structure and questions for the survey and select the fields that will appear in the reports.</p>\n<h3>Publication</h3>\n<p>During the 'Prepare' phase of this step, we can define the execution dates, create the business rules for sending out the survey, and prepare the reports. If we define the 'Active from' date, the survey will transition to the next step when that date is reached. Otherwise, we can manually move the survey forward when we are ready.</p>\n<p>If we need to change the structure or questions of the survey, we can return it to the 'Create' phase.</p>\n<h3>Consumption</h3>\n<p>Now the survey is ready for the end users. We can send out the survey using either the manual or automatic methods we discussed, and the answers will be recorded for our reporting. After the survey is completed, it moves to the 'Assess' phase (which will happen automatically if we have specified an 'Active until' date). Here we can review all the reports, but new Surveys will not be sent out and data will no longer be collected.</p>\n<h3>Retirement</h3>\n<p>Here the survey is archived. All saved data is cleared out and reports are inactivated so that it frees up our overall reporting quota.</p>\n<h2>Sending out a survey</h2>\n<p>After we create our survey, we need to send it out for people to answer. Service Management provides two primary ways of distributing surveys: manually, or automatically. </p>\n<p>For both methods, the end users will receive an email with a link to the survey and they will see a visual indication when they log in to the Service Portal. They simply need to fill out the survey from the portal if they wish — they have the option to skip the survey. Once we get their responses we can investigate the results. </p>\n<h3>Sending a survey manually</h3>\n<p>To send a survey manually, we use the 'Send survey now' option from the survey we created. The system will then prompt us for a list of people and/or groups to send the survey to. If we defined the survey around a specific record type (like incident or request) we also need to define the record we want to link to this survey.</p>\n<p>Finally, we need to specify a notification template for the survey, which defines how the survey invitation email will look to the end user. Service Management has a default template we can use, or we can create our own.</p>\n<h3>Sending a survey automatically</h3>\n<p>We can create a business rule to send a survey automatically. For details, see <a href=\"/doc/423/26.1/conductsurvey#Create_a_business_rule_to_send_a_survey\" title=\"Create a business rule to send a survey\">Create a business rule to send a survey</a>.</p>\n<p>If you are interested in more details on how to create the business rule, you can find them in the online documentation <a href=\"/doc/423/26.1/addbizrule\" title=\"here\">here</a>.</p>\n<h2 id=\"Analyzing_the_Survey_Results\">Analyzing the survey results</h2>\n<p>After the survey has ended and we have all the results, we need to figure out what all of that data means. Service Management has two different ways to help us with this; reports and hot topics.</p>\n<h3>Reports</h3>\n<p>Remember the work we did earlier in setting up our reports? Well, it’s time for that to pay off. When we look at the reports tab in our survey, we can see the up-to-date results for all of our reports.</p>\n<div><a class=\"image\" href=\"/file/images/6/6f/SurveyReports_updated.png\" title=\"/file/images/6/6f/SurveyReports_updated.png\"> <img alt=\"Survey reports\" height=\"455\" src=\"../../../images/SurveyReports_updated_9754b5eb.png\" width=\"800\"/> </a></div>\n<p>You can see now why it was so important to figure out what reports we needed ahead of time. By putting in the work to define them up front, we now have an excellent set of curated information that will help us find actionable areas of improvement based on the results of our survey.</p>\n<p>One important thing to note is that the system updates reports once every 24 hours, so we will not be seeing the data from the current day in the reports.</p>\n<h3>Hot Topics</h3>\n<p>While the reports are excellent at giving us a clear look into almost all the question types we can ask in our Surveys, they don't help us gain insights from questions that allow the end user to type in text. This is where we can take advantage of Service Management’s ability to analyze the answers to text questions using the Hot Topic Analytics feature.</p>\n<div><a class=\"image\" href=\"/file/images/d/d4/SurveyHotTopics.png\" title=\"/file/images/d/d4/SurveyHotTopics.png\"> <img alt=\"SurveyHotTopics.png\" border=\"0\" file=\"/mediawiki/images/d/d4/SurveyHotTopics.png\" height=\"474\" hspace=\"0\" src=\"../../../images/SurveyHotTopics_ea9153d7.png\" style=\"width: 800px; height: 474px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<p>Now we can look at trends and commonalities in the end users’ responses to the survey questions — just like we did when using the knowledge management functionality earlier. We can play with the filters to break out specific time periods, questions (with text responses), or even certain responses to the overall survey rating. For example, I can just focus responses to a \"how can we do better” question for those who gave us overall ratings in the lower half of the possible responses.</p>\n<p>From the resulting boxes, I can drill in to get more detail and look at all the responses that fit the selection. This gives us the power to mine our unstructured data to find areas where we can create a plan to improve on. Now we can change how we provide our services, create better knowledge to help our consumers, or perhaps even create some new training material. This time, however, we won't have to guess where our problems are as Service Management and the survey module have guided us to where our issues lie.</p>\n<!-- NewPP limit reportCached time: 20200217094159Cache expiry: 86400Dynamic content: falseCPU time usage: 0.024 secondsReal time usage: 0.132 secondsPreprocessor visited node count: 11/1000000Preprocessor generated node count: 32/1000000Post‐expand include size: 11502/2097152 bytesTemplate argument size: 0/2097152 bytesHighest expansion depth: 2/40Expensive parser function count: 0/100Unstrip recursion depth: 0/20Unstrip post‐expand size: 0/5000000 bytes--><!--Transclusion expansion time report (%,ms,calls,template)100.00%    0.000      1 -total-->\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}