{
  "title": "Integrate with GCP for CMP FinOps",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p>This topic describes how to set up two GCP integrations that support the CMP FinOps capability: the cloud accounts import integration and billing data retrieval integration.</p><h2>Complete prerequisite tasks in GCP</h2><p>To integrate with GCP, you must complete the following tasks in GCP.</p><h3>Complete tasks as Google Cloud administrator</h3><p>Ask your Google Cloud administrator to do the following.</p><ol><li><p>Assign the following roles to your Google account <strong>on the organization</strong>. These roles ensure the cloud accounts import integration has enough permission to retrieve the required accounts.</p><p>Predefined roles: <strong>Organization Viewer</strong></p><p>Custom roles: A custom role that contains only the <code>resourcemanager.projects.get</code> permission.</p><div class=\"admonition\"><div class=\"admonition-icon admonition-tip-icon\"></div><div class=\"admonition-content admonition-tip-content\">For the cloud accounts import integration, assigning these roles on the organization level enables you to retrieve all cloud accounts with one Google account and one integration. If the organization has a large number of projects and performance is a concern, you can assign the roles on the folder level to the Google account and then set up one cloud accounts import integration for each Google account. The remaining setup is the same for this scenario.</div></div></li><li>Assign the following roles to your Google account on the project where you want to create and manage credentials used by the GCP integrations.\n\t<ul><li><b>OAuth Config Editor</b></li><li><b>Create Service Accounts</b></li><li><b>Service Account Key Admin</b></li></ul></li><li>Enable the IAM API and Resource Manager API for projects from which you want to import cloud data.</li></ol><h3>Create credentials used by GCP integrations</h3><ol><li>Log in to the Google Cloud console with your Google account.</li><li>Select the project that has credentials-related roles assigned.</li><li>Navigate to <strong>APIs and Services &gt; Credentials</strong>.</li><li>Follow the <a href=\"https://developers.google.com/workspace/guides/create-credentials\" title=\"Create access credentials\">Google documentation</a> to add the following:\n\t<ul><li><p>an OAuth client ID (with the Web application type). Note down the client ID and secret, which you will need when configuring the cloud accounts import integration.</p><p>Configure Authorized JavaScript origins and Authorized redirect URIs for the client ID.  Add the redirect URI displayed on the Integration Studio <a href=\"/doc/423/26.1/syncgcpprovider#Create_an_endpoint\" title=\"Endpoint configuration UI\">Endpoint configuration UI</a> for the cloud accounts import integration. The Authorized JavaScript origin is the domain section of the redirect URI.</p></li><li>a service account. Assign the following predefined roles to the service account: <b>BigQuery Job User</b>, <b>BigQuery Data Viewer</b>, <strong>Spend Based Commitment Recommender Viewer</strong>, <strong>Billing Account Usage Commitment Recommender Viewer</strong>.</li></ul></li><li>Create a service account key in JSON format by following the <a href=\"http://cloud.google.com/iam/docs/creating-managing-service-account-keys\" title=\"Create and delete service account keys\">Google Cloud documentation</a>.</li></ol><h3>Export billing data to BigQuery table and copy table ID</h3><ol><li>Follow this <a href=\"https://cloud.google.com/billing/docs/how-to/export-data-bigquery-setup\" title=\"Set up Cloud Billing data export to BigQuery\">Google documentation</a> to set up export of Cloud Billing data to BigQuery. To make sure the cost governance reports for GCP contain all required data, you must enable the data export for <em>detailed usage cost data</em> during the setup process.</li><li>Navigate to <strong>BigQuery</strong>.</li><li>In the left pane, select the table under the project and dataset that you specified during the billing export setup in Step 1.</li><li>Click the menu to the right of the table name.</li><li><p>Select <strong>Copy ID</strong> to copy the fully qualified BigQuery table ID, which you will need when configuring the billing data import integration. The ID is in this format: <code>&lt;project_Id&gt;.&lt;dataset name&gt;.&lt;table name&gt;</code>.</p></li></ol><h2 id=\"CloudAccount\">Set up an Integration Studio-based integration to import cloud accounts</h2><p>To set up the Integration Studio-based integration for Google Cloud Platform (GCP) cloud accounts data import, perform the following steps:</p><h3>Prepare an integration user</h3><span class=\"snippet-start\" data-sname=\"423-25.4-423-25.3-SyncAWSProvider|CreateIntUser|N\"></span><p>Create a dedicated integration user for each integration. </p><ol><li>Log in to Suite Administration (https://&lt;External Access Host&gt;/bo) as suite admin and create an integration user with the <strong>Integration user</strong> role for the integration.</li><li>Log in to Agent Interface as the tenant admin and do the following:\n\t<ul><li>Navigate to<strong> Administration </strong>&gt;<strong> Master Data</strong> &gt; <strong>People</strong> &gt; <strong>Roles</strong>, and create a role (with the Application value <strong>SMAX</strong>) with the <strong>Create</strong>, <strong>View</strong>, and <strong>Update</strong> permissions for the <strong>Cloud Account</strong> record type. </li><li>Navigate to<strong> Administration </strong>&gt; <strong>Master Data </strong>&gt; <strong>People</strong>, locate the integration user, and then assign the created role to the user.</li></ul></li></ol><p><br/></p><span class=\"snippet-end\" data-sname=\"423-25.4-423-25.3-SyncAWSProvider|CreateIntUser|N\"></span><h3>Create an endpoint</h3><p>Create an endpoint using the Rest Executor 2.0 endpoint type:</p><ol><li>Log in to Agent Interface as the cloud integration administrator.</li><li>Navigate to <strong>Administration </strong>&gt; <strong>Utilities </strong>&gt; <strong>Integration</strong> &gt;<strong> Endpoints</strong>.</li><li>Click <strong>Add</strong>.</li><li>Select<strong> Rest Executor 2.0</strong> as the endpoint type, enter a name for the endpoint (for example, GCP), and then click <strong>Add</strong>. The system creates the endpoint.</li><li>Click <strong>Configure</strong> and complete the fields.\n\t<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\"><thead><tr><th scope=\"col\">Field</th><th colspan=\"2\" scope=\"col\">Value</th></tr><tr><td colspan=\"3\"><strong>General Configuration</strong> section</td></tr><tr><td>Agent</td><td colspan=\"2\">Select <strong>Agentless</strong></td></tr><tr><td>Authentication type</td><td colspan=\"2\"><p>Select <strong>OAuth 2.0</strong></p></td></tr><tr><td>Protocol</td><td colspan=\"2\">Select <strong>https</strong>.</td></tr><tr><td>Base URL</td><td colspan=\"2\"><code>https://cloudresourcemanager.googleapis.com</code></td></tr><tr><td>Certificate type</td><td colspan=\"2\">Leave it empty.</td></tr><tr><td>Certificate format</td><td colspan=\"2\">Leave it empty.</td></tr><tr><td>Server certificate</td><td colspan=\"2\"><p>Leave it empty.</p></td></tr><tr><td>Enable email notification for token expiration</td><td colspan=\"2\">Check this option and configure the<strong> Recipients </strong>field based on your needs.</td></tr><tr><td>Recipients</td><td colspan=\"2\">Configure the email notification recipients based on your needs.</td></tr><tr><td colspan=\"3\"><strong>Get token configuration</strong> section</td></tr><tr><td>Grant Type</td><td colspan=\"2\">Select<strong> Authorization Code</strong>.</td></tr><tr><td>Client ID</td><td colspan=\"2\"><p>Enter the OAuth client ID obtained in the prerequisite section.</p></td></tr><tr><td>Client Secret</td><td colspan=\"2\">Enter the client secret obtained in the prerequisite section.</td></tr><tr><td>Authorization URL</td><td colspan=\"2\"><code>https://accounts.google.com/o/oauth2/v2/auth?access_type=offline&amp;prompt=consent</code></td></tr><tr><td>Redirect URL</td><td colspan=\"2\">This field is read-only.</td></tr><tr><td>Token URL</td><td colspan=\"2\"><code>https://oauth2.googleapis.com/token</code></td></tr><tr><td>Scope</td><td colspan=\"2\"><code>https://www.googleapis.com/auth/cloud-platform.read-only</code></td></tr><tr><td>State</td><td colspan=\"2\">Leave it empty.</td></tr><tr><td>Send client Id and secret</td><td colspan=\"2\">Select <strong>In body</strong>.</td></tr></thead></table></li><li>Click <strong>Get token</strong>. The system will display a Google login page.</li><li>Log in with the credentials of the Google account mentioned in the prerequisite section, and then click <strong>OK</strong>. The system will display <strong>Available</strong> for the token status.</li><li>Click <strong>Save</strong>.</li></ol><h3>Create an integration</h3><p>In the following steps, you'll create an integration with the predefined template.</p><ol><li>Navigate to <strong>Administration </strong>&gt; <strong>Utilities</strong> &gt; <strong>Integration</strong> &gt;<strong> Integration studio</strong>.</li><li>Click <strong>New</strong>, enter the name of your integration, and then click <strong>Save</strong>. The system displays the Integration page.</li><li>In the <strong>Details</strong> section, configure the integration user you created for the current Service Management system.</li><li>Select the <strong>Active</strong> option to activate the integration.</li><li>In the Connector-Endpoint mappings section, click <strong>Add</strong> to add a mapping.</li><li>Select <strong>Cloud Resource Manager API </strong>(under <strong>Google</strong>) as the connector, select the GCP endpoint that you created earlier, and then enter an alias for the mapping. </li><li>Click <strong>Save</strong>.</li></ol><h3>Configure a scenario</h3><p>Perform the following steps to add a scenario to the integration:</p><ol><li>Click <strong>Add scenario</strong>. </li><li>Enter a name for the scenario. For example, GCP account sync.</li><li>In the <strong>Template</strong> field, select <b>GCP account sync process</b> (under <strong>Google Cloud Resource Manager API</strong>).</li><li>Click <strong>Save</strong> to add the scenario. </li><li>Manually run the scenario. If you don't do this, CMP FinOps functionality that depends on cloud account data will not work as expected until the first scheduled cloud account sync occurs.</li></ol><div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\">Using the out-of-the-box template will make the integration configuration easier than starting from scratch. If you don't select this option, you'll have to manually add your own logic, starting from a blank page. </div></div><span class=\"snippet-start\" data-sname=\"423-25.4-423-25.3-SyncAWSProvider|scheduling|N\"></span><h3>Schedule the import of cloud accounts</h3>\n<p id=\"Trigger_integration_by_scheduler\">Use the scheduler to periodically import cloud accounts from the cloud platform. Create a schedule that executes the cloud accounts import scenario at the scheduled time (for example, trigger the import at <strong>2:00</strong> every day).</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-tip-icon\"></div>\n<div class=\"admonition-content admonition-tip-content\">To optimize system performance, schedule cloud account imports with intervals of at least 24 hours.</div>\n</div>\n<p><br/>\n</p><span class=\"snippet-end\" data-sname=\"423-25.4-423-25.3-SyncAWSProvider|scheduling|N\"></span><h3>Check the scenario execution status</h3><p>To check the scenario execution status, navigate to <b>Administration</b> &gt; <b>Utilities</b> &gt; <b>Integration</b> &gt; <b>Endpoints</b>, and then select the GCP endpoint in the left pane. The system displays the execution history for the GCP integration. Each record displayed in this grid corresponds to one scenario rule. Make sure all rules in the cloud accounts import scenario have the green <strong>Success</strong> status.</p><ul><li>You can check the start and end time (and duration) for two main activities of the scenario: cloud accounts syncing and stale accounts status setting. To do this, click the hyperlinked ID for these rules (<em>Set sync end time</em> and <em>Set cleanup end time</em>), and check the value in the <strong>Output details</strong> field. The field displays both the start time and end time for the corresponding activity.</li><li>The <strong>Connector</strong> column indicates the system against which the rule's action is taken: Cloud Resource Manager API (GCP), SMAX, or Common. Unlike other values, Common means that this rule doesn't call any APIs, instead, it just sets some values or performs some calculations.</li><li>Records whose <strong>Connector</strong> value is not Common contain detailed response data in the <b>Response details</b> field. Check this field for error code or error message for records with a warning or error status.</li><li>If you find an error code or message in error or warning records for GCP rules (with the <strong>Connector</strong> value <strong>Cloud Resource Manager API</strong>), check the Google documentation (such as <a href=\"http://cloud.google.com/apis/design/errors\" title=\"Errors\">this page</a>) to see if you can find more information about the error.</li></ul><h3>Troubleshooting tips</h3><p>For rules that correspond to API calls (as opposed to Common actions), if the error code or message in the <strong>Response details</strong> field indicates connection- or credentials-related errors, take the following actions:</p><ul><li><p>Click <strong>Run scenario</strong> in the Scenario details page to re-run the scenario, and then check the execution history for that rule to see if it succeeds. Use this method to determine whether the error was caused by temporary network issues.</p></li><li>Open the GCP endpoint's configuration page, and check the token status. If the token status is Inactive, make sure the client secret is not revoked or expired. If so, obtain a valid client secret from Google, re-generate the token by clicking <strong>Get token</strong>, complete the sign-in process, and then save the changes.</li></ul><h2>Configure a cloud cost data provider to import billing data</h2><p>With this integration, you can configure retrieval of historical and current billing information for expenditures associated with your cloud provider. This information will be available within the reporting interface.</p><ol><li>Log in to Agent Interface as the cloud integration administrator.</li><li>Go to <b>Administration &gt; Providers &gt; Cloud Cost Data Providers.</b></li><li>On the <strong>Integrations</strong> page, click either the <strong>Add Integration</strong> button (if no integrations exist) or the <a class=\"image\" href=\"/file/images/7/7a/hcm_2018_11_integrations_add.png\" title=\"/file/images/7/7a/hcm_2018_11_integrations_add.png\"><img alt=\"hcm 2018 11 integrations add.png\" data-file-height=\"20\" data-file-width=\"22\" height=\"20\" src=\"../../../images/hcm_2018_11_integrations_add_1c285d73.png\" width=\"22\"/></a> icon on the right pane to add an additional integration.</li><li>Select <strong>Google Cloud Platform</strong> and click <b>Next</b>. Only one GCP cost reporting integration is supported.</li><li>Provide the following details::\n\t<ul><li><strong>Connection Name</strong>: Identifier for the GCP integration, for example, \"<code>My GCP integration</code>\"</li><li><strong>GCP Service Account Key (JSON)</strong>: Copy and paste the content of the service account key generated during the prerequisite step to this field.</li></ul></li><li>Check the <b>I require a proxy server to connect to this provider</b> box to use a proxy server to connect to the cloud provider. You can either use the system default proxy server (configured by a suite admin) or use a custom proxy server here.</li><li>Click <strong>Next</strong>.</li><li>Paste the ID you copied during the Google Cloud prerequisite step in the <strong>Table ID</strong> field. This will automatically populate the next 3 fields (Project ID, Dataset Name, Table Name). Alternatively, skip the Table ID field and enter a value in the Project ID, Dataset Name, and Table Name fields manually.</li><li>Click <b>Finish</b>.</li></ol><h2 id=\"Related_topics\">Related topics</h2><ul><li>For information on cloud cost data providers, see <a href=\"/doc/423/26.1/cgrointegrations\" title=\"Cloud cost data providers\">Cloud cost data providers</a>.</li><li>For general information about the Integration Studio, see <a href=\"/doc/423/26.1/integrationhub\" title=\"Integration Studio\">Integration Studio</a>.</li><li>For information on triggering integration scenarios based on scheduler, see <a href=\"/doc/423/26.1/xiescheduler\" title=\"Scheduler\">Scheduler</a>.</li><li>For information on how to export and import integrations and scenarios, see <a href=\"/doc/423/26.1/xieimportexportintegrations\" title=\"Export and import integrations\">Export and import integrations</a><strong>.</strong></li><li>For information about exporting billing data to BigQuery, see <a href=\"https://cloud.google.com/billing/docs/how-to/export-data-bigquery-setup\" rel=\"nofollow\" title=\"Set up Cloud Billing data export to BigQuery\">Set up Cloud Billing data export to BigQuery</a>.</li><li>For information about detailed usage cost tables, see <a href=\"https://cloud.google.com/billing/docs/how-to/export-data-bigquery-tables/detailed-usage\" rel=\"nofollow\" title=\"Structure of Detailed data export\">Structure of Detailed data export</a>.</li><li>For information on creating service account keys in JSON format, see <a href=\"https://cloud.google.com/iam/docs/creating-managing-service-account-keys\" rel=\"nofollow\" title=\"Create and manage service account keys\">Create and manage service account keys</a>.</li></ul></div><p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}