{
  "title": "Troubleshoot Microsoft 365 email integration",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>This section provides troubleshooting information for the email integration with Microsoft 365. </p>\n<h2>Understand email process statuses</h2>\n<p>Before troubleshooting, familiarize yourself with the different scenario running statuses: <strong>Finish</strong>, <strong>Failed</strong>, and <b>Skipped</b>.</p>\n<h3>Finish</h3>\n<h4>Triggered manually or by a scheduler</h4>\n<p>The <strong>Label </strong>field in the scenario running history shows three statuses:</p>\n<ul>\n<li><strong>Success</strong>: The processed email was moved to the folder configured in the Settings rule for <strong>SuccessFolderName</strong>.</li>\n<li><strong>Failed</strong>: The email failed to convert into a Service Management record and was moved to the folder configured in the Settings rule for <strong>ErrorFolderName</strong>.</li>\n<li><strong>Skipped</strong>: The email was skipped because another scenario had already converted it into a Service Management record.</li>\n</ul>\n<p>The detailed result will be stored in the <strong>FinalResult </strong>variable in Output. Check the rule running history of “Set result to label” in the \"Process emails\" scenario.</p>\n<h4>Trigger by listener</h4>\n<p>A successfully processed email follows the <code>&lt;Record Type&gt; – &lt;Email subject&gt;</code> pattern, such as <strong>Request – System log in failed</strong>.</p>\n<p>A skipped email follows the <code>[&lt;Email subject&gt;] from &lt;Email sender&gt;</code> pattern.</p>\n<h3>Failed</h3>\n<p>A scenario might fail due to incorrect configuration of the Settings rule or the Azure application. Review the scenario execution history to identify which rule failed and why. The returned response may contain diagnostic information.</p>\n<h3>Skipped</h3>\n<p>The scenario can be in Skipped status because the integration or scenario is inactive.</p>\n<h2>Issue: The \"Manage email subscription\" scenario always fails</h2>\n<h3>Symptom</h3>\n<p>Renewing and creating subscriptions always fail with a 400 status code and the following error message can be retrieved from Microsoft:</p>\n<pre>Subscription validation request failed. Notification endpoint must respond with 200 OK to validation request.</pre>\n<h3>Cause</h3>\n<p>This issue may result from network connectivity problems. When the system sends a subscription renewal or creation request to Microsoft Graph, the Microsoft Graph change notification service will send a verification message to the Process email listener. The Process email listener returns <code>200</code> to the Microsoft Graph change notification service upon receiving the verification message.</p>\n<h3>Solution</h3>\n<p>Adjust the network configurations to enable access for the \"Manage email subscription\" scenario and the Process emails listener by the Microsoft Graph change notification service.</p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}