{
  "title": "Limitations",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>This topic contains limitations on integration with PPM.</p>\n<h2 class=\"mw-headline\" id=\"General\">General</h2>\n<ul>\n<li>During endpoint mapping configuration, if you map an idea or proposal field to an invalid PPM field and click <b>Sync now</b>, the synchronization operation is completed with no error message returned as long as the PPM field isn't a required field.</li>\n<li>During endpoint mapping configuration, if the maximum length of the idea or proposal field supported exceeds that of a PPM record field, the value is synchronized to PPM without any truncation.</li>\n<li>When mapping a Boolean type check box from Service Management to PPM as radio buttons, if the check box is first selected and then deselected, the radio button mapping is incorrect.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Mapping_ideas_to_PPM_proposals\">Mapping ideas to PPM proposals</h2>\n<ul>\n<li>\n<p>If no value is mapped to the target PPM proposal title field (<b>REQ.KNTA_PROJECT_NAME</b>), the synchronization operation fails with an error message displayed on the <b>Task details</b> page. The following is one of the messages:</p>\n<p><code>Java.lang.Integer can not be cast to Java.lang.String</code></p>\n</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Mapping_proposals_to_PPM_projects\">Mapping proposals to PPM projects</h2>\n<ul>\n<li>\n<p>If no value is mapped to the target PPM project title field (<b>REQ.KNTA_PROJECT_NAME</b>), the synchronization operation fails with an unknown message displayed on the <b>Task details</b> page. The following is one of the messages:</p>\n<p><code>null; null;</code></p>\n</li>\n</ul>\n<ul>\n<li>\n<p>If no value is specified in the <b>Start date</b> or <b>End date</b> field of a proposal record, the synchronization operation fails with the following message displayed on the <b>Task details</b> page:</p>\n<p><a class=\"image\" href=\"/file/images/8/8a/2018.08_Helpcenter/Resources/Images/APM/ErrorMsg12042.png\" title=\"/file/images/8/8a/2018.08_Helpcenter/Resources/Images/APM/ErrorMsg12042.png\"> <img alt=\"ErrorMsg12042.png\" decoding=\"async\" height=\"335\" src=\"../../../images/ErrorMsg12042_ef1672fb.png\" width=\"687\"/> </a></p>\n</li>\n<li>\n<p>When the active time period of a proposal (the duration between the start date and the end date) is longer than the period that a PPM project is supported, the synchronization operation fails with the following message displayed on the <b>Task details</b> page:</p>\n<p><a class=\"image\" href=\"/file/images/5/51/2018.08_Helpcenter/Resources/Images/APM/ErrorMsg12288.png\" title=\"/file/images/5/51/2018.08_Helpcenter/Resources/Images/APM/ErrorMsg12288.png\"> <img alt=\"ErrorMsg12288.png\" decoding=\"async\" height=\"335\" src=\"../../../images/ErrorMsg12288_382a33c6.png\" width=\"687\"/> </a></p>\n</li>\n<li>\n<p>When mapping a proposal's <b>Target service</b> field to a PPM field, if the target PPM field has less drop-down options than the <b>Target service</b> field or the target PPM field has disabled options, the synchronization operation fails with the following internal error message displayed on the <b>Task details</b> page:</p>\n<p><code>com.mercury.itg.exceptions.WarningException: null</code></p>\n<p><b>Suggestion</b>: When configuring the endpoint mapping, select <b>Lookup</b> as the data type and set up a value-to-value mapping relation.</p>\n</li>\n<li>\n<p>After a proposal is mapped to PPM as a project, mapping another proposal with the same name to PPM fails with an <b>Unknown error</b> message displayed on the <b>Task details</b> page:</p>\n<p><code>Unknown error</code></p>\n</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/integrateppm\" title=\"SMAX:25.1/IntegratePPM\">Integration with Project and Portfolio Management (PPM)</a></li>\n<li><a href=\"/doc/423/26.1/syncwithppm\" title=\"SMAX:25.1/SyncWithPPM\">How to synchronize with PPM</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}