{
  "title": "Federation between SMA OS type and UCMDB OsFamily",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>When Native SACM is enabled, the <strong>OS type</strong> field in SMA is federated with the <strong>OsFamily</strong> attribute in UCMDB. There are five preset OS values in either system, which are mapped according to the following table.<br/>\n </p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<thead>\n<tr>\n<th scope=\"col\">SMA OS type</th>\n<th scope=\"col\">UCMDB OsFamily</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Windows</td>\n<td>windows</td>\n</tr>\n<tr>\n<td>UNIX</td>\n<td>unix</td>\n</tr>\n<tr>\n<td>Virtual address extension (VAX)</td>\n<td>vax</td>\n</tr>\n<tr>\n<td>Mainframe</td>\n<td>mainframe</td>\n</tr>\n<tr>\n<td>Bare metal hypervisor</td>\n<td>baremetal_hypervisor</td>\n</tr>\n</tbody>\n</table>\n<p>Apart from these preset OS values, you can also have custom list values in both systems. If you have a custom <strong>OS type</strong> in SMA, you must manually create a corresponding <strong>OsFamily</strong> attribute in UCMDB. Make sure the suffix <strong>_c</strong> is not appended in UCMDB <strong>OsFamily</strong> value. In addition, these custom values are case-sensitive, we strongly recommend that you create precisely the same custom values in both systems. That is, to create a new <strong>OS type</strong>, make sure to use the same spelling and capitalization in both SMA and UCMDB. For example, you have a custom <strong>OS type</strong> value \"Macintosh_c\" in SMA, you must create an <strong>OsFamily </strong>value \"Macintosh\" in UCMDB.</p>\n<p>For more information about how to create list values in UCMDB, see <a href=\"/doc/403/25.4/citmdlenumdefn\" title=\"Create List and Enumeration definitions\">Create List and Enumeration definitions</a>.</p>\n<div class=\"Admonition_Note\"><span class=\"autonumber\">Note:</span> If you fail to create precisely the same custom values in both SMA and UCMDB, the value may still be synchronized to SMA, however, some features may not function. For example, you have a custom OS type value \"Macintosh_c\" in SMA and have a custom OsFamily value \"macintosh\" in UCMDB. With Native SACM enabled, the value \"macintosh\" is synchronized to SMA, however, if you try to use a filter \"OS type = Macintosh\" to find the record, it won't work.</div>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}