{
  "title": "Uninstall OO RAS",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>This topic lists steps to uninstall OO Remote Action Server (RAS) on Windows and Linux systems.</p>\n<h2>Uninstall OO RAS on Windows</h2>\n<ol>\n<li>In the OO RAS install directory right click <strong><code>uninstall.exe</code></strong> and select <strong>Run as an administrator</strong>. This opens the Uninstall Wizard</li>\n<li>Click <strong>Next</strong>.</li>\n<li>In the <strong>Options</strong> section, select <strong>Remote Action Server </strong>and click <strong>Uninstall.</strong></li>\n<li>(Optional) Unregister the RAS in OO Central. You can unregister this OO RAS from OO Central as part of uninstall. Doing so, this RAS will no longer display in Topology section in OO Central UI. To unregister the RAS as during uninstall:</li>\n<li>Select \"<strong>Provide credentials of a Central user with permission to unregister a RAS (optional)</strong>\" checkbox. To keep the RAS in OO Central's Topology section, don't select this check box and click <strong>Next</strong>.</li>\n<li>Give the credentials of an IdM user that has the <em>oo_manageTopology</em> permission.</li>\n<li>Test the connection to OO Central.</li>\n<li>Click <strong>Next</strong>.</li>\n<li>In the <strong>Uninstall Progress</strong> section, once the uninstall is complete, click <strong>Finish</strong>.</li>\n</ol>\n<ol>\n</ol>\n<h2>Uninstall OO RAS on Linux</h2>\n<p>To uninstall OO RAS on a Linux system:</p>\n<ol>\n<li>Navigate to OO RAS install directory</li>\n<li>Stop the OO RAS service: For example, if you install OO RAS in <code>/opt/microfocus/oo</code>, then the command for stopping the service is: <code>/opt/microfocus/oo/ras/bin/./ras stop</code>.</li>\n<li>Delete the OO RAS directory.</li>\n<li>Note that the RAS worker remains in OO Central topology section and must be manually removed. </li>\n</ol>\n<h2>Silent uninstallation of OO RAS</h2>\n<p>A silent uninstallation is one that's started from the command line and completes without any input from the person who started it. You can perform silent uninstallation from Windows or Linux environments.</p>\n<p>To perform silent uninstallation of an External OO RAS:</p>\n<ol>\n<li>Open a command line in the OO RAS install directory and type the following command at the command prompt: <code>uninstall -s ras</code></li>\n<li>When you perform silent uninstallation of an External RAS, it isn't removed from the OO Central topology view. In OO Central, go to <b>System Configuration &gt; TOPOLOGY &gt; Workers</b>, and manually remove the RAS from the topology.</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}