{
  "title": "Upgrade fails after your session is disconnected",
  "content": "<div class=\"mw-parser-output\"><span class=\"snippet-start\" data-sname=\"423-25.4-423-25.3-UpgradeFailSessionDisconnect||N\"></span><p class=\"mw-empty-elt\">\n</p><p>When you are upgrading OMT, your CLI session is disconnected and the upgrade fails.</p>\n<h2>Cause</h2>\n<p>This issue occurs because the session was disconnected.</p>\n<h2>Solution</h2>\n<ol>\n<li>Run the <code>upgrade</code> command or <code>autoUpgrade</code> script again. Note that you must use the same upgrade method that you started with. If you initially ran the <code>autoUpgrade</code> script, you must rerun the <code>autoUpgrade</code> script. If you performed a manual upgrade, you must rerun the <code>./upgrade.sh</code> command. \n\n\t<ul>\n<li>If the upgrade proceeds as expected, there is no need to do anything else.</li>\n<li>If you receive the following error message, the upgrade didn’t exit correctly due to external factors, and you should follow the steps below:\n\t\t<pre><code>Error: one instance is already running and only one instance is allowed on this node at a time.\nCheck to see if another instance is running.\nIf the instance stops running, delete /tmp/.upgrade-lock file.</code></pre>\n</li>\n</ul>\n</li>\n<li>On the same node where you ran the upgrade, run the following commands to check if the upgrade process is still running:\n\t<pre><code>PID=$(cat /tmp/.upgrade-lock)\nps -ef | grep $PID | grep upgrade.sh</code></pre>\n<ul>\n<li>If the command show the upgrade process is still running, you must wait until the process exits by itself. In this situation, the command output resembles the following:\n\t\t<pre><code>[root@ExampleVM]# ps -ef | grep $PID | grep upgrade.sh\nroot       21040  18581   0   12:35   pts/1      00:00:00  /bin/bash  ./upgrade.sh</code></pre>\n</li>\n<li>Only when the command returns no results, run the following command to delete the safety of the upgrade process on that node, and then rerun the upgrade:\n\t\t<pre><code>rm -f /tmp/.upgrade-lock</code></pre>\n</li>\n</ul>\n</li>\n</ol>\n<p><br/>\n</p>\n<p class=\"mw-empty-elt\"></p><span class=\"snippet-end\" data-sname=\"423-25.4-423-25.3-UpgradeFailSessionDisconnect||N\"></span></div>",
  "modifiedon": "2025-10-24 08:51:12"
}