{
  "title": "Upgrade fails with CMP FinOps pods in the \"Pending\" state",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Upgrade fails with CMP FinOps pods in the \"Pending\" state. This issue occurs when you have performed performance tuning.</p>\n<h2>Cause</h2>\n<p>This issue occurs because the <code>nodeSelector</code> label of the CMP FinOps pods is reset to the default values during the upgrade. However, you may have changed the <code>nodeSelector</code> label of these pods as part of performance tuning. When the <code>nodeSelector</code> label is reset to the default, the CMP FinOps pods can run on worker nodes that are designated for other pods, which leads to resource issues.</p>\n<h2>Solution</h2>\n<p>Run the following command to update the <code>nodeSelector</code> label in each deployment back to the value you used during performance tuning:</p>\n<pre><code>kubectl patch deployment &lt;deployment-name&gt; -n &lt;namespace&gt; -p '{\"spec\": {\"template\": {\"spec\": {\"nodeSelector\": {\"&lt;Kubernetes label key name&gt;\": \"&lt;Kubernetes label key value&gt;\"}}}}}'</code></pre>\n<p>For example, you run the following commands to update the <code>nodeSelector</code> label to <strong>cgro</strong>:</p>\n<pre><code>kubectl patch deployment itom-cgro-showback -n itsma-prod -p '{\"spec\": {\"template\": {\"spec\": {\"nodeSelector\": {\"Worker\": \"cgro\"}}}}}'  \nkubectl patch deployment itom-cgro-showback-gateway -n itsma-prod -p '{\"spec\": {\"template\": {\"spec\": {\"nodeSelector\": {\"Worker\": \"cgro\"}}}}}'\nkubectl patch deployment itom-cgro-costpolicy -n itsma-prod -p '{\"spec\": {\"template\": {\"spec\": {\"nodeSelector\": {\"Worker\": \"cgro\"}}}}}'\nkubectl patch deployment itom-cgro-insights -n itsma-prod -p '{\"spec\": {\"template\": {\"spec\": {\"nodeSelector\": {\"Worker\": \"cgro\"}}}}}'\nkubectl patch deployment itom-cgro-insights-gateway -n itsma-prod -p '{\"spec\": {\"template\": {\"spec\": {\"nodeSelector\": {\"Worker\": \"cgro\"}}}}}'\nkubectl patch deployment itom-cgro-policy-gateway -n itsma-prod -p '{\"spec\": {\"template\": {\"spec\": {\"nodeSelector\": {\"Worker\": \"cgro\"}}}}}'</code></pre>\n<h2>Related topics</h2>\n<p>For more information about performance tuning for CMP FinOps, see the hardware requirements section in <a href=\"/doc/423/26.1/plandeployment\" title=\"Plan the deployment\">Plan the deployment</a>.</p>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}