{
  "title": "Upload container images for OO to a registry on OpenShift",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>Upload the installation images to your image registry. The image registry is a local registry on your cluster nodes or an external registry, such as your enterprise repository.</p>\n<p>To upload the images:</p>\n<ol>\n<li>Log on to one of the bastion nodes.</li>\n<li>On the bastion node, go to the <code>$CDF_HOME/scripts/</code> directory. Run the following command:<br/>\n<code>cd $CDF_HOME/scripts</code></li>\n<li>Run the following command to upload the suite images to the local registry:\n\t<pre><code>./uploadimages.sh [-r &lt;image repository URL&gt;] [-u &lt;username&gt;]  [-d &lt;image download directory&gt;</code></pre>\n\tWhere:<br/>\n\tIn &lt;<code>image repository URL</code>&gt;, specify the <code>-r</code> option if you want to upload the images to an external registry other than the local registry.\n\n\t<p>Replace &lt;<code>username</code>&gt; with the Docker Hub username. Use the <code>registry-admin</code> user for the local registry. The local registry refers to the default registry or the registry URL which is <code>localhost:5000</code>.</p>\n<p>If you don't specify the credentials here, specify them when you run the command, at the prompt.</p>\n<p>&lt;<code>image download directory</code>&gt;: The directory where the container images are downloaded. The default value is <code>/var/opt/kubernetes/offline</code>. The <code>-d</code> option is the image directory where you placed the images you have downloaded. Specify the <code>-d </code>option if the images aren't available in the <code>/var/opt/kubernetes/offline/</code> directory. You can use the <code>-d</code> option multiple times when the images are in different directories. However, if you have specified the <code>-l</code> option to \"false\", then you can only specify one image directory. The images can be either the images download by the <code>downloadimages.sh</code> or the images generated by <code>docker save</code>. However, if there are both, the <code>uploadimages.sh</code> script won't upload the images generated by <code>docker save</code>. Only the <code>.tar</code>, <code>.tgz</code>, and <code>.tar.gz</code> images are supported. Make sure the image file type matches the file extension. </p>\n</li>\n</ol>\n<p>To see the full list of options for the <code>downloadimages.sh</code> command, run the command: <code>./downloadimages.sh –h</code>.<br/>\nThe command also has a <code>-p</code> option to enter your password. The <code>-p</code>  option doesn't support single quotes (don't include single quotes in the password). </p>\n<div class=\"Admonition_Recommendation\">By selecting the <code>-p</code> option, you are disabling or bypassing security features, thereby exposing the system to increased security risks. By using this option, you understand and agree to assume all associated risks and hold OpenText harmless for the same. You're encouraged to use some other password options. By implementing the <code>-p</code> option, you may expose the system to increased security risks. You understand and agree to assume all associated risks and hold OpenText harmless for the same. It remains your sole responsibility to assess its own regulatory and business requirements. OpenText doesn't represent or warrant that its products comply with any specific legal or regulatory standards applicable to you in conducting your business.</div>\n<p>Wait until the images are successfully uploaded. Your terminal resembles the following:</p>\n<pre>Upload-process successfully completed.</pre>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}