{
  "title": "Use Aviator in Service Portal",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>You can chat with Aviator by clicking the Aviator icon in Service Portal.</p>\n<h3>Aviator disclaimer acceptance</h3>\n<p>An Aviator disclaimer popup will appear upon your first interaction with Aviator, prompting for user acceptance. To engage in conversations with Aviator, click <strong>Accept</strong>.</p>\n<p>If you click <strong>Cancel</strong>, you'll be using the basic Virtual Agent capability. To alter your choice, go to the <strong>Preferences </strong>page of your Service Portal profile and reset the <strong>Aviator disclaimer acceptance</strong> option.</p>\n<h3>Ask a question</h3>\n<ol>\n<li>Type your question (for example, how to connect to a printer) in the message bar and click <strong>Post</strong>. Then, Aviator will generate an answer to your question. When the Aviator service connection fails, responses will be generated using IDOL search.</li>\n<li>If the answer isn't complete, click <strong>Continue generating</strong> to view the full text. This button allows for only two clicks and it's not available for open topics.</li>\n<li>If a <b>Suggested next steps </b>section is present with some suggestions (including offerings and conversational intents), click an intent or offering to submit a service request. The intents and offerings are displayed according to their relevant scores.</li>\n<li>For any follow-up questions, type them in the message bar and click <strong>Post</strong>. More detailed questions will result in more accurate responses and reference resources.</li>\n<li>\n<p>Whenever Aviator answers, it will provide links to the context documents it used as references for its answers. In the lower-left corner, click  <a class=\"image\" href=\"/file/images/7/77/Aviator241_References.png\" title=\"/file/images/7/77/Aviator241_References.png\"> <img alt=\"References\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/7/77/Aviator241_References.png\" height=\"24\" hspace=\"0\" src=\"../../../images/Aviator241_References_5c2b9643.png\" style=\"width:25px;height:24px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"25\"/> </a> to expand the <strong>References </strong>section and click a link to view the details of the reference materials that are relevant to your request.</p>\n<p>The reference can be knowledge articles, news, external articles (Confluence and SharePoint), or data of any record types that you are authorized to see. For more information about access control, see <a href=\"/doc/423/26.1/addediterules\" title=\"How to manage entitlement rules\">Manage entitlement rules</a> and <a href=\"/doc/423/26.1/erulesusecase\" title=\"Entitlement rules use case\">Entitlement rules use case</a>.</p>\n<p>Aviator will provide up to seven references depending on the data retrieved. See the Data retrieval descriptions in <a href=\"/doc/423/26.1/136-aviatormodels\" title=\"Aviator models\">Aviator models</a>. When no reference on that topic was found, Aviator will respond that it doesn't have information on this topic. It's a default restriction that your tenant admin can toggle on or off. See <a href=\"/doc/423/26.1/adminaviator\" title=\"Configure Aviator\">Configure Aviator</a>.</p>\n</li>\n<li>\n<p>To comment on the answer provided by Aviator, click the <strong>Like </strong>or <strong>Dislike </strong>button and submit your comment.</p>\n<p>You can ask your tenant admin to enable or disable the feedback functionality. This function will log your feedback notes along with categorization and debug information for later analysis. See <a href=\"/doc/423/26.1/adminaviator\" title=\"Configure Aviator\">Configure Aviator</a>.</p>\n</li>\n</ol>\n<h3>Create a new topic</h3>\n<p>If you want to end the current topic and change a topic, click <strong>Start new topic</strong> in the lower left corner. </p>\n<p>To ask a question that belongs to an open topic, ask your tenant admin to enable the <b>Enable open topics</b> functionality for you. See <a href=\"/doc/423/26.1/adminaviator\" title=\"Configure Aviator\">Configure Aviator</a>.</p>\n<h3 id=\"Create_a_support_request\">Create a support request</h3>\n<p>If no information is available, you can submit a support request by following these steps: </p>\n<ol>\n<li>At the bottom of the page, click <b>Create a standard support request</b>.</li>\n<li>Describe your problem in detail or upload a screenshot.</li>\n<li>Click <b>Submit</b>.</li>\n</ol>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}