{
  "title": "Use HR Service Management",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\"></p><div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><p>This section provides a brief introduction to Human Resources (HR) service delivery and illustrates the core functions that can be achieved by HR Service Management.</p>\n<p>HR service delivery is a core function of an organization that allows its human resources department to offer services and interact with employees thus giving access to various levels of HR expertise and prioritizing HR management. Delivering HR services from a unified platform optimizes business costs and processes like monitoring and compliance, improves HR productivity, and meets employee expectations more accurately and efficiently.</p>\n<p>Remote and hybrid work has become the norm for many organizations, making the traditional model of HR service delivery less feasible. The multi-tier HR service delivery model provides the flexibility needed by employees in the modern workplace, which leads to the success of the hybrid work mode.</p>\n<h2>Typical multi-tier HR service delivery model</h2>\n<p>A multi-tier HR service delivery model is often used to deliver HR services. Traditionally, the role of HR services was to boost operational efficiency and cost advantage, but the scenario is evolving with heightened employee technology experience expectations and demographic changes.</p>\n<div><a class=\"image\" href=\"/file/images/e/e8/tier2c.png\" title=\"/file/images/e/e8/tier2c.png\"> <img alt=\"tier2c\" border=\"0\" file=\"/mediawiki/images/e/e8/tier2c.png\" height=\"548\" hspace=\"0\" src=\"../../../images/tier2c_2ffc4ed4.png\" style=\"width: 800px; height: 548px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\"> The percentages displayed above are approximate values only.</div>\n</div>\n<p>The above diagram shows a four-tier HR service delivery model.</p>\n<ul>\n<li><strong>Tier 0</strong> is becoming important to generate an excellent employee experience that both meets the expectations of employees and contributes to the retaining and enhancement of organizational intelligence. Integrating Self Service, Knowledge Management, and Chatbot into a unified digital platform strengthens Tier 0 service delivery. </li>\n<li><strong>Tier 1</strong> strives for better customer satisfaction with standardized streamlined SOP-driven services with a focus on delivering services faster with first-time resolutions. </li>\n<li><strong>Tier 2</strong> focuses on specialized services where the quality of service, increasing efficiency, and flawless delivery are key parameters of measurement. </li>\n<li><strong>Tier 3</strong> services are to resolve issues and exceptions where a real human touch and empathy can make a big difference.</li>\n</ul>\n<h3>HR Service Management</h3>\n<p>HR Service Management plays an important role in delivering Tier 0 and Tier 1 of the above-mentioned 4-tier HR service delivery model. The diagram below illustrates key elements of HR Service Management, which facilitates employees with a seamless and modern user experience.</p>\n<div><a class=\"image\" href=\"/file/images/c/c6/experience_layer.png\" title=\"/file/images/c/c6/experience_layer.png\"> <img alt=\"experience_layer\" border=\"0\" file=\"/mediawiki/images/c/c6/experience_layer.png\" height=\"458\" hspace=\"0\" src=\"../../../images/experience_layer_adc30fe0.png\" style=\"width: 800px; height: 458px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h2>Key capabilities of HR Service Management</h2>\n<h3>Employee self-service portal</h3>\n<p>The Service Portal is an intuitive self-service portal that you can use as a standalone HR service portal or a single company portal combined with IT and other functions. The employee self-service portal has many capabilities that empower self-service for employees and managers, including:</p>\n<ul>\n<li>Smart Virtual Agent</li>\n<li>End user chat with HR Service Desk Agents</li>\n<li>Access to a targeted knowledge base</li>\n<li>Hot News</li>\n<li>Ability to submit and track service and support requests</li>\n<li>Ability to approve/deny requests</li>\n<li>Ability to request on behalf of other users</li>\n<li>Content access control for audiences through entitlement rules</li>\n</ul>\n<div><a class=\"image\" href=\"/file/images/c/cf/ess_244_for_hrsm.png\" title=\"/file/images/c/cf/ess_244_for_hrsm.png\"> <img alt=\"Employee self service dashboard\" height=\"388\" src=\"../../../images/ess_244_for_hrsm_206bbd6f.png\" width=\"800\"/> </a></div>\n<h3>Knowledge base and hot news</h3>\n<p>The Knowledge Management module provides an HR knowledge base that can be utilized by both employees through the service portal and agents during case management or chat sessions with employees. The knowledge articles can be created manually, imported from other knowledge sources, or indexed from remote SharePoint or Confluence sources. Important information can be highlighted as Hot News type articles that will be automatically displayed in the Service Portal, and the knowledge articles are segregated based on entitlements.</p>\n<div><a class=\"image\" href=\"/file/images/general/hrsmhotnews.png\" title=\"/file/images/general/hrsmhotnews.png\"> <img alt=\"HR Service Management Knowledge base\" height=\"446\" src=\"../../../images/hrsmhotnews_14799931.png\" width=\"800\"/> </a></div>\n<h3>Case management </h3>\n<p>The Request Management module provides case management for HR Service Management and includes the following key capabilities:</p>\n<ul>\n<li>Out-of-the-box HR Support Request and Service Request process flows that support codeless configuration to further refine the tool according to your company's processes</li>\n<li>Live Support dedicated UI to facilitate service desk agent interactions with employees</li>\n<li>Intelligent routing using routing definitions and business rules to ensure that HR cases are routed to the most appropriate HR team for resolution</li>\n<li>Domain segmentation, which allows cases to have restricted visibility to specific people or groups. This ensures that only HR agents see the HR cases in a combined environment. In addition, the most sensitive types of HR cases can be further restricted to specialist HR agents.\n\t<ul>\n</ul>\n</li>\n<li>Encryption domains to enable field encryption for sensitive HR data</li>\n<li>Service Level Agreement (SLA) monitoring with Service Level Targets to ensure timely response and resolution of HR cases</li>\n<li>HR admin can generate an analytical or operational report of how HR tickets are tracked, handled, and resolved</li>\n<li>Satisfaction surveys</li>\n</ul>\n<p><strong>HR Support request process workflow (out-of-the-box)</strong></p>\n<p><span style=\"font-size:11pt\"><span style=\"text-justify:inter-ideograph\"><span style=\"line-height:107%\"><span style='font-family:\"Segoe UI\",sans-serif'><a class=\"image\" href=\"/file/images/1/18/hr_support.png\" title=\"/file/images/1/18/hr_support.png\"> <img alt=\"hr_support\" border=\"0\" file=\"/mediawiki/images/1/18/hr_support.png\" height=\"296\" hspace=\"0\" src=\"../../../images/hr_support_e33fbc25.png\" style=\"width: 800px; height: 296px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a> </span></span></span></span></p>\n<p><strong>Service request process workflow (out-of-the-box)</strong></p>\n<p><span style=\"text-justify:inter-ideograph\"><span style=\"line-height:107%\"><span style='font-family:\"Segoe UI\",sans-serif'><a class=\"image\" href=\"/file/images/1/18/servicewoflw.png\" title=\"/file/images/1/18/servicewoflw.png\"> <img alt=\"servicewoflw\" border=\"0\" file=\"/mediawiki/images/1/18/servicewoflw.png\" height=\"265\" hspace=\"0\" src=\"../../../images/servicewoflw_ae24e1f6.png\" style=\"width: 800px; height: 265px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a> </span></span></span></p>\n<h3>Privacy controls </h3>\n<p>Aviator can be configured to perform automatic privacy analysis of HR Requests. Requests that Aviator determines to include personal private information are flagged and assigned to a restricted group.</p>\n<p>For more information, see <a href=\"/doc/423/26.1/privacycontrolshrsm\" title=\"Privacy controls in HR Service Management\">Privacy controls in HR Service Management</a>.</p>\n<h3>Catalog entitlement</h3>\n<p>Existing Service Management functionality can be leveraged to set up catalog entitlement. </p>\n<p>For more information, see <a href=\"/doc/423/26.1/catalogentitlement\" title=\"Privacy controls in HR Service Management\">Catalog entitlement</a>.</p>\n<h3>Aviator user assistance and automation </h3>\n<p>Aviator can leverage Enterprise HR Knowledge discovery capabilities and can answer questions based on content stored in:</p>\n<ul>\n<li>Service Management HR Knowledge Base</li>\n<li>Service Management HR Automation Offerings and Templates</li>\n<li>Enterprise HR intranet web sites</li>\n<li>HR documents content managed in systems such as OpenText xECM, OpenText Core Content, SharePoint, and Confluence.</li>\n</ul>\n<p>In Service Portal, Aviator can recognize variations of the following questions and include an appropriate intent (\"Lookup Employee Position Information​\") in the suggested next steps:</p>\n<ul>\n<li>What is my employee ID?</li>\n<li>What is my employment service date?</li>\n<li>What is my title?</li>\n<li>What is my employee location?</li>\n</ul>\n<p>When a user selects the intent, Service Management automatically creates a Request and retrieves the employee information from SAP SuccessFactors (this requires an integrating with SAP SuccessFactors). The employee's ID, service date, title, and location are all added to the Request and also displayed directly to the user in the Aviator chat.</p>\n<p>In the Agent Interface, Aviator can provide HR Agents with detailed case summaries based on the latest updates, including:</p>\n<div>\n<ul>\n<li>Ticket title and description</li>\n<li>Ongoing agent and user comments</li>\n<li>Synchronized updates from case related Teams chat conversations</li>\n<li>History of ticket updates</li>\n</ul>\n</div>\n<div><a class=\"image\" href=\"/file/images/b/b3/aviator_hr_agent_interface.png\" title=\"/file/images/b/b3/aviator_hr_agent_interface.png\"> <img alt=\"Aviator in use with HR requests\" height=\"627\" src=\"../../../images/aviator_hr_agent_interface_9d73bde8.png\" width=\"800\"/> </a></div>\n<p>Aviator workflow business rules can automatically analyze the sentiment expressed by users in Requests and categorize it as \"positive\", \"neutral\", or \"negative\". If the sentiment is \"negative\", a business rule assigns the Request to your chosen Service Desk group, ensuring that such Requests are responded to quickly. Changes in sentiment are automatically detected and flagged as new comments are posted by the user. Sentiment can be used for prioritization, reporting, and as a further workflow driver.</p>\n<p>The result of Aviator's analysis is displayed in the Request form. </p>\n<div><a class=\"image\" href=\"/file/images/4/4f/sentiment_analysis_hr.png\" title=\"/file/images/4/4f/sentiment_analysis_hr.png\"> <img alt=\"Sentiment analysis of HR requests using Aviator\" height=\"606\" src=\"../../../images/sentiment_analysis_hr_88fba0df.png\" width=\"800\"/> </a></div>\n<p>To use this feature, you will have to configure the business rule that assigns the Request with the group to which you want</p>\n<p>In the main menu, click <strong>Administration</strong> &gt; <strong>Studio </strong>&gt;<strong> Processes and Rules</strong>. In the record type drop-down list, select <strong>Request</strong>, and then add the required business rules.</p>\n<h2>Out-of-the-box HR content</h2>\n<p>Service Management provides a robust set of out-of-the-box employee workflows in the form of offerings in the Service Catalog. The Human Resources category includes the following catalogs: Benefits and Rewards, Employee Lifecycle, Facilities and Security, HR Support, Payroll, and Travel &amp; Time off. </p>\n<p>Each Catalog contains a number of Service Definitions, and each Service Definition includes one or more offerings that employees can select from the Service Portal or a service desk agent can select on behalf of employees. Each offering can have user options to capture information from the employee that will be needed to fulfill the request. The offering can also be expanded with the specific tasks that are required for the fulfillment of the request. These can be manual tasks that are assigned to HR specialists or automation tasks that perform actions within Service Management or through integrations with other tools. </p>\n<p>Some offerings are provided through the loadable content such as Report Lost or Stolen Badge, Check leave eligibility, Request salary confirmation statement, Employee title update, and Employee promotion.</p>\n<div><a class=\"image\" href=\"/file/images/b/bb/hr_support_offerings_244.png\" title=\"/file/images/b/bb/hr_support_offerings_244.png\"> <img alt=\"out-of-the-box HR support offerings\" height=\"389\" src=\"../../../images/hr_support_offerings_244_c93c1582.png\" width=\"800\"/> </a></div>\n<p>For a full list of HR Catalogs, Service Definitions, and Offerings in Service Management's out-of-the-box package, see <a href=\"/doc/423/26.1/oobhrsmcontent\" title=\"&lt;LINK&gt;\">Out-of-the-box content for HR Service Management</a>.</p>\n<h2><span style=\"font-size: clamp(1.59375rem, 18.7895px + 1.39803vw, 2.125rem);\">Integrated co</span><span style=\"font-size: clamp(1.59375rem, 18.7895px + 1.39803vw, 2.125rem);\">ntent management</span></h2>\n<p>Integrations to content management systems provides agents with direct access to relevant documentation when working on a case.</p>\n<ul>\n<li><strong>Content indexing and global search:</strong> HR content stored in OpenText Extended ECM (xECM), OpenText Core Content, Microsoft SharePoint, and Atlassian Confluence can be accessed by agents via Global Search within Service Management.</li>\n<li><strong>Integrated Content Views: </strong>Through an integrated user interface, Core Content and xECM provide powerful business content management for HR processes, and provide Service Management users with a secure and private means to capture sensitive content.</li>\n</ul>\n<p>For more information about integrating with xECM and Core Content, see <a href=\"/doc/423/26.1/integratexecmwidget\" title=\"Integrate with Extended ECM\">Integrate with Extended ECM</a> and <a href=\"/doc/423/26.1/integratecorecontent\" title=\"Integrate with Core Content\">Integrate with Core Content</a>.</p>\n<h2>Integration with HR systems</h2>\n<p>Integration Engine connectors for Workday and SAP SuccessFactors can be leveraged to integrate process and data across Service Management use cases.</p>\n<p>The following scenario templates for SAP SuccessFactors are available out-of-the-box.</p>\n<ul>\n<li>Create new SuccessFactors users</li>\n<li>Create requests for new hires</li>\n<li>Get employee position information</li>\n<li>Get holiday balance</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"></div>\n<div class=\"admonition-content admonition-note-content\">An existing scenario template (\"Onboard new user\") was removed in Service Management 24.4. It is superseded by the \"Create new SuccessFactors users\" template. If you are an upgrading customer who has already configured scenarios using the \"Onboard new user\" template, the scenarios will continue to work as expected.</div>\n</div>\n<p>For more information about these SAP SuccessFactors scenarios, the use cases they enable, and how to set up and configure the integration, see <a href=\"/doc/423/26.1/integratesuccessfactors\" title=\"Integration Studio—SAP SuccessFactors integration\">Integration Studio—SAP SuccessFactors integration</a>.</p>\n<h2>Use cases</h2>\n<h3>New hire onboarding with the onboarding bundle</h3>\n<p>This use case demonstrates best practice design that leverages bundling of multiple services that can be delivered to a new employee. This offering bundle also works in conjunction with an Integration Engine automation flow that integrates with SAP SuccessFactors.</p>\n<p>For more information, see <a href=\"/doc/423/26.1/newhirebundlehrsm\" title=\"HR SM use case: New hire onboarding with the onboarding bundle\">HR SM use case: New hire onboarding with the onboarding bundle</a>.</p>\n<h3>Request for remote country work</h3>\n<p>This use case demonstrates the automation of handling formal approval and process tasks related to an HR request.</p>\n<p>For more information, see <a href=\"/doc/423/26.1/requestremoteworkhrsm\" title=\"HR SM use case: Request for remote country work\">HR SM use case: Request for remote country work</a>.</p>\n<h3>Request eLetter for business visa</h3>\n<p>This use case demonstrates how employee files can be stored and viewed through integrations to Open Text content management platforms.</p>\n<p>For more information, see <a href=\"/doc/423/26.1/requesteletterhrsm\" title=\"HR SM use case: Request an eLetter for a business visa\">HR SM use case: Request an eLetter for a business visa</a>.</p>\n<p class=\"mw-empty-elt\"></p></div>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}