{
  "title": "Agent user interface",
  "content": "<div class=\"mw-parser-output\"><p>The following sections and areas are consistent in every module of the user interface.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"> </div>\n<div class=\"admonition-content admonition-note-content\">\n<p>- The agent interface supports Screen Reader software. For more information, see <a href=\"/doc/423/26.1/accessibility#Screen_reader_support\" title=\"SMAX:25.1/ScreenReader\">Screen reader support</a>.</p>\n<p>- To switch between the classic UI and the JATO UI, click the user icon in the upper right corner and select <strong>Switch to JATO UX</strong> or <strong>Switch to Classic experience</strong>.</p>\n<p lang=\"EN-US\" xml:lang=\"EN-US\">The new JATO UX UI offers a number of improvements to enhance user experience in Service Management: </p>\n<ol role=\"list\">\n<li data-aria-level=\"3\" data-aria-posinset=\"1\" role=\"listitem\">\n<p lang=\"EN-US\" xml:lang=\"EN-US\">New Login/Logout Page: A refreshed UI design for logging in and out of the system. </p>\n</li>\n<li data-aria-level=\"3\" data-aria-posinset=\"2\" role=\"listitem\">\n<p lang=\"EN-US\" xml:lang=\"EN-US\">User-Based Toggle: Users will see a toggle when they log into the upgraded Agent UI, allowing them to switch to the new JATO UX. </p>\n</li>\n<li data-aria-level=\"3\" data-aria-posinset=\"3\" role=\"listitem\">\n<p lang=\"EN-US\" xml:lang=\"EN-US\">Updated Product Header: The header has a new look and feel, highlighting both product and module levels. </p>\n</li>\n<li data-aria-level=\"3\" data-aria-posinset=\"4\" role=\"listitem\">\n<p lang=\"EN-US\" xml:lang=\"EN-US\">New Hamburger Menu: A redesigned menu for easier navigation. (This new menu is not available in all product pages. In some pages of product, the classic menu is still displayed, such as Integration Studio, AI Studio &gt; Virtual Agent, Design &gt; Service Designer, Cost Governance, Audit, etc.)</p>\n</li>\n<li data-aria-level=\"3\" data-aria-posinset=\"5\" role=\"listitem\">\n<p lang=\"EN-US\" xml:lang=\"EN-US\">Enhanced Report Dashboard UI: Reports now feature a new color theme and graphic style for improved readability. </p>\n</li>\n<li data-aria-level=\"3\" data-aria-posinset=\"6\" role=\"listitem\">\n<p lang=\"EN-US\" xml:lang=\"EN-US\">New Look &amp; Feel Notification Panel: A revamped notification panel to show recent discussions. </p>\n</li>\n<li data-aria-level=\"3\" data-aria-posinset=\"7\" role=\"listitem\">\n<p lang=\"EN-US\" xml:lang=\"EN-US\">Updated Entity Badges: The color theme of entity badges has been redesigned. </p>\n</li>\n<li data-aria-level=\"3\" data-aria-posinset=\"8\" role=\"listitem\">\n<p lang=\"EN-US\" xml:lang=\"EN-US\">Improved Record Grid and Details Pages (partially done): A new UI style and design for the record grid and record details pages. </p>\n</li>\n<li data-aria-level=\"3\" data-aria-posinset=\"9\" role=\"listitem\">\n<p lang=\"EN-US\" xml:lang=\"EN-US\">New Aviator Inline Panel: Available in the report dashboard, record grid, and record details pages. </p>\n</li>\n<li data-aria-level=\"3\" data-aria-posinset=\"10\" role=\"listitem\">\n<p lang=\"EN-US\" xml:lang=\"EN-US\">CI Topology Widget UI: A new look and feel for the CI topology widget UI. </p>\n</li>\n<li data-aria-level=\"3\" data-aria-posinset=\"11\" role=\"listitem\">\n<p lang=\"EN-US\" xml:lang=\"EN-US\">Light/Dark Mode Switch: Users can now toggle between light and dark modes on their profile page. </p>\n</li>\n</ol>\n<p lang=\"EN-US\" xml:lang=\"EN-US\">For the pages that are not listed above, the improved UI/UX in JATO theme may not be implemented. In these pages, you may encounter imperfect UI/UX<strong> </strong>where continuous enhancements will be integrated in future releases. </p>\n</div>\n</div>\n<table>\n<tbody>\n<tr>\n<th>GUI Element</th>\n<th>Description</th>\n</tr>\n<tr>\n<td><span class=\"SAW_VariablesMain_menu_Starter\">Main menu</span></td>\n<td>\n<p>The top-level menu that points to all the modules that you can access. The list of modules varies depending on the permissions associated with your user account.</p>\n<p><b>Example</b>: the <span class=\"SAW_VariablesMain_menu\">main menu</span> contains links to <b>Incident</b>, <b>Change</b>, <b>Problem</b>, <b>Service Level</b>, and so on.</p>\n<p>If you have administrative permissions, the <b>Administration</b> menu appears in the lower section of the main menu.</p>\n<p>Click the <b>New Window/Tab</b> button to open the menu item in a new window or tab, depending on your default browser settings.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"main menu new win-or-tab.png\" data-file-height=\"169\" data-file-width=\"255\" height=\"169\" src=\"../../../images/main_menu_new_win-or-tab_ad1f60d4.png\" width=\"255\"/> </a></div>\n</td>\n</tr>\n<tr>\n<td>Submenus</td>\n<td>\n<p>Links to sections within an application module. The submenu items appear to the right of the module name.</p>\n<p><b>Example</b>: Problem Management contains submenu links to <b>Problems</b>, <b>Templates</b>, and <b>Hot Topic Analytics</b>.</p>\n</td>\n</tr>\n<tr>\n<td><b><span class=\"SAW_VariablesGrid\">List</span> view</b> (Also known as <b>Grid view</b>.)</td>\n<td>\n<p>A list of records that you can view, edit, or delete. This view is typically the starting point to create, edit, or delete a record in a module.</p>\n<p>Select a record to display its details in the <span class=\"SAW_VariablesSidebar\">right pane</span>.</p>\n<p>List view toolbar</p>\n<p>The List view has its toolbar, the contents of which vary according to the record type.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"List view toolbar\" data-file-height=\"38\" data-file-width=\"446\" height=\"38\" src=\"../../../images/list-view-toolbar_2878a1ca.png\" width=\"446\"/> </a></div>\n<ul>\n<li>Click <b>New</b> to create a record.</li>\n<li>Click <b>Details</b> to view the details of the selected record.</li>\n<li>Click <b>Refresh</b> to refresh the screen.</li>\n<li>Click <b>Columns</b> to customize your view of the fields in each record. For more information, see <a href=\"/doc/423/26.1/listviewcolumns\" title=\"SMAX:25.1/ListViewColumns\">List view columns</a>.</li>\n<li>Click <b>More</b> to display record options, the contents of which vary according to the record type. Options may include:\n\t\t\t\t<ul>\n<li><b>Export to XLS</b>. Click to download the record in <strong>XLSX</strong> format.\n\t\t\t\t\t<ol>\n<li>The downloaded file includes the data in the displayed columns, in the same sorted order, taking account of any filter applied. The file also includes filters for each column.</li>\n<li>The downloaded file is localized according to the user's language setting in the agent interface.</li>\n</ol>\n</li>\n<li><b>Export to CSV</b>. Click to download the record in CSV format.\n\t\t\t\t\t<ol>\n<li>The downloaded file includes the data in the displayed columns, in the same sorted order, taking account of any filter applied.</li>\n</ol>\n</li>\n<li><b>Send by email</b>. Click to display a blank email template. For more information, see <a href=\"/doc/423/26.1/sendrcordsbyemail\" title=\"Send records by email\">Send records by email</a>.<strong> </strong><strong>Note</strong>: You can see the same button on the toolbar of the record detail page.\n\t\t\t\t\t<ul>\n<li>Only Change, Purchase order, Request, and Incident support sending emails with attachments.</li>\n<li>The attachment field is available only when the record has non-encrypted attachments. You can select all or partial attachments to send with the email.</li>\n<li>If the total size of the selected attachments exceeds the maximum allowed value, an error occurs.</li>\n</ul>\n</li>\n<li><b>Create operational report</b> and <b>Create operational raw data report</b>. For more information, see <a href=\"/doc/423/26.1/report\" title=\"SMAX:25.1/Report\">Reports</a>.</li>\n<li><b>Export for localization.</b> For categories, offerings, service definitions, surveys, and articles, click to export records in the selected languages.</li>\n</ul>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Main toolbar</td>\n<td>\n<p>The following icons are included on the main toolbar:</p>\n<ul>\n<li>\n<p><a class=\"image\" href=\"\"> <img alt=\"Avatar icon\" data-file-height=\"13\" data-file-width=\"13\" height=\"13\" src=\"../../../images/AvatarIcon_7f9d9338.png\" width=\"13\"/> </a> The avatar of the signed in user. A green side bar indicates that the user is logged in.</p>\n</li>\n<li>\n<p><a class=\"image\" href=\"\"> <img alt=\"Help icon\" data-file-height=\"16\" data-file-width=\"17\" height=\"16\" src=\"../../../images/HelpIcon_9dd3cb95.png\" width=\"17\"/> </a> Opens help for the current area of Service Management Automation.</p>\n</li>\n<li>\n<p><a class=\"image\" href=\"\"> <img alt=\"DiscussionsIcon.png\" data-file-height=\"13\" data-file-width=\"13\" height=\"13\" src=\"../../../images/DiscussionsIcon_0f1f9123.png\" width=\"13\"/> </a> Displays the most recent discussions that you are participating in. For more information, see <a href=\"/doc/423/26.1/discussions\" title=\"SMAX:25.1/Discussions\">Discussions</a>.</p>\n</li>\n<li>\n<p><a class=\"image\" href=\"\"> <img alt=\"SearchIcon.png\" data-file-height=\"13\" data-file-width=\"13\" height=\"13\" src=\"../../../images/SearchIcon_1b94f74f.png\" width=\"13\"/> </a> Opens the search bar enabling you to do a global search for records. For more information, see <a href=\"/doc/423/26.1/globalsearch\" title=\"SMAX:25.1/GlobalSearch\">Search</a>.</p>\n</li>\n<li>\n<p><a class=\"image\" href=\"\"> <img alt=\"NetworkIndicationIcon.png\" data-file-height=\"27\" data-file-width=\"33\" height=\"27\" src=\"../../../images/NetworkIndicationIcon_d593bee5.png\" width=\"33\"/> </a> The network indication icon. The icon appears when a slow network is detected. If you hover over the icon, a tooltip is displayed indicating the average time of an operation.</p>\n<p>A slow network could be due to poor Wi-Fi reception. Try changing your location or Wi-Fi signal. If the network indication icon appears for multiple users, it may indicate that their location lacks proper Wi-Fi coverage, or that the LAN might be slow. It could also be due to a proxy or firewall issue.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Record form</td>\n<td>\n<p>Every record form displays fields and values that exist in the record. Most forms display tabbed sections, each of which contains part of the record data.</p>\n<p>At the top of the form, records display a <b>record toolbar</b>, the contents of which vary according to record type. The record toolbar may include:</p>\n<ul>\n<li><b>Comments</b> icon. Click this to open discussions or post comments about the records you are viewing.</li>\n<li><b>Start Discussion</b> icon. Click this to open a chat window.</li>\n</ul>\n<p>For more information, see <a href=\"/doc/423/26.1/discussions\" title=\"SMAX:25.1/Discussions\">Discussions</a>.</p>\n<p>At the top of the form, some record types display a <b>workflow snapshot</b> to show the current workflow metaphase for the record. For example: <a class=\"image\" href=\"\"> <img alt=\"Workflow snapshot image\" data-file-height=\"20\" data-file-width=\"102\" height=\"20\" src=\"../../../images/workflowSnapshot_256b437c.png\" width=\"102\"/> </a></p>\n<p>The snapshot graphic varies according to the workflow for the record type.</p>\n<p><b>Guidance text</b> to tell you about the current workflow metaphase, displays beside the workflow snapshot.</p>\n<p><b>Automatic</b> transitions to the next metaphase occur when certain conditions are met. The transition is usually transparent. If the next available transition in the workflow requires <b>manual</b> intervention, the next available phases appear on the upper right area of the form. If necessary, click the manual transition button to advance to the next phase. <span style=\"background-color: transparent;\">For example: </span> <a class=\"image\" href=\"\"> <img alt=\"Workflow transition to the Close phase button\" data-file-height=\"40\" data-file-width=\"122\" height=\"40\" src=\"../../../images/workflowSnapshotTransition_01114a5a.png\" style=\"background-color: transparent;\" width=\"122\"/> </a></p>\n<p>The health indicator (light bulb icon) displays if there are workflow messages for the record. <a class=\"image\" href=\"\"> <img alt=\"Health icon with messages\" data-file-height=\"15\" data-file-width=\"15\" height=\"15\" src=\"../../../images/HealthIconNum_8491b5e3.png\" width=\"15\"/> </a> The number in the icon shows how many messages are available. For example, a message might tell you that you selected a start date that's later than the end date. If you fix the date, the number reduces by one. Or, a message might tell you that a mandatory field is empty. If you complete the field, the number reduces by one.</p>\n<p>When Service Level Target (SLT) is enabled, the SLT progress bar displays the remaining/overdue time of the latest target type. </p>\n<ul>\n<li>If your updates on a record cause an SLT to become Suspended, remember to refresh the page. Otherwise, the timer will continue to count down based on the original status and target date. </li>\n<li>The remaining time of the SLT progress bar is displayed in the context of natural days. For example, if the target duration has 5 minutes left, however, the target date is the next business day, the remaining time shown in the SLT progress bar will be the difference between the current time and the target time on the next business day. </li>\n</ul>\n</td>\n</tr>\n<tr>\n<td><span class=\"SAW_VariablesTab_menu\">Tab menu</span></td>\n<td>\n<p>Provides shortcut links to sections within a record.</p>\n<p><b>Example</b>: when you display a change record, you can click the <b>Workflow</b>, <b>Task plan</b>, or <b>Related records</b> tab to jump to that section of the form.</p>\n</td>\n</tr>\n<tr>\n<td><span class=\"SAW_VariablesSidebarCaps\">Right pane</span></td>\n<td>\n<p>Displays information related to your current activity. It might be a graph, a list of related articles, a preview of the current record, or reference information that's related to the current task.</p>\n<p>If there is a preview pane, you can use this to update multiple records at once. For more information, see <a href=\"/doc/423/26.1/editrecpreview\" title=\"SMAX:25.1/EditRecPreview\">How to edit records using the Preview pane</a>.</p>\n</td>\n</tr>\n<tr>\n<td>Mandatory fields</td>\n<td>\n<p>When you create a new record, you must fill in any field marked with a red asterisk before you save the record.</p>\n<p>A field is defined as mandatory in one of these ways:</p>\n<ul>\n<li>The <b>Required</b> property is selected for the field.</li>\n<li>A business rule is defined (with or without conditions) setting the field as mandatory.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Populating fields</td>\n<td>\n<p>There are two types of selectors to populate a field with a value. You can:</p>\n<ul>\n<li>Click the list icon   <a class=\"image\" href=\"\"> <img alt=\"EnumerationIcon.png\" data-file-height=\"10\" data-file-width=\"13\" height=\"10\" src=\"../../../images/EnumerationIcon_5acaeb74.png\" width=\"13\"/> </a>   to display a simple list of eligible values. When the list of values is long, you can type a few characters into the search field (  <a class=\"image\" href=\"\"> <img alt=\"Search icon\" data-file-height=\"13\" data-file-width=\"13\" height=\"13\" src=\"../../../images/SearchIcon_1b94f74f.png\" width=\"13\"/> </a> ) to limit the results.</li>\n<li>Click the expanded list icon   <a class=\"image\" href=\"\"> <img alt=\"Expanded list icon\" data-file-height=\"16\" data-file-width=\"16\" height=\"16\" src=\"../../../images/EntityPickerIcon_40fcd801.png\" width=\"16\"/> </a>   to display a list of eligible values in a record list format. Other field values appear in this view that are useful information.</li>\n</ul>\n<p>Select your choice. If you want to remove a field value, click the cancel icon   <a class=\"image\" href=\"\"> <img alt=\"Cancel icon\" data-file-height=\"8\" data-file-width=\"8\" height=\"8\" src=\"../../../images/CancelIcon_383cf161.png\" width=\"8\"/> </a>   to remove that selection.</p>\n</td>\n</tr>\n<tr>\n<td>Field display</td>\n<td>\n<p>If you hover over certain fields, a popup window is displayed with details and a link to the record in the agent interface.</p>\n<p>For fields displaying a person or group record, clicking the link in the popup window opens a read-only preview form in the Global Search, with the details of the person or group. If you have permission to edit the person or group record, an <b>Edit</b> link appears next to the record name. Click the link to go directly to the person or group record.</p>\n</td>\n</tr>\n<tr>\n<td>Rich-text editor (original)</td>\n<td>\n<p>Most forms contain fields that require user information. In some cases, the field has a rich-text editor that enables you to format plain text. You can choose one or more format options:</p>\n<ul>\n<li>Apply bold, italics, underscores, text and background colors to plain text. Certain styles such as text color and table background color are lost when you copy and paste content to the editor.</li>\n<li>Format bulleted or numeric lists.</li>\n<li>When adding a table, note that the <strong>Headers </strong>functionality controls text boldness. Grey shading appears only in the first row when you select the <strong>First Row</strong> or <strong>Both </strong>options.</li>\n<li>Insert links (URLs) to internal or external content. To edit a link, use the keyboard to place the cursor to where you want to make changes.</li>\n<li>\n<p>Embed images by:</p>\n<p><b>Image formats:</b> The supported image formats are defined in the tenant's <b>Application settings</b> tab in Suite Administration.</p>\n<ul>\n<li>Uploading an image</li>\n<li>Specifying the URL where an image is stored. In this case, you can provide a width and height for the image, specify where it should be aligned. You can also add tooltip text (<b>Alt Text</b>) for the image. </li>\n<li>Copying and pasting images. You can only copy and paste one image from OneNote to the editor. <strong>Note</strong>: When you copy content from the rich-text editor of one record to another record, if the content contains an image, you need to delete and then reinsert the image in the target record. Each inserted image is assigned a unique URL, however, a copied image shares the same URL as the source one. Deleting an image from one record will eventually (not immediately) delete all images that have the same URL from other records.</li>\n<li>Dragging and dropping image files.</li>\n</ul>\n</li>\n<li>Select <b>Source mode</b> <a class=\"image\" href=\"\"> <img alt=\"Source mode.png\" data-file-height=\"24\" data-file-width=\"21\" height=\"24\" src=\"../../../images/Source_mode_9678f1e8.png\" width=\"21\"/> </a> to edit the HTML code directly.</li>\n<li>Select <b>Full screen mode</b> <a class=\"image\" href=\"\"> <img alt=\"Full screen.png\" data-file-height=\"26\" data-file-width=\"24\" height=\"26\" src=\"../../../images/Full_screen_e3d203b5.png\" width=\"24\"/> </a> to maximize the editor to the full screen.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>New rich-text editor </td>\n<td>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"> </div>\n<div class=\"admonition-content admonition-note-content\">- For the upgrade tenants, the new rich-text editor is in use after you <a href=\"/doc/423/26.1/appsettings#Enable_new_rich-text_editor\" title=\"Enable new rich-text editor\">Enable new rich-text editor</a>. For the new tenants, the new rich-text editor is in use by default.<br/>\n\t\t\t- As we do not support to switch back from the new rich-text editor to the previous editor, if you export the Dev2Prod package which contains rich-text content from a tenant where the new editor is enabled (such as a new Dev tenant), please do not import the same package to a tenant where the previous editor is used (such as an upgrade Prod tenant).</div>\n</div>\n<p>Most forms contain fields that require user information. In some cases, the field has a rich-text editor that enables you to format plain text. You can choose one or more format options:</p>\n<ul type=\"disc\">\n<li>Apply bold, italics, underscores, text and background colors to plain text. </li>\n<li>Format bulleted or numeric lists.</li>\n<li>When adding a table, note that the <b>Headers </b>functionality controls text boldness. </li>\n<li>Insert links (URLs) to internal or external content. To edit a link, use the mouse to place the cursor to where you want to make changes.</li>\n<li>Embed images by:<br/>\n<b>Image formats:</b> The supported image formats are defined in the tenant's <b>Application settings</b> tab in Suite Administration.\n\t\t\t\t<ul>\n<li>Uploading an image</li>\n<li>Specifying the URL where an image is stored. In this case, you can provide a width and height for the image, specify where it should be aligned. You can also add tooltip text (<b>Alternative Text</b>) for the image. </li>\n<li>Copying and pasting images. </li>\n<li>Dragging and dropping image files.</li>\n</ul>\n</li>\n<li>Select <b>Code View</b> <a class=\"image\" href=\"\"> <img alt=\"wR9h5uYUHyNTQAAAABJRU5ErkJggg==\" crossorigin=\"use-credentials\" data-custom=\"AAMkAGQ2NzYxMmQ2LTE3YWItNDRkYy1hMTI0LTNmYTIwYWFkYzFmMgBGAAAAAACZN%2Fi9uOluSaIuGCWDRPkuBwBDti6f8o9tQ5mAFIxvDTp0AAAAAAEMAABDti6f8o9tQ5mAFIxvDTp0AAH%2BfLTxAAABEgAQAJhSHQNumAVCuvldbdZw8Hc%3D\" data-imagetype=\"AttachmentByCid\" fetchpriority=\"high\" height=\"23\" id=\"x_Picture_x0020_3\" src=\"../../../images/wAAACH5BAEKAAAALAAAAAABAAEAAAICRAEAOw_d639b57c\" tabindex=\"0\" width=\"34\"/> </a> to edit the HTML code directly.</li>\n<li>Select <b>Fullscreen</b> <a class=\"image\" href=\"\"> <img alt=\"ucoAteEyzcyYR+6SR5bcjlUtd1zqtYZB909u6hIwL0ILKoCxAUldfD4CDoQWRRFyAoKq+HwUHQg8iiLh67FJuGD8dANQAAAABJRU5ErkJggg==\" crossorigin=\"use-credentials\" data-custom=\"AAMkAGQ2NzYxMmQ2LTE3YWItNDRkYy1hMTI0LTNmYTIwYWFkYzFmMgBGAAAAAACZN%2Fi9uOluSaIuGCWDRPkuBwBDti6f8o9tQ5mAFIxvDTp0AAAAAAEMAABDti6f8o9tQ5mAFIxvDTp0AAH%2BfLTxAAABEgAQAO5iEj3476xOopLAvhiIMVs%3D\" data-imagetype=\"AttachmentByCid\" fetchpriority=\"high\" height=\"27\" id=\"x_Picture_x0020_4\" src=\"../../../images/wAAACH5BAEKAAAALAAAAAABAAEAAAICRAEAOw_d639b57c\" tabindex=\"0\" width=\"33\"/> </a> to maximize the editor to the full screen.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Keyboard shortcuts</td>\n<td>For a list of keyboard shortcuts, see <a href=\"/doc/423/26.1/accessibility#Keyboard_navigation\" title=\"SMAX:25.1/KeyboardShortcuts\">Keyboard navigation</a>.</td>\n</tr>\n</tbody>\n</table>\n<div> </div>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}