{
  "title": "Smart virtual agent",
  "content": "<div class=\"mw-parser-output\">\n<div></div>\n<p><br/>\nEnd users can chat with the smart virtual agent in Service Portal in natural language. The smart virtual agent combines Rasa with IDOL to understand their intentions and find the most matched intent predefined to provide either related answers or catalog offerings as responses. Rasa natural language understanding (NLU) is an open source natural language processing (NLP) tool for intent classification and user option extraction. The smart virtual agent uses Rasa as a set of high level APIs for building your own language parser with existing NLP and machine learning libraries. However, the classification algorithm only manages limited data volume. When an end user's question isn't understood by Rasa, the virtual agent utilizes IDOL and leverages the bigger index data volume in IDOL to provide cognitive search against the end user's question. The following diagram illustrates the smart virtual agent workflow:</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"201902VA workflow.png\" border=\"0\" decoding=\"async\" file=\"https://staging.docs.microfocus.com/mediawiki/images/e/ee/201902VA_workflow.png\" hspace=\"0\" src=\"../../../images/201902VA_workflow_5eec68d9.png\" style=\"width: 800px; height: 274px; margin: 0px; border: 0px solid black;\" vspace=\"0\"/> </a></div>\n<ol>\n<li>When an end user enters an issue or a question, the smart virtual agent matches the input to an appropriate intent based on the training sentences predefined in that intent.</li>\n<li>The smart virtual agent follows the entitlement rules defined in Access Control List (ACL), and then suggests intents based on the catalog offering and the KM articles that are eligible to this end user's profile. The smart virtual agent's response can prompt the end user either for more information to continue the conversation or to just end the conversation.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Enable_the_smart_virtual_agent\"><a id=\"Enable-the-smart-virtual-agent\" name=\"Enable-the-smart-virtual-agent\" title=\"Enable the smart virtual agent\"></a>Enable the smart virtual agent</h2>\n<h3 id=\"On-premises_deployment\"><a id=\"Helm-deployment\" name=\"Helm-deployment\" title=\"Helm deployment\"></a>Helm deployment</h3>\n<p>To enable the Smart Virtual Agent for an on-premises suite deployment, follow these Helm deployment steps:</p>\n<ol>\n<li>Log in to the bastion node or master node.</li>\n<li>List all Helm releases.\n\t<pre>helm list -A</pre>\n</li>\n<li>Retrieve your custom <code>sma-values.yaml</code> file:\n\t<pre>helm get values sma -n itsma-eks &gt; sma-values.yaml</pre>\n</li>\n<li>Edit the YAML file:\n\t<pre>vi sma-values.yaml</pre>\n<ol>\n<li>In the file, navigate to <code>global &gt; services</code>.</li>\n<li>Set <strong>VA deployment</strong> to <code>true</code>.</li>\n</ol>\n</li>\n<li>Verify the changes with a dry run:\n\t<pre>helm upgrade sma esm-&lt;release-tag&gt;.tgz -n itsma-eks -f sma-values.yaml --dry-run</pre>\n</li>\n<li>Apply the changes:\n\t<pre>helm upgrade sma esm-&lt;release-tag&gt;.tgz -n itsma-eks -f sma-values.yaml</pre>\n</li>\n<li>Check the upgrade status:\n\t<pre>helm history sma -n itsma-eks</pre>\n</li>\n<li>Verify that Virtual Agent pods are running:\n\t<pre>kubectl get pods -n itsma-eks | grep -i virtual</pre>\n</li>\n<li>If the upgrade fails, roll back to the previous revision:\n\t<pre>helm rollback sma -n itsma-eks &lt;REVISION&gt;</pre>\n</li>\n</ol>\n<h3 class=\"mw-headline\" id=\"Cloud_deployment\"><a id=\"Cloud-deployment\" name=\"Cloud-deployment\" title=\"Cloud deployment\"></a>Cloud deployment</h3>\n<p>Follow these steps to enable the smart virtual agent if your suite is deployed in the cloud:</p>\n<ol>\n<li>Log in to a control plane node as root or a sudo user, and run the following command to get the virtual agent pod status:<br/>\n<code>kubectl get deployment -n &lt;namespace&gt; | grep virtual</code><br/>\n\tYou can get the status for the following services:\n\t<ul>\n<li>virtual-agent-admin-ui</li>\n<li>virtual-agent-nlu</li>\n<li>virtual-agent-bot-engine</li>\n</ul>\n</li>\n<li>Run the following command one by one to scale up the virtual agent pods:\n\t<pre>kubectl scale deployment virtual-agent-admin-ui -n &lt;namespace&gt; --replicas=1</pre>\n<pre>kubectl scale deployment virtual-agent-nlu -n &lt;namespace&gt; --replicas=1</pre>\n<pre>kubectl scale deployment virtual-agent-bot-engine -n &lt;namespace&gt; --replicas=1</pre>\n</li>\n<li>Wait a few minutes and run the following command again to check if the pods are running with the status of 1/1. <code>kubectl get deployment -n &lt;namespace&gt; | grep virtual</code></li>\n<li>If the pods are running, log in to Service Management, from the main menu, select <b>Administration &gt; Configuration &gt; Application Settings</b>. Navigate to <b>Enable smart virtual agent</b>, select <b>On</b>. The smart virtual agent is part of the standard tenant life cycle management. For example, when you synchronize a development tenant to a production tenant, the virtual agent settings, intents, and user options on the development tenant are synchronized as well. Another example is, when you create, delete, or clone a tenant, the virtual agent settings, intents, and user options on this tenant are created, deleted, or cloned as well.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Configure_the_smart_virtual_agent\"><a id=\"Configure-the-smart-virtual-agent\" name=\"Configure-the-smart-virtual-agent\" title=\"Configure the smart virtual agent\"></a>Configure the smart virtual agent</h2>\n<p>Follow these steps to configure the settings for a smart virtual agent:</p>\n<ol>\n<li>\n<p>Select <b>Administration</b> &gt; <b>Configuration</b> &gt; <strong>AI Studio </strong>&gt; <b>Virtual Agent</b>.</p>\n<p><b>Tips:</b> The system may display a 503 error here because the smart virtual agent isn't enabled yet. It may take a while for the smart virtual agent to be enabled.</p>\n</li>\n<li>Click the <b>Configurations </b>tab.</li>\n<li>In the <b>Name</b> field, enter a name for the smart virtual agent.</li>\n<li>\n<p>Click the current avatar, and then browse for another photo that's saved on your computer. Select your new photo and then click <b>Open</b>. Alternatively, double-click the new photo. The system displays the new avatar automatically.</p>\n<p>The default avatar is  <a class=\"image\" href=\"\"> <img alt=\"VAIcon_242\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/0/02/VAIcon_242.png\" hspace=\"0\" src=\"../../../images/VAIcon_242_94fc02f4.png\" style=\"width:29px;height:29px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a> . The supported image types include *.jpg, *.png, and *.gif. The maximum file size is 2 MB and the recommended image dimension is 200x200 px.</p>\n<p>To remove this avatar, hover your mouse over the avatar and then click  <a class=\"image\" href=\"\"> <img alt=\"201902VA remove.png\" decoding=\"async\" src=\"../../../images/201902VA_remove_9d959d4e.png\" style=\"width: 38px; height: 38px;\"/> </a> .</p>\n</li>\n<li>In the <b>Greeting words</b> field, type one or more greeting sentences for the smart virtual agent.</li>\n<li>Type a number in the <b>Number of Intent suggestion attempts</b> field to specify the smart virtual agent's maximum rounds of intent confirmation queries. For example, if a user selects <b>No</b> in a prompt provided by the smart virtual agent, the smart virtual agent may send another response back and prompt the end user for more information to continue the conversation. This back-and-forth process repeats in a cadence as you defined in this field.</li>\n<li>Type a decimal value between 0 and 1 in the <b>Intent matching threshold</b> field. The value of 0 is the slackest intent matching, whereas 1 represents the exactest matching.</li>\n<li>In the <b>Information security tips</b> field, type one or more security tips that may gain a user's attention. The system displays these sentences on top of the user's message input field when a conversation starts.</li>\n<li>Click <b>Save</b> to save your settings.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Manage_user_options\"><a id=\"Manage-user-options\" name=\"Manage-user-options\" title=\"Manage user options\"></a>Manage user options</h2>\n<p>The smart virtual agent uses user options to parse parameters from user inputs. You need to define a corresponding user option for any important data you want to get from a user's request.</p>\n<p>A user option consists of the following two main components:</p>\n<ul>\n<li><b>User option name:</b> The name of the user option.</li>\n<li><b>Values:</b> Defines the real world options for user selection in a chat.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Add_a_new_user_option\"><a id=\"Add-a-new-user-option\" name=\"Add-a-new-user-option\" title=\"Add a new user option\"></a>Add a new user option</h3>\n<p>Follow these steps to add a new user option:</p>\n<ol>\n<li>Select <b>Administration</b> &gt; <b>Configuration</b> &gt; <strong>AI Studio </strong>&gt; <b>Virtual Agent</b>.</li>\n<li>Click the <b>User options</b> tab to open the user options list.</li>\n<li>Click <b>New</b> to open the <b>New user option</b> page.</li>\n<li>Type a name for the new user option in the <b>User option name</b> field.</li>\n<li>\n<p>Click <b>ADD DEFINITION</b> to add the value options to this user option. You can provide value and display name for each definition.</p>\n<table>\n<tbody>\n<tr>\n<th>Option</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Value</td>\n<td>\n<p>The value of a definition. If the user option record is mapped to a user option in an offering or a field in a request, each value here must exactly match each user option item name or each field value name defined in <b>Studio</b>.</p>\n<p>This release only supports simple user option including the String, List, and Boolean types.</p>\n</td>\n</tr>\n<tr>\n<td>Display name</td>\n<td>The string that's used for user selection during the runtime chat.</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li>Click <b>Save</b> to save the definition. To remove a definition, click <a class=\"image\" href=\"\"> <img alt=\"201902VA remove.png\" decoding=\"async\" src=\"../../../images/201902VA_remove_9d959d4e.png\" style=\"width: 38px; height: 38px;\"/> </a> .</li>\n<li>Add more definitions as necessary, and then click <b>Save</b> to save the user option.</li>\n</ol>\n<h3 class=\"mw-headline\" id=\"Remove_a_user_option\"><a id=\"Remove-a-user-option\" name=\"Remove-a-user-option\" title=\"Remove a user option\"></a>Remove a user option</h3>\n<p>Follow these steps to remove a user option:</p>\n<ol>\n<li>Select a user option record on the <b>User options</b> tab page, and then click <b>Delete</b>. Alternatively, click <a class=\"image\" href=\"\"> <img alt=\"201902VA remove.png\" decoding=\"async\" src=\"../../../images/201902VA_remove_9d959d4e.png\" style=\"width: 38px; height: 38px;\"/> </a> on the user option to be removed.<br/>\n\tThe system opens the <b>Delete Confirmation</b> dialog.</li>\n<li>Click <b>DELETE</b> to confirm.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Manage_intents\"><a id=\"Manage-intents\" name=\"Manage-intents\" title=\"Manage intents\"></a>Manage intents</h2>\n<p>An intent is basically a conversation rule that maps end user input to actions and responses of the smart virtual agent. In each intent, you can define examples of user inputs that can trigger the intent, what to extract from the input, and how to respond.</p>\n<p>An intent consists of three main components that allow you to map what a user inputs to what a smart virtual agent responds with. These components include the following:</p>\n<ul>\n<li><b>Intent name:</b> The name of the intent.</li>\n<li><b>Training sentences:</b> Examples of what users can say to match a particular intent.</li>\n<li><b>Action:</b> Defines how relevant information is extracted from user inputs. You can use parameters as input into other logic, such as looking up information, carrying out a task, or returning a closing message.</li>\n</ul>\n<h3 class=\"mw-headline\" id=\"Add_new_intents_automatically\"><a id=\"Add-new-intents-automatically\" name=\"Add-new-intents-automatically\" title=\"Add new intents automatically\"></a>Add new intents automatically</h3>\n<p>You may have an empty intent list in your system at the very beginning. To quickly add a list of intents, click <b>Automatic Learning</b> on the <strong>Intents </strong>tab page to automatically generate the intents for the smart virtual agent. If an error message \"Request failed with status code 504\" prompts after you click this button, click <b>OK</b>, wait a while, and then refresh the page, the learning process continues automatically. Here are some details about how this function works:</p>\n<ol>\n<li>The algorithm firstly searches and groups the user requests by the offerings, and then sorts the results to pick out the most popular offerings that have at least two related requests.</li>\n<li>\n<p>The algorithm filters out the requests whose descriptions contain less than three words.</p>\n<p>Now the remaining offerings are qualified for automatic learning. Each offering has at least two related requests, and the description of each request has at least three words.</p>\n</li>\n<li>The system automatically generates intents linked to these offerings. In each intent, the system generates the training sentences based on the descriptions of the most popular user requests and the display labels of the linked offerings, and then attaches an existing Service Catalog offering as an entity to the intent. You need to manually enable these intents.</li>\n</ol>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>If you click <b>Automatic Learning</b> multiple times, the system compares the intent names and will not overwrite the same intents that are existent.</div></div></div>\n<h3 class=\"mw-headline\" id=\"Add_a_new_intent_manually\"><a id=\"Add-a-new-intent-manually\" name=\"Add-a-new-intent-manually\" title=\"Add a new intent manually\"></a>Add a new intent manually</h3>\n<p>Follow these steps to add a new intent manually:</p>\n<ol>\n<li>Select <b>Administration</b> &gt; <b>Configuration</b> &gt; <strong>AI Studio </strong>&gt; <b>Virtual Agent</b>.</li>\n<li>Click the <b>Intents </b>tab to open the intents list.</li>\n<li>Click <b>New</b> to open the <b>New intent</b> page.</li>\n<li>In the <b>Intent name</b> field, type a name for the intent. </li>\n<li>\n<p>(Optional) Turn on the <b>Recommend the intent in the virtual agent's greetings</b> option. The smart virtual agent includes this intent as one of the articles, news, or offerings in the greeting dialog when an end user starts a chat.</p>\n<p>In the greeting dialog, the smart virtual agent recommends up to three options for each type in the list. These types include Question, News, Article, and Offering.</p>\n</li>\n<li>\n<p>(Optional) Type a question in the <b>Intent confirmation message</b> field. The smart virtual agent displays this question to a user when the current intent is open. For example, <code>Do you want to request a new PC?</code>.</p>\n<p>If you leave this field blank, the smart virtual agent uses the intent name instead.</p>\n</li>\n<li>\n<p>Add multiple training sentences. The system requires at least one training sentence.</p>\n<p>Training sentences are collections of possible questions that an end user may ask when meeting a problem. You need to define multiple training sentences within an intent so that your smart virtual agent can recognize a greater variety of user input. The more variations added to training sentences, the better a smart virtual agent understands the end user's question.</p>\n<p>You can perform the following tasks:</p>\n<ul>\n<li><b>Add a training sentence:</b><br/>\n\t\tType a training sentence in the blank field, and then press Enter.</li>\n<li><b>Edit a training sentence:</b><br/>\n\t\tClick a training sentence to edit, and then click the save button to save the changes.</li>\n<li><b>Remove a training sentence:</b><br/>\n\t\tClick <a class=\"image\" href=\"\"> <img alt=\"201902VA intentremove.png\" decoding=\"async\" src=\"../../../images/201902VA_intentremove_7ac45907.png\" style=\"width: 20px; height: 20px;\"/> </a> to remove a training sentence.</li>\n</ul>\n</li>\n<li>\n<p>Specify actions.</p>\n<p>Action refers to the smart virtual agent's solution to the intent. An action defines how the smart virtual agent processes the intent.</p>\n<p>The system provides two action modes and you can use the toggle key to switch from <b>Entity link mode</b> to <b>Conversation mode</b>.</p>\n<p>In the <b>Entity link mode</b>, you can attach an entity to the intent without additional configurations. Follow these steps:</p>\n<ol>\n<li>Click <b>Attach an entity</b>. The system opens the <b>Attach an entity</b> dialog.</li>\n<li>Filter or search for the entities.</li>\n<li>Select an entity, and then click <b>ATTACH</b>.<br/>\n\t\tDepending on your selection, the smart virtual agent either displays an article or opens a Support/Service Request based on the Catalog offerings when using the current intent.</li>\n</ol>\n<p>In the <b>Conversation mode</b>, you can perform the following tasks:</p>\n<ul>\n<li><b>Define an action in the text field:</b><br/>\n\t\tAn intent triggers a support request or a service request based on the scripts defined in this field. Note that:\n\t\t<ul>\n<li>The action name must be <strong>submit_offering_request</strong>.</li>\n<li>Action parameters define the fields used in a request record. Make sure these parameters comply with the established business rules for handling requests. See <a href=\"/doc/423/26.1/requestflows\" title=\"Request flows\">Request flows</a>.</li>\n<li>Use meaningful English names for action parameters and avoid special characters like slashes (/), percentages (%), and spaces.</li>\n</ul>\n\t\tSee the following example of a JSON code snippet to configure the action.\n\n\t\t<pre>{\n  \"name\": \"submit_offering_request\",\n  \"parameters\": {\n    \"Urgency\": \"${affect}\",\n    \"Description\": \"${description}\",\n    \"offering_id\": \"12201\",\n    \"user_options\": [\n      {\n        \"name\": \"HomeLocation_c\",\n        \"value\": \"${homeLocation}\"\n      },\n      {\n        \"name\": \"OfficePhone_c\",\n        \"value\": \"${officePhone}\"\n      }\n    ],\n    \"PreferredContactMethod\": \"${contactMethod}\"\n  }\n}\n\n</pre>\n\t\tThe following image illustrates the user option mapping:<br/>\n<a class=\"image\" href=\"\"> <img alt=\"SMAX 2019.08 smartVAconversation.png\" border=\"0\" decoding=\"async\" file=\"https://staging.docs.microfocus.com/mediawiki/images/1/17/SMAX_2019.08_smartVAconversation.png\" hspace=\"0\" src=\"../../../images/SMAX_2019.08_smartVAconversation_fd94ae8a.png\" style=\"width: 800px; height: 420px; margin: 0px; border: 0px solid black;\" vspace=\"0\"/> </a><br/>\n\t\tThe following table shows the sample properties and the descriptions.\n\t\t<table>\n<tbody>\n<tr>\n<th>Property</th>\n<th>Example</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>name</td>\n<td>submit_offering_request</td>\n<td>The action name.</td>\n</tr>\n<tr>\n<td>Urgency</td>\n<td>${affect}</td>\n<td>The urgency level of this Service Request.</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>${description}</td>\n<td>The business justification field on a Service Request form.</td>\n</tr>\n<tr>\n<td>offering_id</td>\n<td>\"12201\"</td>\n<td>The offering ID in your Service Management system.</td>\n</tr>\n<tr>\n<td>user_options</td>\n<td>[{ \"name\": \"HomeLocation_c\",<br/>\n\t\t\t\t\t\"value\": \"${homeLocation}\"},<br/>\n\t\t\t\t\t{ \"name\": \"OfficePhone_c\",<br/>\n\t\t\t\t\t\"value\": \"${OfficePhone}\"}]</td>\n<td>\n<p>The array of objects for user options defined in this service offering. Each entry is an object for a specific user option. The <code>name</code> is the user option name, and you can find the name from the Catalog Management. The value is the parameter name preceded by a <code>$</code>.</p>\n<p>This release only supports simple user options. This release doesn't support dependent user option.</p>\n</td>\n</tr>\n<tr>\n<td>PreferredContactMethod</td>\n<td>${contactMethod}</td>\n<td>The Preferred contact method field on a Request form.</td>\n</tr>\n</tbody>\n</table>\n<p>However, the scripts in the action text field are optional. If you leave this text field blank, the smart virtual agent returns the closing messages as you defined to the end user. In this case, you must define a closing message.</p>\n</li>\n<li><b>Add a parameter:</b><br/>\n\t\tClick <b>Add a parameter</b> to add a new parameter. The following table shows the fields and the descriptions.\n\t\t<table>\n<tbody>\n<tr>\n<th>Field</th>\n<th>Description</th>\n</tr>\n<tr>\n<td>Required</td>\n<td>Select the check box to mark this parameter as mandatory.</td>\n</tr>\n<tr>\n<td>Parameter name</td>\n<td>Type a name for the parameter.</td>\n</tr>\n<tr>\n<td>Virtual agent says</td>\n<td>\n<p>Click <b>Edit virtual agent says</b> to specify the prompts. The smart virtual agent will use the prompts as questions during a chat.</p>\n<p>If you add multiple prompts for a parameter, the smart virtual agent will use these prompts randomly.</p>\n</td>\n</tr>\n<tr>\n<td>Answer option type</td>\n<td>\n<p>Select a user option from the drop-down list to associate the parameter with a user option. There is a system built-in user option named <code>@sys.any</code> that can be used to represent the string type of data such as \"description\" in requests.</p>\n</td>\n</tr>\n</tbody>\n</table>\n</li>\n<li><b>Remove a parameter:</b><br/>\n\t\tSelect the parameter to be removed, and then click the <b>X</b> icon.</li>\n<li><b>Adjust the parameter sequence:</b><br/>\n\t\tHover over a parameter, and then adjust its sequence by drag-and-drop.</li>\n<li><b>Add or remove a closing message:</b><br/>\n\t\tThe closing message is the smart virtual agent's final response in a chat session which is classified to the current intent. Click <b>ADD CLOSING MESSAGE</b> to add a new closing message to the current intent. You can use parameter values such as <code>${value}</code> in the closing message.<br/>\n\t\tTo remove a closing message, click the <b>X</b> icon on the right.</li>\n</ul>\n</li>\n<li>Click <b>Save</b> to save the intent.</li>\n</ol>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-tip-icon\"></div><div class=\"admonition-content admonition-tip-content\"><div>You can create up to 300 intents. For each intent, you can add up to 20 training sentences. There's also a limit for the total number of training sentences: 1000 for East Asian languages (Japanese, Simplified Chinese, and Korean), and 2400 for other languages. A suite administrator can <a href=\"/doc/423/26.1/smartvahwconsumptionusagetuning#ChgTotalNo\" title=\"change the default limit for total number of training sentences\">change the default limit for total number of training sentences</a>.</div></div></div>\n<h3 class=\"mw-headline\" id=\"Disable_an_intent\"><a id=\"Disable-an-intent\" name=\"Disable-an-intent\" title=\"Disable an intent\"></a>Disable an intent</h3>\n<p>To disable an intent, open an intent record on the <b>Intents </b>tab page, and then deselect the <b>Enabled</b> check box. After you disable an intent, the smart virtual agent no longer maps the user input to the actions and responses defined in this intent.</p>\n<p>To enable an intent, select the <b>Enabled</b> check box.</p>\n<p>After you enable or disable intents, return to the <b>Intents </b>tab page and then click <b>Train</b> so that the smart virtual agent can learn from your revision.</p>\n<h3 class=\"mw-headline\" id=\"Remove_an_intent\"><a id=\"Remove-an-intent\" name=\"Remove-an-intent\" title=\"Remove an intent\"></a>Remove an intent</h3>\n<p>Follow these steps to remove an intent:</p>\n<ol>\n<li>Select an intent record on the <b>Intents </b>tab page, and then click <b>Delete</b>. Alternatively, click <a class=\"image\" href=\"\"> <img alt=\"201902VA remove.png\" decoding=\"async\" src=\"../../../images/201902VA_remove_9d959d4e.png\" style=\"width: 38px; height: 38px;\"/> </a> on the intent.<br/>\n\tThe system opens the <b>Delete Confirmation</b> dialog.</li>\n<li>Click <b>DELETE</b> to confirm.</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Train_a_user_option_or_an_intent\"><a id=\"Train-an-intent\" name=\"Train-an-intent\" title=\"Train an intent\"></a>Train an intent</h2>\n<p>After you edit intents, click <b>Train</b> on the <b>Intents </b>tab page so that the smart virtual agent can learn from your revision. After training, the smart virtual agent can chat with end users based on intents.</p>\n<p>If the training fails, one possible cause is your hardware doesn't support AVX instructions. For details, see <a href=\"/doc/423/26.1/supportavxofcpuinsmartva\" title=\"Smart virtual agent fails to perform training because the CPU doesn't support AVX\">Smart virtual agent fails to perform training because the CPU doesn't support AVX</a>.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>The <b>Train</b> button is disabled if the number of enabled intents is smaller than 2.</div></div></div>\n<h2 class=\"mw-headline\" id=\"Export_and_import\"><a id=\"Export-and-import\" name=\"Export-and-import\" title=\"Export and import\"></a>Export and import</h2>\n<p>You can export and import the intents within the same suite version.</p>\n<p>Click <b>Export</b> on the <b>Intents </b>tab page to export the settings of the smart virtual agent to a *.json file, which includes all intents, user options, and configurations. This *.json file can be used for backing up the smart virtual agent or transferring the smart virtual agent from one tenant to another.</p>\n<p>To import and restore the smart virtual agent's settings, click <b>Import</b> on the <b>Intents </b>tab page and then click <b>UPLOAD</b> to select the exported *.json file. The entity IDs in the intents are updated to the offering IDs in the target tenant automatically, if there are no corresponding offerings in the target tenant, the entity IDs are left empty, you need to link them manually.</p>\n<h2 class=\"mw-headline\" id=\"Multi-language_support\"><a id=\"Multi-language-support-in-one-tenant\" name=\"Multi-language-support-in-one-tenant\" title=\"Multi-language support in one tenant\"></a>Multi-language support in one tenant</h2>\n<p>You can enter intents, user options, training sentences, and configurable messages in different languages, by clicking the <a class=\"image\" href=\"\"> <img alt=\"EllipsisIcon.png\" data-file-height=\"15\" data-file-width=\"15\" src=\"../../../images/EllipsisIcon_882f0854.png\" style=\"width: 15px; height: 15px;\"/> </a>  button next to the corresponding field. After you provide multilingual training sentences for a specific intent, go to the Intents tab and click <strong>Train</strong>.</p>\n<p>The languages supported by the smart virtual agent are listed in <a href=\"/doc/423/26.1/supportmatrixonprem#Language_support\" title=\"Language support\">Language support</a>. End users can chat with the smart virtual agent in their preferred language. The smart virtual agent can automatically detect the language for intent prediction. If the detection fails, the agent will respond in the language specified in the end user's profile.</p>\n<p>The configurable messages include greeting messages, security tips, confirmation messages, and closing messages. When end users launch the smart virtual agent chat window, the configurable messages and the intents list will be shown in the language set in the end user's profile.</p>\n<h2 class=\"mw-headline\" id=\"Smart_virtual_agent_configuration_use_case\"><a id=\"Smart-virtual-agent-configuration-use-case\" name=\"Smart-virtual-agent-configuration-use-case\" title=\"Smart virtual agent configuration use case\"></a>Smart virtual agent configuration use case</h2>\n<p>This use case guides you to add one demonstration intent for updating the end user's personal information. Follow these sample steps:</p>\n<ol>\n<li>\n<p>Add the <b>contactMethod</b> user option as shown in the following screenshot:</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"edit_user_option.png\" border=\"0\" file=\"/mediawiki/images/9/9c/edit_user_option.png\" hspace=\"0\" src=\"../../../images/edit_user_option_408cc999.png\" style=\"width:800px;height:365px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\"/> </a></div>\n<p>This user option record is mapped to a field in a request, and each value here must exactly match each field value name defined in <b>Studio</b>. Here is a sample configuration in Service Management:</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"useroption 1.png\" decoding=\"async\" src=\"../../../images/800px-useroption_1_d019b8d9.png\" style=\"width: 800px; height: 217px;\"/> </a></div>\n</li>\n<li>\n<p>Create a new intent, and then type an intent name, an intent confirmation message, and some training sentences as required. If you want to type in other languages, click the ellipsis button  <a class=\"image\" href=\"\"> <img alt=\"EllipsisIcon.png\" data-file-height=\"15\" data-file-width=\"15\" src=\"../../../images/EllipsisIcon_882f0854.png\" style=\"width: 15px; height: 15px;\"/> </a>   and enter texts into your selected field. See the following screenshot as an example:<br/>\n<a class=\"image\" href=\"\"> <img alt=\"change_personal_detail.png\" border=\"0\" file=\"/mediawiki/images/4/47/change_personal_detail.png\" hspace=\"0\" src=\"../../../images/change_personal_detail_8a45b9d3.png\" style=\"width: 800px; height: 379px; margin: 0px; border: 0px solid black;\" vspace=\"0\"/> </a></p>\n</li>\n<li>\n<p>Add the following scripts to the <b>Action</b> text field:</p>\n<pre>{\n  \"name\": \"submit_offering_request\",\n  \"parameters\": {\n    \"Description\": \"${description}\",\n    \"offering_id\": \"12201\",\n    \"user_options\": [\n      {\n        \"name\": \"HomeLocation_c\",\n        \"value\": \"${homeLocation}\"\n      },\n      {\n        \"name\": \"OfficePhone_c\",\n        \"value\": \"${officePhone}\"\n      }\n    ],\n    \"PreferredContactMethod\": \"${contactMethod}\"\n  }\n} </pre>\n<p>Where:</p>\n<ul>\n<li><code>Id 12201</code> is the ID for the service offering <b>Change personal details</b> in Service Management.</li>\n<li><code>Description</code> is displayed as the <b>Business justification</b> field on the Service Request form. The value <code>${description}</code> is defined in the parameter section.</li>\n<li>\n<p><code>User_options</code> contains two user options that are defined in the <b>Change personal details</b> service offering, and the value of <code>${homeLocation}</code> and <code>${officePhone}</code> are defined in the parameter section. They are the parameter names preceded by <code>$</code>. See the following screenshot as a sample configuration in Service Management:</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"intent 4.png\" decoding=\"async\" src=\"../../../images/800px-intent_4_3b650f2c.png\" style=\"width: 800px; height: 252px;\"/> </a></div>\n</li>\n<li><code>PreferredContactMethod</code> is displayed as the <b>Preferred contact method</b> field on the Service Request form. The value <code>$contactmethod</code> is defined in the parameter section.</li>\n</ul>\n</li>\n<li>Add parameters and closing messages as shown in the following screenshot:<br/>\n<a class=\"image\" href=\"\"> <img alt=\"action_closingmessage.png\" border=\"0\" file=\"/mediawiki/images/4/4f/action_closingmessage.png\" hspace=\"0\" src=\"../../../images/action_closingmessage_cc7e03d2.png\" style=\"width: 800px; height: 398px; margin: 0px; border: 0px solid black;\" vspace=\"0\"/> </a>  \n\t<p>Set the <b>description</b> parameter as required, and then click <b>Edit virtual agent says</b>. In the <b>Prompts for the description parameter</b> dialog, type <b>Why did you move?</b>. Set the answer option type to <b>@sys.any</b> so as to represent the end user's inputs, which is the string type of data.</p>\n<p>Set the <b>contactMethod</b> parameter as required, and then click <b>Edit virtual agent says</b>. In the <b>Prompts for the description parameter</b> dialog, type <b>If we need to verify anything, what's the best way for HR to contact you?</b>. Set the answer option type to <b>contactMethod</b> so that the system associates the parameter with a user option.</p>\n<p>Set the smart virtual agent says to <b>What is your new address?</b> for the <b>homeLocation</b> parameter, and then set the virtual agent says to <b>Did you change your number as well? Let me know your new number and I'll update that as well.</b> for the <b>officePhone</b> parameter.</p>\n</li>\n<li>Click <b>Train</b> to perform training after you add the user options and intents. The system will notify you when the training is completed.</li>\n<li>\n<p>Switch to Service Portal to start a chat with the smart virtual agent.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"VAChat 1.png\" decoding=\"async\" src=\"../../../images/800px-VAChat_1_0c77856c.png\" style=\"width: 800px; height: 546px;\"/> </a></div>\n<p>Click <b>Yes</b>, and then type a reason as the smart virtual agent prompts.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"VAChat 2.png\" decoding=\"async\" src=\"../../../images/800px-VAChat_2_895a041a.png\" style=\"width: 800px; height: 242px;\"/> </a></div>\n<p>Click either <b>email</b> or <b>phone</b> to continue. The next two questions are optional, and you can either provide answers or ignore them. The virtual agent will then submit a service request for you. You can click the request link to view the detail of the ticket. After your contact information is updated in the system, the virtual agent prompts that your request is resolved.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"VAChat 3.png\" decoding=\"async\" src=\"../../../images/800px-VAChat_3_4738f12b.png\" style=\"width: 800px; height: 629px;\"/> </a></div>\n</li>\n</ol>\n<h2 class=\"mw-headline\" id=\"Related_topics\"><a id=\"Related-topics\" name=\"Related-topics\" title=\"Related topics\"></a>Related topics</h2>\n<p>For information on smart virtual agent stop words, see <a href=\"/doc/423/26.1/stopwords\" title=\"Smart virtual agent stop words\">Smart virtual agent stop words</a>.</p>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}