{
  "title": "Work with reports",
  "content": "<div class=\"mw-parser-output\">\n<p>You can create reports and view them as tables or column/pie/bar charts. Users who have access to the report can select and view each of these options dynamically. Users can also change reports viewed in the dashboard dynamically.</p>\n<h2 class=\"mw-headline\" id=\"View_or_edit_an_existing_report\">View or edit an existing report</h2>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\" style=\"font-weight: normal;\">main menu</span>, click <b>Reports</b> to open the Reports page.</li>\n<li>In the left pane, select a report from the list. Service Management displays the report in the middle pane.</li>\n<li>Edit the report properties in the right panel, as described in <a href=\"/doc/423/26.1/reportproperties\" title=\"SMAX:25.1/ReportProperties\">Report properties</a>. To preview your changes to the report, click the <b>Preview</b> button at the bottom of the right panel.</li>\n<li>Click <b>Save</b> at the bottom of the right panel to save your changes.</li>\n</ol>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"> </div>\n<div class=\"admonition-content admonition-note-content\">\n<p>For information on view and edit permission for reports, see <a href=\"/doc/423/26.1/reportslist#ReportPermissions\" title=\"SMAX:25.1/ReportsList\">Reports list pane</a>.</p>\n</div>\n</div>\n<h2 class=\"mw-headline\" id=\"Create_a_report\">Create a report</h2>\n<ol>\n<li>\n<p>From the <span class=\"SAW_VariablesMain_menu\" style=\"font-weight: normal;\">main menu</span>, click <b>Reports</b> to open the Reports page.</p>\n</li>\n<li>\n<p>In the left pane, click <b>New</b>. Select the report type from the drop-down list. The available options are:</p>\n<ul>\n<li>Analytic report</li>\n<li>Operational report</li>\n<li>Operational raw data report</li>\n<li>Survey analytic report</li>\n</ul>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"> </div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>For analytic and survey reports, the new report is defined as active by default.</li>\n<li>If you want your report to be based on the properties of an existing report, select the report and click <b>Duplicate</b> on the toolbar.</li>\n</ul>\n</div>\n</div>\n<p>The <b>New report</b> dialog box opens.</p>\n</li>\n<li>\n<p>Enter the required information as described in <a href=\"/doc/423/26.1/reportproperties\" title=\"SMAX:25.1/ReportProperties\">Report properties</a>.</p>\n</li>\n<li>\n<p>If you want to preview the report, click the <b>Preview</b> button.</p>\n</li>\n<li>\n<p>Click <b>Save</b> to save your report.</p>\n</li>\n</ol>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"> </div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>You can also create a report directly from a record grid page. Click <b>More &gt; Create operational report</b> or <b>More &gt; Create operational raw data report</b> on the toolbar. The <b>New report</b> dialog box opens with the relevant record type already selected. You can generate operational reports and operational raw data reports only from the record grid page.</li>\n<li>To create a SAM report from Service Management, you will see two values with the same name <b>License Metric</b> from the <strong>Record type</strong> drop-down list of the <b>New report</b> dialog box. Select one and check whether the <b>Filter by</b> field lists the following values: <b>Code</b>, <b>Group CI Type</b>, <b>Guid</b>, <b>Name</b>, <b>System</b>. If yes, select this record type. The other value with the same name is the record type for the original SAM application and is incorrect for creating compliance reports. For more information, see <a href=\"/doc/423/26.1/samreportentities\" title=\"Design SAM reports from Service Management using entities\">Design SAM reports from Service Management using entities</a>.</li>\n</ul>\n</div>\n</div>\n<h2 class=\"mw-headline\" id=\"Delete_a_report\">Delete a report</h2>\n<ol>\n<li>From the <span class=\"SAW_VariablesMain_menu\" style=\"font-weight: normal;\">main menu</span>, click <b>Reports</b> to open the Reports page.</li>\n<li>In the left pane, select a report from the list.</li>\n<li>Click <b>Delete</b> on the <span class=\"SAW_VariablesToolbar\">toolbar</span>.</li>\n</ol>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"> </div>\n<div class=\"admonition-content admonition-note-content\">\n<ul>\n<li>Deleted reports are also removed from all dashboard widgets.</li>\n<li>For information on delete permission for reports, see <a href=\"/doc/423/26.1/reportslist#ReportPermissions\" title=\"SMAX:25.1/ReportsList\">Reports list pane</a>.</li>\n</ul>\n</div>\n</div>\n<h2 class=\"mw-headline\" id=\"Add_a_report_to_the_dashboard\">Limitations</h2>\n<p>Be aware of the following limitations when working with reports.</p>\n<table>\n<tbody>\n<tr>\n<th>Issue</th>\n<th>Causes and solutions</th>\n</tr>\n<tr>\n<td>Analytic and survey analytic report doesn't display values at successive time intervals</td>\n<td>\n<ul>\n<li>If the time field is beyond the primary and secondary level of grouping, the report will skip the time intervals which have no data record or no values.</li>\n<li>If there is no value in the time field, or only one time value in the time field (either start or end date), the report will skip the time intervals which have no data record or no values</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Report can't be displayed</td>\n<td>\n<ul>\n<li>If the raw data for an operational report contains a number of rows of data that exceeds the tenant's <b>Maximum query size</b> value (default: 10,000) defined in Suite Administration, the report can't be displayed.</li>\n<li>If the aggregated data for a report (operational or analytic) exceeds 800 rows, the report can't be displayed. Try refining your data by applying a filter in the Report properties.</li>\n<li>If the time of loading a report exceeds the <strong>Report loading timeout</strong> setting (30 seconds by default), the report can't be displayed. You can click the <strong>Refresh </strong>button or adjust the <strong>Report loading timeout</strong> setting defined in <strong>Administration </strong>&gt; <strong>Configuration </strong>&gt; <strong>Application Settings</strong>.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Chart can't be displayed</td>\n<td>\n<ul>\n<li>If the report data exceeds 40 bars or columns in a bar or column chart or 40 pie slices in a pie chart, the chart can't be viewed. Try refining your data by applying a filter in the Report properties.</li>\n<li>If the report data exceeds 20 different subgroups in a stacked bar or column chart, the chart can't be viewed. Try refining your data by applying a filter in the Report properties.</li>\n<li>If more than two grouping options are selected for the report, no chart is displayed.</li>\n<li>In an operational report, if no grouping option and no function are selected, no chart is displayed.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Can't drill down from report</td>\n<td>\n<ul>\n<li>If the source data for the selected bar or slice of a chart or grid row contains a number of rows of data that exceeds the tenant's <b>Maximum query size</b> value (default: 10,000) defined in Suite Administration, you can't drill down to it.</li>\n<li>If the report filter and the grouping options don't contain at least one searchable field, you can't drill down from the report to the source data. Searchable fields are defined in the metadata for the record type.</li>\n<li>Drill-down isn't available for reports based on articles, models, tasks, or Service Level targets.</li>\n<li>In an analytic report, if the report is grouped by a time field by hour, you can't drill down to the source data.</li>\n<li>In an analytic report, if the report is grouped by a time field, you can't drill down to the source data for the section representing a null value.</li>\n<li>Drill-down isn't available for survey reports.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Report can't be changed from analytic to operational</td>\n<td>\n<ul>\n<li>Grouping by a time field isn't supported for operational reports. If your analytic report has a grouping defined on a time field, select a different grouping field.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Report can't be changed from operational to analytic</td>\n<td>\n<ul>\n<li>Analytic reports require at least one grouping option and one function. If your operational report has no grouping option and no function, it can't be changed to an analytic report.</li>\n<li>Analytic reports don't support the filter by <b>Me</b> feature. If your operational report has a filter defined for a field of type person by <b>Me</b>, it can't be changed to an analytic report. Enter your name in the filter.</li>\n<li>If your operational report includes field selections in the filter or the grouping options that aren't supported for analytic reports, change the selection.</li>\n<li>If you are unable to change an operational report to an analytic one because you are exceeding your quota, see below for suggestions on how to reduce your quota usage.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Invalid grouping selection</td>\n<td>\n<ul>\n<li>You can select a maximum of three different related records for groupings by a related record field. (You can select more than three groupings by related record field for the same related record.)</li>\n<li>In an analytic report, if one of the related record groupings is of type Incident, Request, or Service Level Target, no other related record grouping of those types can be selected.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Quota is exceeded</td>\n<td>\n<p>If you are unable to save or activate a report because you have exceeded your quota, try one of the following methods to reduce your quota usage:</p>\n<ul>\n<li>Deactivate some active analytic reports.</li>\n<li>Change some active analytic reports to operational reports.</li>\n<li>Reduce the recalculation frequency of some analytic reports.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>In reports of the table format, the ID field is not displayed as a hyperlink. This limitation applies to the following record types: Model, Service Definition, Service Level Target, Group, and Article.</td>\n<td>\n<p>The system can't assemble the correct link address for the ID field for these record types. <br/>\n\t\t\tUse the ID value together with other information to locate the record. For example, for an Article record, if the subtype is News, use the ID value to locate the News record. </p>\n</td>\n</tr>\n</tbody>\n</table>\n<div>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/report\" title=\"SMAX:25.1/Report\">Reports</a></li>\n<li><a href=\"/doc/423/26.1/reportslist\" title=\"SMAX:25.1/ReportsList\">Reports list pane</a></li>\n<li><a href=\"/doc/423/26.1/reprtscenterpane\" title=\"SMAX:25.1/ReprtsCenterPane\">Reports center pane</a></li>\n<li><a href=\"/doc/423/26.1/dashboard\" title=\"SMAX:25.1/Dashboard\">Dashboard</a></li>\n</ul>\n</div>\n<div> </div>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}