{
  "title": "Work with scenario rules",
  "content": "<div class=\"mw-parser-output\"><p>This page describes different types of scenario rules and how to use them to build the scenario logic.</p>\n<h2>Understand scenario rules</h2>\n<p>Scenario rules are the building blocks of a scenario. You build the scenario logic by adding scenario rules sequentially. When the Integration Studio runs a scenario, it runs the scenario rules from top to bottom (except for the loop action rules).</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>Conceptually, rules and actions are different. Rules are the building blocks of scenarios, and actions serve as the blueprint from which different instances of rules can be created. But other than this, they are very similar. For simplicity, we use the terms <em>rule</em> and <em>action</em> interchangeably in many places throughout the Integration Studio documentation. </div></div></div>\n<h3>Categorization</h3>\n<p>Scenario rules can be categorized into these types, according to the action performed when the system runs the rule:</p>\n<ul>\n<li>Target system rules (rules that are based on actions associated with a connector): execute an action against the target system endpoint as specified in the integration's endpoint configuration.</li>\n<li>Local system rules: execute an action against the current Service Management system.</li>\n<li>Common action rules: manipulate values (data management rules) or perform logic control operations (logic control rules).</li>\n</ul>\n<p>See <a href=\"/doc/423/26.1/xiesupportedconnectors\" title=\"Connectors\">connectors</a> for the list of actions available for each target system.</p>\n<p>See <a href=\"/doc/423/26.1/commonactions\" title=\"Built-in actions\">built-in actions</a> for the list of local system actions and common actions.</p>\n<h3><span style=\"color: rgb(0, 0, 0); font-family: Roboto, sans-serif; font-size: 20px;\">Structure</span></h3>\n<p>Local system rules and target system rules have the same standard structure. They consist of​ the following sections:</p>\n<ul>\n<li>A <strong>condition</strong>: allows you to specify conditions that decide if the rule will run or not.</li>\n<li><strong>Input parameters</strong>: allows you to specify values for input parameters of the rule. Depending on the rules and parameters, the parameters might correspond to properties in different parts of the request for the REST API that is represented by the rule: payload, query parameters, URI path parameters.</li>\n<li><strong>Output parameters</strong>: allows you to extract properties from the response of the rule so that subsequent rules can use the properties.</li>\n<li>A<strong> retry policy</strong>: allows you to configure the rule retry behavior: the condition that must be satisfied for the retry to occur (Condition field), the number of retries (Count field), and the interval period between two consecutive retries (Interval field). Typically, you can use the retry condition to specify what error codes returned from the local or target system must trigger a retry.</li>\n<li>\n<p>A<strong> Fail rule on expression evaluation error</strong><strong> setting</strong> allows you to control whether to treat expression evaluation errors as errors. If turned off, the system will return <code>null</code> for parameters whose value contains such errors, and set a \"Success with warning\" status for the rule that contains such parameters on the <strong>Execution history</strong> form.</p>\n<p>Note that this option is also available on the scenario level. This setting takes effect only if the scenario-level setting is OFF. If the scenario-level setting is ON, this setting is ignored.</p>\n</li>\n<li>\n<p>A<strong> Stop processing upon failure</strong><strong> setting</strong> allows you to control whether the Integration Studio should continue processing subsequent rules when the current rule encounters an error. This setting also affects whether the rule's error will be detected by the Try rule. See <a href=\"/doc/423/26.1/commonactions#Try-Catch\" title=\"Try-Catch\">Try-Catch</a> for details.</p>\n</li>\n<li>\n<p>A<strong> Set headers</strong> setting allows you to set custom headers of the request for REST API. If you define the same key with default header, custom header overwrites it. If you add the custom header, it displays a header icon.</p>\n</li>\n<li>\n<p>A <strong>Custom status rule expression</strong> setting allows you to set a condition to check the rule execution status and mark it as failed, even if the HTTP status of the REST API call is successful. For example, in a service request creation scenario, the request may fail due to invalid configuration, but the API may return a 200 OK status. To mark this rule as failed, you can add a custom status rule expression to check the response body status value.</p>\n</li>\n</ul>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>Failure to construct the request data to be sent, the target system unreachable, the received response data contains an error code (larger than 300), failure to parse the response data, and expression evaluation errors are deemed as errors in the Integration Studio.</div></div></div>\n<p><a href=\"/doc/423/26.1/commonactions#Common\" title=\"Common action\">Common action</a> rules don't have a fixed structure and their available sections vary by rules. They don't have the <strong>Retry policy</strong> section, because this is required only for local system or target system rules that correspond to REST API calls.</p>\n<h2>Add scenario rules</h2>\n<p>To add rules to a scenario, use one of the following methods:</p>\n<ul>\n<li>If you are adding the first rule to a blank scenario or adding the first embedded rule to a logic control rule, click <strong>Add a rule</strong>.</li>\n<li>\n<p>If you are adding additional rules to a scenario, hover over the area (called hover area) above or below an existing rule to display the <strong>Add a rule</strong> button, and then click the shaded hover area to add the rule.</p>\n<p>Note: Logic control rules have a block structure with child rules nested inside it. The hover area for adding a rule <em>after </em>logic control<em> </em>rules is located at the bottom of the rule's block instead of immediately below the logic control rule.</p>\n<p>When you add rules around the bottom of a logic control rule block, pay attention to the level of the rule being added. Use the width of the hover area as the guide to determine the level of the rule.</p>\n</li>\n<li>To add an <strong>Else</strong> rule for an <strong>If</strong> rule, select <strong>Add Else rule</strong> in the <strong>If</strong> rule's menu.</li>\n<li>To add an <strong>Output Data</strong> rule inside a loop action rule (<strong>Apply to Each</strong> and <strong>Do Until</strong>), select <strong>Enable output data</strong> from the menu of the loop action rule.</li>\n</ul>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>The <strong>Catch</strong> rule is automatically added when you add a <strong>Try</strong> rule—These two rules are always added together and you can't add a <strong>Catch</strong> rule separately.</div></div></div>\n<h2>Enter parameter values</h2>\n<p>Before entering values for parameters of the scenario rules, first you need to determine which type of field you are working with:</p>\n<ul>\n<li>Fields that support the Integration Studio <a href=\"/doc/423/26.1/xieexplang\" title=\"Expression language\">expression language</a></li>\n<li>Fields (with the name <strong>Key</strong>) that support the Integration Studio <a href=\"/doc/423/26.1/keyexpressionsxie\" title=\"JSON payload expressions\">JSON payload expression</a></li>\n<li>Normal fields that don't support these features</li>\n</ul>\n<h3 id=\"ExpLang\">Identify and work with fields that support the expression language</h3>\n<p>You can identify most fields that support the expression language by the  <a class=\"image\" href=\"\"> <img alt=\"Code Editor icon\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/7/7f/ExpLangCodeEditor.png\" height=\"24\" hspace=\"0\" src=\"../../../images/ExpLangCodeEditor_05c7d230.png\" style=\"width:24px;height:24px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"24\"/> </a> icon next to the field. Additionally, you can also use the expression language in these places:</p>\n<ul>\n<li>The condition field that determines whether to run the rule (located on the header pane of local system rules, target system rules, data manipulation rules, and the <strong>If</strong> rule)</li>\n<li>The <strong>Do Until</strong> rule's exit condition field, which determines when to stop running the embedded rules (located on its header pane)</li>\n<li>The <strong>Apply to Each</strong> rule's array field (located on its header pane)</li>\n</ul>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-important-icon\"></div><div class=\"admonition-content admonition-important-content\"><div>If you want to enter a string value in fields that support the expression language, you must enclose it in single quotation marks; otherwise, the Integration Studio will attempt to parse the value as an object property, and will return the value of the property (if defined in a preceding rule) or empty (if not defined).  You can directly enter the value of other expression language data types (number and boolean).</div></div></div>\n<h4 id=\"CodeEditor\">Use the Expression Editor and Data pane to work with this type of fields</h4>\n<p>The Integration Studio provides the Expression Editor and the Data pane to improve your efficiency and experience working with the expression language.</p>\n<p><strong>Expression Editor</strong></p>\n<p>You can directly enter simple values in fields that support the expression language. But if you are composing complex expressions, click the  <a class=\"image\" href=\"\"> <img alt=\"Code Editor icon\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/7/7f/ExpLangCodeEditor.png\" height=\"24\" hspace=\"0\" src=\"../../../images/ExpLangCodeEditor_05c7d230.png\" style=\"width:24px;height:24px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"24\"/> </a> icon to open the Expression Editor to take advantage of its rich capabilities:</p>\n<ul>\n<li>\n<p>Displays suggestions when you enter text that partially matches the name of built-in objects or DSL functions.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-tip-icon\"></div><div class=\"admonition-content admonition-tip-content\"><div>You can press <strong>Ctrl+Space</strong> to display all available DSL functions and built-in objects, denoted by the <code>f</code> and <code>x</code> symbols, respectively. Note that the cursor can't be in the middle of text when you press the key combination.</div></div></div>\n</li>\n<li>\n<p>Displays available properties for built-in objects after you enter the dot (.) symbol after the object name.</p>\n</li>\n<li>\n<p>Automatically adds closing brackets after you add opening brackets.</p>\n</li>\n<li>\n<p>Displays different types of expressions in different colors.</p>\n</li>\n</ul>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-tip-icon\"></div><div class=\"admonition-content admonition-tip-content\"><div>Drag the header bar of the Expression Editor window to move it around.</div></div></div>\n<p><strong>Data pane</strong></p>\n<p>To reference object properties defined in preceding rules, instead of manually typing the object and property name, you can drag and drop the objects and properties from the right-hand Data pane to the fields.</p>\n<h3 id=\"JSONExp\">Identify fields that support the JSON payload expression</h3>\n<p>Some rules contain input parameters with a special section (with an <strong>Add Property</strong> button). This indicates that you can use the <a href=\"/doc/423/26.1/keyexpressionsxie\" title=\"JSON payload expressions\">JSON payload expression</a> in the <strong>key</strong> field of the key-value pairs you added by using the button.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"JSON payload expression\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/c/c9/IdentifyParamWithJSONPayload.png\" height=\"215\" hspace=\"0\" src=\"../../../images/IdentifyParamWithJSONPayload_ea01fa02.png\" style=\"width:800px;height:215px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-note-icon\"></div><div class=\"admonition-content admonition-note-content\"><div>There's an <strong>Add property</strong> button in the Output section, but JSON payload expressions can't be used in that section because they are intended only for input parameters.</div></div></div>\n<h2><span style=\"color: rgb(0, 115, 231); font-family: Roboto, sans-serif; font-size: 24px;\">Navigate scenario rules</span></h2>\n<p>Use the following tips to navigate scenario rules.</p>\n<ul>\n<li>To quickly navigate through scenario rules, use the scroll wheel on your mouse to scroll up and down while the mouse pointer is in the <strong>Process logic</strong> section.</li>\n<li>To pan around the <strong>Process logic</strong> section, move the mouse pointer until it changes to the shape of a white hand, and then click and drag with the mouse.</li>\n<li>To collapse or expand the rule block for logic control rules, click the arrow to the left of the rule number for logic control rules. With the rule block collapsed, you can also click the \"x more rules\" button in the rule block to expand it.</li>\n<li>To collapse or expand a rule's details pane, click the rule's header pane.</li>\n</ul>\n<h2>Manage scenario rules</h2>\n<p>You can perform the following operations on a scenario rule, by using the menu or arrow icons that are displayed on the right of a rule's header pane. Note that you need to hover over a rule to access its menu and arrow icons.</p>\n<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width: 500px;\">\n<thead>\n<tr>\n<th scope=\"col\">Operation</th>\n<th scope=\"col\">Menu or Icon</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Move the rule up and down within the same level<sup>*</sup></td>\n<td>The <b>Up</b> ( <a class=\"image\" href=\"\"> <img alt=\"Up arrow\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/c/c2/Up_XIE_Rules.png\" height=\"20\" hspace=\"0\" src=\"../../../images/Up_XIE_Rules_1c2ff7c9.png\" style=\"width:15px;height:20px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"15\"/> </a> ) or <strong>Down</strong> ( <a class=\"image\" href=\"\"> <img alt=\"Down arrow\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/1/19/Down_XIE_Rules.png\" height=\"20\" hspace=\"0\" src=\"../../../images/Down_XIE_Rules_83483a11.png\" style=\"width:17px;height:20px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"17\"/> </a> ) icon</td>\n</tr>\n<tr>\n<td>Remove the rule</td>\n<td>The <strong>Remove rule</strong> menu item</td>\n</tr>\n<tr>\n<td>\n<p>Disable the rule</p>\n<p>A disabled rule is grayed out on the UI and won't be executed when the Integration Studio runs the scenario.</p>\n</td>\n<td>\n<p>The <strong>Disable rule</strong> menu item</p>\n</td>\n</tr>\n<tr>\n<td>Enable the disabled rule</td>\n<td>The <strong>Enable rule</strong> menu item</td>\n</tr>\n<tr>\n<td>\n<p>Duplicate the rule</p>\n<p>If this is a logic control rule, the action duplicates the rule and its child rules.</p>\n</td>\n<td>The <strong>Duplicate rule</strong> menu item</td>\n</tr>\n<tr>\n<td>Change the rule name</td>\n<td>The <strong>Edit name</strong> menu item</td>\n</tr>\n<tr>\n<td>\n<p>Change the rule description</p>\n<p>Note that logic control rules don't support this operation.</p>\n</td>\n<td>The <strong>Edit description</strong> menu item</td>\n</tr>\n</tbody>\n</table>\n<p>* You can also drag and drop rules to the desired position. This method supports moving rules across different levels. To move a rule, move the mouse pointer to the rule to be moved, press and hold the mouse button for some time until the mouse pointer changes to the<strong> </strong>  <a class=\"image\" href=\"\"> <img alt=\"Move icon\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/d/de/Move.png\" height=\"23\" hspace=\"0\" src=\"../../../images/Move_52689086.png\" style=\"width:24px;height:23px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"24\"/> </a>   shape, and then drag and drop the rule to the target position.</p>\n<div class=\"admonition\"><div class=\"admonition-icon admonition-tip-icon\"></div><div class=\"admonition-content admonition-tip-content\"><div> To move the rule to a position outside the current view, drag the rule to the top or bottom edge of the <strong>Process logic</strong> section and hold to make the screen scroll. When the target position is visible, move the mouse again to drop the rule to the target position.</div></div></div>\n<p>The preceding table lists only standard operations. See <a href=\"/doc/423/26.1/commonactions\" title=\"Built-in actions\">Common actions</a> for special operations supported on only some common action rules.</p>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}