{
  "title": "Working with processes",
  "content": "<div class=\"mw-parser-output\"><p class=\"mw-empty-elt\">\n</p><div>\n<p>Each record has at least one out-of-the-box process. You can edit a process by adding or deleting phases and transitions. However, the number of metaphases is fixed for each record.</p>\n</div>\n<h2 class=\"mw-headline\" id=\"Phases_and_Metaphases\">Phases and Metaphases</h2>\n<p>Every process is made up of phases and metaphases that reflect the stages of the workflow. The phases are connected by transitions. You can add, move, and delete phases and transitions, and change the direction of a transition. There must be a transition leading to every phase, except the phase at the start of the process. You can define one or more transitions between two phases (see <a href=\"/doc/423/26.1/addtransition\">Add a transition in a process</a> for more information). However, a process may contain branches, where multiple transitions from a phase lead to different phases.</p>\n<p>A process must have exactly one Start phase, which indicates the beginning of the process. You can designate a phase as a Start phase by selecting the <b>Start phase</b> check box in the <b>Properties</b> tab for that phase. The Start phase can't be deleted from the process; you must first designate a different phase as the Start phase. For more information about adding phases to a process, see <a href=\"/doc/423/26.1/addphase\" title=\"SMAX:25.1/AddPhase\">How to add a phase in a process</a>.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> The Start phase doesn't have to be located in the first metaphase. Any phase can be selected as the Start phase.</p>\n</div>\n<p>All the phases located in the last metaphase are designated as <b>End phases</b>. There must be at least one phase in the last metaphase.</p>\n<h2 class=\"mw-headline\" id=\"Automatic_and_manual_transitions\">Automatic and manual transitions</h2>\n<p>There are two types of transitions:</p>\n<ul>\n<li><b>Manual.</b> A manual transition occurs when a user updates the system with a change of phase.</li>\n<li><b>Automatic.</b> An automatic transition is controlled by a condition. If the condition is satisfied, the workflow advances to the next phase. If it's not satisfied, the workflow is aborted.</li>\n</ul>\n<p>If you define two transitions from a phase, one automatic and one manual, leading to different phases, they work concurrently. If the condition of the automatic transition is satisfied first, the process advances automatically to the next phase in that branch. If the condition has not been satisfied, you can manually advance the process to the next phase in that branch.</p>\n<p>If you define two transitions from a phase, one automatic and one manual, leading to the same phase, they work concurrently. If the condition of the automatic transition is satisfied first, the process advances automatically to the next phase. If the condition has not been satisfied, you can manually advance the process to the next phase. </p>\n<p>If you define two automatic transitions from the same phase, they are evaluated in the order they were created. The first one to be satisfied advances the process along that branch.</p>\n<p>For more information about adding transitions to a process, see <a href=\"/doc/423/26.1/addtransition\" title=\"SMAX:25.1/AddTransition\">How to add a transition in a process</a>.</p>\n<h2 class=\"mw-headline\" id=\"Process_Properties\">Process properties</h2>\n<p>To access the properties of a process, select the process in the tree on the left (the second level of the tree) or by clicking the breadcrumbs above the tree in the <b>Processes and Rules</b> tab. For example, in Change Management, you can select the <b>Emergency</b> process:</p>\n<p><a class=\"image\" href=\"/file/images/2/20/2018.08_Helpcenter/Resources/Images/EM/emProcessPath.png\" title=\"/file/images/2/20/2018.08_Helpcenter/Resources/Images/EM/emProcessPath.png\"> <img alt=\"emProcessPath.png\" data-file-height=\"53\" data-file-width=\"195\" height=\"53\" src=\"../../../images/emProcessPath_57df0aad.png\" width=\"195\"/> </a></p>\n<p>Select the <b>Properties</b> tab on the right. The following properties are editable:</p>\n<ul>\n<li>\n<p><b>Display name.</b> Click the ellipsis button <a class=\"image\" href=\"/file/images/6/6f/2018.08_Helpcenter/Resources/Images/Icons/EllipsisIcon.png\" title=\"/file/images/6/6f/2018.08_Helpcenter/Resources/Images/Icons/EllipsisIcon.png\"> <img alt=\"EllipsisIcon.png\" data-file-height=\"15\" data-file-width=\"15\" height=\"15\" src=\"../../../images/EllipsisIcon_882f0854.png\" width=\"15\"/> </a> to edit the display name of the process in the available languages.</p>\n</li>\n<li>\n<p><b>Is default.</b> Select the check box to define this process as the default process for the record.</p>\n</li>\n<li>\n<p><b>Apply to &lt;record&gt; type.</b> For records that support multiple processes, you can select the record subtype to which the current process applies. For example, in Change Management, the <b>Emergency</b> process applies to changes of type <b>Emergency</b>.</p>\n<div class=\"Admonition_Note\">\n<p><span class=\"autonumber\">Note</span> Each record subtype can be selected for only one process.</p>\n</div>\n</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Metaphase_Properties\">Metaphase properties</h2>\n<p>To access the properties of a metaphase, select the metaphase in the workflow map or in the tree on the left or by clicking the breadcrumbs above the tree in the <b>Processes and Rules</b> tab.</p>\n<p>In the <b>Properties</b> tab on the right, you can edit the display name. Click the ellipsis button <a class=\"image\" href=\"/file/images/6/6f/2018.08_Helpcenter/Resources/Images/Icons/EllipsisIcon.png\" title=\"/file/images/6/6f/2018.08_Helpcenter/Resources/Images/Icons/EllipsisIcon.png\"> <img alt=\"EllipsisIcon.png\" data-file-height=\"15\" data-file-width=\"15\" height=\"15\" src=\"../../../images/EllipsisIcon_882f0854.png\" width=\"15\"/> </a> to edit the display name of the metaphase in the available languages.</p>\n<h2 class=\"mw-headline\" id=\"Phase_Properties\">Phase properties</h2>\n<p>To access the properties of a phase, select the phase in the workflow map or in the tree on the left or by clicking the breadcrumbs above the tree in the <b>Processes and Rules</b> tab.</p>\n<p>Select the <b>Properties</b> tab on the right. The following properties are editable:</p>\n<ul>\n<li><b>Display name.</b> Click the ellipsis button <a class=\"image\" href=\"/file/images/6/6f/2018.08_Helpcenter/Resources/Images/Icons/EllipsisIcon.png\" title=\"/file/images/6/6f/2018.08_Helpcenter/Resources/Images/Icons/EllipsisIcon.png\"> <img alt=\"EllipsisIcon.png\" data-file-height=\"15\" data-file-width=\"15\" height=\"15\" src=\"../../../images/EllipsisIcon_882f0854.png\" width=\"15\"/> </a> to edit the display name of the phase in the available languages.</li>\n<li><b>Metaphase.</b> Select a metaphase from the drop-down list to move the phase to that metaphase.</li>\n<li><b>Instructions.</b> For records that support multiple processes, you can select the record subtype to which the current process applies. For example, in Change Management, the <b>Emergency</b> process applies to changes of type <b>Emergency</b>.</li>\n<li><b>Start phase.</b> Select the check box to define this phase as the start phase of the process.</li>\n<li><b>Approval definition.</b> For phases that contain approvals, select the approval definition from the drop-down list. For more information on approvals, see <a href=\"/doc/423/26.1/taskplans\" title=\"SMAX:25.1/Taskplans\">Task plans</a>.</li>\n</ul>\n<h2 class=\"mw-headline\" id=\"Workflow_Performance\">Workflow performance</h2>\n<p>Workflow customizations, such as added transitions or business rules, may result in an infinite loop if not defined properly. This could impact the workflow performance. If an infinite loop occurs, the workflow automatically stops after 100 transactions.</p>\n<p>For example, it's possible to define automatic transitions between two phases of a workflow such that the workflow automatically transitions from one phase to the other, and back to the first phase. Alternatively, a business rule can be defined to update a field on a related record. When the workflow runs for a record, it may result in a new transaction to update a field on a second record. The new transaction will then update the field on the first record. In these situations, the infinite loop that's generated can result in significant workflow performance degradation.</p>\n<h2 class=\"mw-headline\" id=\"Related_topics\">Related topics</h2>\n<ul>\n<li><a href=\"/doc/423/26.1/processes\" title=\"SMAX:25.1/Processes\">Processes and Rules</a></li>\n<li><a href=\"/doc/423/26.1/addphase\" title=\"SMAX:25.1/AddPhase\">How to add a phase in a process</a></li>\n<li><a href=\"/doc/423/26.1/addtransition\" title=\"SMAX:25.1/AddTransition\">How to add a transition in a process</a></li>\n<li><a href=\"/doc/423/26.1/movephase\" title=\"SMAX:25.1/MovePhase\">How to move a phase or transition in a process</a></li>\n<li><a href=\"/doc/423/26.1/embizrules\" title=\"SMAX:25.1/emBizRules\">Studio business rules</a></li>\n<li><a href=\"/doc/423/26.1/processrulescompare\" title=\"SMAX:25.1/ProcessRulesCompare\">Configuration Comparison</a></li>\n</ul>\n<p class=\"mw-empty-elt\"></p></div>",
  "modifiedon": "2025-10-24 08:51:12"
}