{
  "title": "Objects",
  "content": "<div class=\"mw-parser-output\"><br/>\n<p>Objects are data structures that contain a collection of properties and objects.</p>\n<p>The Integration Studio supports two types of objects: user-defined objects and built-in objects. The difference between the two lies in how they are used: you can directly reference the properties of built-in objects, but you need to manually create a user-defined object before you can reference its properties. Note that you can use built-in object properties in user-defined objects.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-caution-icon\"> </div>\n<div class=\"admonition-content admonition-caution-content\">The object name must be unique across the entire scenario. Otherwise, the object defined at the beginning of the scenario will be overridden by the same object defined in a later rule. This applies to built-in objects as well, so don't use the built-in object names for user-defined objects (unless you do intend to override the built-in objects).</div>\n</div>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"> </div>\n<div class=\"admonition-content admonition-note-content\">Object and property names are case-sensitive.</div>\n</div>\n<h2>User-defined objects</h2>\n<p>User-defined objects enable you to achieve the following:</p>\n<ul>\n<li>Facilitate reuse of properties in scenario rules. For example, if a property is used in many places throughout an integration scenario, you can define it once, and use it in multiple rules. Later, if you need to change the property value, you need to change it in only one place.</li>\n<li>Pass data from one scenario rule to another. For example, if you need to use the response data of one system in the request data for another system, you must define user-defined objects. With the <strong>Store Data</strong> action, you can even pass data from one scenario to another.</li>\n</ul>\n<h3>Choose where to define objects</h3>\n<p>You can define user-defined objects in different places. Choose an appropriate place according to your usage scenario and purpose. See the table below.</p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">If you want to do this...</th>\n<th scope=\"col\">Define the object in...</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>\n<p>Do the following:</p>\n<ul>\n<li>\n<p>Capture environment-specific details</p>\n</li>\n<li>\n<p>Define values that can be used in multiple rules</p>\n</li>\n<li>\n<p>Initialize values for use by a Do Until rule</p>\n</li>\n</ul>\n</td>\n<td>\n<p><strong>Prepare Data</strong> rules</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Retrieve values from the response of the target system or the local system, so that you can use the retrieved values in subsequent rules.</p>\n</td>\n<td>\n<p><strong>Output</strong> section of normal rules (rules associated with actions in a category other than Common)</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Do one of the following:</p>\n<ul>\n<li>Define properties that can be used in another scenario of the same integration.</li>\n<li>Define properties that pass values from previous runs of the same scenario.</li>\n</ul>\n</td>\n<td>\n<p><strong>Store Data</strong> rules</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3>Define objects</h3>\n<p>The main procedure for defining objects is the same no matter where you define the object: Specify a name for the object, and then click <strong>Add Property</strong> to add properties to the object.</p>\n<p>Note the following for objects defined in the <strong>Output</strong> section of normal rules:</p>\n<ul>\n<li>If you don't need to use any value of the current rule's response data in subsequent rules, then you don't need to add properties in the object. In this case, the system creates an empty object.</li>\n<li>\n<p><span style=\"background-color: transparent;\">To retrieve the entire response data as an object (so that you can use the . operator to directly access data in the object in subsequent fields that support the </span><a href=\"/doc/423/26.1/xieexplang\" title=\"expression language\">expression language</a><span style=\"background-color: transparent;\">), add a property in the Output section of the rule, and then enter the following in its Value field: </span><code>json_parser(response.data, '$')</code>.</p>\n</li>\n</ul>\n<p>Note the following for objects defined in <strong>Store Data</strong> rules:</p>\n<ul>\n<li>\n<p><strong>Store Data</strong> rules support <a href=\"/doc/423/26.1/keyexpressionsxie\" title=\"JSON payload expressions\">JSON payload expressions</a>, which means that you can add child objects in such rules. By contrast, you can add only properties, not child objects, in <strong>Prepare Data</strong> rules and the <strong>Output</strong> section of normal rules.</p>\n</li>\n<li>\n<p>The name of <strong>Store Data</strong> rules supports the expression language. You can use this to dynamically create multiple objects by using one <strong>Store Data</strong> rule. For example, if the integration is triggered by updates to Service Management request records, you can enter <code>payload.entityId</code> as the object name. The system then creates an object (with the Service Management request Id as the object name) for each request record that triggers the scenario.</p>\n</li>\n<li>\n<p>Select the Scenario scope when you define an object that is used only in the current scenario. Select the Integration scope when you define an object that is used by another scenario of the same integration.</p>\n</li>\n<li>\n<p>Objects defined in <strong>Store Data</strong> rules are uniquely identified by the object name and scope. This means that if you define two objects with the same name but with different scopes in the same scenario, these are different objects and the system will not override them when the corresponding <strong>Store Data</strong> rules are executed.</p>\n</li>\n</ul>\n<h3>Use object properties</h3>\n<p>After you define an object, you can use (reference) the value of the object's properties in fields that support the Integration Studio expression language.</p>\n<p>For most object-creation methods, you can reference object properties only in rules that are in the same scenario as the rule where you define the object. To reference object properties defined in another scenario, you must define the object by using the <strong>Store Data</strong> rule and the object must have the Integration scope.</p>\n<p>If you reference object properties defined in the same scenario, the rule where you reference object properties must be below the rule where the object is defined.</p>\n<p>For objects defined in <strong>Prepare Data</strong> rules and the Output section of normal rules, you can also reference the same object's other properties, as long as the properties being referenced are above the properties where you reference those properties.</p>\n<h4>How to reference object properties</h4>\n<p>To reference an object property:</p>\n<ul>\n<li>For objects defined in <strong>Prepare Data</strong> rules and the Output section of normal rules, use this expression: <code>&lt;object&gt;.&lt;property&gt;</code>.</li>\n<li>For objects defined in <strong>Store Data</strong> rules, use this expression: <code>get_stored_data(&lt;object&gt;,&lt;scope&gt;).&lt;property&gt;</code>. Example: <code>get_stored_data('account','integration').number</code>.</li>\n</ul>\n<p>See the Example section below for examples.</p>\n<h4>Use optional chaining operator to prevent errors</h4>\n<p>The <em>optional chaining</em> operator (<code>?.</code>) enables you to retrieve the value of a property without having to check that the object that contains the property is not empty.</p>\n<p>Syntax: <code>&lt;object&gt;?.&lt;key&gt;</code></p>\n<p>When an object is empty, <code>&lt;object&gt;?.&lt;key&gt;</code> returns the value <code>undefined</code>, instead of causing an error and returning <code>null</code> for the whole expression. An object could be empty if the rule where the object is defined is skipped because its condition is not satisfied.</p>\n<h3>Change object property values</h3>\n<p>After you define an object, you can change its property values in a subsequent rule (in most cases). The process for doing this varies, depending on where you defined the object.</p>\n<h4>For objects defined in Prepare Data rules and the Output section of normal rules</h4>\n<p>You can change the property values of objects defined in preceding rules by using the <strong>Change Data</strong> rule or the <strong>Prepare Data</strong> rule.</p>\n<p>With the <strong>Prepare Data</strong> rule approach, you define a new object (with the same name) to override the existing object. The drawback for this approach is that if the object contains multiple properties, you must re-define all properties again in the new object, even those properties whose value should keep the same.</p>\n<p>With the <strong>Change Data</strong> rule approach, you change only the values of properties that you specify. You are not re-defining the objects, so other properties in the objects keep intact. Another benefit of this approach is that you can change property values for multiple objects (those defined in rules that are above the current rule) in the same <strong>Change Data</strong> rule.</p>\n<h4>For objects defined in Store Data rules</h4>\n<p>For such objects, there isn't a Change Data approach—You must define another object with the same name and scope in another <strong>Store Data</strong> rule to override the object.</p>\n<p>If you are overriding an object in the same scenario, the <strong>Store Data</strong> rule where you define the new object must be after the rule where the original object was defined.</p>\n<p>If two scenarios in the same integration have a <strong>Store Data</strong> rule that defines the same object (with the same name and the same Integration scope), the object that is defined in the rule that is executed later overrides the other object.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"> </div>\n<div class=\"admonition-content admonition-note-content\">Because of the differences in how the objects are defined, accessed, and used, objects defined in <strong>Store Data</strong> rules can have the same name as objects created through other methods, without overriding each other.</div>\n</div>\n<h3>Examples</h3>\n<p>This section provides some examples about how to define and reference object properties.</p>\n<h4 id=\"PrepareData\">Prepare Data example</h4>\n<p>In this example, we use the <b>Prepare Data</b> rule to define a \"Data\" object, which includes three properties (Subject, StartDate, EndDate).</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"PrepareDataExmp.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/7/7a/PrepareDataExmp.png\" height=\"487\" hspace=\"0\" src=\"../../../images/PrepareDataExmp_9360cf39.png\" style=\"width: 800px; height: 487px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<p>Then use the properties in input parameters of a subsequent <strong>Run flow</strong> rule.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"PrepareDataExmp2.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/c/ce/PrepareDataExmp2.png\" height=\"452\" hspace=\"0\" src=\"../../../images/PrepareDataExmp2_5f44e250.png\" style=\"width: 800px; height: 452px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h4 id=\"StoreData\">Store Data example</h4>\n<p>This example demonstrates how to define an object and use it in another scenario. This can be achieved only by using the <strong>Store Data</strong> rule.</p>\n<p>First, add a <strong>Store Data</strong> rule to define the object. Select <strong>Integration</strong> as the scope because this object needs to be referenced by another scenario. </p>\n<div><a class=\"image\" href=\"\"> <img alt=\"DefineStore.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/7/7c/DefineStore.png\" height=\"499\" hspace=\"0\" src=\"../../../images/DefineStore_cbb2ba5e.png\" style=\"width:717px;height:499px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"717\"/> </a></div>\n<p>In the scenario where we want to use the object, use the <code>get_stored_data</code> function to retrieve the value. In this example, we retrieve both the entire object (the <code>AccountObj</code> parameter) and a property of the object (the <code>AccountId</code> parameter).</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"UseStoreData.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/6/6f/UseStoreData.png\" height=\"397\" hspace=\"0\" src=\"../../../images/UseStoreData_98ba6375.png\" style=\"width:721px;height:397px;margin-top:0px;margin-bottom:0px;margin-left:0px;margin-right:0px;border:0px solid black;\" vspace=\"0\" width=\"721\"/> </a></div>\n<p>If we check the <strong>Expression execution details</strong> field of the execution history for the rule that uses the stored data, we can see that the <code>AccountId</code> and <code>AccountObj</code> parameters are assigned the expected values.</p>\n<div><a class=\"image\" href=\"\"> <img alt=\"ExeHistoryStoreData.png\" border=\"0\" file=\"https://staging.docs.microfocus.com/mediawiki/images/f/ff/ExeHistoryStoreData.png\" height=\"135\" hspace=\"0\" src=\"../../../images/ExeHistoryStoreData_0b8138f6.png\" style=\"width: 800px; height: 135px; margin: 0px; border: 0px solid black;\" vspace=\"0\" width=\"800\"/> </a></div>\n<h2 id=\"BuiltInObj\">Built-in objects</h2>\n<p>In the Value field for various parameters in scenario rules, you can directly reference object properties by using this syntax: <code>&lt;object&gt;.&lt;object&gt;.&lt;object&gt;..&lt;property_key&gt;</code>. Example: <code>currentSystem.tenantId</code>, <code>payload.entityId</code>, <code>response.data</code>.</p>\n<p>The Integration Studio supports the following built-in objects:</p>\n<ul>\n<li>payload</li>\n<li>response</li>\n<li>currentSystem</li>\n<li>currentIntegration</li>\n<li>currentScenario</li>\n</ul>\n<p>The following lists the built-in objects and their properties.</p>\n<h3 id=\"payload\">payload object</h3>\n<p>This object contains data related with the triggering entity or system of the scenario.</p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">\n<p>Member</p>\n</th>\n<th scope=\"col\">\n<p>Description</p>\n</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>tenantId</td>\n<td>The Id of the current Service Management tenant.</td>\n</tr>\n<tr>\n<td>\n<p><span style=\"background-color: transparent;\">entityType</span></p>\n</td>\n<td>\n<p>The Service Management record type associated with the business rule that triggered <span style=\"background-color: transparent;\">the current scenario. Example: 'incident'.</span></p>\n<p>If the current scenario is not triggered by a business rule, this property is empty.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>entityId</p>\n</td>\n<td>\n<p>The Id of the Service Management record whose associated business rule triggered <span style=\"background-color: transparent;\">the current scenario. Example: 12345.</span></p>\n<p>If the current scenario is not triggered by a business rule, this property is empty.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>data</p>\n</td>\n<td>\n<p><span style=\"background-color: transparent;\">An object that contains data passed from the <strong>Call Integration Studio</strong> business rule (for business rule-triggered scenarios), the external system (for webhook-triggered scenarios), or the schedule record associated with the scenario (for scheduler-triggered scenarios). For scenarios that are not triggered by business rules, webhooks, or the scheduler, this object is empty.</span></p>\n<p><strong><span style=\"background-color: transparent;\">For business rule-triggered scenarios</span></strong></p>\n<p><span style=\"background-color: transparent;\">The <code>data</code> object contains the properties (fields) added in the business rule.</span></p>\n<p>You can reference the properties by entering this in the corresponding Value field: <code>payload.data.&lt;field/key&gt;</code>.</p>\n<p><strong><span style=\"background-color: transparent;\">For scheduler-triggered scenarios</span></strong></p>\n<p><span style=\"background-color: transparent;\">The <code>data</code> object contains the following properties</span></p>\n<ul>\n<li><span style=\"background-color: transparent;\">Properties defined in the schedule Input parameter configuration</span></li>\n<li>\n<p><span style=\"background-color: transparent;\">A built-in property </span><code>last_execution_time</code>, which can be directly used in scenarios. The property indicates the time when the schedule was last executed and is represented by the <a href=\"https://en.wikipedia.org/wiki/Unix_time\" title=\"Unix timestamp\">Unix timestamp</a> (in milliseconds).</p>\n<p>If the schedule was never executed, the property returns the Unix timestamp for the current time.</p>\n</li>\n</ul>\n<p>You can reference the properties by entering this in the corresponding Value field: <code>payload.data.&lt;key&gt;</code>.</p>\n<p><strong><span style=\"background-color: transparent;\">For external system/webhook-triggered scenarios</span></strong></p>\n<p><span style=\"background-color: transparent;\">The <code>data</code> object contains data passed in from the external system. The expression to use to reference a property in this object depends on the structure of the payload sent from the external system.</span></p>\n<p>Tip: <span style=\"background-color: transparent;\">To learn the structure of this object, define an object in the Output of one of the scenario rules, assign the value <code>payload.data</code> to a key in the object, trigger this listener-based scenario, and examine the Output field in the details of the execution log for the corresponding rule (in the related Endpoint).</span></p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3>response object</h3>\n<p>This object contains data related to the response that is received after the request data as configured in the corresponding scenario rule is sent. Note that this object's context is scenario rules that correspond to actual actions executed against the local or target system. That is, it can't be used in common action rules such as <strong>Prepare Data</strong>, which doesn't correspond to requests sent to an external system.</p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">\n<p>Member</p>\n</th>\n<th scope=\"col\">\n<p>Description</p>\n</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>\n<p><span style=\"background-color: transparent;\">data</span></p>\n</td>\n<td>\n<p><span style=\"background-color: transparent;\">An object that contains </span>the payload data of the response.</p>\n<p>You can retrieve values from the response payload by using the <code>json_parser</code> <a href=\"/doc/423/26.1/xiesupporteddslfunctions2205\" title=\"DSL function\">DSL function</a> and passing in <code>response.data</code> to the first parameter of the function.</p>\n</td>\n</tr>\n<tr>\n<td>headers</td>\n<td>\n<p><span style=\"background-color: transparent;\">An object that contains </span>the headers of the response.</p>\n<p>You can retrieve values from the response headers by using this expression:</p>\n<pre>response.headers.&lt;field name&gt;[0]</pre>\n<p>Example: <code>response.headers.eTag[0]</code></p>\n<p>You need to add <code>[0]</code> after the header field name because every field in <code>response.headers</code> is of the array data type.</p>\n<div class=\"admonition\">\n<div class=\"admonition-icon admonition-note-icon\"> </div>\n<div class=\"admonition-content admonition-note-content\">\n<p>If the field name contains non-alphanumeric characters (except for underscore <code>_</code>), you need to enclose it in <code>['']</code> and omit the . before the field name.</p>\n<p>Example: <code>response.headers['Content-Type</code><code>'][0]</code></p>\n</div>\n</div>\n</td>\n</tr>\n<tr>\n<td>\n<p>statusCode</p>\n</td>\n<td>\n<p>The HTTP status code for the response.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>code</p>\n</td>\n<td>\n<p>A code that indicates whether this is a success or failure response. The code maps with different HTTP status code ranges:</p>\n<ul>\n<li><code>0</code> (success response): status codes 2xx</li>\n<li><code>-1</code> (failure response): other status codes</li>\n</ul>\n<p>One reason you want to use this property instead of <code>statusCode</code> is that it simplifies the conditional expression if you want to assign different values depending on whether a successful response is received. You can simply use <code>response.Code == 0</code> in the conditional expression instead of having to enumerate all possible successful HTTP status codes.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3>currentSystem object</h3>\n<p>This object contains some properties of the current Service Management system.</p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">\n<p>Member</p>\n</th>\n<th scope=\"col\">\n<p>Description</p>\n</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>\n<p>tenantId</p>\n</td>\n<td>\n<p>The Id of the current Service Management tenant.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>baseUrl</p>\n</td>\n<td>\n<p>Returns this value:</p>\n<p><code>https://&lt;SMAX_external_access_host&gt;</code></p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3>currentIntegration object</h3>\n<p>This object contains some properties about the current integration.</p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">\n<p>Member</p>\n</th>\n<th scope=\"col\">\n<p>Description</p>\n</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>\n<p>integrationUserId</p>\n</td>\n<td>\n<p>The Id of the integration user configured in the current integration.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>integrationUserUpn</p>\n</td>\n<td>\n<p>The User Principal Name (UPN) of the integration user configured in the current integration.</p>\n</td>\n</tr>\n<tr>\n<td>name</td>\n<td>The name of the current integration.</td>\n</tr>\n<tr>\n<td>uuid</td>\n<td>The Id of the current integration.</td>\n</tr>\n</tbody>\n</table>\n<h3>currentScenario object</h3>\n<p>This object contains some properties about the current scenario.</p>\n<table>\n<thead>\n<tr>\n<th scope=\"col\">\n<p>Member</p>\n</th>\n<th scope=\"col\">\n<p>Description</p>\n</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>\n<p>label</p>\n</td>\n<td>\n<p>The label of the current scenario. This property must be used in a Change Data rule to <a href=\"/doc/423/26.1/commonactions#set_label\" title=\"set the label\">set the label</a> for scenario execution history.</p>\n</td>\n</tr>\n<tr>\n<td>name</td>\n<td>The name of the current scenario.</td>\n</tr>\n<tr>\n<td>uuid</td>\n<td>The Id of the current scenario.</td>\n</tr>\n<tr>\n<td>listenerURL</td>\n<td>The webhook URL for the listener associated with the current scenario.</td>\n</tr>\n</tbody>\n</table>\n<h2>Related topics</h2>\n<ul>\n<li>\n<p><a href=\"/doc/423/26.1/xiescheduler\" title=\"Scheduler\">Scheduler</a></p>\n</li>\n<li>\n<p><a href=\"/doc/423/26.1/xielistener\" title=\"Listener\">Listener</a></p>\n</li>\n<li>\n<p><a href=\"/doc/423/26.1/dslactionrules\" title=\"Action rule examples\">Action rules</a></p>\n</li>\n</ul>\n<div> </div>\n</div>",
  "modifiedon": "2025-10-24 08:51:12"
}